#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACTOR_GamePigSplashScreenManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ACTOR_GamePigSplashScreenManager.ACTOR_GamePigSplashScreenManager_C
// 0x0020 (0x0240 - 0x0220)
class AACTOR_GamePigSplashScreenManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_GamePig_C*                    MinigameInteract;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ACTOR_GamePigSplashScreenManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Initialize(class AINTERACT_GamePig_C* InteractActor);
	void Advance();
	void StopSplashScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ACTOR_GamePigSplashScreenManager_C">();
	}
	static class AACTOR_GamePigSplashScreenManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AACTOR_GamePigSplashScreenManager_C>();
	}
};
static_assert(alignof(AACTOR_GamePigSplashScreenManager_C) == 0x000008, "Wrong alignment on AACTOR_GamePigSplashScreenManager_C");
static_assert(sizeof(AACTOR_GamePigSplashScreenManager_C) == 0x000240, "Wrong size on AACTOR_GamePigSplashScreenManager_C");
static_assert(offsetof(AACTOR_GamePigSplashScreenManager_C, UberGraphFrame) == 0x000220, "Member 'AACTOR_GamePigSplashScreenManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AACTOR_GamePigSplashScreenManager_C, Widget) == 0x000228, "Member 'AACTOR_GamePigSplashScreenManager_C::Widget' has a wrong offset!");
static_assert(offsetof(AACTOR_GamePigSplashScreenManager_C, DefaultSceneRoot) == 0x000230, "Member 'AACTOR_GamePigSplashScreenManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AACTOR_GamePigSplashScreenManager_C, MinigameInteract) == 0x000238, "Member 'AACTOR_GamePigSplashScreenManager_C::MinigameInteract' has a wrong offset!");

}

