#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AMMO_ITEM_Base

#include "Basic.hpp"

#include "STRUCT_SoftItemParams_structs.hpp"


namespace SDK::Params
{

// Function AMMO_ITEM_Base.AMMO_ITEM_Base_C.GetInventoryItemDetailsClass
// 0x0008 (0x0008 - 0x0000)
struct AMMO_ITEM_Base_C_GetInventoryItemDetailsClass final
{
public:
	class UClass*                                 InventoryItemDetailsWidget;                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AMMO_ITEM_Base_C_GetInventoryItemDetailsClass) == 0x000008, "Wrong alignment on AMMO_ITEM_Base_C_GetInventoryItemDetailsClass");
static_assert(sizeof(AMMO_ITEM_Base_C_GetInventoryItemDetailsClass) == 0x000008, "Wrong size on AMMO_ITEM_Base_C_GetInventoryItemDetailsClass");
static_assert(offsetof(AMMO_ITEM_Base_C_GetInventoryItemDetailsClass, InventoryItemDetailsWidget) == 0x000000, "Member 'AMMO_ITEM_Base_C_GetInventoryItemDetailsClass::InventoryItemDetailsWidget' has a wrong offset!");

// Function AMMO_ITEM_Base.AMMO_ITEM_Base_C.GetBestPickupClass
// 0x00B0 (0x00B0 - 0x0000)
struct AMMO_ITEM_Base_C_GetBestPickupClass final
{
public:
	class UClass*                                 Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CachedLargePickupClass;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CachedSmallPickupClass;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_SoftItemParams>         Temp_struct_Variable;                              // 0x0018(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Package_Base;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPICKUP_Base;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_SoftItemParams                 CallFunc_Array_Get_Item;                           // 0x0058(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_2;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPICKUP_Base_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_2;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_Result;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AMMO_ITEM_Base_C_GetBestPickupClass) == 0x000008, "Wrong alignment on AMMO_ITEM_Base_C_GetBestPickupClass");
static_assert(sizeof(AMMO_ITEM_Base_C_GetBestPickupClass) == 0x0000B0, "Wrong size on AMMO_ITEM_Base_C_GetBestPickupClass");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, Result) == 0x000000, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::Result' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CachedLargePickupClass) == 0x000008, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CachedLargePickupClass' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CachedSmallPickupClass) == 0x000010, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CachedSmallPickupClass' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, Temp_struct_Variable) == 0x000018, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000028, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_AsITEM_Package_Base) == 0x000030, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_AsITEM_Package_Base' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_bSuccess) == 0x000038, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_LoadClassAsset_Blocking_ReturnValue_1) == 0x000040, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_LoadClassAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_AsPICKUP_Base) == 0x000048, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_AsPICKUP_Base' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_bSuccess_1) == 0x000050, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_Array_Get_Item) == 0x000058, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000088, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_LoadClassAsset_Blocking_ReturnValue_2) == 0x000090, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_LoadClassAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_AsPICKUP_Base_1) == 0x000098, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_AsPICKUP_Base_1' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, K2Node_ClassDynamicCast_bSuccess_2) == 0x0000A0, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::K2Node_ClassDynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_GetCount_Result) == 0x0000A4, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_GetCount_Result' has a wrong offset!");
static_assert(offsetof(AMMO_ITEM_Base_C_GetBestPickupClass, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'AMMO_ITEM_Base_C_GetBestPickupClass::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

