#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_Pickup_Software

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_Pickup_Software.ANIMBP_Pickup_Software_C
// 0x0340 (0x0600 - 0x02C0)
class UANIMBP_Pickup_Software_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0378(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0480(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x04C0(0x0108)()
	struct FRotator                               ContentsRotation;                                  // 0x05C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ContentsRotationSpeed;                             // 0x05D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BoxRotation;                                       // 0x05D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               BoxRotationSpeed;                                  // 0x05E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Jitter;                                            // 0x05F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ANIMBP_Pickup_Software(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANIMBP_Pickup_Software_C">();
	}
	static class UANIMBP_Pickup_Software_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_Pickup_Software_C>();
	}
};
static_assert(alignof(UANIMBP_Pickup_Software_C) == 0x000010, "Wrong alignment on UANIMBP_Pickup_Software_C");
static_assert(sizeof(UANIMBP_Pickup_Software_C) == 0x000600, "Wrong size on UANIMBP_Pickup_Software_C");
static_assert(offsetof(UANIMBP_Pickup_Software_C, UberGraphFrame) == 0x0002C0, "Member 'UANIMBP_Pickup_Software_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_ModifyBone_1) == 0x000378, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_LocalToComponentSpace) == 0x000480, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A0, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, AnimGraphNode_ModifyBone) == 0x0004C0, "Member 'UANIMBP_Pickup_Software_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, ContentsRotation) == 0x0005C8, "Member 'UANIMBP_Pickup_Software_C::ContentsRotation' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, ContentsRotationSpeed) == 0x0005D4, "Member 'UANIMBP_Pickup_Software_C::ContentsRotationSpeed' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, BoxRotation) == 0x0005D8, "Member 'UANIMBP_Pickup_Software_C::BoxRotation' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, BoxRotationSpeed) == 0x0005E4, "Member 'UANIMBP_Pickup_Software_C::BoxRotationSpeed' has a wrong offset!");
static_assert(offsetof(UANIMBP_Pickup_Software_C, Jitter) == 0x0005F0, "Member 'UANIMBP_Pickup_Software_C::Jitter' has a wrong offset!");

}

