#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMNOTIFYSTATE_SetDamageEnabled

#include "Basic.hpp"


namespace SDK::Params
{

// Function ANIMNOTIFYSTATE_SetDamageEnabled.ANIMNOTIFYSTATE_SetDamageEnabled_C.GetWeapon
// 0x0060 (0x0060 - 0x0000)
struct ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MeleeWeapon_Base_C*               Weapon;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UInventoryBag_C*                        WeaponBag;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetFirstEquippedItem_Item;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MeleeWeapon_Base_C*               K2Node_DynamicCast_AsITEM_Melee_Weapon_Base;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon) == 0x000008, "Wrong alignment on ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon");
static_assert(sizeof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon) == 0x000060, "Wrong size on ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, Mesh) == 0x000000, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::Mesh' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, Weapon) == 0x000008, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::Weapon' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, WeaponBag) == 0x000010, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::WeaponBag' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, Inventory) == 0x000018, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::Inventory' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000028, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_GetFirstEquippedItem_Item) == 0x000038, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_GetFirstEquippedItem_Item' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_GetInventoryComponent_Inventory) == 0x000040, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, K2Node_DynamicCast_AsITEM_Melee_Weapon_Base) == 0x000048, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::K2Node_DynamicCast_AsITEM_Melee_Weapon_Base' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_IsValid_ReturnValue_1) == 0x000052, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon, CallFunc_GetBagByType_Bag) == 0x000058, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetWeapon::CallFunc_GetBagByType_Bag' has a wrong offset!");

// Function ANIMNOTIFYSTATE_SetDamageEnabled.ANIMNOTIFYSTATE_SetDamageEnabled_C.Received_NotifyEnd
// 0x0030 (0x0030 - 0x0000)
struct ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MeleeWeapon_Base_C*               Weapon;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UITEM_MeleeWeapon_Base_C*               CallFunc_GetWeapon_Weapon;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_DisableDamage_Result;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd");
static_assert(sizeof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd) == 0x000030, "Wrong size on ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, Weapon) == 0x000018, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::Weapon' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, CallFunc_GetWeapon_Weapon) == 0x000020, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::CallFunc_GetWeapon_Weapon' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, CallFunc_DisableDamage_Result) == 0x000028, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::CallFunc_DisableDamage_Result' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ANIMNOTIFYSTATE_SetDamageEnabled.ANIMNOTIFYSTATE_SetDamageEnabled_C.Received_NotifyBegin
// 0x0038 (0x0038 - 0x0000)
struct ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MeleeWeapon_Base_C*               Weapon;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EnableDamage_Result;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MeleeWeapon_Base_C*               CallFunc_GetWeapon_Weapon;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin");
static_assert(sizeof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin) == 0x000038, "Wrong size on ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, Weapon) == 0x000018, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::Weapon' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, CallFunc_EnableDamage_Result) == 0x000020, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::CallFunc_EnableDamage_Result' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, CallFunc_GetWeapon_Weapon) == 0x000028, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::CallFunc_GetWeapon_Weapon' has a wrong offset!");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ANIMNOTIFYSTATE_SetDamageEnabled.ANIMNOTIFYSTATE_SetDamageEnabled_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName) == 0x000008, "Wrong alignment on ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName");
static_assert(sizeof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName) == 0x000010, "Wrong size on ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName");
static_assert(offsetof(ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'ANIMNOTIFYSTATE_SetDamageEnabled_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

