#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MedicalDoor_Secret_1_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_MedicalDoor_Secret_1_2.AnimBP_MedicalDoor_Secret_1_2_C
// 0x0230 (0x04F0 - 0x02C0)
class UAnimBP_MedicalDoor_Secret_1_2_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x02F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0398(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0418(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0498(0x0048)()
	bool                                          Open;                                              // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_MedicalDoor_Secret_1_2(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void UnlockDoor(bool* Result);
	void HideBackButton(bool HideState, bool* Result);
	void HideFrontButton(bool HideState, bool* Result);
	void SetLocked(bool LockedState, bool* Result);
	void IsLocked(bool* Result);
	void CloseDoor(bool* Result);
	void OpenDoor(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_MedicalDoor_Secret_1_2_C">();
	}
	static class UAnimBP_MedicalDoor_Secret_1_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_MedicalDoor_Secret_1_2_C>();
	}
};
static_assert(alignof(UAnimBP_MedicalDoor_Secret_1_2_C) == 0x000010, "Wrong alignment on UAnimBP_MedicalDoor_Secret_1_2_C");
static_assert(sizeof(UAnimBP_MedicalDoor_Secret_1_2_C) == 0x0004F0, "Wrong size on UAnimBP_MedicalDoor_Secret_1_2_C");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, UberGraphFrame) == 0x0002C0, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, AnimGraphNode_BlendListByBool) == 0x0002F8, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, AnimGraphNode_SequencePlayer_1) == 0x000398, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, AnimGraphNode_SequencePlayer) == 0x000418, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, AnimGraphNode_Slot) == 0x000498, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_MedicalDoor_Secret_1_2_C, Open) == 0x0004E0, "Member 'UAnimBP_MedicalDoor_Secret_1_2_C::Open' has a wrong offset!");

}

