#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lever

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Lever.AnimBP_Lever_C.ExecuteUbergraph_AnimBP_Lever
// 0x0020 (0x0020 - 0x0000)
struct AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_Lever_C*                      K2Node_DynamicCast_AsINTERACT_Lever;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGame_ReturnValue;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever) == 0x000008, "Wrong alignment on AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever");
static_assert(sizeof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever) == 0x000020, "Wrong size on AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, EntryPoint) == 0x000000, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, K2Node_DynamicCast_AsINTERACT_Lever) == 0x000010, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::K2Node_DynamicCast_AsINTERACT_Lever' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, CallFunc_IsGame_ReturnValue) == 0x000019, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::CallFunc_IsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'AnimBP_Lever_C_ExecuteUbergraph_AnimBP_Lever::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function AnimBP_Lever.AnimBP_Lever_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_Lever_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_Lever_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_Lever_C_AnimGraph");
static_assert(sizeof(AnimBP_Lever_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_Lever_C_AnimGraph");
static_assert(offsetof(AnimBP_Lever_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_Lever_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

