#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_FX_Footstep

#include "Basic.hpp"

#include "ENUM_Foot_structs.hpp"
#include "ENUM_LocomotionType_structs.hpp"
#include "AnimNotify_FX_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_FX_Footstep.AnimNotify_FX_Footstep_C
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_FX_Footstep_C final : public UAnimNotify_FX_Base_C
{
public:
	ENUM_Foot                                     Foot;                                              // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LocomotionType                           LocomotionType;                                    // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachPoint;                                       // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_FX_Footstep_C">();
	}
	static class UAnimNotify_FX_Footstep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FX_Footstep_C>();
	}
};
static_assert(alignof(UAnimNotify_FX_Footstep_C) == 0x000008, "Wrong alignment on UAnimNotify_FX_Footstep_C");
static_assert(sizeof(UAnimNotify_FX_Footstep_C) == 0x000050, "Wrong size on UAnimNotify_FX_Footstep_C");
static_assert(offsetof(UAnimNotify_FX_Footstep_C, Foot) == 0x000040, "Member 'UAnimNotify_FX_Footstep_C::Foot' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FX_Footstep_C, LocomotionType) == 0x000041, "Member 'UAnimNotify_FX_Footstep_C::LocomotionType' has a wrong offset!");
static_assert(offsetof(UAnimNotify_FX_Footstep_C, AttachPoint) == 0x000044, "Member 'UAnimNotify_FX_Footstep_C::AttachPoint' has a wrong offset!");

}

