#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_StationMonitor_Large

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_StationMonitor_Large.AnimBP_StationMonitor_Large_C
// 0x0270 (0x0530 - 0x02C0)
class UAnimBP_StationMonitor_Large_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0340(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0448(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0468(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E8(0x0020)()
	struct FVector                                TargetVector;                                      // 0x0508(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x0514(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               CurrentRotation;                                   // 0x0520(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_StationMonitor_Large(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void SetTargetVector(const struct FVector& Segment);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_StationMonitor_Large_C">();
	}
	static class UAnimBP_StationMonitor_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_StationMonitor_Large_C>();
	}
};
static_assert(alignof(UAnimBP_StationMonitor_Large_C) == 0x000010, "Wrong alignment on UAnimBP_StationMonitor_Large_C");
static_assert(sizeof(UAnimBP_StationMonitor_Large_C) == 0x000530, "Wrong size on UAnimBP_StationMonitor_Large_C");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, UberGraphFrame) == 0x0002C0, "Member 'UAnimBP_StationMonitor_Large_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_ModifyBone) == 0x000340, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_ComponentToLocalSpace) == 0x000448, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_SequencePlayer) == 0x000468, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, AnimGraphNode_LocalToComponentSpace) == 0x0004E8, "Member 'UAnimBP_StationMonitor_Large_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, TargetVector) == 0x000508, "Member 'UAnimBP_StationMonitor_Large_C::TargetVector' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, TargetRotation) == 0x000514, "Member 'UAnimBP_StationMonitor_Large_C::TargetRotation' has a wrong offset!");
static_assert(offsetof(UAnimBP_StationMonitor_Large_C, CurrentRotation) == 0x000520, "Member 'UAnimBP_StationMonitor_Large_C::CurrentRotation' has a wrong offset!");

}

