#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_CyberSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIMBP_CyberSwitch.ANIMBP_CyberSwitch_C
// 0x0550 (0x0810 - 0x02C0)
class UANIMBP_CyberSwitch_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0340(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03E0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0460(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0500(0x0108)()
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0610(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07C0(0x0020)()
	bool                                          Activated;                                         // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerLocation;                                    // 0x07E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtAlpha;                                       // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Jitter;                                            // 0x0800(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ANIMBP_CyberSwitch(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANIMBP_CyberSwitch_C">();
	}
	static class UANIMBP_CyberSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIMBP_CyberSwitch_C>();
	}
};
static_assert(alignof(UANIMBP_CyberSwitch_C) == 0x000010, "Wrong alignment on UANIMBP_CyberSwitch_C");
static_assert(sizeof(UANIMBP_CyberSwitch_C) == 0x000810, "Wrong size on UANIMBP_CyberSwitch_C");
static_assert(offsetof(UANIMBP_CyberSwitch_C, UberGraphFrame) == 0x0002C0, "Member 'UANIMBP_CyberSwitch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_BlendListByBool) == 0x000340, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_SequencePlayer_1) == 0x0003E0, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_SequencePlayer) == 0x000460, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_LocalToComponentSpace) == 0x0004E0, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_ModifyBone) == 0x000500, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_LookAt) == 0x000610, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007C0, "Member 'UANIMBP_CyberSwitch_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, Activated) == 0x0007E0, "Member 'UANIMBP_CyberSwitch_C::Activated' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, PlayerLocation) == 0x0007E4, "Member 'UANIMBP_CyberSwitch_C::PlayerLocation' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, LookAtAlpha) == 0x0007F0, "Member 'UANIMBP_CyberSwitch_C::LookAtAlpha' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, PlayerCameraManager) == 0x0007F8, "Member 'UANIMBP_CyberSwitch_C::PlayerCameraManager' has a wrong offset!");
static_assert(offsetof(UANIMBP_CyberSwitch_C, Jitter) == 0x000800, "Member 'UANIMBP_CyberSwitch_C::Jitter' has a wrong offset!");

}

