#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MedicalDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.ExecuteUbergraph_AnimBP_MedicalDoor
// 0x000C (0x000C - 0x0000)
struct AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor) == 0x000004, "Wrong alignment on AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor");
static_assert(sizeof(AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor) == 0x00000C, "Wrong size on AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor");
static_assert(offsetof(AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor, EntryPoint) == 0x000000, "Member 'AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000008, "Member 'AnimBP_MedicalDoor_C_ExecuteUbergraph_AnimBP_MedicalDoor::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.FinishUnlocking
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_MedicalDoor_C_FinishUnlocking final
{
public:
	bool                                          CallFunc_OpenDoor_Result;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_FinishUnlocking) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_FinishUnlocking");
static_assert(sizeof(AnimBP_MedicalDoor_C_FinishUnlocking) == 0x000001, "Wrong size on AnimBP_MedicalDoor_C_FinishUnlocking");
static_assert(offsetof(AnimBP_MedicalDoor_C_FinishUnlocking, CallFunc_OpenDoor_Result) == 0x000000, "Member 'AnimBP_MedicalDoor_C_FinishUnlocking::CallFunc_OpenDoor_Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_MedicalDoor_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_MedicalDoor_C_AnimGraph");
static_assert(sizeof(AnimBP_MedicalDoor_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_MedicalDoor_C_AnimGraph");
static_assert(offsetof(AnimBP_MedicalDoor_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_MedicalDoor_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.OpenDoor
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_MedicalDoor_C_OpenDoor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_OpenDoor) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_OpenDoor");
static_assert(sizeof(AnimBP_MedicalDoor_C_OpenDoor) == 0x000001, "Wrong size on AnimBP_MedicalDoor_C_OpenDoor");
static_assert(offsetof(AnimBP_MedicalDoor_C_OpenDoor, Result) == 0x000000, "Member 'AnimBP_MedicalDoor_C_OpenDoor::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.CloseDoor
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_MedicalDoor_C_CloseDoor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_CloseDoor) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_CloseDoor");
static_assert(sizeof(AnimBP_MedicalDoor_C_CloseDoor) == 0x000001, "Wrong size on AnimBP_MedicalDoor_C_CloseDoor");
static_assert(offsetof(AnimBP_MedicalDoor_C_CloseDoor, Result) == 0x000000, "Member 'AnimBP_MedicalDoor_C_CloseDoor::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_MedicalDoor_C_IsLocked final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_IsLocked) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_IsLocked");
static_assert(sizeof(AnimBP_MedicalDoor_C_IsLocked) == 0x000001, "Wrong size on AnimBP_MedicalDoor_C_IsLocked");
static_assert(offsetof(AnimBP_MedicalDoor_C_IsLocked, Result) == 0x000000, "Member 'AnimBP_MedicalDoor_C_IsLocked::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.SetLocked
// 0x0002 (0x0002 - 0x0000)
struct AnimBP_MedicalDoor_C_SetLocked final
{
public:
	bool                                          LockedState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_SetLocked) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_SetLocked");
static_assert(sizeof(AnimBP_MedicalDoor_C_SetLocked) == 0x000002, "Wrong size on AnimBP_MedicalDoor_C_SetLocked");
static_assert(offsetof(AnimBP_MedicalDoor_C_SetLocked, LockedState) == 0x000000, "Member 'AnimBP_MedicalDoor_C_SetLocked::LockedState' has a wrong offset!");
static_assert(offsetof(AnimBP_MedicalDoor_C_SetLocked, Result) == 0x000001, "Member 'AnimBP_MedicalDoor_C_SetLocked::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.HideFrontButton
// 0x0002 (0x0002 - 0x0000)
struct AnimBP_MedicalDoor_C_HideFrontButton final
{
public:
	bool                                          HideState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_HideFrontButton) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_HideFrontButton");
static_assert(sizeof(AnimBP_MedicalDoor_C_HideFrontButton) == 0x000002, "Wrong size on AnimBP_MedicalDoor_C_HideFrontButton");
static_assert(offsetof(AnimBP_MedicalDoor_C_HideFrontButton, HideState) == 0x000000, "Member 'AnimBP_MedicalDoor_C_HideFrontButton::HideState' has a wrong offset!");
static_assert(offsetof(AnimBP_MedicalDoor_C_HideFrontButton, Result) == 0x000001, "Member 'AnimBP_MedicalDoor_C_HideFrontButton::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.HideBackButton
// 0x0002 (0x0002 - 0x0000)
struct AnimBP_MedicalDoor_C_HideBackButton final
{
public:
	bool                                          HideState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_HideBackButton) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_HideBackButton");
static_assert(sizeof(AnimBP_MedicalDoor_C_HideBackButton) == 0x000002, "Wrong size on AnimBP_MedicalDoor_C_HideBackButton");
static_assert(offsetof(AnimBP_MedicalDoor_C_HideBackButton, HideState) == 0x000000, "Member 'AnimBP_MedicalDoor_C_HideBackButton::HideState' has a wrong offset!");
static_assert(offsetof(AnimBP_MedicalDoor_C_HideBackButton, Result) == 0x000001, "Member 'AnimBP_MedicalDoor_C_HideBackButton::Result' has a wrong offset!");

// Function AnimBP_MedicalDoor.AnimBP_MedicalDoor_C.UnlockDoor
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_MedicalDoor_C_UnlockDoor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_MedicalDoor_C_UnlockDoor) == 0x000001, "Wrong alignment on AnimBP_MedicalDoor_C_UnlockDoor");
static_assert(sizeof(AnimBP_MedicalDoor_C_UnlockDoor) == 0x000001, "Wrong size on AnimBP_MedicalDoor_C_UnlockDoor");
static_assert(offsetof(AnimBP_MedicalDoor_C_UnlockDoor, Result) == 0x000000, "Member 'AnimBP_MedicalDoor_C_UnlockDoor::Result' has a wrong offset!");

}

