#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_RepulsorLift

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ANIMBP_RepulsorLift.AnimBP_RepulsorLift_C.ExecuteUbergraph_AnimBP_RepulsorLift
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift) == 0x000004, "Wrong alignment on AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift");
static_assert(sizeof(AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift) == 0x000008, "Wrong size on AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift");
static_assert(offsetof(AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift, EntryPoint) == 0x000000, "Member 'AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'AnimBP_RepulsorLift_C_ExecuteUbergraph_AnimBP_RepulsorLift::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function ANIMBP_RepulsorLift.AnimBP_RepulsorLift_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_RepulsorLift_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_RepulsorLift_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_RepulsorLift_C_AnimGraph");
static_assert(sizeof(AnimBP_RepulsorLift_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_RepulsorLift_C_AnimGraph");
static_assert(offsetof(AnimBP_RepulsorLift_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_RepulsorLift_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

