#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Button.AnimBP_Button_C.ExecuteUbergraph_AnimBP_Button
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button) == 0x000004, "Wrong alignment on AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button");
static_assert(sizeof(AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button) == 0x000004, "Wrong size on AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button");
static_assert(offsetof(AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button, EntryPoint) == 0x000000, "Member 'AnimBP_Button_C_ExecuteUbergraph_AnimBP_Button::EntryPoint' has a wrong offset!");

// Function AnimBP_Button.AnimBP_Button_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_Button_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_Button_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_Button_C_AnimGraph");
static_assert(sizeof(AnimBP_Button_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_Button_C_AnimGraph");
static_assert(offsetof(AnimBP_Button_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_Button_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_Button.AnimBP_Button_C.IsButtonPressed
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_Button_C_IsButtonPressed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Button_C_IsButtonPressed) == 0x000001, "Wrong alignment on AnimBP_Button_C_IsButtonPressed");
static_assert(sizeof(AnimBP_Button_C_IsButtonPressed) == 0x000001, "Wrong size on AnimBP_Button_C_IsButtonPressed");
static_assert(offsetof(AnimBP_Button_C_IsButtonPressed, Result) == 0x000000, "Member 'AnimBP_Button_C_IsButtonPressed::Result' has a wrong offset!");

// Function AnimBP_Button.AnimBP_Button_C.ToggleButton
// 0x0002 (0x0002 - 0x0000)
struct AnimBP_Button_C_ToggleButton final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Button_C_ToggleButton) == 0x000001, "Wrong alignment on AnimBP_Button_C_ToggleButton");
static_assert(sizeof(AnimBP_Button_C_ToggleButton) == 0x000002, "Wrong size on AnimBP_Button_C_ToggleButton");
static_assert(offsetof(AnimBP_Button_C_ToggleButton, Result) == 0x000000, "Member 'AnimBP_Button_C_ToggleButton::Result' has a wrong offset!");
static_assert(offsetof(AnimBP_Button_C_ToggleButton, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'AnimBP_Button_C_ToggleButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

