#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_ServiceDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_ServiceDoor.AnimBP_ServiceDoor_C
// 0x04C0 (0x0780 - 0x02C0)
class UAnimBP_ServiceDoor_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x02F8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0378(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x03F8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0498(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x04E0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x05A8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0670(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06F0(0x0080)()
	bool                                          IsOpen;                                            // 0x0770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NoFrontButton;                                     // 0x0771(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NoBackButton;                                      // 0x0772(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_ServiceDoor(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_ServiceDoor_AnimGraphNode_ApplyAdditive_E41CAF4C4CAA95E3AE05D2A4DC39CF3D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_ServiceDoor_AnimGraphNode_ApplyAdditive_42A2F86A4DF8A622FD950D853C1B10B0();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void UnlockDoor(bool* Result);
	void HideBackButton(bool HideState, bool* Result);
	void HideFrontButton(bool HideState, bool* Result);
	void SetLocked(bool LockedState, bool* Result);
	void IsLocked(bool* Result);
	void CloseDoor(bool* Result);
	void OpenDoor(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_ServiceDoor_C">();
	}
	static class UAnimBP_ServiceDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_ServiceDoor_C>();
	}
};
static_assert(alignof(UAnimBP_ServiceDoor_C) == 0x000010, "Wrong alignment on UAnimBP_ServiceDoor_C");
static_assert(sizeof(UAnimBP_ServiceDoor_C) == 0x000780, "Wrong size on UAnimBP_ServiceDoor_C");
static_assert(offsetof(UAnimBP_ServiceDoor_C, UberGraphFrame) == 0x0002C0, "Member 'UAnimBP_ServiceDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_SequencePlayer_3) == 0x0002F8, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_SequencePlayer_2) == 0x000378, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_BlendListByBool) == 0x0003F8, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_Slot) == 0x000498, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_ApplyAdditive_1) == 0x0004E0, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_ApplyAdditive) == 0x0005A8, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_SequencePlayer_1) == 0x000670, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, AnimGraphNode_SequencePlayer) == 0x0006F0, "Member 'UAnimBP_ServiceDoor_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, IsOpen) == 0x000770, "Member 'UAnimBP_ServiceDoor_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, NoFrontButton) == 0x000771, "Member 'UAnimBP_ServiceDoor_C::NoFrontButton' has a wrong offset!");
static_assert(offsetof(UAnimBP_ServiceDoor_C, NoBackButton) == 0x000772, "Member 'UAnimBP_ServiceDoor_C::NoBackButton' has a wrong offset!");

}

