#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIMBP_PowerStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_PowerStationRechargeState_structs.hpp"


namespace SDK::Params
{

// Function ANIMBP_PowerStation.AnimBP_PowerStation_C.ExecuteUbergraph_AnimBP_PowerStation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation) == 0x000004, "Wrong alignment on AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation");
static_assert(sizeof(AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation) == 0x000004, "Wrong size on AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation");
static_assert(offsetof(AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation, EntryPoint) == 0x000000, "Member 'AnimBP_PowerStation_C_ExecuteUbergraph_AnimBP_PowerStation::EntryPoint' has a wrong offset!");

// Function ANIMBP_PowerStation.AnimBP_PowerStation_C.SetRechargeState
// 0x0001 (0x0001 - 0x0000)
struct AnimBP_PowerStation_C_SetRechargeState final
{
public:
	ENUM_PowerStationRechargeState                State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_PowerStation_C_SetRechargeState) == 0x000001, "Wrong alignment on AnimBP_PowerStation_C_SetRechargeState");
static_assert(sizeof(AnimBP_PowerStation_C_SetRechargeState) == 0x000001, "Wrong size on AnimBP_PowerStation_C_SetRechargeState");
static_assert(offsetof(AnimBP_PowerStation_C_SetRechargeState, State) == 0x000000, "Member 'AnimBP_PowerStation_C_SetRechargeState::State' has a wrong offset!");

// Function ANIMBP_PowerStation.AnimBP_PowerStation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_PowerStation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_PowerStation_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_PowerStation_C_AnimGraph");
static_assert(sizeof(AnimBP_PowerStation_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_PowerStation_C_AnimGraph");
static_assert(offsetof(AnimBP_PowerStation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_PowerStation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

