#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Crate_Large

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Crate_Large.AnimBP_Crate_Large_C.ExecuteUbergraph_AnimBP_Crate_Large
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large) == 0x000004, "Wrong alignment on AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large");
static_assert(sizeof(AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large) == 0x000004, "Wrong size on AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large");
static_assert(offsetof(AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large, EntryPoint) == 0x000000, "Member 'AnimBP_Crate_Large_C_ExecuteUbergraph_AnimBP_Crate_Large::EntryPoint' has a wrong offset!");

// Function AnimBP_Crate_Large.AnimBP_Crate_Large_C.UpdateBlendspaceCoords
// 0x0014 (0x0014 - 0x0000)
struct AnimBP_Crate_Large_C_UpdateBlendspaceCoords final
{
public:
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords) == 0x000004, "Wrong alignment on AnimBP_Crate_Large_C_UpdateBlendspaceCoords");
static_assert(sizeof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords) == 0x000014, "Wrong size on AnimBP_Crate_Large_C_UpdateBlendspaceCoords");
static_assert(offsetof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords, CallFunc_DegSin_ReturnValue) == 0x000000, "Member 'AnimBP_Crate_Large_C_UpdateBlendspaceCoords::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords, CallFunc_DegCos_ReturnValue) == 0x000004, "Member 'AnimBP_Crate_Large_C_UpdateBlendspaceCoords::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_Crate_Large_C_UpdateBlendspaceCoords::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'AnimBP_Crate_Large_C_UpdateBlendspaceCoords::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_UpdateBlendspaceCoords, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000010, "Member 'AnimBP_Crate_Large_C_UpdateBlendspaceCoords::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function AnimBP_Crate_Large.AnimBP_Crate_Large_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_Crate_Large_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_Crate_Large_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_Crate_Large_C_AnimGraph");
static_assert(sizeof(AnimBP_Crate_Large_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_Crate_Large_C_AnimGraph");
static_assert(offsetof(AnimBP_Crate_Large_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_Crate_Large_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_Crate_Large.AnimBP_Crate_Large_C.SetPhase
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_Crate_Large_C_SetPhase final
{
public:
	float                                         NewPhase;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Crate_Large_C_SetPhase) == 0x000004, "Wrong alignment on AnimBP_Crate_Large_C_SetPhase");
static_assert(sizeof(AnimBP_Crate_Large_C_SetPhase) == 0x000008, "Wrong size on AnimBP_Crate_Large_C_SetPhase");
static_assert(offsetof(AnimBP_Crate_Large_C_SetPhase, NewPhase) == 0x000000, "Member 'AnimBP_Crate_Large_C_SetPhase::NewPhase' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_SetPhase, Result) == 0x000004, "Member 'AnimBP_Crate_Large_C_SetPhase::Result' has a wrong offset!");

// Function AnimBP_Crate_Large.AnimBP_Crate_Large_C.SetAngle
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_Crate_Large_C_SetAngle final
{
public:
	float                                         NewAngle;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Crate_Large_C_SetAngle) == 0x000004, "Wrong alignment on AnimBP_Crate_Large_C_SetAngle");
static_assert(sizeof(AnimBP_Crate_Large_C_SetAngle) == 0x000008, "Wrong size on AnimBP_Crate_Large_C_SetAngle");
static_assert(offsetof(AnimBP_Crate_Large_C_SetAngle, NewAngle) == 0x000000, "Member 'AnimBP_Crate_Large_C_SetAngle::NewAngle' has a wrong offset!");
static_assert(offsetof(AnimBP_Crate_Large_C_SetAngle, Result) == 0x000004, "Member 'AnimBP_Crate_Large_C_SetAngle::Result' has a wrong offset!");

}

