#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AlarmSpeaker_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.ExecuteUbergraph_BP_AlarmSpeaker_Base
// 0x0008 (0x0008 - 0x0000)
struct BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bAudibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base) == 0x000004, "Wrong alignment on BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base) == 0x000008, "Wrong size on BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base, EntryPoint) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base, K2Node_ComponentBoundEvent_bAudibleState) == 0x000004, "Member 'BP_AlarmSpeaker_Base_C_ExecuteUbergraph_BP_AlarmSpeaker_Base::K2Node_ComponentBoundEvent_bAudibleState' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature final
{
public:
	bool                                          bAudibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong size on BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature, bAudibleState) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_BndEvt__BP_AlarmLight_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature::bAudibleState' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.IsAlarmFunctional
// 0x0001 (0x0001 - 0x0000)
struct BP_AlarmSpeaker_Base_C_IsAlarmFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_IsAlarmFunctional) == 0x000001, "Wrong alignment on BP_AlarmSpeaker_Base_C_IsAlarmFunctional");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_IsAlarmFunctional) == 0x000001, "Wrong size on BP_AlarmSpeaker_Base_C_IsAlarmFunctional");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_IsAlarmFunctional, Result) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_IsAlarmFunctional::Result' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.InitializeAlarmSpeaker
// 0x0038 (0x0038 - 0x0000)
struct BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed_1;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker) == 0x000038, "Wrong size on BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, GameInstance) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, CallFunc_HasCompletedStoryQuest_Completed) == 0x000018, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker, CallFunc_HasCompletedStoryQuest_Completed_1) == 0x000031, "Member 'BP_AlarmSpeaker_Base_C_InitializeAlarmSpeaker::CallFunc_HasCompletedStoryQuest_Completed_1' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.OnAlarmActivated
// 0x0030 (0x0030 - 0x0000)
struct BP_AlarmSpeaker_Base_C_OnAlarmActivated final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_OnAlarmActivated) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_OnAlarmActivated");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_OnAlarmActivated) == 0x000030, "Wrong size on BP_AlarmSpeaker_Base_C_OnAlarmActivated");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_OnAlarmActivated, GameInstance) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_OnAlarmActivated::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_OnAlarmActivated, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AlarmSpeaker_Base_C_OnAlarmActivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_OnAlarmActivated, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'BP_AlarmSpeaker_Base_C_OnAlarmActivated::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_OnAlarmActivated, K2Node_DynamicCast_AsGI_Single_Player) == 0x000020, "Member 'BP_AlarmSpeaker_Base_C_OnAlarmActivated::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_OnAlarmActivated, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_AlarmSpeaker_Base_C_OnAlarmActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.TryUpdateAudibleBehavior
// 0x0020 (0x0020 - 0x0000)
struct BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlarmFunctional_Result;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior) == 0x000020, "Wrong size on BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, GameInstance) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, CallFunc_IsAlarmFunctional_Result) == 0x000019, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::CallFunc_IsAlarmFunctional_Result' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_AlarmSpeaker_Base_C_TryUpdateAudibleBehavior::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.UpdateAlarmSpeakerAudibility
// 0x0010 (0x0010 - 0x0000)
struct BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility final
{
public:
	bool                                          AudibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility) == 0x000010, "Wrong size on BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility, AudibilityState) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility::AudibilityState' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility, GameInstance) == 0x000008, "Member 'BP_AlarmSpeaker_Base_C_UpdateAlarmSpeakerAudibility::GameInstance' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.PlayEmergencySound
// 0x0028 (0x0028 - 0x0000)
struct BP_AlarmSpeaker_Base_C_PlayEmergencySound final
{
public:
	struct FVector                                CallFunc_GetAlarmSpeakerPosition_Result;           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_PlayEmergencySound) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_PlayEmergencySound");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_PlayEmergencySound) == 0x000028, "Wrong size on BP_AlarmSpeaker_Base_C_PlayEmergencySound");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_PlayEmergencySound, CallFunc_GetAlarmSpeakerPosition_Result) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_PlayEmergencySound::CallFunc_GetAlarmSpeakerPosition_Result' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_PlayEmergencySound, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_AlarmSpeaker_Base_C_PlayEmergencySound::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_PlayEmergencySound, K2Node_DynamicCast_AsGI_Single_Player) == 0x000018, "Member 'BP_AlarmSpeaker_Base_C_PlayEmergencySound::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_PlayEmergencySound, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AlarmSpeaker_Base_C_PlayEmergencySound::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.EVENT_OnStoryQuestChanged
// 0x0020 (0x0020 - 0x0000)
struct BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged final
{
public:
	class FName                                   StoryQuestName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged) == 0x000008, "Wrong alignment on BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged) == 0x000020, "Wrong size on BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged, StoryQuestName) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged::StoryQuestName' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged, Value) == 0x000008, "Member 'BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged::Value' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged, GameInstance) == 0x000010, "Member 'BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged::GameInstance' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000018, "Member 'BP_AlarmSpeaker_Base_C_EVENT_OnStoryQuestChanged::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.IsAlarmActive
// 0x0001 (0x0001 - 0x0000)
struct BP_AlarmSpeaker_Base_C_IsAlarmActive final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_IsAlarmActive) == 0x000001, "Wrong alignment on BP_AlarmSpeaker_Base_C_IsAlarmActive");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_IsAlarmActive) == 0x000001, "Wrong size on BP_AlarmSpeaker_Base_C_IsAlarmActive");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_IsAlarmActive, Result) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_IsAlarmActive::Result' has a wrong offset!");

// Function BP_AlarmSpeaker_Base.BP_AlarmSpeaker_Base_C.GetAlarmSpeakerPosition
// 0x0018 (0x0018 - 0x0000)
struct BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition) == 0x000004, "Wrong alignment on BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition");
static_assert(sizeof(BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition) == 0x000018, "Wrong size on BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition, Result) == 0x000000, "Member 'BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition::Result' has a wrong offset!");
static_assert(offsetof(BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'BP_AlarmSpeaker_Base_C_GetAlarmSpeakerPosition::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

}

