#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExternalWindow_LargeDouble

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExternalWindow_LargeDouble.BP_ExternalWindow_LargeDouble_C
// 0x0018 (0x0238 - 0x0220)
class ABP_ExternalWindow_LargeDouble_C final : public AActor
{
public:
	class UStaticMeshComponent*                   ExternalWindow_LargeDouble;                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExternalWindow_LargeDouble_C">();
	}
	static class ABP_ExternalWindow_LargeDouble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExternalWindow_LargeDouble_C>();
	}
};
static_assert(alignof(ABP_ExternalWindow_LargeDouble_C) == 0x000008, "Wrong alignment on ABP_ExternalWindow_LargeDouble_C");
static_assert(sizeof(ABP_ExternalWindow_LargeDouble_C) == 0x000238, "Wrong size on ABP_ExternalWindow_LargeDouble_C");
static_assert(offsetof(ABP_ExternalWindow_LargeDouble_C, ExternalWindow_LargeDouble) == 0x000220, "Member 'ABP_ExternalWindow_LargeDouble_C::ExternalWindow_LargeDouble' has a wrong offset!");
static_assert(offsetof(ABP_ExternalWindow_LargeDouble_C, SpotLight) == 0x000228, "Member 'ABP_ExternalWindow_LargeDouble_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_ExternalWindow_LargeDouble_C, SpotLight1) == 0x000230, "Member 'ABP_ExternalWindow_LargeDouble_C::SpotLight1' has a wrong offset!");

}

