#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Loudspeaker

#include "Basic.hpp"

#include "BP_AlarmSpeaker_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Loudspeaker.BP_Loudspeaker_C
// 0x0018 (0x02A0 - 0x0288)
class ABP_Loudspeaker_C final : public ABP_AlarmSpeaker_Base_C
{
public:
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPublicAddressActive;                             // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EVENT_OnPublicAddressStateChanged(class USoundCue* SoundCue, TSoftObjectPtr<class UTexture2D> PortraitTexture, int32 RowCount, int32 ColCount, int32 FrameRate);
	void UpdateAlarmSpeakerAudibility(bool AudibilityState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Loudspeaker_C">();
	}
	static class ABP_Loudspeaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Loudspeaker_C>();
	}
};
static_assert(alignof(ABP_Loudspeaker_C) == 0x000008, "Wrong alignment on ABP_Loudspeaker_C");
static_assert(sizeof(ABP_Loudspeaker_C) == 0x0002A0, "Wrong size on ABP_Loudspeaker_C");
static_assert(offsetof(ABP_Loudspeaker_C, COMP_VoxelAudio) == 0x000288, "Member 'ABP_Loudspeaker_C::COMP_VoxelAudio' has a wrong offset!");
static_assert(offsetof(ABP_Loudspeaker_C, COMP_Descriptor) == 0x000290, "Member 'ABP_Loudspeaker_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(ABP_Loudspeaker_C, IsPublicAddressActive) == 0x000298, "Member 'ABP_Loudspeaker_C::IsPublicAddressActive' has a wrong offset!");

}

