#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lounge_Foliage_Wall_End_B

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lounge_Foliage_Wall_End_B.BP_Lounge_Foliage_Wall_End_B_C
// 0x0118 (0x0338 - 0x0220)
class ABP_Lounge_Foliage_Wall_End_B_C final : public AActor
{
public:
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf8;                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium8;                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall7;                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall6;                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall5;                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall4;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium7;                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium3;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall3;                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall2;                            // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium6;                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall1;                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall;                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium2;                           // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf7;                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium9;                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf13;                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_LargeGrass_SmallLeaf2;                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium5;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf12;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium4;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf11;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf10;                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium1;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf6;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf3;                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf5;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf4;                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyLarge;                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf2;                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf_Jagged;                    // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf_CrotonLarge;               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foliage;                                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lounge_Wall_End;                                   // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lounge_Foliage_Wall_End_B_C">();
	}
	static class ABP_Lounge_Foliage_Wall_End_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lounge_Foliage_Wall_End_B_C>();
	}
};
static_assert(alignof(ABP_Lounge_Foliage_Wall_End_B_C) == 0x000008, "Wrong alignment on ABP_Lounge_Foliage_Wall_End_B_C");
static_assert(sizeof(ABP_Lounge_Foliage_Wall_End_B_C) == 0x000338, "Wrong size on ABP_Lounge_Foliage_Wall_End_B_C");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf8) == 0x000220, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf8' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium8) == 0x000228, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium8' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall7) == 0x000230, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall7' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall6) == 0x000238, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall6' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall5) == 0x000240, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall5' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall4) == 0x000248, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall4' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium7) == 0x000250, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium7' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium3) == 0x000258, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium3' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall3) == 0x000260, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall3' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall2) == 0x000268, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium6) == 0x000270, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium6' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall1) == 0x000278, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall1' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvySmall) == 0x000280, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvySmall' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium2) == 0x000288, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf7) == 0x000290, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf7' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium9) == 0x000298, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium9' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf13) == 0x0002A0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf13' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_LargeGrass_SmallLeaf2) == 0x0002A8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_LargeGrass_SmallLeaf2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium5) == 0x0002B0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium5' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf12) == 0x0002B8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf12' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium4) == 0x0002C0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium4' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf11) == 0x0002C8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf11' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf10) == 0x0002D0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf10' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyMedium1) == 0x0002D8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyMedium1' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf6) == 0x0002E0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf6' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_MediumLeaf3) == 0x0002E8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_MediumLeaf3' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf5) == 0x0002F0, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf5' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_SmallLeaf4) == 0x0002F8, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_SmallLeaf4' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_IvyLarge) == 0x000300, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_IvyLarge' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_MediumLeaf2) == 0x000308, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_MediumLeaf2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_MediumLeaf_Jagged) == 0x000310, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_MediumLeaf_Jagged' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, GroveFoliage_MediumLeaf_CrotonLarge) == 0x000318, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::GroveFoliage_MediumLeaf_CrotonLarge' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, Foliage) == 0x000320, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::Foliage' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, Lounge_Wall_End) == 0x000328, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::Lounge_Wall_End' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_End_B_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_Lounge_Foliage_Wall_End_B_C::DefaultSceneRoot' has a wrong offset!");

}

