#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lounge_Foliage_WallTop_EndQuarter_A

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lounge_Foliage_WallTop_EndQuarter_A.BP_Lounge_Foliage_WallTop_EndQuarter_A_C
// 0x0050 (0x0270 - 0x0220)
class ABP_Lounge_Foliage_WallTop_EndQuarter_A_C final : public AActor
{
public:
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf_Jagged;                    // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyLarge;                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf14;                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf13;                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf12;                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf9;                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_CrotonLeaf2;                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foliage;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lounge_WallTop_EndQuarter;                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lounge_Foliage_WallTop_EndQuarter_A_C">();
	}
	static class ABP_Lounge_Foliage_WallTop_EndQuarter_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lounge_Foliage_WallTop_EndQuarter_A_C>();
	}
};
static_assert(alignof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C) == 0x000008, "Wrong alignment on ABP_Lounge_Foliage_WallTop_EndQuarter_A_C");
static_assert(sizeof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C) == 0x000270, "Wrong size on ABP_Lounge_Foliage_WallTop_EndQuarter_A_C");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_MediumLeaf_Jagged) == 0x000220, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_MediumLeaf_Jagged' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_IvyLarge) == 0x000228, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_IvyLarge' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_SmallLeaf14) == 0x000230, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_SmallLeaf14' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_SmallLeaf13) == 0x000238, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_SmallLeaf13' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_SmallLeaf12) == 0x000240, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_SmallLeaf12' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_SmallLeaf9) == 0x000248, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_SmallLeaf9' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, GroveFoliage_CrotonLeaf2) == 0x000250, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::GroveFoliage_CrotonLeaf2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, Foliage) == 0x000258, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::Foliage' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, Lounge_WallTop_EndQuarter) == 0x000260, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::Lounge_WallTop_EndQuarter' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_WallTop_EndQuarter_A_C, DefaultSceneRoot) == 0x000268, "Member 'ABP_Lounge_Foliage_WallTop_EndQuarter_A_C::DefaultSceneRoot' has a wrong offset!");

}

