#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lounge_Foliage_Wall_HalfSmall_End_A

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lounge_Foliage_Wall_HalfSmall_End_A.BP_Lounge_Foliage_Wall_HalfSmall_End_A_C
// 0x0060 (0x0280 - 0x0220)
class ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C final : public AActor
{
public:
	class UStaticMeshComponent*                   GroveFoliage_IvySmall;                             // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium3;                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf4;                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf2;                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvySmall1;                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyLarge4;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_IvyMedium2;                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_SmallLeaf3;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveFoliage_MediumLeaf_Jagged;                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Foliage;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lounge_Wall_HalfSmall_End;                         // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lounge_Foliage_Wall_HalfSmall_End_A_C">();
	}
	static class ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C>();
	}
};
static_assert(alignof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C) == 0x000008, "Wrong alignment on ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C");
static_assert(sizeof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C) == 0x000280, "Wrong size on ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_IvySmall) == 0x000220, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_IvySmall' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_IvyMedium3) == 0x000228, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_IvyMedium3' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_SmallLeaf4) == 0x000230, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_SmallLeaf4' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_MediumLeaf2) == 0x000238, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_MediumLeaf2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_IvySmall1) == 0x000240, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_IvySmall1' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_IvyLarge4) == 0x000248, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_IvyLarge4' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_IvyMedium2) == 0x000250, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_IvyMedium2' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_SmallLeaf3) == 0x000258, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_SmallLeaf3' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, GroveFoliage_MediumLeaf_Jagged) == 0x000260, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::GroveFoliage_MediumLeaf_Jagged' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, Foliage) == 0x000268, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::Foliage' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, Lounge_Wall_HalfSmall_End) == 0x000270, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::Lounge_Wall_HalfSmall_End' has a wrong offset!");
static_assert(offsetof(ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C, DefaultSceneRoot) == 0x000278, "Member 'ABP_Lounge_Foliage_Wall_HalfSmall_End_A_C::DefaultSceneRoot' has a wrong offset!");

}

