#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Medical_Computer_Screens_2

#include "Basic.hpp"

#include "TILE_Prefab_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Medical_Computer_Screens_2.BP_Medical_Computer_Screens_2_C
// 0x0040 (0x0270 - 0x0230)
class ABP_Medical_Computer_Screens_2_C final : public ATILE_Prefab_C
{
public:
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio_ComputerWall_Loop;                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight5;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight4;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight3;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FogScatterIntensity;                               // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Medical_Computer_Screens_2_C">();
	}
	static class ABP_Medical_Computer_Screens_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Medical_Computer_Screens_2_C>();
	}
};
static_assert(alignof(ABP_Medical_Computer_Screens_2_C) == 0x000008, "Wrong alignment on ABP_Medical_Computer_Screens_2_C");
static_assert(sizeof(ABP_Medical_Computer_Screens_2_C) == 0x000270, "Wrong size on ABP_Medical_Computer_Screens_2_C");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, COMP_VoxelAudio_ComputerWall_Loop) == 0x000230, "Member 'ABP_Medical_Computer_Screens_2_C::COMP_VoxelAudio_ComputerWall_Loop' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight1) == 0x000238, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight5) == 0x000240, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight5' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight4) == 0x000248, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight4' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight3) == 0x000250, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight3' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight2) == 0x000258, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight2' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, PointLight) == 0x000260, "Member 'ABP_Medical_Computer_Screens_2_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Computer_Screens_2_C, FogScatterIntensity) == 0x000268, "Member 'ABP_Medical_Computer_Screens_2_C::FogScatterIntensity' has a wrong offset!");

}

