#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Medical_CeilingVent

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Medical_CeilingVent.BP_Medical_CeilingVent_C
// 0x0020 (0x0240 - 0x0220)
class ABP_Medical_CeilingVent_C final : public AActor
{
public:
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio;                                   // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_SteamVent;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSteamActive;                                     // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Medical_CeilingVent_C">();
	}
	static class ABP_Medical_CeilingVent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Medical_CeilingVent_C>();
	}
};
static_assert(alignof(ABP_Medical_CeilingVent_C) == 0x000008, "Wrong alignment on ABP_Medical_CeilingVent_C");
static_assert(sizeof(ABP_Medical_CeilingVent_C) == 0x000240, "Wrong size on ABP_Medical_CeilingVent_C");
static_assert(offsetof(ABP_Medical_CeilingVent_C, COMP_VoxelAudio) == 0x000220, "Member 'ABP_Medical_CeilingVent_C::COMP_VoxelAudio' has a wrong offset!");
static_assert(offsetof(ABP_Medical_CeilingVent_C, P_SteamVent) == 0x000228, "Member 'ABP_Medical_CeilingVent_C::P_SteamVent' has a wrong offset!");
static_assert(offsetof(ABP_Medical_CeilingVent_C, StaticMesh) == 0x000230, "Member 'ABP_Medical_CeilingVent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Medical_CeilingVent_C, IsSteamActive) == 0x000238, "Member 'ABP_Medical_CeilingVent_C::IsSteamActive' has a wrong offset!");

}

