#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Medical_Floor_Lights

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Medical_Floor_Lights.BP_Medical_Floor_Lights_C
// 0x0018 (0x0238 - 0x0220)
class ABP_Medical_Floor_Lights_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Medical_Floor_Lights(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Medical_Floor_Lights_C">();
	}
	static class ABP_Medical_Floor_Lights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Medical_Floor_Lights_C>();
	}
};
static_assert(alignof(ABP_Medical_Floor_Lights_C) == 0x000008, "Wrong alignment on ABP_Medical_Floor_Lights_C");
static_assert(sizeof(ABP_Medical_Floor_Lights_C) == 0x000238, "Wrong size on ABP_Medical_Floor_Lights_C");
static_assert(offsetof(ABP_Medical_Floor_Lights_C, UberGraphFrame) == 0x000220, "Member 'ABP_Medical_Floor_Lights_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Floor_Lights_C, RectLight) == 0x000228, "Member 'ABP_Medical_Floor_Lights_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABP_Medical_Floor_Lights_C, StaticMesh) == 0x000230, "Member 'ABP_Medical_Floor_Lights_C::StaticMesh' has a wrong offset!");

}

