#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Maintenance_WallFan

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Maintenance_WallFan.BP_Maintenance_WallFan_C
// 0x0018 (0x0238 - 0x0220)
class ABP_Maintenance_WallFan_C final : public AActor
{
public:
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio;                                   // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVariantTile;                                     // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Maintenance_WallFan_C">();
	}
	static class ABP_Maintenance_WallFan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Maintenance_WallFan_C>();
	}
};
static_assert(alignof(ABP_Maintenance_WallFan_C) == 0x000008, "Wrong alignment on ABP_Maintenance_WallFan_C");
static_assert(sizeof(ABP_Maintenance_WallFan_C) == 0x000238, "Wrong size on ABP_Maintenance_WallFan_C");
static_assert(offsetof(ABP_Maintenance_WallFan_C, COMP_VoxelAudio) == 0x000220, "Member 'ABP_Maintenance_WallFan_C::COMP_VoxelAudio' has a wrong offset!");
static_assert(offsetof(ABP_Maintenance_WallFan_C, StaticMesh) == 0x000228, "Member 'ABP_Maintenance_WallFan_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Maintenance_WallFan_C, IsVariantTile) == 0x000230, "Member 'ABP_Maintenance_WallFan_C::IsVariantTile' has a wrong offset!");

}

