#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OxygenScrubber_Tubes

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_OxygenScrubber_Tubes.BP_OxygenScrubber_Tubes_C.ExecuteUbergraph_BP_OxygenScrubber_Tubes
// 0x000C (0x000C - 0x0000)
struct BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_PC;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Xbox;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Playstation;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Switch;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Console;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes) == 0x000004, "Wrong alignment on BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes");
static_assert(sizeof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes) == 0x00000C, "Wrong size on BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, EntryPoint) == 0x000000, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_IsVisible_ReturnValue) == 0x000005, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_GetCurrentPlatform_PC) == 0x000006, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_GetCurrentPlatform_PC' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_GetCurrentPlatform_Xbox) == 0x000007, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_GetCurrentPlatform_Xbox' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_GetCurrentPlatform_Playstation) == 0x000008, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_GetCurrentPlatform_Playstation' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_GetCurrentPlatform_Switch) == 0x000009, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_GetCurrentPlatform_Switch' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes, CallFunc_GetCurrentPlatform_Console) == 0x00000A, "Member 'BP_OxygenScrubber_Tubes_C_ExecuteUbergraph_BP_OxygenScrubber_Tubes::CallFunc_GetCurrentPlatform_Console' has a wrong offset!");

// Function BP_OxygenScrubber_Tubes.BP_OxygenScrubber_Tubes_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'BP_OxygenScrubber_Tubes_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function BP_OxygenScrubber_Tubes.BP_OxygenScrubber_Tubes_C.UpdateVisibility
// 0x0002 (0x0002 - 0x0000)
struct BP_OxygenScrubber_Tubes_C_UpdateVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OxygenScrubber_Tubes_C_UpdateVisibility) == 0x000001, "Wrong alignment on BP_OxygenScrubber_Tubes_C_UpdateVisibility");
static_assert(sizeof(BP_OxygenScrubber_Tubes_C_UpdateVisibility) == 0x000002, "Wrong size on BP_OxygenScrubber_Tubes_C_UpdateVisibility");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_UpdateVisibility, VisibilityState) == 0x000000, "Member 'BP_OxygenScrubber_Tubes_C_UpdateVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Tubes_C_UpdateVisibility, CallFunc_IsPlaying_ReturnValue) == 0x000001, "Member 'BP_OxygenScrubber_Tubes_C_UpdateVisibility::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

}

