#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OxygenScrubber_Tubes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OxygenScrubber_Tubes.BP_OxygenScrubber_Tubes_C
// 0x0040 (0x0260 - 0x0220)
class ABP_OxygenScrubber_Tubes_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     Pipes_Audio_Loop;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TubeMeshRight;                                     // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TubeMeshLeft;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OxygenScrubber_Tubes(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();
	void UpdateVisibility(bool VisibilityState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OxygenScrubber_Tubes_C">();
	}
	static class ABP_OxygenScrubber_Tubes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OxygenScrubber_Tubes_C>();
	}
};
static_assert(alignof(ABP_OxygenScrubber_Tubes_C) == 0x000008, "Wrong alignment on ABP_OxygenScrubber_Tubes_C");
static_assert(sizeof(ABP_OxygenScrubber_Tubes_C) == 0x000260, "Wrong size on ABP_OxygenScrubber_Tubes_C");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, UberGraphFrame) == 0x000220, "Member 'ABP_OxygenScrubber_Tubes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, Pipes_Audio_Loop) == 0x000228, "Member 'ABP_OxygenScrubber_Tubes_C::Pipes_Audio_Loop' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, COMP_VoxelCullable) == 0x000230, "Member 'ABP_OxygenScrubber_Tubes_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, COMP_Descriptor) == 0x000238, "Member 'ABP_OxygenScrubber_Tubes_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, TubeMeshRight) == 0x000240, "Member 'ABP_OxygenScrubber_Tubes_C::TubeMeshRight' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, StaticMesh) == 0x000248, "Member 'ABP_OxygenScrubber_Tubes_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, TubeMeshLeft) == 0x000250, "Member 'ABP_OxygenScrubber_Tubes_C::TubeMeshLeft' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Tubes_C, DefaultSceneRoot) == 0x000258, "Member 'ABP_OxygenScrubber_Tubes_C::DefaultSceneRoot' has a wrong offset!");

}

