#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OxygenScrubber_Bags

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_OxygenScrubber_Bags.BP_OxygenScrubber_Bags_C.ExecuteUbergraph_BP_OxygenScrubber_Bags
// 0x0008 (0x0008 - 0x0000)
struct BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags) == 0x000004, "Wrong alignment on BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags");
static_assert(sizeof(BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags) == 0x000008, "Wrong size on BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags");
static_assert(offsetof(BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags, EntryPoint) == 0x000000, "Member 'BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags, K2Node_ComponentBoundEvent_bVisibleState) == 0x000005, "Member 'BP_OxygenScrubber_Bags_C_ExecuteUbergraph_BP_OxygenScrubber_Bags::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function BP_OxygenScrubber_Bags.BP_OxygenScrubber_Bags_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'BP_OxygenScrubber_Bags_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

}

