#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OxygenScrubber_Bags

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OxygenScrubber_Bags.BP_OxygenScrubber_Bags_C
// 0x0040 (0x0260 - 0x0220)
class ABP_OxygenScrubber_Bags_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          RightScrubberCollision;                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftScrubberCollision;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCollision;                                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OxygenScrubber_Bag;                                // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OxygenScrubber_Bags(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OxygenScrubber_Bags_C">();
	}
	static class ABP_OxygenScrubber_Bags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OxygenScrubber_Bags_C>();
	}
};
static_assert(alignof(ABP_OxygenScrubber_Bags_C) == 0x000008, "Wrong alignment on ABP_OxygenScrubber_Bags_C");
static_assert(sizeof(ABP_OxygenScrubber_Bags_C) == 0x000260, "Wrong size on ABP_OxygenScrubber_Bags_C");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, UberGraphFrame) == 0x000220, "Member 'ABP_OxygenScrubber_Bags_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, RightScrubberCollision) == 0x000228, "Member 'ABP_OxygenScrubber_Bags_C::RightScrubberCollision' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, LeftScrubberCollision) == 0x000230, "Member 'ABP_OxygenScrubber_Bags_C::LeftScrubberCollision' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, COMP_VoxelCullable) == 0x000238, "Member 'ABP_OxygenScrubber_Bags_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, COMP_Descriptor) == 0x000240, "Member 'ABP_OxygenScrubber_Bags_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, TileCollision) == 0x000248, "Member 'ABP_OxygenScrubber_Bags_C::TileCollision' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, OxygenScrubber_Bag) == 0x000250, "Member 'ABP_OxygenScrubber_Bags_C::OxygenScrubber_Bag' has a wrong offset!");
static_assert(offsetof(ABP_OxygenScrubber_Bags_C, DefaultSceneRoot) == 0x000258, "Member 'ABP_OxygenScrubber_Bags_C::DefaultSceneRoot' has a wrong offset!");

}

