#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StreamingSaveGameSession

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StreamingSaveGameSession.BP_StreamingSaveGameSession_C.ExecuteUbergraph_BP_StreamingSaveGameSession
// 0x0008 (0x0008 - 0x0000)
struct BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ResumeActivity_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetActivities_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetActivityAvailability_ReturnValue;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession) == 0x000004, "Wrong alignment on BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession");
static_assert(sizeof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession) == 0x000008, "Wrong size on BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession");
static_assert(offsetof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession, EntryPoint) == 0x000000, "Member 'BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession, CallFunc_ResumeActivity_ReturnValue) == 0x000004, "Member 'BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession::CallFunc_ResumeActivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession, CallFunc_ResetActivities_ReturnValue) == 0x000005, "Member 'BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession::CallFunc_ResetActivities_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession, CallFunc_SetActivityAvailability_ReturnValue) == 0x000006, "Member 'BP_StreamingSaveGameSession_C_ExecuteUbergraph_BP_StreamingSaveGameSession::CallFunc_SetActivityAvailability_ReturnValue' has a wrong offset!");

}

