#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skully

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Skully.BP_Skully_C
// 0x00A0 (0x02C0 - 0x0220)
class ABP_Skully_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TargetBox;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HasDiscovered;                                     // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObserveElapsedTime;                                // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RequiredObserveDuration;                           // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FoundAchievementHandle;                            // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLinearColor                           UndiscoveredColor;                                 // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DiscoveredColor;                                   // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EyeGlowColor;                                      // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               DiscoverSoundCue;                                  // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Skully(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnCursorLeave(class UPrimitiveComponent* Cursor_Primitive);
	void OnCursorEnter(class UPrimitiveComponent* Cursor_Primitive);
	void UserConstructionScript();
	void InitializeSkully();
	void UpdateColorParameters(bool State);
	void ShouldIgnoreInteractRange(bool* Result);
	void IsHiddenInteractablePrimitive(class APAWN_SystemShockCharacter_C* Character, class UPrimitiveComponent* CursorPrimitive, bool* Result);
	void GetInteractBroken(bool* Result, class FText* BrokenMessage);
	void GetInteractLocked(class AActor* SourceActor, bool* Result, class FText* LockMessage);
	void GetInteractBusy(bool* Result, class FText* BusyMessage);
	void SetInteractLocked(bool Locked, bool* Result);
	void StopChanneling(class AActor* NewChannelingInteract, bool* Result);
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void TryReceiveItem(class UITEM_Base_C* Item, bool* Result);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void IsInteractActivated(bool* Result);
	void CanReceiveItem(class UITEM_Base_C* Item, bool* Result);
	void SetInteractPowered(bool State, bool* Result);
	void GetInteractDestroyed(bool* Result);
	void CanInteractBeDestroyed(bool* Result);
	void CanModifyInteractPower(bool* Result);
	void TryDetachInteract(bool SimulatePhysics, bool* Result);
	void GetChannelingHoldDuration(float* Result);
	void FinishedChannelingHoldInteraction(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	bool ReceivePendingBodyTransforms(class USkeletalMeshComponent* SkeletalMeshComponent, const TArray<struct FTransform>& BodyTransforms);
	bool ReceivePendingCharacterVelocity(const struct FVector& Velocity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Skully_C">();
	}
	static class ABP_Skully_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Skully_C>();
	}
};
static_assert(alignof(ABP_Skully_C) == 0x000008, "Wrong alignment on ABP_Skully_C");
static_assert(sizeof(ABP_Skully_C) == 0x0002C0, "Wrong size on ABP_Skully_C");
static_assert(offsetof(ABP_Skully_C, UberGraphFrame) == 0x000220, "Member 'ABP_Skully_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, TargetBox) == 0x000228, "Member 'ABP_Skully_C::TargetBox' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, StaticMesh) == 0x000230, "Member 'ABP_Skully_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, PointLight) == 0x000238, "Member 'ABP_Skully_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, COMP_Descriptor) == 0x000240, "Member 'ABP_Skully_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, HasDiscovered) == 0x000248, "Member 'ABP_Skully_C::HasDiscovered' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, ObserveElapsedTime) == 0x00024C, "Member 'ABP_Skully_C::ObserveElapsedTime' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, RequiredObserveDuration) == 0x000250, "Member 'ABP_Skully_C::RequiredObserveDuration' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, FoundAchievementHandle) == 0x000258, "Member 'ABP_Skully_C::FoundAchievementHandle' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, UndiscoveredColor) == 0x000268, "Member 'ABP_Skully_C::UndiscoveredColor' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, DiscoveredColor) == 0x000278, "Member 'ABP_Skully_C::DiscoveredColor' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, EyeGlowColor) == 0x000288, "Member 'ABP_Skully_C::EyeGlowColor' has a wrong offset!");
static_assert(offsetof(ABP_Skully_C, DiscoverSoundCue) == 0x000298, "Member 'ABP_Skully_C::DiscoverSoundCue' has a wrong offset!");

}

