#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skully

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function BP_Skully.BP_Skully_C.ExecuteUbergraph_BP_Skully
// 0x0018 (0x0018 - 0x0000)
struct BP_Skully_C_ExecuteUbergraph_BP_Skully final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_ExecuteUbergraph_BP_Skully) == 0x000008, "Wrong alignment on BP_Skully_C_ExecuteUbergraph_BP_Skully");
static_assert(sizeof(BP_Skully_C_ExecuteUbergraph_BP_Skully) == 0x000018, "Wrong size on BP_Skully_C_ExecuteUbergraph_BP_Skully");
static_assert(offsetof(BP_Skully_C_ExecuteUbergraph_BP_Skully, EntryPoint) == 0x000000, "Member 'BP_Skully_C_ExecuteUbergraph_BP_Skully::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ExecuteUbergraph_BP_Skully, K2Node_Event_Cursor_Primitive_1) == 0x000008, "Member 'BP_Skully_C_ExecuteUbergraph_BP_Skully::K2Node_Event_Cursor_Primitive_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ExecuteUbergraph_BP_Skully, K2Node_Event_Cursor_Primitive) == 0x000010, "Member 'BP_Skully_C_ExecuteUbergraph_BP_Skully::K2Node_Event_Cursor_Primitive' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.OnCursorLeave
// 0x0008 (0x0008 - 0x0000)
struct BP_Skully_C_OnCursorLeave final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_OnCursorLeave) == 0x000008, "Wrong alignment on BP_Skully_C_OnCursorLeave");
static_assert(sizeof(BP_Skully_C_OnCursorLeave) == 0x000008, "Wrong size on BP_Skully_C_OnCursorLeave");
static_assert(offsetof(BP_Skully_C_OnCursorLeave, Cursor_Primitive) == 0x000000, "Member 'BP_Skully_C_OnCursorLeave::Cursor_Primitive' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.OnCursorEnter
// 0x0008 (0x0008 - 0x0000)
struct BP_Skully_C_OnCursorEnter final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_OnCursorEnter) == 0x000008, "Wrong alignment on BP_Skully_C_OnCursorEnter");
static_assert(sizeof(BP_Skully_C_OnCursorEnter) == 0x000008, "Wrong size on BP_Skully_C_OnCursorEnter");
static_assert(offsetof(BP_Skully_C_OnCursorEnter, Cursor_Primitive) == 0x000000, "Member 'BP_Skully_C_OnCursorEnter::Cursor_Primitive' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.UpdateColorParameters
// 0x0064 (0x0064 - 0x0000)
struct BP_Skully_C_UpdateColorParameters final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           PrimaryColor;                                      // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_UpdateColorParameters) == 0x000004, "Wrong alignment on BP_Skully_C_UpdateColorParameters");
static_assert(sizeof(BP_Skully_C_UpdateColorParameters) == 0x000064, "Wrong size on BP_Skully_C_UpdateColorParameters");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, State) == 0x000000, "Member 'BP_Skully_C_UpdateColorParameters::State' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, PrimaryColor) == 0x000004, "Member 'BP_Skully_C_UpdateColorParameters::PrimaryColor' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, Temp_bool_Variable) == 0x000014, "Member 'BP_Skully_C_UpdateColorParameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000018, "Member 'BP_Skully_C_UpdateColorParameters::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, Temp_struct_Variable) == 0x000024, "Member 'BP_Skully_C_UpdateColorParameters::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, Temp_bool_Variable_1) == 0x000034, "Member 'BP_Skully_C_UpdateColorParameters::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, K2Node_Select_Default) == 0x000038, "Member 'BP_Skully_C_UpdateColorParameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x000048, "Member 'BP_Skully_C_UpdateColorParameters::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_UpdateColorParameters, K2Node_Select_Default_1) == 0x000054, "Member 'BP_Skully_C_UpdateColorParameters::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.ShouldIgnoreInteractRange
// 0x0001 (0x0001 - 0x0000)
struct BP_Skully_C_ShouldIgnoreInteractRange final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong alignment on BP_Skully_C_ShouldIgnoreInteractRange");
static_assert(sizeof(BP_Skully_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong size on BP_Skully_C_ShouldIgnoreInteractRange");
static_assert(offsetof(BP_Skully_C_ShouldIgnoreInteractRange, Result) == 0x000000, "Member 'BP_Skully_C_ShouldIgnoreInteractRange::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.IsHiddenInteractablePrimitive
// 0x0018 (0x0018 - 0x0000)
struct BP_Skully_C_IsHiddenInteractablePrimitive final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_IsHiddenInteractablePrimitive) == 0x000008, "Wrong alignment on BP_Skully_C_IsHiddenInteractablePrimitive");
static_assert(sizeof(BP_Skully_C_IsHiddenInteractablePrimitive) == 0x000018, "Wrong size on BP_Skully_C_IsHiddenInteractablePrimitive");
static_assert(offsetof(BP_Skully_C_IsHiddenInteractablePrimitive, Character) == 0x000000, "Member 'BP_Skully_C_IsHiddenInteractablePrimitive::Character' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_IsHiddenInteractablePrimitive, CursorPrimitive) == 0x000008, "Member 'BP_Skully_C_IsHiddenInteractablePrimitive::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_IsHiddenInteractablePrimitive, Result) == 0x000010, "Member 'BP_Skully_C_IsHiddenInteractablePrimitive::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetInteractBroken
// 0x0020 (0x0020 - 0x0000)
struct BP_Skully_C_GetInteractBroken final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BrokenMessage;                                     // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_Skully_C_GetInteractBroken) == 0x000008, "Wrong alignment on BP_Skully_C_GetInteractBroken");
static_assert(sizeof(BP_Skully_C_GetInteractBroken) == 0x000020, "Wrong size on BP_Skully_C_GetInteractBroken");
static_assert(offsetof(BP_Skully_C_GetInteractBroken, Result) == 0x000000, "Member 'BP_Skully_C_GetInteractBroken::Result' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_GetInteractBroken, BrokenMessage) == 0x000008, "Member 'BP_Skully_C_GetInteractBroken::BrokenMessage' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetInteractLocked
// 0x0028 (0x0028 - 0x0000)
struct BP_Skully_C_GetInteractLocked final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LockMessage;                                       // 0x0010(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_Skully_C_GetInteractLocked) == 0x000008, "Wrong alignment on BP_Skully_C_GetInteractLocked");
static_assert(sizeof(BP_Skully_C_GetInteractLocked) == 0x000028, "Wrong size on BP_Skully_C_GetInteractLocked");
static_assert(offsetof(BP_Skully_C_GetInteractLocked, SourceActor) == 0x000000, "Member 'BP_Skully_C_GetInteractLocked::SourceActor' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_GetInteractLocked, Result) == 0x000008, "Member 'BP_Skully_C_GetInteractLocked::Result' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_GetInteractLocked, LockMessage) == 0x000010, "Member 'BP_Skully_C_GetInteractLocked::LockMessage' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetInteractBusy
// 0x0020 (0x0020 - 0x0000)
struct BP_Skully_C_GetInteractBusy final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BusyMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_Skully_C_GetInteractBusy) == 0x000008, "Wrong alignment on BP_Skully_C_GetInteractBusy");
static_assert(sizeof(BP_Skully_C_GetInteractBusy) == 0x000020, "Wrong size on BP_Skully_C_GetInteractBusy");
static_assert(offsetof(BP_Skully_C_GetInteractBusy, Result) == 0x000000, "Member 'BP_Skully_C_GetInteractBusy::Result' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_GetInteractBusy, BusyMessage) == 0x000008, "Member 'BP_Skully_C_GetInteractBusy::BusyMessage' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.SetInteractLocked
// 0x0002 (0x0002 - 0x0000)
struct BP_Skully_C_SetInteractLocked final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_SetInteractLocked) == 0x000001, "Wrong alignment on BP_Skully_C_SetInteractLocked");
static_assert(sizeof(BP_Skully_C_SetInteractLocked) == 0x000002, "Wrong size on BP_Skully_C_SetInteractLocked");
static_assert(offsetof(BP_Skully_C_SetInteractLocked, Locked) == 0x000000, "Member 'BP_Skully_C_SetInteractLocked::Locked' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_SetInteractLocked, Result) == 0x000001, "Member 'BP_Skully_C_SetInteractLocked::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.StopChanneling
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_StopChanneling final
{
public:
	class AActor*                                 NewChannelingInteract;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_StopChanneling) == 0x000008, "Wrong alignment on BP_Skully_C_StopChanneling");
static_assert(sizeof(BP_Skully_C_StopChanneling) == 0x000010, "Wrong size on BP_Skully_C_StopChanneling");
static_assert(offsetof(BP_Skully_C_StopChanneling, NewChannelingInteract) == 0x000000, "Member 'BP_Skully_C_StopChanneling::NewChannelingInteract' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_StopChanneling, Result) == 0x000008, "Member 'BP_Skully_C_StopChanneling::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetTargetShape
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_GetTargetShape) == 0x000008, "Wrong alignment on BP_Skully_C_GetTargetShape");
static_assert(sizeof(BP_Skully_C_GetTargetShape) == 0x000010, "Wrong size on BP_Skully_C_GetTargetShape");
static_assert(offsetof(BP_Skully_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'BP_Skully_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'BP_Skully_C_GetTargetShape::ShapeComponent' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.TryReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_TryReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_TryReceiveItem) == 0x000008, "Wrong alignment on BP_Skully_C_TryReceiveItem");
static_assert(sizeof(BP_Skully_C_TryReceiveItem) == 0x000010, "Wrong size on BP_Skully_C_TryReceiveItem");
static_assert(offsetof(BP_Skully_C_TryReceiveItem, Item) == 0x000000, "Member 'BP_Skully_C_TryReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryReceiveItem, Result) == 0x000008, "Member 'BP_Skully_C_TryReceiveItem::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.TryInteract
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Skully_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0040(0x0020)(HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0070(0x0020)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryIncrementOrderedAchievement_Result;    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_TryInteract) == 0x000008, "Wrong alignment on BP_Skully_C_TryInteract");
static_assert(sizeof(BP_Skully_C_TryInteract) == 0x0000B8, "Wrong size on BP_Skully_C_TryInteract");
static_assert(offsetof(BP_Skully_C_TryInteract, SourceActor) == 0x000000, "Member 'BP_Skully_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'BP_Skully_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, InteractionType) == 0x000010, "Member 'BP_Skully_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, InteractResults) == 0x000018, "Member 'BP_Skully_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'BP_Skully_C_TryInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000040, "Member 'BP_Skully_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x000060, "Member 'BP_Skully_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Skully_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000070, "Member 'BP_Skully_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000090, "Member 'BP_Skully_C_TryInteract::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x00009C, "Member 'BP_Skully_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000A0, "Member 'BP_Skully_C_TryInteract::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x0000A8, "Member 'BP_Skully_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_Skully_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryInteract, CallFunc_TryIncrementOrderedAchievement_Result) == 0x0000B1, "Member 'BP_Skully_C_TryInteract::CallFunc_TryIncrementOrderedAchievement_Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.IsInteractActivated
// 0x0001 (0x0001 - 0x0000)
struct BP_Skully_C_IsInteractActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_IsInteractActivated) == 0x000001, "Wrong alignment on BP_Skully_C_IsInteractActivated");
static_assert(sizeof(BP_Skully_C_IsInteractActivated) == 0x000001, "Wrong size on BP_Skully_C_IsInteractActivated");
static_assert(offsetof(BP_Skully_C_IsInteractActivated, Result) == 0x000000, "Member 'BP_Skully_C_IsInteractActivated::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.CanReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_CanReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_CanReceiveItem) == 0x000008, "Wrong alignment on BP_Skully_C_CanReceiveItem");
static_assert(sizeof(BP_Skully_C_CanReceiveItem) == 0x000010, "Wrong size on BP_Skully_C_CanReceiveItem");
static_assert(offsetof(BP_Skully_C_CanReceiveItem, Item) == 0x000000, "Member 'BP_Skully_C_CanReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_CanReceiveItem, Result) == 0x000008, "Member 'BP_Skully_C_CanReceiveItem::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.SetInteractPowered
// 0x0002 (0x0002 - 0x0000)
struct BP_Skully_C_SetInteractPowered final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_SetInteractPowered) == 0x000001, "Wrong alignment on BP_Skully_C_SetInteractPowered");
static_assert(sizeof(BP_Skully_C_SetInteractPowered) == 0x000002, "Wrong size on BP_Skully_C_SetInteractPowered");
static_assert(offsetof(BP_Skully_C_SetInteractPowered, State) == 0x000000, "Member 'BP_Skully_C_SetInteractPowered::State' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_SetInteractPowered, Result) == 0x000001, "Member 'BP_Skully_C_SetInteractPowered::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetInteractDestroyed
// 0x0001 (0x0001 - 0x0000)
struct BP_Skully_C_GetInteractDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_GetInteractDestroyed) == 0x000001, "Wrong alignment on BP_Skully_C_GetInteractDestroyed");
static_assert(sizeof(BP_Skully_C_GetInteractDestroyed) == 0x000001, "Wrong size on BP_Skully_C_GetInteractDestroyed");
static_assert(offsetof(BP_Skully_C_GetInteractDestroyed, Result) == 0x000000, "Member 'BP_Skully_C_GetInteractDestroyed::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.CanInteractBeDestroyed
// 0x0001 (0x0001 - 0x0000)
struct BP_Skully_C_CanInteractBeDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_CanInteractBeDestroyed) == 0x000001, "Wrong alignment on BP_Skully_C_CanInteractBeDestroyed");
static_assert(sizeof(BP_Skully_C_CanInteractBeDestroyed) == 0x000001, "Wrong size on BP_Skully_C_CanInteractBeDestroyed");
static_assert(offsetof(BP_Skully_C_CanInteractBeDestroyed, Result) == 0x000000, "Member 'BP_Skully_C_CanInteractBeDestroyed::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.CanModifyInteractPower
// 0x0001 (0x0001 - 0x0000)
struct BP_Skully_C_CanModifyInteractPower final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_CanModifyInteractPower) == 0x000001, "Wrong alignment on BP_Skully_C_CanModifyInteractPower");
static_assert(sizeof(BP_Skully_C_CanModifyInteractPower) == 0x000001, "Wrong size on BP_Skully_C_CanModifyInteractPower");
static_assert(offsetof(BP_Skully_C_CanModifyInteractPower, Result) == 0x000000, "Member 'BP_Skully_C_CanModifyInteractPower::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.TryDetachInteract
// 0x0002 (0x0002 - 0x0000)
struct BP_Skully_C_TryDetachInteract final
{
public:
	bool                                          SimulatePhysics;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_TryDetachInteract) == 0x000001, "Wrong alignment on BP_Skully_C_TryDetachInteract");
static_assert(sizeof(BP_Skully_C_TryDetachInteract) == 0x000002, "Wrong size on BP_Skully_C_TryDetachInteract");
static_assert(offsetof(BP_Skully_C_TryDetachInteract, SimulatePhysics) == 0x000000, "Member 'BP_Skully_C_TryDetachInteract::SimulatePhysics' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_TryDetachInteract, Result) == 0x000001, "Member 'BP_Skully_C_TryDetachInteract::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.GetChannelingHoldDuration
// 0x0004 (0x0004 - 0x0000)
struct BP_Skully_C_GetChannelingHoldDuration final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skully_C_GetChannelingHoldDuration) == 0x000004, "Wrong alignment on BP_Skully_C_GetChannelingHoldDuration");
static_assert(sizeof(BP_Skully_C_GetChannelingHoldDuration) == 0x000004, "Wrong size on BP_Skully_C_GetChannelingHoldDuration");
static_assert(offsetof(BP_Skully_C_GetChannelingHoldDuration, Result) == 0x000000, "Member 'BP_Skully_C_GetChannelingHoldDuration::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.FinishedChannelingHoldInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_FinishedChannelingHoldInteraction final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_FinishedChannelingHoldInteraction) == 0x000008, "Wrong alignment on BP_Skully_C_FinishedChannelingHoldInteraction");
static_assert(sizeof(BP_Skully_C_FinishedChannelingHoldInteraction) == 0x000010, "Wrong size on BP_Skully_C_FinishedChannelingHoldInteraction");
static_assert(offsetof(BP_Skully_C_FinishedChannelingHoldInteraction, Character) == 0x000000, "Member 'BP_Skully_C_FinishedChannelingHoldInteraction::Character' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_FinishedChannelingHoldInteraction, Result) == 0x000008, "Member 'BP_Skully_C_FinishedChannelingHoldInteraction::Result' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.ShouldSaveActor
// 0x0038 (0x0038 - 0x0000)
struct BP_Skully_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          K2Node_MakeStruct_StreamingSaveGameActorParams;    // 0x0020(0x0018)()
};
static_assert(alignof(BP_Skully_C_ShouldSaveActor) == 0x000008, "Wrong alignment on BP_Skully_C_ShouldSaveActor");
static_assert(sizeof(BP_Skully_C_ShouldSaveActor) == 0x000038, "Wrong size on BP_Skully_C_ShouldSaveActor");
static_assert(offsetof(BP_Skully_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'BP_Skully_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'BP_Skully_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ShouldSaveActor, K2Node_MakeStruct_StreamingSaveGameActorParams) == 0x000020, "Member 'BP_Skully_C_ShouldSaveActor::K2Node_MakeStruct_StreamingSaveGameActorParams' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.ReceivePendingBodyTransforms
// 0x0020 (0x0020 - 0x0000)
struct BP_Skully_C_ReceivePendingBodyTransforms final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     BodyTransforms;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_ReceivePendingBodyTransforms) == 0x000008, "Wrong alignment on BP_Skully_C_ReceivePendingBodyTransforms");
static_assert(sizeof(BP_Skully_C_ReceivePendingBodyTransforms) == 0x000020, "Wrong size on BP_Skully_C_ReceivePendingBodyTransforms");
static_assert(offsetof(BP_Skully_C_ReceivePendingBodyTransforms, SkeletalMeshComponent) == 0x000000, "Member 'BP_Skully_C_ReceivePendingBodyTransforms::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ReceivePendingBodyTransforms, BodyTransforms) == 0x000008, "Member 'BP_Skully_C_ReceivePendingBodyTransforms::BodyTransforms' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ReceivePendingBodyTransforms, ReturnValue) == 0x000018, "Member 'BP_Skully_C_ReceivePendingBodyTransforms::ReturnValue' has a wrong offset!");

// Function BP_Skully.BP_Skully_C.ReceivePendingCharacterVelocity
// 0x0010 (0x0010 - 0x0000)
struct BP_Skully_C_ReceivePendingCharacterVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skully_C_ReceivePendingCharacterVelocity) == 0x000004, "Wrong alignment on BP_Skully_C_ReceivePendingCharacterVelocity");
static_assert(sizeof(BP_Skully_C_ReceivePendingCharacterVelocity) == 0x000010, "Wrong size on BP_Skully_C_ReceivePendingCharacterVelocity");
static_assert(offsetof(BP_Skully_C_ReceivePendingCharacterVelocity, Velocity) == 0x000000, "Member 'BP_Skully_C_ReceivePendingCharacterVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Skully_C_ReceivePendingCharacterVelocity, ReturnValue) == 0x00000C, "Member 'BP_Skully_C_ReceivePendingCharacterVelocity::ReturnValue' has a wrong offset!");

}

