#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_MenuNavigationRecipient

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavUp
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavUp final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavUp) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavUp");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavUp) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavUp");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavUp, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavUp::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavUp, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavUp::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavDown
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavDown final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavDown) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavDown");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavDown) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavDown");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavDown, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavDown::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavDown, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavDown::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavLeft
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavLeft) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavLeft");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavLeft) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavLeft");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavLeft, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavLeft::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavLeft, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavLeft::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavRight
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavRight) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavRight");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavRight) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavRight");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavRight, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavRight::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavRight, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavRight::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavAccept
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavAccept final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavAccept) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavAccept");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavAccept) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavAccept");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAccept, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAccept::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAccept, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAccept::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavBack
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavBack final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavBack) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavBack");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavBack) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavBack");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavBack, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavBack::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavBack, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavBack::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavAlt1
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavAlt1 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt1) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavAlt1");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt1) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavAlt1");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt1, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAlt1::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt1, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAlt1::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavAlt2
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavAlt2 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt2) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavAlt2");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt2) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavAlt2");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt2, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAlt2::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavAlt2, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavAlt2::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavTabLeft
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavTabLeft::Result' has a wrong offset!");

// Function BPI_MenuNavigationRecipient.BPI_MenuNavigationRecipient_C.ReceiveNavTabRight
// 0x0002 (0x0002 - 0x0000)
struct BPI_MenuNavigationRecipient_C_ReceiveNavTabRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_MenuNavigationRecipient_C_ReceiveNavTabRight) == 0x000001, "Wrong alignment on BPI_MenuNavigationRecipient_C_ReceiveNavTabRight");
static_assert(sizeof(BPI_MenuNavigationRecipient_C_ReceiveNavTabRight) == 0x000002, "Wrong size on BPI_MenuNavigationRecipient_C_ReceiveNavTabRight");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavTabRight, InputState) == 0x000000, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavTabRight::InputState' has a wrong offset!");
static_assert(offsetof(BPI_MenuNavigationRecipient_C_ReceiveNavTabRight, Result) == 0x000001, "Member 'BPI_MenuNavigationRecipient_C_ReceiveNavTabRight::Result' has a wrong offset!");

}

