#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BROADCAST_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BROADCAST_Base.BROADCAST_Base_C
// 0x0038 (0x0298 - 0x0260)
class UBROADCAST_Base_C : public UUserWidget
{
public:
	float                                         TimeSpentUpdating;                                 // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BroadcastDrawSize;                                 // 0x0264(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_BroadcastScreen_C*              BroadcastScreenWidget;                             // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TriggerWorldEvent;                                 // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ModifyScreenStatic;                                // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void IsLoopingContent(bool* Result);
	void SetState(bool State);
	void UpdateContent(float DeltaTime, bool* IsFinished);
	void PlayContent(class UVoxelAudioComponent* AudioComponent);
	void TriggerWorldEvent__DelegateSignature();
	void ModifyScreenStatic__DelegateSignature(float TargetValue, bool Instant);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BROADCAST_Base_C">();
	}
	static class UBROADCAST_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBROADCAST_Base_C>();
	}
};
static_assert(alignof(UBROADCAST_Base_C) == 0x000008, "Wrong alignment on UBROADCAST_Base_C");
static_assert(sizeof(UBROADCAST_Base_C) == 0x000298, "Wrong size on UBROADCAST_Base_C");
static_assert(offsetof(UBROADCAST_Base_C, TimeSpentUpdating) == 0x000260, "Member 'UBROADCAST_Base_C::TimeSpentUpdating' has a wrong offset!");
static_assert(offsetof(UBROADCAST_Base_C, BroadcastDrawSize) == 0x000264, "Member 'UBROADCAST_Base_C::BroadcastDrawSize' has a wrong offset!");
static_assert(offsetof(UBROADCAST_Base_C, BroadcastScreenWidget) == 0x000270, "Member 'UBROADCAST_Base_C::BroadcastScreenWidget' has a wrong offset!");
static_assert(offsetof(UBROADCAST_Base_C, TriggerWorldEvent) == 0x000278, "Member 'UBROADCAST_Base_C::TriggerWorldEvent' has a wrong offset!");
static_assert(offsetof(UBROADCAST_Base_C, ModifyScreenStatic) == 0x000288, "Member 'UBROADCAST_Base_C::ModifyScreenStatic' has a wrong offset!");

}

