#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BROADCAST_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BROADCAST_Base.BROADCAST_Base_C.IsLoopingContent
// 0x0001 (0x0001 - 0x0000)
struct BROADCAST_Base_C_IsLoopingContent final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BROADCAST_Base_C_IsLoopingContent) == 0x000001, "Wrong alignment on BROADCAST_Base_C_IsLoopingContent");
static_assert(sizeof(BROADCAST_Base_C_IsLoopingContent) == 0x000001, "Wrong size on BROADCAST_Base_C_IsLoopingContent");
static_assert(offsetof(BROADCAST_Base_C_IsLoopingContent, Result) == 0x000000, "Member 'BROADCAST_Base_C_IsLoopingContent::Result' has a wrong offset!");

// Function BROADCAST_Base.BROADCAST_Base_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct BROADCAST_Base_C_SetState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BROADCAST_Base_C_SetState) == 0x000001, "Wrong alignment on BROADCAST_Base_C_SetState");
static_assert(sizeof(BROADCAST_Base_C_SetState) == 0x000001, "Wrong size on BROADCAST_Base_C_SetState");
static_assert(offsetof(BROADCAST_Base_C_SetState, State) == 0x000000, "Member 'BROADCAST_Base_C_SetState::State' has a wrong offset!");

// Function BROADCAST_Base.BROADCAST_Base_C.UpdateContent
// 0x000C (0x000C - 0x0000)
struct BROADCAST_Base_C_UpdateContent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BROADCAST_Base_C_UpdateContent) == 0x000004, "Wrong alignment on BROADCAST_Base_C_UpdateContent");
static_assert(sizeof(BROADCAST_Base_C_UpdateContent) == 0x00000C, "Wrong size on BROADCAST_Base_C_UpdateContent");
static_assert(offsetof(BROADCAST_Base_C_UpdateContent, DeltaTime) == 0x000000, "Member 'BROADCAST_Base_C_UpdateContent::DeltaTime' has a wrong offset!");
static_assert(offsetof(BROADCAST_Base_C_UpdateContent, IsFinished) == 0x000004, "Member 'BROADCAST_Base_C_UpdateContent::IsFinished' has a wrong offset!");
static_assert(offsetof(BROADCAST_Base_C_UpdateContent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'BROADCAST_Base_C_UpdateContent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BROADCAST_Base.BROADCAST_Base_C.PlayContent
// 0x0008 (0x0008 - 0x0000)
struct BROADCAST_Base_C_PlayContent final
{
public:
	class UVoxelAudioComponent*                   AudioComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BROADCAST_Base_C_PlayContent) == 0x000008, "Wrong alignment on BROADCAST_Base_C_PlayContent");
static_assert(sizeof(BROADCAST_Base_C_PlayContent) == 0x000008, "Wrong size on BROADCAST_Base_C_PlayContent");
static_assert(offsetof(BROADCAST_Base_C_PlayContent, AudioComponent) == 0x000000, "Member 'BROADCAST_Base_C_PlayContent::AudioComponent' has a wrong offset!");

// Function BROADCAST_Base.BROADCAST_Base_C.ModifyScreenStatic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature final
{
public:
	float                                         TargetValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature) == 0x000004, "Wrong alignment on BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature");
static_assert(sizeof(BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature) == 0x000008, "Wrong size on BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature");
static_assert(offsetof(BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature, TargetValue) == 0x000000, "Member 'BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature::TargetValue' has a wrong offset!");
static_assert(offsetof(BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature, Instant) == 0x000004, "Member 'BROADCAST_Base_C_ModifyScreenStatic__DelegateSignature::Instant' has a wrong offset!");

}

