#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BULLET_Repairbot_FlameBubble

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function BULLET_Repairbot_FlameBubble.BULLET_Repairbot_FlameBubble_C.IncrementalPositionUpdate
// 0x0014 (0x0014 - 0x0000)
struct BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBulletTravelProgress_Result;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IncrementalPositionUpdate_Result;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate) == 0x000004, "Wrong alignment on BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate");
static_assert(sizeof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate) == 0x000014, "Wrong size on BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate, DeltaTime) == 0x000000, "Member 'BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate::DeltaTime' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate, Result) == 0x000004, "Member 'BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate::Result' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate, CallFunc_GetBulletTravelProgress_Result) == 0x000008, "Member 'BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate::CallFunc_GetBulletTravelProgress_Result' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate, CallFunc_IncrementalPositionUpdate_Result) == 0x00000C, "Member 'BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate::CallFunc_IncrementalPositionUpdate_Result' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BULLET_Repairbot_FlameBubble_C_IncrementalPositionUpdate::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function BULLET_Repairbot_FlameBubble.BULLET_Repairbot_FlameBubble_C.ApplyDamageMod
// 0x0270 (0x0270 - 0x0000)
struct BULLET_Repairbot_FlameBubble_C_ApplyDamageMod final
{
public:
	class UAttribManagerComponent*                AttribManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameHitDeltaTime;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0018(0x0028)(Parm, OutParm)
	class UAttribMod*                             DamageMod;                                         // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribModApplyData                    DecreaseThermalEnergyApplyData;                    // 0x0048(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    IncreaseThermalEnergyApplyData;                    // 0x00E8(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    DamageOverTimeApplyData;                           // 0x0188(0x00A0)(Edit, BlueprintVisible)
	struct FAttribDamageInstance                  CallFunc_ApplyDamageMod_DamageInstance;            // 0x0228(0x0028)()
	class UAttribMod*                             CallFunc_ApplyDamageMod_DamageMod;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_2;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod) == 0x000008, "Wrong alignment on BULLET_Repairbot_FlameBubble_C_ApplyDamageMod");
static_assert(sizeof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod) == 0x000270, "Wrong size on BULLET_Repairbot_FlameBubble_C_ApplyDamageMod");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, AttribManager) == 0x000000, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::AttribManager' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, ImpactData) == 0x000008, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::ImpactData' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, FrameHitDeltaTime) == 0x000010, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::FrameHitDeltaTime' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, DamageInstance) == 0x000018, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::DamageInstance' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, DamageMod) == 0x000040, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::DamageMod' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, DecreaseThermalEnergyApplyData) == 0x000048, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::DecreaseThermalEnergyApplyData' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, IncreaseThermalEnergyApplyData) == 0x0000E8, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::IncreaseThermalEnergyApplyData' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, DamageOverTimeApplyData) == 0x000188, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::DamageOverTimeApplyData' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, CallFunc_ApplyDamageMod_DamageInstance) == 0x000228, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::CallFunc_ApplyDamageMod_DamageInstance' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, CallFunc_ApplyDamageMod_DamageMod) == 0x000250, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::CallFunc_ApplyDamageMod_DamageMod' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, CallFunc_ApplyMod_ReturnValue) == 0x000258, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, CallFunc_ApplyMod_ReturnValue_1) == 0x000260, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BULLET_Repairbot_FlameBubble_C_ApplyDamageMod, CallFunc_ApplyMod_ReturnValue_2) == 0x000268, "Member 'BULLET_Repairbot_FlameBubble_C_ApplyDamageMod::CallFunc_ApplyMod_ReturnValue_2' has a wrong offset!");

}

