#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt.BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C.ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt
// 0x0018 (0x0018 - 0x0000)
struct BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt) == 0x000008, "Wrong alignment on BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt");
static_assert(sizeof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt) == 0x000018, "Wrong size on BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt, EntryPoint) == 0x000000, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000010, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_ExecuteUbergraph_BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt.BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C.TryBulletCollision
// 0x0120 (0x0120 - 0x0000)
struct BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         FrameHitDeltaTime;                                 // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryBulletCollision_Result;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABulletProjectile_PlasmaRifle_PlasmaCharge_C* K2Node_DynamicCast_AsBullet_Projectile_Plasma_Rifle_Plasma_Charge; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision) == 0x000008, "Wrong alignment on BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision");
static_assert(sizeof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision) == 0x000120, "Wrong size on BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, Hit) == 0x000000, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::Hit' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, FrameHitDeltaTime) == 0x000088, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::FrameHitDeltaTime' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, Result) == 0x00008C, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_TryBulletCollision_Result) == 0x00008D, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_TryBulletCollision_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_bBlockingHit) == 0x00008E, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_bInitialOverlap) == 0x00008F, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_Time) == 0x000090, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_Distance) == 0x000094, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_Location) == 0x000098, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactPoint) == 0x0000A4, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_Normal) == 0x0000B0, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactNormal) == 0x0000BC, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_PhysMat) == 0x0000C8, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_HitActor) == 0x0000D0, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_HitComponent) == 0x0000D8, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_HitBoneName) == 0x0000E0, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_HitItem) == 0x0000E8, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_ElementIndex) == 0x0000EC, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_FaceIndex) == 0x0000F0, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_TraceStart) == 0x0000F4, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, CallFunc_BreakHitResult_TraceEnd) == 0x000100, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, K2Node_DynamicCast_AsBullet_Projectile_Plasma_Rifle_Plasma_Charge) == 0x000110, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::K2Node_DynamicCast_AsBullet_Projectile_Plasma_Rifle_Plasma_Charge' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BulletProjectile_Diego_v1_PlasmaRifle_EnergyBolt_C_TryBulletCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

