#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletProjectile_PlasmaRifle_PlasmaCharge

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge
// 0x0030 (0x0030 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentChargeUpRatio_Result;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge) == 0x000004, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge) == 0x000030, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, EntryPoint) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_GetCurrentChargeUpRatio_Result) == 0x00000C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_GetCurrentChargeUpRatio_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_Lerp_ReturnValue) == 0x000014, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000028, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ExecuteUbergraph_BulletProjectile_PlasmaRifle_PlasmaCharge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick) == 0x000004, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick) == 0x000004, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.Detonate
// 0x01D8 (0x01D8 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate final
{
public:
	struct FVector                                DirectionToActor;                                  // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentActor;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                CurrentAttribManager;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribModApplyData                    BlastDamageMod;                                    // 0x0020(0x00A0)(Edit, BlueprintVisible)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseBulletDamage_Result;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue; // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x01B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate) == 0x000008, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate) == 0x0001D8, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, DirectionToActor) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::DirectionToActor' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CurrentActor) == 0x000010, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CurrentActor' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CurrentAttribManager) == 0x000018, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CurrentAttribManager' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, BlastDamageMod) == 0x000020, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::BlastDamageMod' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, GameInstance) == 0x0000C0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::GameInstance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, Temp_object_Variable) == 0x0000C8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, Temp_int_Loop_Counter_Variable) == 0x0000DC, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, Temp_int_Array_Index_Variable) == 0x0000E4, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_GetBaseBulletDamage_Result) == 0x0000E8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_GetBaseBulletDamage_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000EC, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_GetInstigator_ReturnValue) == 0x0000F0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_GetInstigator_ReturnValue_1) == 0x0000F8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_SpawnObject_ReturnValue) == 0x000100, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_GetGameInstance_ReturnValue) == 0x000108, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, K2Node_DynamicCast_AsGI_Single_Player) == 0x000110, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00011C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000128, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue) == 0x000134, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_ApplyMod_ReturnValue) == 0x000138, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000140, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00014C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000158, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000164, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_GetComponentByClass_ReturnValue) == 0x000170, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000178, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Normal_ReturnValue) == 0x000184, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, K2Node_MakeArray_Array) == 0x000190, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0001A0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_SphereOverlapActors_OutActors) == 0x0001B0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_SphereOverlapActors_ReturnValue) == 0x0001C0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Array_Length_ReturnValue) == 0x0001C4, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_Detonate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.TryBulletCollision
// 0x01D0 (0x01D0 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         FrameHitDeltaTime;                                 // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryBulletCollision_Result;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedBulletLifetime_Result;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetReflectionVector_ReturnValue;          // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13F[0x1];                                      // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision) == 0x000008, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision) == 0x0001D0, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, Hit) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::Hit' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, FrameHitDeltaTime) == 0x000088, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::FrameHitDeltaTime' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, Result) == 0x00008C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_TryBulletCollision_Result) == 0x00008D, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_TryBulletCollision_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_GetElapsedBulletLifetime_Result) == 0x000090, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_GetElapsedBulletLifetime_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_GetActorForwardVector_ReturnValue) == 0x000098, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_bBlockingHit) == 0x0000A4, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000A5, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Time) == 0x0000A8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Distance) == 0x0000AC, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Location) == 0x0000B0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactPoint) == 0x0000BC, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Normal) == 0x0000C8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactNormal) == 0x0000D4, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_PhysMat) == 0x0000E0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitActor) == 0x0000E8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitComponent) == 0x0000F0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitBoneName) == 0x0000F8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitItem) == 0x000100, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ElementIndex) == 0x000104, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_FaceIndex) == 0x000108, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_TraceStart) == 0x00010C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_TraceEnd) == 0x000118, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_GetReflectionVector_ReturnValue) == 0x000124, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_GetReflectionVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000130, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_K2_SetActorRotation_ReturnValue) == 0x00013C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00013D, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00013E, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Time_1) == 0x000140, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Distance_1) == 0x000144, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Location_1) == 0x000148, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000154, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_Normal_1) == 0x000160, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ImpactNormal_1) == 0x00016C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_PhysMat_1) == 0x000178, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitActor_1) == 0x000180, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitComponent_1) == 0x000188, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitBoneName_1) == 0x000190, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_HitItem_1) == 0x000198, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_ElementIndex_1) == 0x00019C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_FaceIndex_1) == 0x0001A0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_TraceStart_1) == 0x0001A4, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, CallFunc_BreakHitResult_TraceEnd_1) == 0x0001B0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0001C0, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_TryBulletCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.ChargeUp
// 0x0118 (0x0118 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp final
{
public:
	float                                         CallFunc_GetBaseBulletDamage_Result;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0100)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBaseBulletDamage_Result_1;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp) == 0x000008, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp) == 0x000118, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_GetBaseBulletDamage_Result) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_GetBaseBulletDamage_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000109, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_GetBaseBulletDamage_Result_1) == 0x00010C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_GetBaseBulletDamage_Result_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000110, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_ChargeUp::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.GetCurrentChargeUpRatio
// 0x0118 (0x0118 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0100)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBaseBulletDamage_Result;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio) == 0x000008, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio) == 0x000118, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, Result) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, CallFunc_GetBaseBulletDamage_Result) == 0x00010C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::CallFunc_GetBaseBulletDamage_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000110, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000114, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_GetCurrentChargeUpRatio::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BulletProjectile_PlasmaRifle_PlasmaCharge.BulletProjectile_PlasmaRifle_PlasmaCharge_C.CreateEffects
// 0x0068 (0x0068 - 0x0000)
struct BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects final
{
public:
	class UFXSystemAsset*                         ParticleFX;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundCue;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects) == 0x000008, "Wrong alignment on BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects");
static_assert(sizeof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects) == 0x000068, "Wrong size on BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, ParticleFX) == 0x000000, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::ParticleFX' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, SoundCue) == 0x000008, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::SoundCue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, K2Node_DynamicCast_AsNiagara_System) == 0x000010, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, K2Node_DynamicCast_AsParticle_System) == 0x000020, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000048, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000050, "Member 'BulletProjectile_PlasmaRifle_PlasmaCharge_C_CreateEffects::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
