#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BULLORANG_Homing

#include "Basic.hpp"

#include "BULLORANG_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BULLORANG_Homing.BULLORANG_Homing_C
// 0x0028 (0x0348 - 0x0320)
class ABULLORANG_Homing_C final : public ABULLORANG_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BULLORANG_Homing_C;                 // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MaxMoveSpeed;                                      // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRotationSpeed;                                  // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMoveSpeedScale;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentRotationSpeedScale;                         // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SeekEndTimestamp;                                  // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SeekDuration;                                      // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BULLORANG_Homing(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateBullorangMovement(float DeltaSeconds);
	void GetTargetMoveDirection(struct FVector* Directino);
	void GetTargetDistance(float* Distance);
	void ShouldReturnToBully(bool* Result);
	void ReceiveStunningImpact(const struct FVector& ReflectionDirection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BULLORANG_Homing_C">();
	}
	static class ABULLORANG_Homing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABULLORANG_Homing_C>();
	}
};
static_assert(alignof(ABULLORANG_Homing_C) == 0x000008, "Wrong alignment on ABULLORANG_Homing_C");
static_assert(sizeof(ABULLORANG_Homing_C) == 0x000348, "Wrong size on ABULLORANG_Homing_C");
static_assert(offsetof(ABULLORANG_Homing_C, UberGraphFrame_BULLORANG_Homing_C) == 0x000320, "Member 'ABULLORANG_Homing_C::UberGraphFrame_BULLORANG_Homing_C' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, Arrow) == 0x000328, "Member 'ABULLORANG_Homing_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, MaxMoveSpeed) == 0x000330, "Member 'ABULLORANG_Homing_C::MaxMoveSpeed' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, MaxRotationSpeed) == 0x000334, "Member 'ABULLORANG_Homing_C::MaxRotationSpeed' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, CurrentMoveSpeedScale) == 0x000338, "Member 'ABULLORANG_Homing_C::CurrentMoveSpeedScale' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, CurrentRotationSpeedScale) == 0x00033C, "Member 'ABULLORANG_Homing_C::CurrentRotationSpeedScale' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, SeekEndTimestamp) == 0x000340, "Member 'ABULLORANG_Homing_C::SeekEndTimestamp' has a wrong offset!");
static_assert(offsetof(ABULLORANG_Homing_C, SeekDuration) == 0x000344, "Member 'ABULLORANG_Homing_C::SeekDuration' has a wrong offset!");

}

