#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletProjectile_Railgun

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function BulletProjectile_Railgun.BulletProjectile_Railgun_C.CanPierceThroughActor
// 0x0030 (0x0030 - 0x0000)
struct BulletProjectile_Railgun_C_CanPierceThroughActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADismembermentLimb_Base_C*              K2Node_DynamicCast_AsDismemberment_Limb_Base;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_Railgun_C_CanPierceThroughActor) == 0x000008, "Wrong alignment on BulletProjectile_Railgun_C_CanPierceThroughActor");
static_assert(sizeof(BulletProjectile_Railgun_C_CanPierceThroughActor) == 0x000030, "Wrong size on BulletProjectile_Railgun_C_CanPierceThroughActor");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, Actor) == 0x000000, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::Actor' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, Result) == 0x000008, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, K2Node_DynamicCast_AsDismemberment_Limb_Base) == 0x000010, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::K2Node_DynamicCast_AsDismemberment_Limb_Base' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000020, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_CanPierceThroughActor, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BulletProjectile_Railgun_C_CanPierceThroughActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BulletProjectile_Railgun.BulletProjectile_Railgun_C.TryPierceThroughArmor
// 0x0034 (0x0034 - 0x0000)
struct BulletProjectile_Railgun_C_TryPierceThroughArmor final
{
public:
	int32                                         ArmorValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PiercingDamageScale;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArmorPenetrationRemaining;                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PiercingArmorPenetration;                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseBulletDamage_Result;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_Railgun_C_TryPierceThroughArmor) == 0x000004, "Wrong alignment on BulletProjectile_Railgun_C_TryPierceThroughArmor");
static_assert(sizeof(BulletProjectile_Railgun_C_TryPierceThroughArmor) == 0x000034, "Wrong size on BulletProjectile_Railgun_C_TryPierceThroughArmor");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, ArmorValue) == 0x000000, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::ArmorValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, Result) == 0x000004, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, PiercingDamageScale) == 0x000008, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::PiercingDamageScale' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, ArmorPenetrationRemaining) == 0x00000C, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::ArmorPenetrationRemaining' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, PiercingArmorPenetration) == 0x000010, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::PiercingArmorPenetration' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_GetBaseBulletDamage_Result) == 0x000014, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_GetBaseBulletDamage_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000020, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryPierceThroughArmor, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'BulletProjectile_Railgun_C_TryPierceThroughArmor::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function BulletProjectile_Railgun.BulletProjectile_Railgun_C.ApplyDamageMod
// 0x0078 (0x0078 - 0x0000)
struct BulletProjectile_Railgun_C_ApplyDamageMod final
{
public:
	class UAttribManagerComponent*                AttribManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameHitDeltaTime;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0018(0x0028)(Parm, OutParm)
	class UAttribMod*                             DamageMod;                                         // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  CallFunc_ApplyDamageMod_DamageInstance;            // 0x0048(0x0028)()
	class UAttribMod*                             CallFunc_ApplyDamageMod_DamageMod;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletProjectile_Railgun_C_ApplyDamageMod) == 0x000008, "Wrong alignment on BulletProjectile_Railgun_C_ApplyDamageMod");
static_assert(sizeof(BulletProjectile_Railgun_C_ApplyDamageMod) == 0x000078, "Wrong size on BulletProjectile_Railgun_C_ApplyDamageMod");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, AttribManager) == 0x000000, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::AttribManager' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, ImpactData) == 0x000008, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::ImpactData' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, FrameHitDeltaTime) == 0x000010, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::FrameHitDeltaTime' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, DamageInstance) == 0x000018, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::DamageInstance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, DamageMod) == 0x000040, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::DamageMod' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, CallFunc_ApplyDamageMod_DamageInstance) == 0x000048, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::CallFunc_ApplyDamageMod_DamageInstance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_ApplyDamageMod, CallFunc_ApplyDamageMod_DamageMod) == 0x000070, "Member 'BulletProjectile_Railgun_C_ApplyDamageMod::CallFunc_ApplyDamageMod_DamageMod' has a wrong offset!");

// Function BulletProjectile_Railgun.BulletProjectile_Railgun_C.TryIncrementKillCount
// 0x0070 (0x0070 - 0x0000)
struct BulletProjectile_Railgun_C_TryIncrementKillCount final
{
public:
	class UAttribManagerComponent*                AttribManager;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteBinaryAchievement_Result;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletProjectile_Railgun_C_TryIncrementKillCount) == 0x000008, "Wrong alignment on BulletProjectile_Railgun_C_TryIncrementKillCount");
static_assert(sizeof(BulletProjectile_Railgun_C_TryIncrementKillCount) == 0x000070, "Wrong size on BulletProjectile_Railgun_C_TryIncrementKillCount");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, AttribManager) == 0x000000, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::AttribManager' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, DamageInstance) == 0x000008, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::DamageInstance' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, Temp_int_Variable) == 0x000030, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000035, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, K2Node_DynamicCast_AsGI_Single_Player) == 0x000048, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_TryCompleteBinaryAchievement_Result) == 0x000051, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_TryCompleteBinaryAchievement_Result' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000060, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_IsPlayerControlled_ReturnValue) == 0x00006A, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_Not_PreBool_ReturnValue) == 0x00006B, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_Not_PreBool_ReturnValue_1) == 0x00006C, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BulletProjectile_Railgun_C_TryIncrementKillCount, CallFunc_BooleanAND_ReturnValue) == 0x00006D, "Member 'BulletProjectile_Railgun_C_TryIncrementKillCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

