#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Humanoid_CtrlRig_Stripped

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CH_Humanoid_CtrlRig_Stripped.CH_Humanoid_CtrlRig_Stripped_C
// 0x00C0 (0x0710 - 0x0650)
class UCH_Humanoid_CtrlRig_Stripped_C final : public UControlRig
{
public:
	float                                         Upperleg_length;                                   // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lowerleg_length;                                   // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtAlpha;                                       // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtLocation;                                    // 0x065C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lowerarm_length;                                   // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Upperarm_length;                                   // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rifle;                                             // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MovementVector;                                    // 0x0674(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovementDelta;                                     // 0x0680(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weapon;                                            // 0x068C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68D[0x3];                                      // 0x068D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactLocation;                                    // 0x0690(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactStrength;                                    // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactImpulse;                                     // 0x06A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             L_ankle_pos;                                       // 0x06B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             R_ankle_pos;                                       // 0x06E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_Humanoid_CtrlRig_Stripped_C">();
	}
	static class UCH_Humanoid_CtrlRig_Stripped_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_Humanoid_CtrlRig_Stripped_C>();
	}
};
static_assert(alignof(UCH_Humanoid_CtrlRig_Stripped_C) == 0x000010, "Wrong alignment on UCH_Humanoid_CtrlRig_Stripped_C");
static_assert(sizeof(UCH_Humanoid_CtrlRig_Stripped_C) == 0x000710, "Wrong size on UCH_Humanoid_CtrlRig_Stripped_C");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Upperleg_length) == 0x000650, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Upperleg_length' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Lowerleg_length) == 0x000654, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Lowerleg_length' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, LookAtAlpha) == 0x000658, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::LookAtAlpha' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, LookAtLocation) == 0x00065C, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::LookAtLocation' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Lowerarm_length) == 0x000668, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Lowerarm_length' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Upperarm_length) == 0x00066C, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Upperarm_length' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Rifle) == 0x000670, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Rifle' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, MovementVector) == 0x000674, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::MovementVector' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, MovementDelta) == 0x000680, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::MovementDelta' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, Weapon) == 0x00068C, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::Weapon' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, ImpactLocation) == 0x000690, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::ImpactLocation' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, ImpactStrength) == 0x00069C, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::ImpactStrength' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, ImpactImpulse) == 0x0006A0, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::ImpactImpulse' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, L_ankle_pos) == 0x0006B0, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::L_ankle_pos' has a wrong offset!");
static_assert(offsetof(UCH_Humanoid_CtrlRig_Stripped_C, R_ankle_pos) == 0x0006E0, "Member 'UCH_Humanoid_CtrlRig_Stripped_C::R_ankle_pos' has a wrong offset!");

}

