#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Hacker_Arms_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CH_Hacker_Arms_AnimBP.CH_Hacker_Arms_AnimBP_C
// 0x0210 (0x04D0 - 0x02C0)
class UCH_Hacker_Arms_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02F8(0x01D8)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_CH_Hacker_Arms_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_Hacker_Arms_AnimBP_C">();
	}
	static class UCH_Hacker_Arms_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_Hacker_Arms_AnimBP_C>();
	}
};
static_assert(alignof(UCH_Hacker_Arms_AnimBP_C) == 0x000010, "Wrong alignment on UCH_Hacker_Arms_AnimBP_C");
static_assert(sizeof(UCH_Hacker_Arms_AnimBP_C) == 0x0004D0, "Wrong size on UCH_Hacker_Arms_AnimBP_C");
static_assert(offsetof(UCH_Hacker_Arms_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UCH_Hacker_Arms_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_Hacker_Arms_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCH_Hacker_Arms_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCH_Hacker_Arms_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002F8, "Member 'UCH_Hacker_Arms_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

