#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CIRCUITPUZZLE_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PUZZLE_Base_classes.hpp"
#include "ENUM_GeneratedCircuitType_structs.hpp"
#include "ENUM_PowerState_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CIRCUITPUZZLE_Base.CIRCUITPUZZLE_Base_C
// 0x0240 (0x08A0 - 0x0660)
class ACIRCUITPUZZLE_Base_C : public APUZZLE_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CIRCUITPUZZLE_Base_C;               // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TargetBox_Circuit;                                 // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C7;                                 // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C6;                                 // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C5;                                 // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C4;                                 // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C3;                                 // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C2;                                 // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C1;                                 // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R7_C0;                                 // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C7;                                 // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C6;                                 // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C5;                                 // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C4;                                 // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C3;                                 // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C2;                                 // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C1;                                 // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R6_C0;                                 // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C7;                                 // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C6;                                 // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C5;                                 // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C4;                                 // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C3;                                 // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C2;                                 // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C1;                                 // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R5_C0;                                 // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C7;                                 // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C6;                                 // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C5;                                 // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C4;                                 // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C3;                                 // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C2;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C1;                                 // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R4_C0;                                 // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C7;                                 // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C6;                                 // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C5;                                 // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C4;                                 // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C3;                                 // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C2;                                 // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C1;                                 // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R3_C0;                                 // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C7;                                 // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C6;                                 // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C5;                                 // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C4;                                 // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C3;                                 // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C2;                                 // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C1;                                 // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R2_C0;                                 // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C7;                                 // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C6;                                 // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C5;                                 // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C4;                                 // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C3;                                 // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C2;                                 // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C1;                                 // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R1_C0;                                 // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C7;                                 // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C6;                                 // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C5;                                 // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C4;                                 // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C3;                                 // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C2;                                 // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C1;                                 // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CircuitMesh_C*                    CircuitMesh_R0_C0;                                 // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Cells;                                             // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               RotateCue;                                         // 0x0878(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CIRCUITPUZZLE_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetCircuitMesh(class UCOMP_CircuitMesh_C* CircuitMesh, struct FSTRUCT_MeshTransform* MeshTransform);
	void GetConnectedNeighborCells(class UCOMP_CircuitMesh_C* CircuitMesh, TArray<class UCOMP_CircuitMesh_C*>* Neighbors);
	void ColumnRowToIndex(int32 Column, int32 Row, int32* Index_0);
	void EVENT_OnTargetStateChanged(class UCOMP_CircuitMesh_C* Circuit, ENUM_PowerState PowerState);
	void EvaluateCellPower();
	void RegisterCircuitCellComponents();
	void InteractWithPuzzlePrimitive(class UPrimitiveComponent* CursorPrimitive, ENUM_InteractResultType* Result, class FText* ResultText);
	void GetPuzzleShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** TargetShape);
	void CellToIndex(class UCOMP_CircuitMesh_C* CircuitCell, int32* Index_0);
	void InitializePuzzle();
	void GetModifiedCellDirections(uint8 Type, uint8 Rotations, int32* Directions);
	void LoadPuzzleFromDataTable();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CIRCUITPUZZLE_Base_C">();
	}
	static class ACIRCUITPUZZLE_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACIRCUITPUZZLE_Base_C>();
	}
};
static_assert(alignof(ACIRCUITPUZZLE_Base_C) == 0x000008, "Wrong alignment on ACIRCUITPUZZLE_Base_C");
static_assert(sizeof(ACIRCUITPUZZLE_Base_C) == 0x0008A0, "Wrong size on ACIRCUITPUZZLE_Base_C");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, UberGraphFrame_CIRCUITPUZZLE_Base_C) == 0x000660, "Member 'ACIRCUITPUZZLE_Base_C::UberGraphFrame_CIRCUITPUZZLE_Base_C' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, TargetBox_Circuit) == 0x000668, "Member 'ACIRCUITPUZZLE_Base_C::TargetBox_Circuit' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C7) == 0x000670, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C6) == 0x000678, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C5) == 0x000680, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C4) == 0x000688, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C3) == 0x000690, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C2) == 0x000698, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C1) == 0x0006A0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R7_C0) == 0x0006A8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R7_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C7) == 0x0006B0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C6) == 0x0006B8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C5) == 0x0006C0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C4) == 0x0006C8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C3) == 0x0006D0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C2) == 0x0006D8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C1) == 0x0006E0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R6_C0) == 0x0006E8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R6_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C7) == 0x0006F0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C6) == 0x0006F8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C5) == 0x000700, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C4) == 0x000708, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C3) == 0x000710, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C2) == 0x000718, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C1) == 0x000720, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R5_C0) == 0x000728, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R5_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C7) == 0x000730, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C6) == 0x000738, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C5) == 0x000740, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C4) == 0x000748, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C3) == 0x000750, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C2) == 0x000758, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C1) == 0x000760, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R4_C0) == 0x000768, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R4_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C7) == 0x000770, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C6) == 0x000778, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C5) == 0x000780, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C4) == 0x000788, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C3) == 0x000790, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C2) == 0x000798, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C1) == 0x0007A0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R3_C0) == 0x0007A8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R3_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C7) == 0x0007B0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C6) == 0x0007B8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C5) == 0x0007C0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C4) == 0x0007C8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C3) == 0x0007D0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C2) == 0x0007D8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C1) == 0x0007E0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R2_C0) == 0x0007E8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R2_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C7) == 0x0007F0, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C6) == 0x0007F8, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C5) == 0x000800, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C4) == 0x000808, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C3) == 0x000810, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C2) == 0x000818, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C1) == 0x000820, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R1_C0) == 0x000828, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R1_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C7) == 0x000830, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C7' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C6) == 0x000838, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C6' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C5) == 0x000840, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C5' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C4) == 0x000848, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C4' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C3) == 0x000850, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C3' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C2) == 0x000858, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C2' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C1) == 0x000860, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C1' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, CircuitMesh_R0_C0) == 0x000868, "Member 'ACIRCUITPUZZLE_Base_C::CircuitMesh_R0_C0' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, Cells) == 0x000870, "Member 'ACIRCUITPUZZLE_Base_C::Cells' has a wrong offset!");
static_assert(offsetof(ACIRCUITPUZZLE_Base_C, RotateCue) == 0x000878, "Member 'ACIRCUITPUZZLE_Base_C::RotateCue' has a wrong offset!");

}

