#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CIRCUITPUZZLE_Base

#include "Basic.hpp"

#include "ENUM_GeneratedCircuitType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_PowerState_structs.hpp"
#include "STRUCT_CircuitPuzzle_PuzzleData_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"
#include "STRUCT_MeshTransform_structs.hpp"


namespace SDK::Params
{

// Function CIRCUITPUZZLE_Base.CIRCUITPUZZLE_Base_C.ExecuteUbergraph_CIRCUITPUZZLE_Base
// 0x0008 (0x0008 - 0x0000)
struct CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPuzzleSolved_Result;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base) == 0x000004, "Wrong alignment on CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base");
static_assert(sizeof(CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base) == 0x000008, "Wrong size on CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base, EntryPoint) == 0x000000, "Member 'CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base, CallFunc_IsPuzzleSolved_Result) == 0x000004, "Member 'CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base::CallFunc_IsPuzzleSolved_Result' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'CIRCUITPUZZLE_Base_C_ExecuteUbergraph_CIRCUITPUZZLE_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CIRCUITPUZZLE_Base.CIRCUITPUZZLE_Base_C.UserConstructionScript
// 0x0250 (0x0250 - 0x0000)
struct CIRCUITPUZZLE_Base_C_UserConstructionScript final
{
public:
	float                                         CellSize;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_CircuitMesh_C*                    CurrentCircuitMesh;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FirstCellLocation;                                 // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGridDimensions_Result;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGridDimensions_Result_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetCircuitMesh_MeshTransform;             // 0x0070(0x0060)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_CircuitMesh_C*                    K2Node_DynamicCast_AsCOMP_Circuit_Mesh;            // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CIRCUITPUZZLE_Base_C_UserConstructionScript) == 0x000010, "Wrong alignment on CIRCUITPUZZLE_Base_C_UserConstructionScript");
static_assert(sizeof(CIRCUITPUZZLE_Base_C_UserConstructionScript) == 0x000250, "Wrong size on CIRCUITPUZZLE_Base_C_UserConstructionScript");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CellSize) == 0x000000, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CellSize' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CurrentCircuitMesh) == 0x000008, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CurrentCircuitMesh' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, FirstCellLocation) == 0x000010, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::FirstCellLocation' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_GetGridDimensions_Result) == 0x000028, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_GetGridDimensions_Result' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_GetGridDimensions_Result_1) == 0x00002C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_GetGridDimensions_Result_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000034, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000040, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000044, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000048, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00004C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000050, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_GetCircuitMesh_MeshTransform) == 0x000070, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_GetCircuitMesh_MeshTransform' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000D0, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000158, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00015C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000160, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000164, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000168, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x00016C, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000170, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_GetChildrenComponents_Children) == 0x000178, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000188, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000198, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A0, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, K2Node_DynamicCast_AsCOMP_Circuit_Mesh) == 0x0001B0, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::K2Node_DynamicCast_AsCOMP_Circuit_Mesh' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001BC, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000244, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'CIRCUITPUZZLE_Base_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CIRCUITPUZZLE_Base.CIRCUITPUZZLE_Base_C.GetCircuitMesh
// 0x1290 (0x1290 - 0x0000)
struct CIRCUITPUZZLE_Base_C_GetCircuitMesh final
{
public:
	class UCOMP_CircuitMesh_C*                    CircuitMesh;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  MeshTransform;                                     // 0x0010(0x0060)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         Connections;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00F0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0160(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0xF];                                      // 0x01C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x01D0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0240(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0xF];                                      // 0x02A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x02B0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0xF];                                      // 0x0311(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_6;         // 0x0320(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_6;    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0xF];                                      // 0x0381(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_7;         // 0x0390(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_7;    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0xF];                                      // 0x03F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_8;         // 0x0400(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_8;    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0xF];                                      // 0x0461(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_9;         // 0x0470(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_9;    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0xF];                                      // 0x04D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_10;        // 0x04E0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_10;   // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_542[0xE];                                      // 0x0542(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_11;        // 0x0550(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_11;   // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0xF];                                      // 0x05B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_12;        // 0x05C0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_12;   // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_622[0xE];                                      // 0x0622(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_13;        // 0x0630(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_13;   // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_692[0xE];                                      // 0x0692(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_14;        // 0x06A0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_14;   // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_702[0xE];                                      // 0x0702(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_15;        // 0x0710(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_15;   // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0772(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0773(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_774[0xC];                                      // 0x0774(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_16;        // 0x0780(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_16;   // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0xF];                                      // 0x07E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_17;        // 0x07F0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_17;   // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851[0xF];                                      // 0x0851(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_18;        // 0x0860(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_18;   // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x08C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C2[0xE];                                      // 0x08C2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_19;        // 0x08D0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_19;   // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWest_West;                             // 0x0931(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0932(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_933[0xD];                                      // 0x0933(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_20;        // 0x0940(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_20;   // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0xF];                                      // 0x09A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_21;        // 0x09B0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_21;   // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South;                           // 0x0A11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0A12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A13[0xD];                                      // 0x0A13(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_22;        // 0x0A20(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_22;   // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0A81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWest_West_1;                           // 0x0A82(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A83[0xD];                                      // 0x0A83(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_23;        // 0x0A90(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_23;   // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0xF];                                      // 0x0AF1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_24;        // 0x0B00(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_24;   // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0B61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_1;                         // 0x0B62(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0B63(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East;                             // 0x0B64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B65[0xB];                                      // 0x0B65(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_25;        // 0x0B70(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_25;   // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0xF];                                      // 0x0BD1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_26;        // 0x0BE0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_26;   // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWest_West_2;                           // 0x0C41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_2;                         // 0x0C42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_1;                           // 0x0C43(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C44[0xC];                                      // 0x0C44(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_27;        // 0x0C50(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_27;   // 0x0CB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNorth_North;                           // 0x0CB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB2[0xE];                                      // 0x0CB2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_28;        // 0x0CC0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_28;   // 0x0D20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D21[0xF];                                      // 0x0D21(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_29;        // 0x0D30(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_29;   // 0x0D90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_3;                         // 0x0D91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_2;                           // 0x0D92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D93[0xD];                                      // 0x0D93(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_30;        // 0x0DA0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_30;   // 0x0E00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_4;                         // 0x0E01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E02[0xE];                                      // 0x0E02(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_31;        // 0x0E10(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_31;   // 0x0E70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_3;                           // 0x0E71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E72[0xE];                                      // 0x0E72(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_32;        // 0x0E80(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_32;   // 0x0EE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNorth_North_1;                         // 0x0EE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE2[0xE];                                      // 0x0EE2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_33;        // 0x0EF0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_33;   // 0x0F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_5;                         // 0x0F51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_4;                           // 0x0F52(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNorth_North_2;                         // 0x0F53(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F54[0xC];                                      // 0x0F54(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_34;        // 0x0F60(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_34;   // 0x0FC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0FC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC2[0x2];                                      // 0x0FC2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0FC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWest_West_3;                           // 0x0FC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC9[0x3];                                      // 0x0FC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0FCC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSouth_South_6;                         // 0x0FD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD1[0x3];                                      // 0x0FD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0FD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD8[0x8];                                      // 0x0FD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_35;        // 0x0FE0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_35;   // 0x1040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1041[0x3];                                     // 0x1041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x1044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEast_East_5;                           // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1049[0x3];                                     // 0x1049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNorth_North_3;                         // 0x1050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1051[0xF];                                     // 0x1051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_36;        // 0x1060(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_36;   // 0x10C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWest_West_4;                           // 0x10C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_7;                         // 0x10C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C3[0xD];                                     // 0x10C3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_37;        // 0x10D0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_37;   // 0x1130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_6;                           // 0x1131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1132[0xE];                                     // 0x1132(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_38;        // 0x1140(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_38;   // 0x11A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNorth_North_4;                         // 0x11A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWest_West_5;                           // 0x11A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSouth_South_8;                         // 0x11A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A4[0xC];                                     // 0x11A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_39;        // 0x11B0(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_39;   // 0x1210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEast_East_7;                           // 0x1211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1212[0xE];                                     // 0x1212(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshTransform                  CallFunc_GetDataTableRowFromName_OutRow_40;        // 0x1220(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_40;   // 0x1280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNorth_North_5;                         // 0x1281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CIRCUITPUZZLE_Base_C_GetCircuitMesh) == 0x000010, "Wrong alignment on CIRCUITPUZZLE_Base_C_GetCircuitMesh");
static_assert(sizeof(CIRCUITPUZZLE_Base_C_GetCircuitMesh) == 0x001290, "Wrong size on CIRCUITPUZZLE_Base_C_GetCircuitMesh");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CircuitMesh) == 0x000000, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CircuitMesh' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, MeshTransform) == 0x000010, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::MeshTransform' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, Connections) == 0x000070, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::Connections' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, Temp_int_Variable) == 0x000074, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000F0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000150, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000160, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x0001C0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x0001D0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000230, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, Temp_int_Variable_1) == 0x000234, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, Temp_int_Variable_2) == 0x000238, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000240, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x0002A0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x0002B0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000310, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_6) == 0x000320, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_6' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_6) == 0x000380, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_7) == 0x000390, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_7' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_7) == 0x0003F0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_8) == 0x000400, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_8' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_8) == 0x000460, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_9) == 0x000470, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_9' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_9) == 0x0004D0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_10) == 0x0004E0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_10' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_10) == 0x000540, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000541, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_11) == 0x000550, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_11' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_11) == 0x0005B0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_12) == 0x0005C0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_12' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_12) == 0x000620, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000621, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_13) == 0x000630, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_13' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_13) == 0x000690, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000691, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_14) == 0x0006A0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_14' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_14) == 0x000700, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000701, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_15) == 0x000710, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_15' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_15) == 0x000770, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000771, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000772, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000773, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_16) == 0x000780, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_16' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_16) == 0x0007E0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_OutRow_17) == 0x0007F0, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_OutRow_17' has a wrong offset!");
static_assert(offsetof(CIRCUITPUZZLE_Base_C_GetCircuitMesh, CallFunc_GetDataTableRowFromName_ReturnValue_17) == 0x000850, "Member 'CIRCUITPUZZLE_Base_C_GetCircuitMesh::CallFunc_GetDataTableRowFromName_ReturnValue_17' has a wrong offset!");
