#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMBOREQ_CombatTeleport

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMBOREQ_CombatTeleport.COMBOREQ_CombatTeleport_C.CanStartCombo
// 0x0018 (0x0018 - 0x0000)
struct COMBOREQ_CombatTeleport_C_CanStartCombo final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSinceEnteringState_Result;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMBOREQ_CombatTeleport_C_CanStartCombo) == 0x000008, "Wrong alignment on COMBOREQ_CombatTeleport_C_CanStartCombo");
static_assert(sizeof(COMBOREQ_CombatTeleport_C_CanStartCombo) == 0x000018, "Wrong size on COMBOREQ_CombatTeleport_C_CanStartCombo");
static_assert(offsetof(COMBOREQ_CombatTeleport_C_CanStartCombo, EnemyPawn) == 0x000000, "Member 'COMBOREQ_CombatTeleport_C_CanStartCombo::EnemyPawn' has a wrong offset!");
static_assert(offsetof(COMBOREQ_CombatTeleport_C_CanStartCombo, ComboIndex) == 0x000008, "Member 'COMBOREQ_CombatTeleport_C_CanStartCombo::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_CombatTeleport_C_CanStartCombo, Result) == 0x00000C, "Member 'COMBOREQ_CombatTeleport_C_CanStartCombo::Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_CombatTeleport_C_CanStartCombo, CallFunc_GetTimeSinceEnteringState_Result) == 0x000010, "Member 'COMBOREQ_CombatTeleport_C_CanStartCombo::CallFunc_GetTimeSinceEnteringState_Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_CombatTeleport_C_CanStartCombo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'COMBOREQ_CombatTeleport_C_CanStartCombo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

