#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMBOREQ_Assassin_SprintEscape

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMBOREQ_Assassin_SprintEscape.COMBOREQ_Assassin_SprintEscape_C.CanStartCombo
// 0x0028 (0x0028 - 0x0000)
struct COMBOREQ_Assassin_SprintEscape_C_CanStartCombo final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          CallFunc_GetActiveComboBehaviorTree_BehaviorTree;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveCombo_Result;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetComboByBehaviorTree_ComboIndex;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartCombo_CanStart;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo) == 0x000008, "Wrong alignment on COMBOREQ_Assassin_SprintEscape_C_CanStartCombo");
static_assert(sizeof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo) == 0x000028, "Wrong size on COMBOREQ_Assassin_SprintEscape_C_CanStartCombo");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, EnemyPawn) == 0x000000, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::EnemyPawn' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, ComboIndex) == 0x000008, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, Result) == 0x00000C, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_GetActiveComboBehaviorTree_BehaviorTree) == 0x000010, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_GetActiveComboBehaviorTree_BehaviorTree' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_HasActiveCombo_Result) == 0x000018, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_HasActiveCombo_Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_GetComboByBehaviorTree_ComboIndex) == 0x00001C, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_GetComboByBehaviorTree_ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Assassin_SprintEscape_C_CanStartCombo, CallFunc_CanStartCombo_CanStart) == 0x000020, "Member 'COMBOREQ_Assassin_SprintEscape_C_CanStartCombo::CallFunc_CanStartCombo_CanStart' has a wrong offset!");

}

