#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMBOREQ_IsTargetInFrontOfEnemy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function COMBOREQ_IsTargetInFrontOfEnemy.COMBOREQ_IsTargetInFrontOfEnemy_C.CanStartCombo
// 0x0060 (0x0060 - 0x0000)
struct COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo) == 0x000008, "Wrong alignment on COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo");
static_assert(sizeof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo) == 0x000060, "Wrong size on COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, EnemyPawn) == 0x000000, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::EnemyPawn' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, ComboIndex) == 0x000008, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, Result) == 0x00000C, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_GetActorForwardVector_ReturnValue) == 0x00001C, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_GetTarget_Target) == 0x000028, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_Get_Target_Location_Location) == 0x000030, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_Get_Target_Location_Location' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_Dot_VectorVector_ReturnValue) == 0x000054, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000058, "Member 'COMBOREQ_IsTargetInFrontOfEnemy_C_CanStartCombo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

