#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMBOREQ_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMBOREQ_Base.COMBOREQ_Base_C.CanStartCombo
// 0x0010 (0x0010 - 0x0000)
struct COMBOREQ_Base_C_CanStartCombo final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMBOREQ_Base_C_CanStartCombo) == 0x000008, "Wrong alignment on COMBOREQ_Base_C_CanStartCombo");
static_assert(sizeof(COMBOREQ_Base_C_CanStartCombo) == 0x000010, "Wrong size on COMBOREQ_Base_C_CanStartCombo");
static_assert(offsetof(COMBOREQ_Base_C_CanStartCombo, EnemyPawn) == 0x000000, "Member 'COMBOREQ_Base_C_CanStartCombo::EnemyPawn' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Base_C_CanStartCombo, ComboIndex) == 0x000008, "Member 'COMBOREQ_Base_C_CanStartCombo::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Base_C_CanStartCombo, Result) == 0x00000C, "Member 'COMBOREQ_Base_C_CanStartCombo::Result' has a wrong offset!");

}

