#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMBOREQ_Diego_v1_Recharge

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMBOREQ_Diego_v1_Recharge.COMBOREQ_Diego_v1_Recharge_C.CanStartCombo
// 0x0070 (0x0070 - 0x0000)
struct COMBOREQ_Diego_v1_Recharge_C_CanStartCombo final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        ShieldAttribInstance;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceEnteringState_Result;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceLastUpdate_ReturnValue;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxValue_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttributeDef*                          CallFunc_GetShieldAttrib_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo) == 0x000008, "Wrong alignment on COMBOREQ_Diego_v1_Recharge_C_CanStartCombo");
static_assert(sizeof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo) == 0x000070, "Wrong size on COMBOREQ_Diego_v1_Recharge_C_CanStartCombo");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, EnemyPawn) == 0x000000, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::EnemyPawn' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, ComboIndex) == 0x000008, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, Result) == 0x00000C, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, ShieldAttribInstance) == 0x000010, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::ShieldAttribInstance' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetTimeSinceEnteringState_Result) == 0x000018, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetTimeSinceEnteringState_Result' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetAttribValue_ReturnValue) == 0x00001C, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetTimeSinceLastUpdate_ReturnValue) == 0x00002C, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetTimeSinceLastUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetValue_ReturnValue) == 0x000030, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetAttribInstance_ReturnValue) == 0x000038, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetValue_ReturnValue_1) == 0x000040, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetMaxValue_ReturnValue) == 0x000044, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_FMax_ReturnValue) == 0x000050, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_FMin_ReturnValue) == 0x000058, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetShieldAttrib_ReturnValue) == 0x000060, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetShieldAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMBOREQ_Diego_v1_Recharge_C_CanStartCombo, CallFunc_GetAttribInstance_ReturnValue_1) == 0x000068, "Member 'COMBOREQ_Diego_v1_Recharge_C_CanStartCombo::CallFunc_GetAttribInstance_ReturnValue_1' has a wrong offset!");

}

