#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_VoxelCullablePropagator

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function COMP_VoxelCullablePropagator.COMP_VoxelCullablePropagator_C.GetVoxelLevelManager
// 0x0020 (0x0020 - 0x0000)
struct COMP_VoxelCullablePropagator_C_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager) == 0x000008, "Wrong alignment on COMP_VoxelCullablePropagator_C_GetVoxelLevelManager");
static_assert(sizeof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager) == 0x000020, "Wrong size on COMP_VoxelCullablePropagator_C_GetVoxelLevelManager");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'COMP_VoxelCullablePropagator_C_GetVoxelLevelManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'COMP_VoxelCullablePropagator_C_GetVoxelLevelManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'COMP_VoxelCullablePropagator_C_GetVoxelLevelManager::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetVoxelLevelManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'COMP_VoxelCullablePropagator_C_GetVoxelLevelManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function COMP_VoxelCullablePropagator.COMP_VoxelCullablePropagator_C.GetElapsedPlayTime
// 0x0008 (0x0008 - 0x0000)
struct COMP_VoxelCullablePropagator_C_GetElapsedPlayTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_VoxelCullablePropagator_C_GetElapsedPlayTime) == 0x000004, "Wrong alignment on COMP_VoxelCullablePropagator_C_GetElapsedPlayTime");
static_assert(sizeof(COMP_VoxelCullablePropagator_C_GetElapsedPlayTime) == 0x000008, "Wrong size on COMP_VoxelCullablePropagator_C_GetElapsedPlayTime");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetElapsedPlayTime, ReturnValue) == 0x000000, "Member 'COMP_VoxelCullablePropagator_C_GetElapsedPlayTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetElapsedPlayTime, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'COMP_VoxelCullablePropagator_C_GetElapsedPlayTime::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");

// Function COMP_VoxelCullablePropagator.COMP_VoxelCullablePropagator_C.GetRelativePropagationOriginOffset
// 0x0028 (0x0028 - 0x0000)
struct COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        PrimaryChildComponent;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset) == 0x000008, "Wrong alignment on COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset");
static_assert(sizeof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset) == 0x000028, "Wrong size on COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset, ReturnValue) == 0x000000, "Member 'COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset, PrimaryChildComponent) == 0x000010, "Member 'COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset::PrimaryChildComponent' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset, CallFunc_ComponentHasTag_ReturnValue) == 0x000018, "Member 'COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset, CallFunc_GetChildComponent_ReturnValue) == 0x000020, "Member 'COMP_VoxelCullablePropagator_C_GetRelativePropagationOriginOffset::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");

// Function COMP_VoxelCullablePropagator.COMP_VoxelCullablePropagator_C.ShouldSaveComponent
// 0x000C (0x000C - 0x0000)
struct COMP_VoxelCullablePropagator_C_ShouldSaveComponent final
{
public:
	struct FStreamingSaveGameComponentParams      Params_0;                                          // 0x0000(0x0004)(Parm, OutParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameComponentParams      K2Node_MakeStruct_StreamingSaveGameComponentParams; // 0x0008(0x0004)(NoDestructor)
};
static_assert(alignof(COMP_VoxelCullablePropagator_C_ShouldSaveComponent) == 0x000004, "Wrong alignment on COMP_VoxelCullablePropagator_C_ShouldSaveComponent");
static_assert(sizeof(COMP_VoxelCullablePropagator_C_ShouldSaveComponent) == 0x00000C, "Wrong size on COMP_VoxelCullablePropagator_C_ShouldSaveComponent");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_ShouldSaveComponent, Params_0) == 0x000000, "Member 'COMP_VoxelCullablePropagator_C_ShouldSaveComponent::Params_0' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_ShouldSaveComponent, ReturnValue) == 0x000004, "Member 'COMP_VoxelCullablePropagator_C_ShouldSaveComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullablePropagator_C_ShouldSaveComponent, K2Node_MakeStruct_StreamingSaveGameComponentParams) == 0x000008, "Member 'COMP_VoxelCullablePropagator_C_ShouldSaveComponent::K2Node_MakeStruct_StreamingSaveGameComponentParams' has a wrong offset!");

}

