#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_VoxelAudio

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMP_VoxelAudio.COMP_VoxelAudio_C.GetVoxelLevelManager
// 0x0020 (0x0020 - 0x0000)
struct COMP_VoxelAudio_C_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_VoxelAudio_C_GetVoxelLevelManager) == 0x000008, "Wrong alignment on COMP_VoxelAudio_C_GetVoxelLevelManager");
static_assert(sizeof(COMP_VoxelAudio_C_GetVoxelLevelManager) == 0x000020, "Wrong size on COMP_VoxelAudio_C_GetVoxelLevelManager");
static_assert(offsetof(COMP_VoxelAudio_C_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'COMP_VoxelAudio_C_GetVoxelLevelManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelAudio_C_GetVoxelLevelManager, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'COMP_VoxelAudio_C_GetVoxelLevelManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelAudio_C_GetVoxelLevelManager, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'COMP_VoxelAudio_C_GetVoxelLevelManager::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_VoxelAudio_C_GetVoxelLevelManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'COMP_VoxelAudio_C_GetVoxelLevelManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

