#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_DismembermentManager

#include "Basic.hpp"

#include "STRUCT_DynaDamageElement_structs.hpp"
#include "STRUCT_ImpactParams_structs.hpp"
#include "ENUM_LimbStrength_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "STRUCT_LimbSpawnEffect_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_DismemberableLimb_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_LimbStrengthSettings_structs.hpp"
#include "STRUCT_AnimatedLimb_structs.hpp"


namespace SDK::Params
{

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.OnLimbDismembered__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature final
{
public:
	class FName                                   LimbName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DismemberableLimb              LimbData;                                          // 0x0008(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class ADismembermentLimb_Base_C*              LimbActor;                                         // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnBeginPlay;                                       // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature");
static_assert(sizeof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature) == 0x0000B0, "Wrong size on COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature");
static_assert(offsetof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature, LimbName) == 0x000000, "Member 'COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature::LimbName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature, LimbData) == 0x000008, "Member 'COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature::LimbData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature, LimbActor) == 0x0000A0, "Member 'COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature::LimbActor' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature, OnBeginPlay) == 0x0000A8, "Member 'COMP_DismembermentManager_C_OnLimbDismembered__DelegateSignature::OnBeginPlay' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.OnDynaDamage__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature final
{
public:
	class FName                                   DynaElementName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnBeginPlay;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature) == 0x000004, "Wrong alignment on COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature");
static_assert(sizeof(COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature) == 0x00000C, "Wrong size on COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature");
static_assert(offsetof(COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature, DynaElementName) == 0x000000, "Member 'COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature::DynaElementName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature, OnBeginPlay) == 0x000008, "Member 'COMP_DismembermentManager_C_OnDynaDamage__DelegateSignature::OnBeginPlay' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.ExecuteUbergraph_COMP_DismembermentManager
// 0x00F8 (0x00F8 - 0x0000)
struct COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_LimbName;                       // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_DismemberableLimb              K2Node_CustomEvent_LimbData;                       // 0x0020(0x0098)(ConstParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager");
static_assert(sizeof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager) == 0x0000F8, "Wrong size on COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, EntryPoint) == 0x000000, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_CustomEvent_LimbName) == 0x000014, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_CustomEvent_LimbName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_CustomEvent_LimbData) == 0x000020, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_CustomEvent_LimbData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, Temp_object_Variable) == 0x0000B8, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000C0, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0000C8, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x0000D8, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000E2, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_CustomEvent_Loaded) == 0x0000E8, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'COMP_DismembermentManager_C_ExecuteUbergraph_COMP_DismembermentManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_DismembermentManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_DismembermentManager_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_DismembermentManager_C_ReceiveTick");
static_assert(sizeof(COMP_DismembermentManager_C_ReceiveTick) == 0x000004, "Wrong size on COMP_DismembermentManager_C_ReceiveTick");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_DismembermentManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.StreamDismemberableLimbMesh
// 0x00A0 (0x00A0 - 0x0000)
struct COMP_DismembermentManager_C_StreamDismemberableLimbMesh final
{
public:
	class FName                                   LimbName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DismemberableLimb              LimbData;                                          // 0x0008(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(COMP_DismembermentManager_C_StreamDismemberableLimbMesh) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_StreamDismemberableLimbMesh");
static_assert(sizeof(COMP_DismembermentManager_C_StreamDismemberableLimbMesh) == 0x0000A0, "Wrong size on COMP_DismembermentManager_C_StreamDismemberableLimbMesh");
static_assert(offsetof(COMP_DismembermentManager_C_StreamDismemberableLimbMesh, LimbName) == 0x000000, "Member 'COMP_DismembermentManager_C_StreamDismemberableLimbMesh::LimbName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_StreamDismemberableLimbMesh, LimbData) == 0x000008, "Member 'COMP_DismembermentManager_C_StreamDismemberableLimbMesh::LimbData' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7
// 0x0008 (0x0008 - 0x0000)
struct COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7");
static_assert(sizeof(COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7) == 0x000008, "Wrong size on COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7");
static_assert(offsetof(COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7, Loaded) == 0x000000, "Member 'COMP_DismembermentManager_C_OnLoaded_3E0AC6B84CCA7F17E04CA4AA481994B7::Loaded' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.InitializeDismembermentManager
// 0x0250 (0x0250 - 0x0000)
struct COMP_DismembermentManager_C_InitializeDismembermentManager final
{
public:
	class FName                                   CurrentLimbName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LimbRootBone;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DismemberableLimb              LimbData;                                          // 0x0010(0x0098)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LimbMesh;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DismemberableLimb              CallFunc_GetLimbData_LimbData;                     // 0x00C0(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_BoneIsChildOf_ReturnValue;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSetBitIndices_ReturnValue;             // 0x0160(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetDynaDamageByIndex_DynaName;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSetBitIndices_ReturnValue_1;           // 0x0188(0x0010)(ReferenceParm)
	struct FSTRUCT_DismemberableLimb              CallFunc_GetLimbData_LimbData_1;                   // 0x0198(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLimbByIndex_LimbName;                  // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetLimbMesh_Mesh;                         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_DismembermentManager_C_InitializeDismembermentManager) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_InitializeDismembermentManager");
static_assert(sizeof(COMP_DismembermentManager_C_InitializeDismembermentManager) == 0x000250, "Wrong size on COMP_DismembermentManager_C_InitializeDismembermentManager");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CurrentLimbName) == 0x000000, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CurrentLimbName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, LimbRootBone) == 0x000008, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::LimbRootBone' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, LimbData) == 0x000010, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::LimbData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, LimbMesh) == 0x0000A8, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::LimbMesh' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetLimbData_LimbData) == 0x0000C0, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetLimbData_LimbData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_BoneIsChildOf_ReturnValue) == 0x000158, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_BoneIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, Temp_int_Loop_Counter_Variable_1) == 0x00015C, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetSetBitIndices_ReturnValue) == 0x000160, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetSetBitIndices_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Array_Get_Item) == 0x000170, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Array_Length_ReturnValue) == 0x000174, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetDynaDamageByIndex_DynaName) == 0x000178, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetDynaDamageByIndex_DynaName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000184, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetSetBitIndices_ReturnValue_1) == 0x000188, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetSetBitIndices_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetLimbData_LimbData_1) == 0x000198, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetLimbData_LimbData_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetLimbByIndex_LimbName) == 0x000234, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetLimbByIndex_LimbName' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Array_Length_ReturnValue_1) == 0x00023C, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_GetLimbMesh_Mesh) == 0x000240, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_GetLimbMesh_Mesh' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismembermentManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000248, "Member 'COMP_DismembermentManager_C_InitializeDismembermentManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.InitializeDismemberedLimb
// 0x0038 (0x0038 - 0x0000)
struct COMP_DismembermentManager_C_InitializeDismemberedLimb final
{
public:
	int32                                         LowHideMask_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HighHideMask_0;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DismembermentData;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DynaDamageData;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LimbRowName_0;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissingLimbBits;                                   // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActivatedDynaDamageBits;                           // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector4>                       BloodData;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(COMP_DismembermentManager_C_InitializeDismemberedLimb) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_InitializeDismemberedLimb");
static_assert(sizeof(COMP_DismembermentManager_C_InitializeDismemberedLimb) == 0x000038, "Wrong size on COMP_DismembermentManager_C_InitializeDismemberedLimb");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, LowHideMask_0) == 0x000000, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::LowHideMask_0' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, HighHideMask_0) == 0x000004, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::HighHideMask_0' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, DismembermentData) == 0x000008, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::DismembermentData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, DynaDamageData) == 0x000010, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::DynaDamageData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, LimbRowName_0) == 0x000018, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::LimbRowName_0' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, MissingLimbBits) == 0x000020, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::MissingLimbBits' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, ActivatedDynaDamageBits) == 0x000024, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::ActivatedDynaDamageBits' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_InitializeDismemberedLimb, BloodData) == 0x000028, "Member 'COMP_DismembermentManager_C_InitializeDismemberedLimb::BloodData' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.ReceiveDamage
// 0x0048 (0x0048 - 0x0000)
struct COMP_DismembermentManager_C_ReceiveDamage final
{
public:
	class UOBJ_ImpactData_C*                      Impact;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  Damage;                                            // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          LegDismembered;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LimbDismembered;                                   // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PseudoLimbDismembered;                             // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDismembermentAllowed_Result;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DealDamageToDismemberLimbs_LegDismembered; // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DealDamageToDismemberLimbs_LimbDismembered; // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DealDamageToDynaElements_PseudoLimbsDestroyed; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_DismembermentManager_C_ReceiveDamage) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_ReceiveDamage");
static_assert(sizeof(COMP_DismembermentManager_C_ReceiveDamage) == 0x000048, "Wrong size on COMP_DismembermentManager_C_ReceiveDamage");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, Impact) == 0x000000, "Member 'COMP_DismembermentManager_C_ReceiveDamage::Impact' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, Damage) == 0x000008, "Member 'COMP_DismembermentManager_C_ReceiveDamage::Damage' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, LegDismembered) == 0x000030, "Member 'COMP_DismembermentManager_C_ReceiveDamage::LegDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, LimbDismembered) == 0x000031, "Member 'COMP_DismembermentManager_C_ReceiveDamage::LimbDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, PseudoLimbDismembered) == 0x000032, "Member 'COMP_DismembermentManager_C_ReceiveDamage::PseudoLimbDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_IsDismembermentAllowed_Result) == 0x000033, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_IsDismembermentAllowed_Result' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000035, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_NotEqual_NameName_ReturnValue) == 0x000036, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_BooleanOR_ReturnValue) == 0x000037, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00003B, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_BooleanOR_ReturnValue_1) == 0x00003C, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_DealDamageToDismemberLimbs_LegDismembered) == 0x00003D, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_DealDamageToDismemberLimbs_LegDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_DealDamageToDismemberLimbs_LimbDismembered) == 0x00003E, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_DealDamageToDismemberLimbs_LimbDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_BooleanOR_ReturnValue_2) == 0x000040, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_ReceiveDamage, CallFunc_DealDamageToDynaElements_PseudoLimbsDestroyed) == 0x000041, "Member 'COMP_DismembermentManager_C_ReceiveDamage::CallFunc_DealDamageToDynaElements_PseudoLimbsDestroyed' has a wrong offset!");

// Function COMP_DismembermentManager.COMP_DismembermentManager_C.DealDamageToDismemberLimbs
// 0x0258 (0x0258 - 0x0000)
struct COMP_DismembermentManager_C_DealDamageToDismemberLimbs final
{
public:
	class UOBJ_ImpactData_C*                      Impact;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  Damage;                                            // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          LegDismembered;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LimbDismembered;                                   // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LimbWasDismembered;                                // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LegWasDismembered;                                 // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         HitReqToDestroy;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitReqToDismember;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageReqPerHit;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LimbToDismember;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NetDamageOnLimb;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULimbDamageAccumulator_C*               Accumulator;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitsDealt;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_DismemberableLimb              LimbDataToDismember;                               // 0x0060(0x0098)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         LimbIndex;                                         // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 LimbMesh;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ForceDismemberLimb_LegDismembered;        // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetLimbMesh_Mesh;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetOrderedLimbList_Limbs;                 // 0x0130(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_DismemberableLimb              CallFunc_GetLimbData_LimbData;                     // 0x0150(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetLimbIndex_Index;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULimbDamageAccumulator_C*               CallFunc_GetLimbDamageAccumulator_Accumulator;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLimbAttached_Result;                    // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeSlicingDamage_Result;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddDamageInstance_NetDamage;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerAlive_IsAlive;                     // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E[0x2];                                      // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLimbByBone_Limb;                       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLimbStrengthSettings_StackArmor;       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLimbStrengthSettings_StackCount;       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs) == 0x000008, "Wrong alignment on COMP_DismembermentManager_C_DealDamageToDismemberLimbs");
static_assert(sizeof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs) == 0x000258, "Wrong size on COMP_DismembermentManager_C_DealDamageToDismemberLimbs");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, Impact) == 0x000000, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::Impact' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, Damage) == 0x000008, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::Damage' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LegDismembered) == 0x000030, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LegDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbDismembered) == 0x000031, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbWasDismembered) == 0x000032, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbWasDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LegWasDismembered) == 0x000033, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LegWasDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, HitReqToDestroy) == 0x000034, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::HitReqToDestroy' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, HitReqToDismember) == 0x000038, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::HitReqToDismember' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, DamageReqPerHit) == 0x00003C, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::DamageReqPerHit' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbToDismember) == 0x000040, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbToDismember' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, NetDamageOnLimb) == 0x000048, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::NetDamageOnLimb' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, Accumulator) == 0x000050, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::Accumulator' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, HitsDealt) == 0x000058, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::HitsDealt' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbDataToDismember) == 0x000060, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbDataToDismember' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbIndex) == 0x0000F8, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbIndex' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, LimbMesh) == 0x000100, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::LimbMesh' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, Temp_int_Array_Index_Variable) == 0x000108, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Multiply_IntInt_ReturnValue) == 0x00010C, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Array_Get_Item) == 0x000114, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Greater_IntInt_ReturnValue) == 0x000118, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_ForceDismemberLimb_LegDismembered) == 0x00011A, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_ForceDismemberLimb_LegDismembered' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x00011C, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000120, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_GetLimbMesh_Mesh) == 0x000128, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_GetLimbMesh_Mesh' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_GetOrderedLimbList_Limbs) == 0x000130, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_GetOrderedLimbList_Limbs' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_GetLimbData_LimbData) == 0x000150, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_GetLimbData_LimbData' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_GetLimbIndex_Index) == 0x0001E8, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_GetLimbIndex_Index' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_GetLimbDamageAccumulator_Accumulator) == 0x0001F0, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_GetLimbDamageAccumulator_Accumulator' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001F8, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_DismembermentManager_C_DealDamageToDismemberLimbs, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0001F9, "Member 'COMP_DismembermentManager_C_DealDamageToDismemberLimbs::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
