#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_SkillManager

#include "Basic.hpp"

#include "ENUM_SkillType_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_PreferredCombatStyle_structs.hpp"
#include "STRUCT_DefaultSkillComboParams_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function COMP_SkillManager.COMP_SkillManager_C.ExecuteUbergraph_COMP_SkillManager
// 0x00A0 (0x00A0 - 0x0000)
struct COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetCombosByStyle_Result;                  // 0x0060(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager) == 0x000008, "Wrong alignment on COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager");
static_assert(sizeof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager) == 0x0000A0, "Wrong size on COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, EntryPoint) == 0x000000, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000004, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_GetClassDisplayName_ReturnValue) == 0x000030, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000040, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_GetCombosByStyle_Result) == 0x000060, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_GetCombosByStyle_Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000088, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'COMP_SkillManager_C_ExecuteUbergraph_COMP_SkillManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.InitializeDefaultSkills
// 0x0070 (0x0070 - 0x0000)
struct COMP_SkillManager_C_InitializeDefaultSkills final
{
public:
	bool                                          GrantDefaultSkills;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkill_C*                               CurrentSkill;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkill_C* Skill)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class USkill_C* Skill)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkill_C*                               CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_InitializeDefaultSkills) == 0x000008, "Wrong alignment on COMP_SkillManager_C_InitializeDefaultSkills");
static_assert(sizeof(COMP_SkillManager_C_InitializeDefaultSkills) == 0x000070, "Wrong size on COMP_SkillManager_C_InitializeDefaultSkills");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, GrantDefaultSkills) == 0x000000, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::GrantDefaultSkills' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CurrentSkill) == 0x000008, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CurrentSkill' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, Temp_int_Array_Index_Variable) == 0x000018, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Array_Get_Item) == 0x000050, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeDefaultSkills, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'COMP_SkillManager_C_InitializeDefaultSkills::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.InitializeCustomRequirements
// 0x0060 (0x0060 - 0x0000)
struct COMP_SkillManager_C_InitializeCustomRequirements final
{
public:
	int32                                         ComboIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DefaultSkillComboParams        CallFunc_Array_Get_Item;                           // 0x0018(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMBOREQ_Base_C*                       CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_InitializeCustomRequirements) == 0x000008, "Wrong alignment on COMP_SkillManager_C_InitializeCustomRequirements");
static_assert(sizeof(COMP_SkillManager_C_InitializeCustomRequirements) == 0x000060, "Wrong size on COMP_SkillManager_C_InitializeCustomRequirements");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, ComboIndex) == 0x000000, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, Temp_int_Array_Index_Variable) == 0x000004, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_Array_Length_ReturnValue_1) == 0x000014, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_Array_Get_Item) == 0x000018, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_InitializeCustomRequirements, CallFunc_IsValidClass_ReturnValue) == 0x000058, "Member 'COMP_SkillManager_C_InitializeCustomRequirements::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.CleanupSkills
// 0x0001 (0x0001 - 0x0000)
struct COMP_SkillManager_C_CleanupSkills final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_CleanupSkills) == 0x000001, "Wrong alignment on COMP_SkillManager_C_CleanupSkills");
static_assert(sizeof(COMP_SkillManager_C_CleanupSkills) == 0x000001, "Wrong size on COMP_SkillManager_C_CleanupSkills");
static_assert(offsetof(COMP_SkillManager_C_CleanupSkills, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'COMP_SkillManager_C_CleanupSkills::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.AddSkill
// 0x0030 (0x0030 - 0x0000)
struct COMP_SkillManager_C_AddSkill final
{
public:
	class UClass*                                 Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkill_C*                               CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkill_C* Skill)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_SkillManager_C_AddSkill) == 0x000008, "Wrong alignment on COMP_SkillManager_C_AddSkill");
static_assert(sizeof(COMP_SkillManager_C_AddSkill) == 0x000030, "Wrong size on COMP_SkillManager_C_AddSkill");
static_assert(offsetof(COMP_SkillManager_C_AddSkill, Skill) == 0x000000, "Member 'COMP_SkillManager_C_AddSkill::Skill' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_AddSkill, CallFunc_IsValidClass_ReturnValue) == 0x000008, "Member 'COMP_SkillManager_C_AddSkill::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_AddSkill, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'COMP_SkillManager_C_AddSkill::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_AddSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'COMP_SkillManager_C_AddSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_AddSkill, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'COMP_SkillManager_C_AddSkill::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.HasAnySkills
// 0x000C (0x000C - 0x0000)
struct COMP_SkillManager_C_HasAnySkills final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_HasAnySkills) == 0x000004, "Wrong alignment on COMP_SkillManager_C_HasAnySkills");
static_assert(sizeof(COMP_SkillManager_C_HasAnySkills) == 0x00000C, "Wrong size on COMP_SkillManager_C_HasAnySkills");
static_assert(offsetof(COMP_SkillManager_C_HasAnySkills, Result) == 0x000000, "Member 'COMP_SkillManager_C_HasAnySkills::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_HasAnySkills, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'COMP_SkillManager_C_HasAnySkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_HasAnySkills, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'COMP_SkillManager_C_HasAnySkills::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.EVENT_OnSkillActivated
// 0x0018 (0x0018 - 0x0000)
struct COMP_SkillManager_C_EVENT_OnSkillActivated final
{
public:
	class USkill_C*                               Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkill_C* Skill)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_EVENT_OnSkillActivated) == 0x000008, "Wrong alignment on COMP_SkillManager_C_EVENT_OnSkillActivated");
static_assert(sizeof(COMP_SkillManager_C_EVENT_OnSkillActivated) == 0x000018, "Wrong size on COMP_SkillManager_C_EVENT_OnSkillActivated");
static_assert(offsetof(COMP_SkillManager_C_EVENT_OnSkillActivated, Skill) == 0x000000, "Member 'COMP_SkillManager_C_EVENT_OnSkillActivated::Skill' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_EVENT_OnSkillActivated, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'COMP_SkillManager_C_EVENT_OnSkillActivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.EVENT_OnSkillDeactivated
// 0x0018 (0x0018 - 0x0000)
struct COMP_SkillManager_C_EVENT_OnSkillDeactivated final
{
public:
	class USkill_C*                               Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkill_C* Skill)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_EVENT_OnSkillDeactivated) == 0x000008, "Wrong alignment on COMP_SkillManager_C_EVENT_OnSkillDeactivated");
static_assert(sizeof(COMP_SkillManager_C_EVENT_OnSkillDeactivated) == 0x000018, "Wrong size on COMP_SkillManager_C_EVENT_OnSkillDeactivated");
static_assert(offsetof(COMP_SkillManager_C_EVENT_OnSkillDeactivated, Skill) == 0x000000, "Member 'COMP_SkillManager_C_EVENT_OnSkillDeactivated::Skill' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_EVENT_OnSkillDeactivated, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'COMP_SkillManager_C_EVENT_OnSkillDeactivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetSkillByClass
// 0x0048 (0x0048 - 0x0000)
struct COMP_SkillManager_C_GetSkillByClass final
{
public:
	class UClass*                                 SkillClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnyDerivedClass;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkill_C*                               Skill;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkill_C*                               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_GetSkillByClass) == 0x000008, "Wrong alignment on COMP_SkillManager_C_GetSkillByClass");
static_assert(sizeof(COMP_SkillManager_C_GetSkillByClass) == 0x000048, "Wrong size on COMP_SkillManager_C_GetSkillByClass");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, SkillClass) == 0x000000, "Member 'COMP_SkillManager_C_GetSkillByClass::SkillClass' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, AnyDerivedClass) == 0x000008, "Member 'COMP_SkillManager_C_GetSkillByClass::AnyDerivedClass' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, Skill) == 0x000010, "Member 'COMP_SkillManager_C_GetSkillByClass::Skill' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, Temp_int_Array_Index_Variable) == 0x000018, "Member 'COMP_SkillManager_C_GetSkillByClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'COMP_SkillManager_C_GetSkillByClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_Array_Get_Item) == 0x000028, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000040, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_ClassIsChildOf_ReturnValue) == 0x000041, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetSkillByClass, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'COMP_SkillManager_C_GetSkillByClass::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetActiveSkill
// 0x0008 (0x0008 - 0x0000)
struct COMP_SkillManager_C_GetActiveSkill final
{
public:
	class USkill_C*                               Skill;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_SkillManager_C_GetActiveSkill) == 0x000008, "Wrong alignment on COMP_SkillManager_C_GetActiveSkill");
static_assert(sizeof(COMP_SkillManager_C_GetActiveSkill) == 0x000008, "Wrong size on COMP_SkillManager_C_GetActiveSkill");
static_assert(offsetof(COMP_SkillManager_C_GetActiveSkill, Skill) == 0x000000, "Member 'COMP_SkillManager_C_GetActiveSkill::Skill' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.HasActiveCombo
// 0x0002 (0x0002 - 0x0000)
struct COMP_SkillManager_C_HasActiveCombo final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_HasActiveCombo) == 0x000001, "Wrong alignment on COMP_SkillManager_C_HasActiveCombo");
static_assert(sizeof(COMP_SkillManager_C_HasActiveCombo) == 0x000002, "Wrong size on COMP_SkillManager_C_HasActiveCombo");
static_assert(offsetof(COMP_SkillManager_C_HasActiveCombo, Result) == 0x000000, "Member 'COMP_SkillManager_C_HasActiveCombo::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_HasActiveCombo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'COMP_SkillManager_C_HasActiveCombo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetComboCooldownRemaining
// 0x001C (0x001C - 0x0000)
struct COMP_SkillManager_C_GetComboCooldownRemaining final
{
public:
	int32                                         ComboIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_SkillManager_C_GetComboCooldownRemaining) == 0x000004, "Wrong alignment on COMP_SkillManager_C_GetComboCooldownRemaining");
static_assert(sizeof(COMP_SkillManager_C_GetComboCooldownRemaining) == 0x00001C, "Wrong size on COMP_SkillManager_C_GetComboCooldownRemaining");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, ComboIndex) == 0x000000, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::ComboIndex' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, Result) == 0x000004, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000008, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, CallFunc_Array_Get_Item) == 0x00000C, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000014, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetComboCooldownRemaining, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'COMP_SkillManager_C_GetComboCooldownRemaining::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetCombosByType
// 0x0078 (0x0078 - 0x0000)
struct COMP_SkillManager_C_GetCombosByType final
{
public:
	ENUM_SkillType                                Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Result;                                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<int32>                                 ComboIndices;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentComboIndex;                                 // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DefaultSkillComboParams        CallFunc_Array_Get_Item;                           // 0x0038(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_GetCombosByType) == 0x000008, "Wrong alignment on COMP_SkillManager_C_GetCombosByType");
static_assert(sizeof(COMP_SkillManager_C_GetCombosByType) == 0x000078, "Wrong size on COMP_SkillManager_C_GetCombosByType");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, Type) == 0x000000, "Member 'COMP_SkillManager_C_GetCombosByType::Type' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, Result) == 0x000008, "Member 'COMP_SkillManager_C_GetCombosByType::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, ComboIndices) == 0x000018, "Member 'COMP_SkillManager_C_GetCombosByType::ComboIndices' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CurrentComboIndex) == 0x000028, "Member 'COMP_SkillManager_C_GetCombosByType::CurrentComboIndex' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'COMP_SkillManager_C_GetCombosByType::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'COMP_SkillManager_C_GetCombosByType::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_Array_Get_Item) == 0x000038, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006C, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByType, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'COMP_SkillManager_C_GetCombosByType::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetCombosByStyle
// 0x0078 (0x0078 - 0x0000)
struct COMP_SkillManager_C_GetCombosByStyle final
{
public:
	ENUM_PreferredCombatStyle                     Style;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Result;                                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<int32>                                 ComboIndices;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentComboIndex;                                 // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DefaultSkillComboParams        CallFunc_Array_Get_Item;                           // 0x0038(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_GetCombosByStyle) == 0x000008, "Wrong alignment on COMP_SkillManager_C_GetCombosByStyle");
static_assert(sizeof(COMP_SkillManager_C_GetCombosByStyle) == 0x000078, "Wrong size on COMP_SkillManager_C_GetCombosByStyle");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, Style) == 0x000000, "Member 'COMP_SkillManager_C_GetCombosByStyle::Style' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, Result) == 0x000008, "Member 'COMP_SkillManager_C_GetCombosByStyle::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, ComboIndices) == 0x000018, "Member 'COMP_SkillManager_C_GetCombosByStyle::ComboIndices' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CurrentComboIndex) == 0x000028, "Member 'COMP_SkillManager_C_GetCombosByStyle::CurrentComboIndex' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'COMP_SkillManager_C_GetCombosByStyle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'COMP_SkillManager_C_GetCombosByStyle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_Array_Get_Item) == 0x000038, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006C, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByStyle, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'COMP_SkillManager_C_GetCombosByStyle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetCombosByTypes
// 0x0080 (0x0080 - 0x0000)
struct COMP_SkillManager_C_GetCombosByTypes final
{
public:
	TArray<ENUM_SkillType>                        Types;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 Result;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<int32>                                 ComboIndices;                                      // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentComboIndex;                                 // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DefaultSkillComboParams        CallFunc_Array_Get_Item;                           // 0x0040(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_SkillManager_C_GetCombosByTypes) == 0x000008, "Wrong alignment on COMP_SkillManager_C_GetCombosByTypes");
static_assert(sizeof(COMP_SkillManager_C_GetCombosByTypes) == 0x000080, "Wrong size on COMP_SkillManager_C_GetCombosByTypes");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, Types) == 0x000000, "Member 'COMP_SkillManager_C_GetCombosByTypes::Types' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, Result) == 0x000010, "Member 'COMP_SkillManager_C_GetCombosByTypes::Result' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, ComboIndices) == 0x000020, "Member 'COMP_SkillManager_C_GetCombosByTypes::ComboIndices' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CurrentComboIndex) == 0x000030, "Member 'COMP_SkillManager_C_GetCombosByTypes::CurrentComboIndex' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, Temp_int_Array_Index_Variable) == 0x000034, "Member 'COMP_SkillManager_C_GetCombosByTypes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'COMP_SkillManager_C_GetCombosByTypes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Array_Get_Item) == 0x000040, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Array_Contains_ReturnValue) == 0x000074, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_SkillManager_C_GetCombosByTypes, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'COMP_SkillManager_C_GetCombosByTypes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.GetLastUsedComboIndex
// 0x0004 (0x0004 - 0x0000)
struct COMP_SkillManager_C_GetLastUsedComboIndex final
{
public:
	int32                                         LastComboIndex;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_SkillManager_C_GetLastUsedComboIndex) == 0x000004, "Wrong alignment on COMP_SkillManager_C_GetLastUsedComboIndex");
static_assert(sizeof(COMP_SkillManager_C_GetLastUsedComboIndex) == 0x000004, "Wrong size on COMP_SkillManager_C_GetLastUsedComboIndex");
static_assert(offsetof(COMP_SkillManager_C_GetLastUsedComboIndex, LastComboIndex) == 0x000000, "Member 'COMP_SkillManager_C_GetLastUsedComboIndex::LastComboIndex' has a wrong offset!");

// Function COMP_SkillManager.COMP_SkillManager_C.SelectRandomComboOfType
// 0x00C8 (0x00C8 - 0x0000)
struct COMP_SkillManager_C_SelectRandomComboOfType final
{
public:
	ENUM_SkillType                                SkillType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyPreferredStyle;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          ComboBehaviorTree;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ComboWeights;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         ComboIndex;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ComboIndices;                                      // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 CallFunc_GetCombosOfTypeThatCanStart_Combos;       // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTreeComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
