#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_Scanner

#include "Basic.hpp"

#include "STRUCT_InteractFlavorText_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_MeshDescriptor_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"


namespace SDK::Params
{

// Function COMP_Scanner.COMP_Scanner_C.OnScanDataChanged__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct COMP_Scanner_C_OnScanDataChanged__DelegateSignature final
{
public:
	class UObject*                                Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Primitive;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(COMP_Scanner_C_OnScanDataChanged__DelegateSignature) == 0x000008, "Wrong alignment on COMP_Scanner_C_OnScanDataChanged__DelegateSignature");
static_assert(sizeof(COMP_Scanner_C_OnScanDataChanged__DelegateSignature) == 0x000028, "Wrong size on COMP_Scanner_C_OnScanDataChanged__DelegateSignature");
static_assert(offsetof(COMP_Scanner_C_OnScanDataChanged__DelegateSignature, Interactable) == 0x000000, "Member 'COMP_Scanner_C_OnScanDataChanged__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_OnScanDataChanged__DelegateSignature, Primitive) == 0x000008, "Member 'COMP_Scanner_C_OnScanDataChanged__DelegateSignature::Primitive' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_OnScanDataChanged__DelegateSignature, Description) == 0x000010, "Member 'COMP_Scanner_C_OnScanDataChanged__DelegateSignature::Description' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.OnFeedbackDataChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature final
{
public:
	ENUM_InteractResultType                       FeedbackType_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FeedbackMessage_0;                                 // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature) == 0x000008, "Wrong alignment on COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature");
static_assert(sizeof(COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature) == 0x000020, "Wrong size on COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature");
static_assert(offsetof(COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature, FeedbackType_0) == 0x000000, "Member 'COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature::FeedbackType_0' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature, FeedbackMessage_0) == 0x000008, "Member 'COMP_Scanner_C_OnFeedbackDataChanged__DelegateSignature::FeedbackMessage_0' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.OnScannerUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct COMP_Scanner_C_OnScannerUpdated__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    ScannedPrimitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_OnScannerUpdated__DelegateSignature) == 0x000008, "Wrong alignment on COMP_Scanner_C_OnScannerUpdated__DelegateSignature");
static_assert(sizeof(COMP_Scanner_C_OnScannerUpdated__DelegateSignature) == 0x000010, "Wrong size on COMP_Scanner_C_OnScannerUpdated__DelegateSignature");
static_assert(offsetof(COMP_Scanner_C_OnScannerUpdated__DelegateSignature, ScannedPrimitive) == 0x000000, "Member 'COMP_Scanner_C_OnScannerUpdated__DelegateSignature::ScannedPrimitive' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_OnScannerUpdated__DelegateSignature, Distance) == 0x000008, "Member 'COMP_Scanner_C_OnScannerUpdated__DelegateSignature::Distance' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.ExecuteUbergraph_COMP_Scanner
// 0x0010 (0x0010 - 0x0000)
struct COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShuffler*                              CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner) == 0x000008, "Wrong alignment on COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner");
static_assert(sizeof(COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner) == 0x000010, "Wrong size on COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner");
static_assert(offsetof(COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner, EntryPoint) == 0x000000, "Member 'COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'COMP_Scanner_C_ExecuteUbergraph_COMP_Scanner::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_Scanner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_Scanner_C_ReceiveTick");
static_assert(sizeof(COMP_Scanner_C_ReceiveTick) == 0x000004, "Wrong size on COMP_Scanner_C_ReceiveTick");
static_assert(offsetof(COMP_Scanner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_Scanner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.HasCursorObjectChanged
// 0x0028 (0x0028 - 0x0000)
struct COMP_Scanner_C_HasCursorObjectChanged final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CursorMaterial;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelComponent*                        K2Node_DynamicCast_AsModel_Component;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_Scanner_C_HasCursorObjectChanged) == 0x000008, "Wrong alignment on COMP_Scanner_C_HasCursorObjectChanged");
static_assert(sizeof(COMP_Scanner_C_HasCursorObjectChanged) == 0x000028, "Wrong size on COMP_Scanner_C_HasCursorObjectChanged");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, CursorPrimitive) == 0x000000, "Member 'COMP_Scanner_C_HasCursorObjectChanged::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, CursorMaterial) == 0x000008, "Member 'COMP_Scanner_C_HasCursorObjectChanged::CursorMaterial' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, Result) == 0x000010, "Member 'COMP_Scanner_C_HasCursorObjectChanged::Result' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, K2Node_DynamicCast_AsModel_Component) == 0x000018, "Member 'COMP_Scanner_C_HasCursorObjectChanged::K2Node_DynamicCast_AsModel_Component' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'COMP_Scanner_C_HasCursorObjectChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'COMP_Scanner_C_HasCursorObjectChanged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_HasCursorObjectChanged, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000022, "Member 'COMP_Scanner_C_HasCursorObjectChanged::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.GetMaterialFromHitComponent
// 0x0080 (0x0080 - 0x0000)
struct COMP_Scanner_C_GetMaterialFromHitComponent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FaceIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelComponent*                        K2Node_DynamicCast_AsModel_Component;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaticMeshHasMaterialDescriptor_Result; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex_1; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_GetMaterialFromHitComponent) == 0x000008, "Wrong alignment on COMP_Scanner_C_GetMaterialFromHitComponent");
static_assert(sizeof(COMP_Scanner_C_GetMaterialFromHitComponent) == 0x000080, "Wrong size on COMP_Scanner_C_GetMaterialFromHitComponent");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, Object) == 0x000000, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::Object' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, FaceIndex) == 0x000008, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::FaceIndex' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, ReturnValue) == 0x000010, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, StaticMeshComponent) == 0x000018, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000028, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_AsGI_Single_Player) == 0x000038, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_AsModel_Component) == 0x000048, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_AsModel_Component' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetMaterial_ReturnValue) == 0x000058, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetStaticMeshHasMaterialDescriptor_Result) == 0x000060, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetStaticMeshHasMaterialDescriptor_Result' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000061, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex) == 0x000064, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue) == 0x000068, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex_1) == 0x000070, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetMaterialFromCollisionFaceIndex_SectionIndex_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetMaterialFromHitComponent, CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue_1) == 0x000078, "Member 'COMP_Scanner_C_GetMaterialFromHitComponent::CallFunc_GetMaterialFromCollisionFaceIndex_ReturnValue_1' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.GetLastCursorActor
// 0x0018 (0x0018 - 0x0000)
struct COMP_Scanner_C_GetLastCursorActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_Scanner_C_GetLastCursorActor) == 0x000008, "Wrong alignment on COMP_Scanner_C_GetLastCursorActor");
static_assert(sizeof(COMP_Scanner_C_GetLastCursorActor) == 0x000018, "Wrong size on COMP_Scanner_C_GetLastCursorActor");
static_assert(offsetof(COMP_Scanner_C_GetLastCursorActor, Actor) == 0x000000, "Member 'COMP_Scanner_C_GetLastCursorActor::Actor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetLastCursorActor, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'COMP_Scanner_C_GetLastCursorActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetLastCursorActor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'COMP_Scanner_C_GetLastCursorActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.GetDescriptorUnderCursor
// 0x0070 (0x0070 - 0x0000)
struct COMP_Scanner_C_GetDescriptorUnderCursor final
{
public:
	TScriptInterface<class IINTERF_Descriptor_C>  Descriptor;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 OwnerActor;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChildActor_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Descriptor_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Descriptor_C>  K2Node_DynamicCast_AsINTERF_Descriptor;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_Descriptor_C>  K2Node_DynamicCast_AsINTERF_Descriptor_1;          // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_Scanner_C_GetDescriptorUnderCursor) == 0x000008, "Wrong alignment on COMP_Scanner_C_GetDescriptorUnderCursor");
static_assert(sizeof(COMP_Scanner_C_GetDescriptorUnderCursor) == 0x000070, "Wrong size on COMP_Scanner_C_GetDescriptorUnderCursor");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, Descriptor) == 0x000000, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::Descriptor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, OwnerActor) == 0x000010, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::OwnerActor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, CallFunc_GetAttachParentActor_ReturnValue) == 0x000018, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, CallFunc_IsChildActor_ReturnValue) == 0x000020, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::CallFunc_IsChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, K2Node_DynamicCast_AsINTERF_Descriptor) == 0x000038, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::K2Node_DynamicCast_AsINTERF_Descriptor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, K2Node_DynamicCast_AsINTERF_Descriptor_1) == 0x000058, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::K2Node_DynamicCast_AsINTERF_Descriptor_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_GetDescriptorUnderCursor, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'COMP_Scanner_C_GetDescriptorUnderCursor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.InitializeScanner
// 0x0010 (0x0010 - 0x0000)
struct COMP_Scanner_C_InitializeScanner final
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraPanelWidget*                     CameraPanel;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_InitializeScanner) == 0x000008, "Wrong alignment on COMP_Scanner_C_InitializeScanner");
static_assert(sizeof(COMP_Scanner_C_InitializeScanner) == 0x000010, "Wrong size on COMP_Scanner_C_InitializeScanner");
static_assert(offsetof(COMP_Scanner_C_InitializeScanner, Camera) == 0x000000, "Member 'COMP_Scanner_C_InitializeScanner::Camera' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScanner, CameraPanel) == 0x000008, "Member 'COMP_Scanner_C_InitializeScanner::CameraPanel' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.InitializeScannerAttributes
// 0x0040 (0x0040 - 0x0000)
struct COMP_Scanner_C_InitializeScannerAttributes final
{
public:
	class UAttribInstance*                        ScanRangeInstance;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                AttribManager;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetOrCreateAttribInstance_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_Scanner_C_InitializeScannerAttributes) == 0x000008, "Wrong alignment on COMP_Scanner_C_InitializeScannerAttributes");
static_assert(sizeof(COMP_Scanner_C_InitializeScannerAttributes) == 0x000040, "Wrong size on COMP_Scanner_C_InitializeScannerAttributes");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, ScanRangeInstance) == 0x000000, "Member 'COMP_Scanner_C_InitializeScannerAttributes::ScanRangeInstance' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, AttribManager) == 0x000008, "Member 'COMP_Scanner_C_InitializeScannerAttributes::AttribManager' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, CallFunc_GetOrCreateAttribInstance_ReturnValue) == 0x000010, "Member 'COMP_Scanner_C_InitializeScannerAttributes::CallFunc_GetOrCreateAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'COMP_Scanner_C_InitializeScannerAttributes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'COMP_Scanner_C_InitializeScannerAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, CallFunc_GetValue_ReturnValue) == 0x00002C, "Member 'COMP_Scanner_C_InitializeScannerAttributes::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'COMP_Scanner_C_InitializeScannerAttributes::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_InitializeScannerAttributes, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'COMP_Scanner_C_InitializeScannerAttributes::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.UpdateCursorInformation
// 0x0168 (0x0168 - 0x0000)
struct COMP_Scanner_C_UpdateCursorInformation final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CursorMaterial;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelComponent*                        K2Node_DynamicCast_AsModel_Component;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescriptionFromMaterial_DescriptionText; // 0x0048(0x0018)()
	bool                                          CallFunc_HasCursorObjectChanged_Result;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Descriptor_C>  CallFunc_GetDescriptorUnderCursor_Descriptor;      // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetDescriptionMessage_Message;            // 0x0078(0x0018)()
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescriptionFromStaticMesh_DescriptionText; // 0x00B0(0x0018)()
	TScriptInterface<class IINTERF_Interactable_C> K2Node_DynamicCast_AsINTERF_Interactable;          // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_1;     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshDescriptor                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0100(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> K2Node_DynamicCast_AsINTERF_Interactable_1;        // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_Scanner_C_UpdateCursorInformation) == 0x000008, "Wrong alignment on COMP_Scanner_C_UpdateCursorInformation");
static_assert(sizeof(COMP_Scanner_C_UpdateCursorInformation) == 0x000168, "Wrong size on COMP_Scanner_C_UpdateCursorInformation");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CursorPrimitive) == 0x000000, "Member 'COMP_Scanner_C_UpdateCursorInformation::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CursorMaterial) == 0x000008, "Member 'COMP_Scanner_C_UpdateCursorInformation::CursorMaterial' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, Distance) == 0x000010, "Member 'COMP_Scanner_C_UpdateCursorInformation::Distance' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, GameInstance) == 0x000018, "Member 'COMP_Scanner_C_UpdateCursorInformation::GameInstance' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_AsModel_Component) == 0x000038, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_AsModel_Component' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDescriptionFromMaterial_DescriptionText) == 0x000048, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDescriptionFromMaterial_DescriptionText' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_HasCursorObjectChanged_Result) == 0x000060, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_HasCursorObjectChanged_Result' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDescriptorUnderCursor_Descriptor) == 0x000068, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDescriptorUnderCursor_Descriptor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDescriptionMessage_Message) == 0x000078, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDescriptionMessage_Message' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000090, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue_2) == 0x000099, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000A0, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDescriptionFromStaticMesh_DescriptionText) == 0x0000B0, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDescriptionFromStaticMesh_DescriptionText' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_AsINTERF_Interactable) == 0x0000C8, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_AsINTERF_Interactable' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetOwner_ReturnValue) == 0x0000E0, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue_4) == 0x0000E8, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetOwner_ReturnValue_1) == 0x0000F0, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_DoesImplementInterface_ReturnValue) == 0x0000F8, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_DoesImplementInterface_ReturnValue_1) == 0x0000F9, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_DoesImplementInterface_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDataTableRowFromName_OutRow) == 0x000100, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000148, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_AsINTERF_Interactable_1) == 0x000150, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_AsINTERF_Interactable_1' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, K2Node_DynamicCast_bSuccess_4) == 0x000160, "Member 'COMP_Scanner_C_UpdateCursorInformation::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateCursorInformation, CallFunc_IsValid_ReturnValue_5) == 0x000161, "Member 'COMP_Scanner_C_UpdateCursorInformation::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function COMP_Scanner.COMP_Scanner_C.UpdateInteractionFeedback
// 0x0180 (0x0180 - 0x0000)
struct COMP_Scanner_C_UpdateInteractionFeedback final
{
public:
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrDescriptorRowName;                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaticMeshHasMaterialDescriptor_Result; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDescRowNameFromStaticMesh_Found;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetDescRowNameFromStaticMesh_RowName;     // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDescRowNameFromMaterial_Found;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetDescRowNameFromMaterial_RowName;       // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Descriptor_C>  CallFunc_GetDescriptorUnderCursor_Descriptor;      // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UModelComponent*                        K2Node_DynamicCast_AsModel_Component;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInteractFlavorMessage_Message;         // 0x00A0(0x0018)()
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNextIndex_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MeshDescriptor                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractFlavorText             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0120(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractFlavorText             CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0148(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_Scanner_C_UpdateInteractionFeedback) == 0x000008, "Wrong alignment on COMP_Scanner_C_UpdateInteractionFeedback");
static_assert(sizeof(COMP_Scanner_C_UpdateInteractionFeedback) == 0x000180, "Wrong size on COMP_Scanner_C_UpdateInteractionFeedback");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, InteractResults) == 0x000000, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::InteractResults' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, StaticMeshComponent) == 0x000020, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, GameInstance) == 0x000028, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::GameInstance' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CurrDescriptorRowName) == 0x000030, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CurrDescriptorRowName' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, K2Node_DynamicCast_AsGI_Single_Player) == 0x000040, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetStaticMeshHasMaterialDescriptor_Result) == 0x000050, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetStaticMeshHasMaterialDescriptor_Result' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDescRowNameFromStaticMesh_Found) == 0x000051, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDescRowNameFromStaticMesh_Found' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDescRowNameFromStaticMesh_RowName) == 0x000054, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDescRowNameFromStaticMesh_RowName' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_Not_PreBool_ReturnValue) == 0x00005C, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000070, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDescRowNameFromMaterial_Found) == 0x000071, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDescRowNameFromMaterial_Found' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDescRowNameFromMaterial_RowName) == 0x000074, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDescRowNameFromMaterial_RowName' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, CallFunc_GetDescriptorUnderCursor_Descriptor) == 0x000080, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::CallFunc_GetDescriptorUnderCursor_Descriptor' has a wrong offset!");
static_assert(offsetof(COMP_Scanner_C_UpdateInteractionFeedback, K2Node_DynamicCast_AsModel_Component) == 0x000090, "Member 'COMP_Scanner_C_UpdateInteractionFeedback::K2Node_DynamicCast_AsModel_Component' has a wrong offset!");
