#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_PhysInstancedStaticMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SystemReShock_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C
// 0x0040 (0x0610 - 0x05D0)
class UCOMP_PhysInstancedStaticMesh_C final : public UPhysInstancedStaticMeshComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class USoundCue>               CollisionSoundCue;                                 // 0x05D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundCue*                              CachedCollisionSoundCue;                           // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_COMP_PhysInstancedStaticMesh(int32 EntryPoint);
	void AsyncLoadCollisionSound();
	void OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC(class UObject* Loaded);
	void SetCollisionSoundCue(TSoftObjectPtr<class USoundCue> SoundCue);
	void EVENT_OnInstanceCollision(const int32 InstanceIndex, const struct FVector& ImpactLocation);
	bool TryCollideWithWorld(const struct FVector& LastCentroid, const struct FVector& CurrCentroid, const struct FVector& CylinderVector, float CapsuleRadius, struct FVector* OutCollisionPoint, struct FVector* OutCollisionNormal, float* OutPenetrationDepth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COMP_PhysInstancedStaticMesh_C">();
	}
	static class UCOMP_PhysInstancedStaticMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOMP_PhysInstancedStaticMesh_C>();
	}
};
static_assert(alignof(UCOMP_PhysInstancedStaticMesh_C) == 0x000010, "Wrong alignment on UCOMP_PhysInstancedStaticMesh_C");
static_assert(sizeof(UCOMP_PhysInstancedStaticMesh_C) == 0x000610, "Wrong size on UCOMP_PhysInstancedStaticMesh_C");
static_assert(offsetof(UCOMP_PhysInstancedStaticMesh_C, UberGraphFrame) == 0x0005D0, "Member 'UCOMP_PhysInstancedStaticMesh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCOMP_PhysInstancedStaticMesh_C, CollisionSoundCue) == 0x0005D8, "Member 'UCOMP_PhysInstancedStaticMesh_C::CollisionSoundCue' has a wrong offset!");
static_assert(offsetof(UCOMP_PhysInstancedStaticMesh_C, CachedCollisionSoundCue) == 0x000600, "Member 'UCOMP_PhysInstancedStaticMesh_C::CachedCollisionSoundCue' has a wrong offset!");

}

