#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_Descriptor

#include "Basic.hpp"

#include "STRUCT_TaggedDescription_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COMP_Descriptor.COMP_Descriptor_C
// 0x0050 (0x0100 - 0x00B0)
class UCOMP_Descriptor_C final : public UActorComponent
{
public:
	class FText                                   Description;                                       // 0x00B0(0x0018)(Edit, BlueprintVisible)
	TArray<struct FSTRUCT_TaggedDescription>      PrimitiveDescriptions;                             // 0x00C8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UShuffler*                              FlavorShuffler;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    FlavorRowHandle;                                   // 0x00E0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<class FText>                           FlavorFeedbackText;                                // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void TryGenerateFlavorText();
	void RegenerateFlavorText();
	void GetPrimitiveDescriptionMessage(class UPrimitiveComponent* Primitive, bool* Result, class FText* Message);
	void SetDescriptionMessage(const class FText& Text);
	void SetFlavorFeedbackRowName(class FName RowName);
	void GetDescriptionMessage(class UPrimitiveComponent* Primitive, class FText* Message);
	void GetInteractFlavorMessage(class FText* Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COMP_Descriptor_C">();
	}
	static class UCOMP_Descriptor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOMP_Descriptor_C>();
	}
};
static_assert(alignof(UCOMP_Descriptor_C) == 0x000008, "Wrong alignment on UCOMP_Descriptor_C");
static_assert(sizeof(UCOMP_Descriptor_C) == 0x000100, "Wrong size on UCOMP_Descriptor_C");
static_assert(offsetof(UCOMP_Descriptor_C, Description) == 0x0000B0, "Member 'UCOMP_Descriptor_C::Description' has a wrong offset!");
static_assert(offsetof(UCOMP_Descriptor_C, PrimitiveDescriptions) == 0x0000C8, "Member 'UCOMP_Descriptor_C::PrimitiveDescriptions' has a wrong offset!");
static_assert(offsetof(UCOMP_Descriptor_C, FlavorShuffler) == 0x0000D8, "Member 'UCOMP_Descriptor_C::FlavorShuffler' has a wrong offset!");
static_assert(offsetof(UCOMP_Descriptor_C, FlavorRowHandle) == 0x0000E0, "Member 'UCOMP_Descriptor_C::FlavorRowHandle' has a wrong offset!");
static_assert(offsetof(UCOMP_Descriptor_C, FlavorFeedbackText) == 0x0000F0, "Member 'UCOMP_Descriptor_C::FlavorFeedbackText' has a wrong offset!");

}

