#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_EnemyDetection

#include "Basic.hpp"

#include "STRUCT_EnemyStats_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_DetectionState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "STRUCT_CombatDifficultySettings_structs.hpp"
#include "STRUCT_EnemyTemplate_structs.hpp"


namespace SDK::Params
{

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnDetectionStateChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventLocation;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           NewState;                                          // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           OldState;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature");
static_assert(sizeof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature) == 0x000018, "Wrong size on COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature");
static_assert(offsetof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature, Character) == 0x000000, "Member 'COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature, EventLocation) == 0x000008, "Member 'COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature::EventLocation' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature, NewState) == 0x000014, "Member 'COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature::NewState' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature, OldState) == 0x000015, "Member 'COMP_EnemyDetection_C_OnDetectionStateChanged__DelegateSignature::OldState' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.ExecuteUbergraph_COMP_EnemyDetection
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection) == 0x000004, "Wrong alignment on COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection");
static_assert(sizeof(COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection) == 0x000008, "Wrong size on COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection");
static_assert(offsetof(COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection, EntryPoint) == 0x000000, "Member 'COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'COMP_EnemyDetection_C_ExecuteUbergraph_COMP_EnemyDetection::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_EnemyDetection_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_EnemyDetection_C_ReceiveTick");
static_assert(sizeof(COMP_EnemyDetection_C_ReceiveTick) == 0x000004, "Wrong size on COMP_EnemyDetection_C_ReceiveTick");
static_assert(offsetof(COMP_EnemyDetection_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_EnemyDetection_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnSeePawn
// 0x0038 (0x0038 - 0x0000)
struct COMP_EnemyDetection_C_OnSeePawn final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  _CurrentEvent;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterThreatening_Result;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetOrCreateDetectionEvent_DetectionEvent; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyDetection_C_OnSeePawn) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnSeePawn");
static_assert(sizeof(COMP_EnemyDetection_C_OnSeePawn) == 0x000038, "Wrong size on COMP_EnemyDetection_C_OnSeePawn");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, Pawn) == 0x000000, "Member 'COMP_EnemyDetection_C_OnSeePawn::Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, DetectionEvent) == 0x000008, "Member 'COMP_EnemyDetection_C_OnSeePawn::DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, _CurrentEvent) == 0x000010, "Member 'COMP_EnemyDetection_C_OnSeePawn::_CurrentEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, CallFunc_IsCharacterThreatening_Result) == 0x000018, "Member 'COMP_EnemyDetection_C_OnSeePawn::CallFunc_IsCharacterThreatening_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, CallFunc_GetOrCreateDetectionEvent_DetectionEvent) == 0x000020, "Member 'COMP_EnemyDetection_C_OnSeePawn::CallFunc_GetOrCreateDetectionEvent_DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, CallFunc_CanDetectAnyEvents_Result) == 0x000028, "Member 'COMP_EnemyDetection_C_OnSeePawn::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x00002C, "Member 'COMP_EnemyDetection_C_OnSeePawn::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeePawn, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'COMP_EnemyDetection_C_OnSeePawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.InitializeDetectionEvents
// 0x0020 (0x0020 - 0x0000)
struct COMP_EnemyDetection_C_InitializeDetectionEvents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyDetection_C_InitializeDetectionEvents) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_InitializeDetectionEvents");
static_assert(sizeof(COMP_EnemyDetection_C_InitializeDetectionEvents) == 0x000020, "Wrong size on COMP_EnemyDetection_C_InitializeDetectionEvents");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, CallFunc_Array_Get_Item) == 0x000010, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_InitializeDetectionEvents, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'COMP_EnemyDetection_C_InitializeDetectionEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.UpdateDetectionEvents
// 0x0128 (0x0128 - 0x0000)
struct COMP_EnemyDetection_C_UpdateDetectionEvents final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           DetectedPawn;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           HighestRatedState;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EventIndex;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentRating;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighestRating;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CurrentEvent;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           CallFunc_GetDetectionState_Result;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DetectionState                           Temp_byte_Variable;                                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentDetectionRating_DetectionRating; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_UpdateDetectionEvents) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_UpdateDetectionEvents");
static_assert(sizeof(COMP_EnemyDetection_C_UpdateDetectionEvents) == 0x000128, "Wrong size on COMP_EnemyDetection_C_UpdateDetectionEvents");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, DeltaTime) == 0x000000, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::DeltaTime' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, DetectedPawn) == 0x000008, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::DetectedPawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, HighestRatedState) == 0x000010, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::HighestRatedState' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, EventIndex) == 0x000014, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::EventIndex' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CurrentRating) == 0x000018, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CurrentRating' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, HighestRating) == 0x00001C, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::HighestRating' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CurrentEvent) == 0x000020, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CurrentEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_struct_Variable) == 0x000028, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_struct_Variable_1) == 0x000038, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_struct_Variable_2) == 0x000048, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_int_Array_Index_Variable) == 0x000064, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetDetectedPawn_Pawn) == 0x000068, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_struct_Variable_3) == 0x000070, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetDetectionState_Result) == 0x000080, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetDetectionState_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000081, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, Temp_byte_Variable) == 0x000083, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000084, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, K2Node_Select_Default) == 0x000088, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000098, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A8, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetActorBounds_Origin) == 0x0000AC, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetActorBounds_BoxExtent) == 0x0000B8, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_BreakVector_X) == 0x0000C4, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_BreakVector_Z) == 0x0000CC, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D0, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_FClamp_ReturnValue) == 0x0000D4, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D8, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Lerp_ReturnValue) == 0x0000DC, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetOwner_ReturnValue_1) == 0x0000F0, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000104, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_GetCurrentDetectionRating_DetectionRating) == 0x000110, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_GetCurrentDetectionRating_DetectionRating' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Array_Get_Item) == 0x000118, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000120, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_UpdateDetectionEvents, CallFunc_Max_ReturnValue) == 0x000124, "Member 'COMP_EnemyDetection_C_UpdateDetectionEvents::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnSeeEvent
// 0x0048 (0x0048 - 0x0000)
struct COMP_EnemyDetection_C_OnSeeEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  _CurrentEvent;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterThreatening_Result;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetOrCreateDetectionEvent_DetectionEvent; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyDetection_C_OnSeeEvent) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnSeeEvent");
static_assert(sizeof(COMP_EnemyDetection_C_OnSeeEvent) == 0x000048, "Wrong size on COMP_EnemyDetection_C_OnSeeEvent");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, Pawn) == 0x000000, "Member 'COMP_EnemyDetection_C_OnSeeEvent::Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, Location) == 0x000008, "Member 'COMP_EnemyDetection_C_OnSeeEvent::Location' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, DetectionEvent) == 0x000018, "Member 'COMP_EnemyDetection_C_OnSeeEvent::DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, _CurrentEvent) == 0x000020, "Member 'COMP_EnemyDetection_C_OnSeeEvent::_CurrentEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, CallFunc_IsCharacterThreatening_Result) == 0x000028, "Member 'COMP_EnemyDetection_C_OnSeeEvent::CallFunc_IsCharacterThreatening_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, CallFunc_GetOrCreateDetectionEvent_DetectionEvent) == 0x000030, "Member 'COMP_EnemyDetection_C_OnSeeEvent::CallFunc_GetOrCreateDetectionEvent_DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, CallFunc_CanDetectAnyEvents_Result) == 0x000038, "Member 'COMP_EnemyDetection_C_OnSeeEvent::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x00003C, "Member 'COMP_EnemyDetection_C_OnSeeEvent::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnSeeEvent, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'COMP_EnemyDetection_C_OnSeeEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnHearPawn
// 0x0020 (0x0020 - 0x0000)
struct COMP_EnemyDetection_C_OnHearPawn final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterThreatening_Result;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetOrCreateDetectionEvent_DetectionEvent; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_OnHearPawn) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnHearPawn");
static_assert(sizeof(COMP_EnemyDetection_C_OnHearPawn) == 0x000020, "Wrong size on COMP_EnemyDetection_C_OnHearPawn");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, Pawn) == 0x000000, "Member 'COMP_EnemyDetection_C_OnHearPawn::Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, Loudness) == 0x000008, "Member 'COMP_EnemyDetection_C_OnHearPawn::Loudness' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, CallFunc_CanDetectAnyEvents_Result) == 0x00000C, "Member 'COMP_EnemyDetection_C_OnHearPawn::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, CallFunc_IsCharacterThreatening_Result) == 0x00000D, "Member 'COMP_EnemyDetection_C_OnHearPawn::CallFunc_IsCharacterThreatening_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'COMP_EnemyDetection_C_OnHearPawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, CallFunc_GetOrCreateDetectionEvent_DetectionEvent) == 0x000010, "Member 'COMP_EnemyDetection_C_OnHearPawn::CallFunc_GetOrCreateDetectionEvent_DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearPawn, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000018, "Member 'COMP_EnemyDetection_C_OnHearPawn::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.GetOrCreateDetectionEvent
// 0x0050 (0x0050 - 0x0000)
struct COMP_EnemyDetection_C_GetOrCreateDetectionEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           DetectedPawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  _CurrentEvent;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_GetOrCreateDetectionEvent");
static_assert(sizeof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent) == 0x000050, "Wrong size on COMP_EnemyDetection_C_GetOrCreateDetectionEvent");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, DetectedPawn) == 0x000000, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::DetectedPawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, DetectionEvent) == 0x000008, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, _CurrentEvent) == 0x000010, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::_CurrentEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, Temp_int_Array_Index_Variable) == 0x000018, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_GetDetectedPawn_Pawn) == 0x000030, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_Array_Get_Item) == 0x000040, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_GetOrCreateDetectionEvent, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'COMP_EnemyDetection_C_GetOrCreateDetectionEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.SetDetectionEnabled
// 0x0058 (0x0058 - 0x0000)
struct COMP_EnemyDetection_C_SetDetectionEnabled final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerThreatening_Result;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsIdentified_IsDetected;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyDetection_C_SetDetectionEnabled) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_SetDetectionEnabled");
static_assert(sizeof(COMP_EnemyDetection_C_SetDetectionEnabled) == 0x000058, "Wrong size on COMP_EnemyDetection_C_SetDetectionEnabled");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, State) == 0x000000, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::State' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, Temp_int_Array_Index_Variable) == 0x000004, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_IsOwnerThreatening_Result) == 0x000008, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_IsOwnerThreatening_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000014, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_Array_Get_Item) == 0x000028, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_GetDetectedPawn_Pawn) == 0x000038, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000048, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_SetDetectionEnabled, CallFunc_GetIsIdentified_IsDetected) == 0x000051, "Member 'COMP_EnemyDetection_C_SetDetectionEnabled::CallFunc_GetIsIdentified_IsDetected' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnHearEvent
// 0x0030 (0x0030 - 0x0000)
struct COMP_EnemyDetection_C_OnHearEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterThreatening_Result;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetOrCreateDetectionEvent_DetectionEvent; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_OnHearEvent) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnHearEvent");
static_assert(sizeof(COMP_EnemyDetection_C_OnHearEvent) == 0x000030, "Wrong size on COMP_EnemyDetection_C_OnHearEvent");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, Pawn) == 0x000000, "Member 'COMP_EnemyDetection_C_OnHearEvent::Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, Location) == 0x000008, "Member 'COMP_EnemyDetection_C_OnHearEvent::Location' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, Loudness) == 0x000014, "Member 'COMP_EnemyDetection_C_OnHearEvent::Loudness' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, CallFunc_CanDetectAnyEvents_Result) == 0x000018, "Member 'COMP_EnemyDetection_C_OnHearEvent::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, CallFunc_IsCharacterThreatening_Result) == 0x000019, "Member 'COMP_EnemyDetection_C_OnHearEvent::CallFunc_IsCharacterThreatening_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'COMP_EnemyDetection_C_OnHearEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, CallFunc_GetOrCreateDetectionEvent_DetectionEvent) == 0x000020, "Member 'COMP_EnemyDetection_C_OnHearEvent::CallFunc_GetOrCreateDetectionEvent_DetectionEvent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnHearEvent, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000028, "Member 'COMP_EnemyDetection_C_OnHearEvent::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.OnTakeDamage
// 0x0018 (0x0018 - 0x0000)
struct COMP_EnemyDetection_C_OnTakeDamage final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetOrCreateDetectionEvent_DetectionEvent; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyDetection_C_OnTakeDamage) == 0x000008, "Wrong alignment on COMP_EnemyDetection_C_OnTakeDamage");
static_assert(sizeof(COMP_EnemyDetection_C_OnTakeDamage) == 0x000018, "Wrong size on COMP_EnemyDetection_C_OnTakeDamage");
static_assert(offsetof(COMP_EnemyDetection_C_OnTakeDamage, Character) == 0x000000, "Member 'COMP_EnemyDetection_C_OnTakeDamage::Character' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnTakeDamage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'COMP_EnemyDetection_C_OnTakeDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnTakeDamage, CallFunc_CanDetectAnyEvents_Result) == 0x000009, "Member 'COMP_EnemyDetection_C_OnTakeDamage::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnTakeDamage, CallFunc_IsPlayerControlled_ReturnValue) == 0x00000A, "Member 'COMP_EnemyDetection_C_OnTakeDamage::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyDetection_C_OnTakeDamage, CallFunc_GetOrCreateDetectionEvent_DetectionEvent) == 0x000010, "Member 'COMP_EnemyDetection_C_OnTakeDamage::CallFunc_GetOrCreateDetectionEvent_DetectionEvent' has a wrong offset!");

// Function COMP_EnemyDetection.COMP_EnemyDetection_C.EVENT_OnCharacterDied
// 0x0058 (0x0058 - 0x0000)
struct COMP_EnemyDetection_C_EVENT_OnCharacterDied final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           DetectedCharacter;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwnerThreatening_Result;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
