#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_MoveControlManager

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_PlayerMoveSpeed_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_HackerGender_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"
#include "ENUM_CameraBobType_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "ENUM_MoveInputActionType_structs.hpp"
#include "ENUM_OffReducedNormal_structs.hpp"
#include "STRUCT_MoveInputAction_structs.hpp"


namespace SDK::Params
{

// Function COMP_MoveControlManager.COMP_MoveControlManager_C.OnMoveControlRegistered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature final
{
public:
	class UMOVECONTROL_Base_C*                    MoveControl;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature) == 0x000008, "Wrong alignment on COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature");
static_assert(sizeof(COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature) == 0x000008, "Wrong size on COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature");
static_assert(offsetof(COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature, MoveControl) == 0x000000, "Member 'COMP_MoveControlManager_C_OnMoveControlRegistered__DelegateSignature::MoveControl' has a wrong offset!");

// Function COMP_MoveControlManager.COMP_MoveControlManager_C.InitializeMoveControls
// 0x0060 (0x0060 - 0x0000)
struct COMP_MoveControlManager_C_InitializeMoveControls final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCrouchToggle_Result;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeightedAverageVec2*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeightedAverageVec2*                   CallFunc_SpawnObject_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeightedAverageFloat*                  CallFunc_SpawnObject_ReturnValue_2;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_MoveControlManager_C_InitializeMoveControls) == 0x000008, "Wrong alignment on COMP_MoveControlManager_C_InitializeMoveControls");
static_assert(sizeof(COMP_MoveControlManager_C_InitializeMoveControls) == 0x000060, "Wrong size on COMP_MoveControlManager_C_InitializeMoveControls");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, Temp_float_Variable) == 0x000000, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_GetCrouchToggle_Result) == 0x000010, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_GetCrouchToggle_Result' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_SpawnObject_ReturnValue_1) == 0x000028, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000030, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_SpawnObject_ReturnValue_2) == 0x000038, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000050, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_InitializeMoveControls, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'COMP_MoveControlManager_C_InitializeMoveControls::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function COMP_MoveControlManager.COMP_MoveControlManager_C.UpdateMoveControls
// 0x04F8 (0x04F8 - 0x0000)
struct COMP_MoveControlManager_C_UpdateMoveControls final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MoveInputAxes;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LookInputAxes;                                     // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaCameraYaw;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredCameraYaw;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredCameraPitch;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustedLookSensitivity;                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_Base_C*                    ActiveMoveControl;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampPointToLozenge2D_ReturnValue;        // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue_2;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x015C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_3;                          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_4;                          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_5;                      // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_5;                     // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_5;                       // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x027C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue_3;                  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_5;                // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x031C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_6;                // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_6;                      // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_6;                     // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_6;                       // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_6;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x03F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCharacterSurfaceMoveScale_Result;      // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRealspaceInvertY_Result;               // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealspaceLookSensitivity_Result;       // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_Base_C*                    CallFunc_GetActiveMoveControl_ActiveMoveControl;   // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMoveControl_ShouldExpire;           // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_MoveControlManager_C_UpdateMoveControls) == 0x000008, "Wrong alignment on COMP_MoveControlManager_C_UpdateMoveControls");
static_assert(sizeof(COMP_MoveControlManager_C_UpdateMoveControls) == 0x0004F8, "Wrong size on COMP_MoveControlManager_C_UpdateMoveControls");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, DeltaTime) == 0x000000, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::DeltaTime' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, MoveInputAxes) == 0x000004, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::MoveInputAxes' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, LookInputAxes) == 0x00000C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::LookInputAxes' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, DeltaCameraYaw) == 0x000014, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::DeltaCameraYaw' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, DesiredCameraYaw) == 0x000018, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::DesiredCameraYaw' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, DesiredCameraPitch) == 0x00001C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::DesiredCameraPitch' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, AdjustedLookSensitivity) == 0x000020, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::AdjustedLookSensitivity' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, ActiveMoveControl) == 0x000028, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::ActiveMoveControl' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, Temp_bool_Variable) == 0x000030, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, Temp_float_Variable) == 0x000034, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, Temp_float_Variable_1) == 0x000038, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X) == 0x00004C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y) == 0x000050, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z) == 0x000054, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue) == 0x000058, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_1) == 0x000064, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_1) == 0x00006C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000070, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_1) == 0x000074, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000080, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_1) == 0x000108, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_1) == 0x00010C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_1) == 0x000110, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_2) == 0x000114, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_2) == 0x000118, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_2) == 0x00011C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue) == 0x000120, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000124, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeVector2D_ReturnValue) == 0x000128, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_FInterpTo_ReturnValue) == 0x000130, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampPointToLozenge2D_ReturnValue) == 0x000134, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampPointToLozenge2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampAxis_ReturnValue) == 0x00013C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector2D_X) == 0x000140, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector2D_Y) == 0x000144, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampAxis_ReturnValue_1) == 0x000148, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampAxis_ReturnValue_2) == 0x00014C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampAxis_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_2) == 0x000150, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x00015C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_2) == 0x0001E4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_2) == 0x0001E8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_2) == 0x0001EC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001F0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Not_PreBool_ReturnValue) == 0x0001F1, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_3) == 0x0001F4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_3) == 0x0001F8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_3) == 0x0001FC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000200, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_3) == 0x00020C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_3) == 0x000210, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_3) == 0x000214, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000218, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_3) == 0x00021C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000228, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_4) == 0x00022C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_4) == 0x000230, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_4) == 0x000234, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000238, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_4) == 0x000244, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_4) == 0x000248, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_4) == 0x00024C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000250, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_5) == 0x000254, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_5) == 0x000258, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_5) == 0x00025C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_5) == 0x000260, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_5) == 0x000264, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_5) == 0x000268, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00026C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_4) == 0x000270, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x00027C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampAngle_ReturnValue) == 0x000304, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_ClampAxis_ReturnValue_3) == 0x000308, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_ClampAxis_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_5) == 0x00030C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000318, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x00031C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeRotator_ReturnValue_6) == 0x0003A4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeRotator_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x0003B0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Roll_6) == 0x0003B4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Roll_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Pitch_6) == 0x0003B8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Pitch_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakRotator_Yaw_6) == 0x0003BC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakRotator_Yaw_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003C0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetActorRightVector_ReturnValue) == 0x0003C4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetActorForwardVector_ReturnValue) == 0x0003D0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003DC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_X_6) == 0x0003E0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_X_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Y_6) == 0x0003E4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Y_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_BreakVector_Z_6) == 0x0003E8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_BreakVector_Z_6' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003EC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x0003F8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000480, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Add_VectorVector_ReturnValue) == 0x00048C, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Normal_ReturnValue) == 0x000498, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetCharacterSurfaceMoveScale_Result) == 0x0004A4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetCharacterSurfaceMoveScale_Result' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0004A8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetRealspaceInvertY_Result) == 0x0004AC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetRealspaceInvertY_Result' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetRealspaceLookSensitivity_Result) == 0x0004B0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetRealspaceLookSensitivity_Result' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, K2Node_Select_Default) == 0x0004B4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0004B8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetActiveMoveControl_ActiveMoveControl) == 0x0004C0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetActiveMoveControl_ActiveMoveControl' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004C8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_GetValue_ReturnValue) == 0x0004CC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0004D0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0004D4, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_MakeVector2D_ReturnValue_1) == 0x0004D8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x0004E0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0004E8, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_Array_LastIndex_ReturnValue) == 0x0004EC, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0004F0, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0004F1, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_MoveControlManager_C_UpdateMoveControls, CallFunc_UpdateMoveControl_ShouldExpire) == 0x0004F2, "Member 'COMP_MoveControlManager_C_UpdateMoveControls::CallFunc_UpdateMoveControl_ShouldExpire' has a wrong offset!");

// Function COMP_MoveControlManager.COMP_MoveControlManager_C.RegisterMoveControl
// 0x0028 (0x0028 - 0x0000)
struct COMP_MoveControlManager_C_RegisterMoveControl final
{
public:
	class UMOVECONTROL_Base_C*                    MoveControl;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LowPriority;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
