#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_PhysInstancedStaticMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C.ExecuteUbergraph_COMP_PhysInstancedStaticMesh
// 0x0048 (0x0048 - 0x0000)
struct COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InstanceIndex, struct FVector& ImpactLocation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh) == 0x000008, "Wrong alignment on COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh");
static_assert(sizeof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh) == 0x000048, "Wrong size on COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, EntryPoint) == 0x000000, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, Temp_object_Variable) == 0x000030, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, K2Node_DynamicCast_AsSound_Cue) == 0x000038, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'COMP_PhysInstancedStaticMesh_C_ExecuteUbergraph_COMP_PhysInstancedStaticMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C.OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC
// 0x0008 (0x0008 - 0x0000)
struct COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC) == 0x000008, "Wrong alignment on COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC");
static_assert(sizeof(COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC) == 0x000008, "Wrong size on COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC, Loaded) == 0x000000, "Member 'COMP_PhysInstancedStaticMesh_C_OnLoaded_6A37EC2342E02CA790119BAF99DDA4DC::Loaded' has a wrong offset!");

// Function COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C.SetCollisionSoundCue
// 0x0030 (0x0030 - 0x0000)
struct COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue final
{
public:
	TSoftObjectPtr<class USoundCue>               SoundCue;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue) == 0x000008, "Wrong alignment on COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue");
static_assert(sizeof(COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue) == 0x000030, "Wrong size on COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue, SoundCue) == 0x000000, "Member 'COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue::SoundCue' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000028, "Member 'COMP_PhysInstancedStaticMesh_C_SetCollisionSoundCue::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C.EVENT_OnInstanceCollision
// 0x0014 (0x0014 - 0x0000)
struct COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision final
{
public:
	int32                                         InstanceIndex;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0004(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision) == 0x000004, "Wrong alignment on COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision");
static_assert(sizeof(COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision) == 0x000014, "Wrong size on COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision, InstanceIndex) == 0x000000, "Member 'COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision::InstanceIndex' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision, ImpactLocation) == 0x000004, "Member 'COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision::ImpactLocation' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'COMP_PhysInstancedStaticMesh_C_EVENT_OnInstanceCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_PhysInstancedStaticMesh.COMP_PhysInstancedStaticMesh_C.TryCollideWithWorld
// 0x0088 (0x0088 - 0x0000)
struct COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld final
{
public:
	struct FVector                                LastCentroid;                                      // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrCentroid;                                      // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CylinderVector;                                    // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadius;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutCollisionPoint;                                 // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutCollisionNormal;                                // 0x0034(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutPenetrationDepth;                               // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFloorForAgentCapsule_OutCollisionPoint; // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFloorForAgentCapsule_OutCollisionNormal; // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloorForAgentCapsule_OutPenetrationDepth; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloorForAgentCapsule_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld) == 0x000008, "Wrong alignment on COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld");
static_assert(sizeof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld) == 0x000088, "Wrong size on COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, LastCentroid) == 0x000000, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::LastCentroid' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CurrCentroid) == 0x00000C, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CurrCentroid' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CylinderVector) == 0x000018, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CylinderVector' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CapsuleRadius) == 0x000024, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CapsuleRadius' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, OutCollisionPoint) == 0x000028, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::OutCollisionPoint' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, OutCollisionNormal) == 0x000034, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::OutCollisionNormal' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, OutPenetrationDepth) == 0x000040, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::OutPenetrationDepth' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, ReturnValue) == 0x000044, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, GameInstance) == 0x000048, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::GameInstance' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CallFunc_GetFloorForAgentCapsule_OutCollisionPoint) == 0x000050, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CallFunc_GetFloorForAgentCapsule_OutCollisionPoint' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CallFunc_GetFloorForAgentCapsule_OutCollisionNormal) == 0x00005C, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CallFunc_GetFloorForAgentCapsule_OutCollisionNormal' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CallFunc_GetFloorForAgentCapsule_OutPenetrationDepth) == 0x000068, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CallFunc_GetFloorForAgentCapsule_OutPenetrationDepth' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CallFunc_GetFloorForAgentCapsule_ReturnValue) == 0x00006C, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CallFunc_GetFloorForAgentCapsule_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, K2Node_DynamicCast_AsGI_Single_Player) == 0x000078, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'COMP_PhysInstancedStaticMesh_C_TryCollideWithWorld::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

