#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_WirePuzzle_Cell_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_WirePlugState_structs.hpp"
#include "STRUCT_WirePuzzle_CellData_structs.hpp"
#include "ENUM_CardinalDirection_structs.hpp"
#include "STRUCT_TraceInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.ExecuteUbergraph_COMP_WirePuzzle_Cell_Base
// 0x0008 (0x0008 - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base) == 0x000004, "Wrong alignment on COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base");
static_assert(sizeof(COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base) == 0x000008, "Wrong size on COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base, EntryPoint) == 0x000000, "Member 'COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'COMP_WirePuzzle_Cell_Base_C_ExecuteUbergraph_COMP_WirePuzzle_Cell_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_WirePuzzle_Cell_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_WirePuzzle_Cell_Base_C_ReceiveTick");
static_assert(sizeof(COMP_WirePuzzle_Cell_Base_C_ReceiveTick) == 0x000004, "Wrong size on COMP_WirePuzzle_Cell_Base_C_ReceiveTick");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_WirePuzzle_Cell_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.InitializeCell
// 0x0238 (0x0238 - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_InitializeCell final
{
public:
	struct FSTRUCT_WirePuzzle_CellData            InitialCellData;                                   // 0x0000(0x0068)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable;                              // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Temp_struct_Variable_1;                            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Temp_struct_Variable_2;                            // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Temp_struct_Variable_3;                            // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class AWIREPUZZLE_WirePlug_C*                 CallFunc_GetWirePlug_Plug;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0108(0x0010)(ReferenceParm)
	TDelegate<void(int32 TotalPowerLevel)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	struct FSTRUCT_WirePuzzle_CellData            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0128(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default_2;                           // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(COMP_WirePuzzle_Cell_Base_C_InitializeCell) == 0x000008, "Wrong alignment on COMP_WirePuzzle_Cell_Base_C_InitializeCell");
static_assert(sizeof(COMP_WirePuzzle_Cell_Base_C_InitializeCell) == 0x000238, "Wrong size on COMP_WirePuzzle_Cell_Base_C_InitializeCell");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, InitialCellData) == 0x000000, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::InitialCellData' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_bool_Variable) == 0x000068, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_int_Variable) == 0x00006C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_struct_Variable) == 0x000070, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_struct_Variable_1) == 0x00007C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_struct_Variable_2) == 0x000088, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_struct_Variable_3) == 0x000094, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000A8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_MakeArray_Array) == 0x0000C0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_GetWirePlug_Plug) == 0x0000D0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_GetWirePlug_Plug' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_Select_Default) == 0x0000D8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000F0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_int_Variable_1) == 0x0000F8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000FC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_SwitchEnum_CmpSuccess) == 0x000100, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000101, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_SetStaticMesh_ReturnValue) == 0x000102, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000108, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_GetDataTableRowFromName_OutRow) == 0x000128, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000190, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, Temp_bool_Variable_1) == 0x000191, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_Select_Default_1) == 0x000194, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_SelectVector_ReturnValue) == 0x000198, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, K2Node_Select_Default_2) == 0x0001A4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeCell, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001B0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeCell::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.InitializeSocketsAndTraces
// 0x0208 (0x0208 - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces final
{
public:
	struct FSTRUCT_WirePuzzle_CellData            InitialCellData;                                   // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      TracesFromTraceInfo;                               // 0x0068(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_TraceInfo                      CallFunc_Array_Get_Item;                           // 0x00D8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item_2;                         // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_MirrorTrace_MirroredTrace;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_TraceInfo                      CallFunc_Array_Get_Item_3;                         // 0x0114(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_RotateTrace_RotatedTrace;                 // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item_4;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_6;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item_7;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_MirrorTrace_MirroredTrace_1;              // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_8;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MirrorSlot_Result;                        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_9;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_11;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MirrorSlot_Result_1;                      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_10;                        // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MirrorSlot_Result_2;                      // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RotateSocket_RotatedSocket;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_11;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_RotateTrace_RotatedTrace_1;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RotateSocket_RotatedSocket_1;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_11;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_11;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RotateSocket_RotatedSocket_2;             // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces) == 0x000008, "Wrong alignment on COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces");
static_assert(sizeof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces) == 0x000208, "Wrong size on COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, InitialCellData) == 0x000000, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::InitialCellData' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, TracesFromTraceInfo) == 0x000068, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::TracesFromTraceInfo' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable) == 0x000078, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_1) == 0x000084, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_2) == 0x000088, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_2) == 0x000090, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_3) == 0x00009C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_4) == 0x0000A0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_5) == 0x0000A4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_3) == 0x0000A8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000AC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_6) == 0x0000B0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_4) == 0x0000B4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_5) == 0x0000B8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000BC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000C0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_7) == 0x0000C4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_8) == 0x0000C8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_6) == 0x0000CC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000D0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_9) == 0x0000D4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_1) == 0x0000F4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_2) == 0x0000FC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_2) == 0x000104, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_MirrorTrace_MirroredTrace) == 0x000108, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_MirrorTrace_MirroredTrace' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_1) == 0x000110, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_3) == 0x000114, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_3) == 0x000124, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_RotateTrace_RotatedTrace) == 0x00012C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_RotateTrace_RotatedTrace' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_7) == 0x000134, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_7) == 0x000138, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_4) == 0x00013C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_5) == 0x000140, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000144, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_4) == 0x000148, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_6) == 0x000150, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_2) == 0x000154, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_5) == 0x000158, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_7) == 0x00015C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_3) == 0x000160, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_6) == 0x000164, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_8) == 0x000168, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_4) == 0x00016C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_7) == 0x000170, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_9) == 0x000178, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_MirrorTrace_MirroredTrace_1) == 0x00017C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_MirrorTrace_MirroredTrace_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_5) == 0x000184, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_8) == 0x000188, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_10) == 0x00018C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_MirrorSlot_Result) == 0x000190, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_MirrorSlot_Result' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_6) == 0x000194, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_9) == 0x000198, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Length_ReturnValue_11) == 0x00019C, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Length_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_MirrorSlot_Result_1) == 0x0001A0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_MirrorSlot_Result_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_7) == 0x0001A4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_8) == 0x0001A8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_8) == 0x0001AC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_8) == 0x0001B0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_9) == 0x0001B4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_10) == 0x0001B8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_10) == 0x0001BC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_MirrorSlot_Result_2) == 0x0001C0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_MirrorSlot_Result_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_9) == 0x0001C4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_9) == 0x0001C8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_10) == 0x0001CC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_RotateSocket_RotatedSocket) == 0x0001D0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_RotateSocket_RotatedSocket' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_10) == 0x0001D4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_10) == 0x0001D8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Loop_Counter_Variable_11) == 0x0001DC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Loop_Counter_Variable_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_RotateTrace_RotatedTrace_1) == 0x0001E0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_RotateTrace_RotatedTrace_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Less_IntInt_ReturnValue_11) == 0x0001E8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Less_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Add_IntInt_ReturnValue_11) == 0x0001EC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Add_IntInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_RotateSocket_RotatedSocket_1) == 0x0001F0, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_RotateSocket_RotatedSocket_1' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, Temp_int_Array_Index_Variable_11) == 0x0001F4, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::Temp_int_Array_Index_Variable_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Array_Get_Item_11) == 0x0001F8, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_RotateSocket_RotatedSocket_2) == 0x0001FC, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_RotateSocket_RotatedSocket_2' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces, CallFunc_Greater_IntInt_ReturnValue) == 0x000200, "Member 'COMP_WirePuzzle_Cell_Base_C_InitializeSocketsAndTraces::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.MirrorSlot
// 0x000C (0x000C - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_MirrorSlot final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_WirePuzzle_Cell_Base_C_MirrorSlot) == 0x000004, "Wrong alignment on COMP_WirePuzzle_Cell_Base_C_MirrorSlot");
static_assert(sizeof(COMP_WirePuzzle_Cell_Base_C_MirrorSlot) == 0x00000C, "Wrong size on COMP_WirePuzzle_Cell_Base_C_MirrorSlot");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_MirrorSlot, Slot) == 0x000000, "Member 'COMP_WirePuzzle_Cell_Base_C_MirrorSlot::Slot' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_MirrorSlot, Result) == 0x000004, "Member 'COMP_WirePuzzle_Cell_Base_C_MirrorSlot::Result' has a wrong offset!");
static_assert(offsetof(COMP_WirePuzzle_Cell_Base_C_MirrorSlot, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'COMP_WirePuzzle_Cell_Base_C_MirrorSlot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function COMP_WirePuzzle_Cell_Base.COMP_WirePuzzle_Cell_Base_C.InteractWithCell
// 0x00D0 (0x00D0 - 0x0000)
struct COMP_WirePuzzle_Cell_Base_C_InteractWithCell final
{
public:
	struct FVector2D                              ProgressParameters;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CurrentTrace;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_WirePuzzle_Cell_Base_C*           CellToPower;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSocket;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NewEnabledOutputSockets;                           // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 AllAdjustedOutputSockets;                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetModifiedCellParameters_Param;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalInputPowerLevel_PowerLevel;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTargetPower_Result;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetEnabledOutputSockets_InitialEnabledOutputSockets; // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
