#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_PlayerCameraEffects

#include "Basic.hpp"

#include "STRUCT_CameraEffectInstance_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.ExecuteUbergraph_COMP_PlayerCameraEffects
// 0x0028 (0x0028 - 0x0000)
struct COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Reversed;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects) == 0x000008, "Wrong alignment on COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects");
static_assert(sizeof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects) == 0x000028, "Wrong size on COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, EntryPoint) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, K2Node_CustomEvent_Reversed) == 0x000008, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::K2Node_CustomEvent_Reversed' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000018, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'COMP_PlayerCameraEffects_C_ExecuteUbergraph_COMP_PlayerCameraEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_PlayerCameraEffects_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_PlayerCameraEffects_C_ReceiveTick");
static_assert(sizeof(COMP_PlayerCameraEffects_C_ReceiveTick) == 0x000004, "Wrong size on COMP_PlayerCameraEffects_C_ReceiveTick");
static_assert(offsetof(COMP_PlayerCameraEffects_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.BeginCyberspaceGreenGrid
// 0x0001 (0x0001 - 0x0000)
struct COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid final
{
public:
	bool                                          Reversed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid) == 0x000001, "Wrong alignment on COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid");
static_assert(sizeof(COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid) == 0x000001, "Wrong size on COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid");
static_assert(offsetof(COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid, Reversed) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_BeginCyberspaceGreenGrid::Reversed' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.AddScreenShakeEffect
// 0x0018 (0x0018 - 0x0000)
struct COMP_PlayerCameraEffects_C_AddScreenShakeEffect final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect) == 0x000004, "Wrong alignment on COMP_PlayerCameraEffects_C_AddScreenShakeEffect");
static_assert(sizeof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect) == 0x000018, "Wrong size on COMP_PlayerCameraEffects_C_AddScreenShakeEffect");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect, Scale) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_AddScreenShakeEffect::Scale' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect, Direction) == 0x000004, "Member 'COMP_PlayerCameraEffects_C_AddScreenShakeEffect::Direction' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_AddScreenShakeEffect::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddScreenShakeEffect, CallFunc_Ease_ReturnValue) == 0x000014, "Member 'COMP_PlayerCameraEffects_C_AddScreenShakeEffect::CallFunc_Ease_ReturnValue' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.UpdateBloodEffects
// 0x005C (0x005C - 0x0000)
struct COMP_PlayerCameraEffects_C_UpdateBloodEffects final
{
public:
	bool                                          ForceUpdate;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CameraEffectInstance           CurrentInstance;                                   // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Value;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighestValue;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Index;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CameraEffectInstance           CallFunc_Array_Get_Item;                           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRampUpRampDown_NewValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRampUpRampDown_IsFinished;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_UpdateBloodEffects) == 0x000004, "Wrong alignment on COMP_PlayerCameraEffects_C_UpdateBloodEffects");
static_assert(sizeof(COMP_PlayerCameraEffects_C_UpdateBloodEffects) == 0x00005C, "Wrong size on COMP_PlayerCameraEffects_C_UpdateBloodEffects");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, ForceUpdate) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::ForceUpdate' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CurrentInstance) == 0x000004, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CurrentInstance' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, Current_Value) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::Current_Value' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, HighestValue) == 0x000014, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::HighestValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, Current_Index) == 0x000018, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::Current_Index' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Array_Get_Item) == 0x000028, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Max_ReturnValue) == 0x00003C, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000044, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_GetRampUpRampDown_NewValue) == 0x000048, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_GetRampUpRampDown_NewValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_GetRampUpRampDown_IsFinished) == 0x00004C, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_GetRampUpRampDown_IsFinished' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_UpdateBloodEffects, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'COMP_PlayerCameraEffects_C_UpdateBloodEffects::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.AddDamageEffects
// 0x00E0 (0x00E0 - 0x0000)
struct COMP_PlayerCameraEffects_C_AddDamageEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribDamageType*                      DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SourceActor;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseMagnitude;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DirectionIndex;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health_Max;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health_Current;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeDamage;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageReceived;                                    // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDamageDirectionIndex_Result;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_2;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_3;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CameraEffectInstance           K2Node_MakeStruct_STRUCT_CameraEffectInstance;     // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxValue_ReturnValue;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CameraEffectInstance           K2Node_MakeStruct_STRUCT_CameraEffectInstance_1;   // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_AddDamageEffects) == 0x000008, "Wrong alignment on COMP_PlayerCameraEffects_C_AddDamageEffects");
static_assert(sizeof(COMP_PlayerCameraEffects_C_AddDamageEffects) == 0x0000E0, "Wrong size on COMP_PlayerCameraEffects_C_AddDamageEffects");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, Damage) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::Damage' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, DamageType) == 0x000008, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::DamageType' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, ImpactData) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::ImpactData' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, SourceActor) == 0x000018, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::SourceActor' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, ImpulseMagnitude) == 0x000020, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::ImpulseMagnitude' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, DirectionIndex) == 0x000024, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::DirectionIndex' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, Health_Max) == 0x000028, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::Health_Max' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, Health_Current) == 0x00002C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::Health_Current' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, RelativeDamage) == 0x000030, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::RelativeDamage' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, DamageReceived) == 0x000034, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::DamageReceived' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_FMin_ReturnValue) == 0x00003C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Lerp_ReturnValue) == 0x000044, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_FClamp_ReturnValue) == 0x00004C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Lerp_ReturnValue_1) == 0x000054, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Normal_ReturnValue) == 0x000058, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000064, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_FMin_ReturnValue_1) == 0x000068, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00006C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00006D, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00006E, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00006F, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_BooleanOR_ReturnValue) == 0x000070, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetDamageDirectionIndex_Result) == 0x000074, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetDamageDirectionIndex_Result' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000078, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00007C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_FMin_ReturnValue_2) == 0x000080, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_FMin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000084, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Lerp_ReturnValue_2) == 0x000088, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00008C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000090, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Lerp_ReturnValue_3) == 0x000094, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000098, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_FMin_ReturnValue_3) == 0x00009C, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_FMin_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0000A0, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Lerp_ReturnValue_4) == 0x0000A4, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x0000A8, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, K2Node_MakeStruct_STRUCT_CameraEffectInstance) == 0x0000AC, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::K2Node_MakeStruct_STRUCT_CameraEffectInstance' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetAttribInstance_ReturnValue) == 0x0000B8, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetMaxValue_ReturnValue) == 0x0000C0, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetValue_ReturnValue) == 0x0000C4, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x0000C8, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, K2Node_MakeStruct_STRUCT_CameraEffectInstance_1) == 0x0000CC, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::K2Node_MakeStruct_STRUCT_CameraEffectInstance_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_AddDamageEffects, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'COMP_PlayerCameraEffects_C_AddDamageEffects::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.SetupAttribEvents
// 0x0050 (0x0050 - 0x0000)
struct COMP_PlayerCameraEffects_C_SetupAttribEvents final
{
public:
	class UAttribInstance*                        DisableAttribInstance;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        HealthAttribInstance;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxValue_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue, float MaxValue, EModApplyType ApplyType)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetOrCreateAttribInstance_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_SetupAttribEvents) == 0x000008, "Wrong alignment on COMP_PlayerCameraEffects_C_SetupAttribEvents");
static_assert(sizeof(COMP_PlayerCameraEffects_C_SetupAttribEvents) == 0x000050, "Wrong size on COMP_PlayerCameraEffects_C_SetupAttribEvents");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, DisableAttribInstance) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::DisableAttribInstance' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, HealthAttribInstance) == 0x000008, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::HealthAttribInstance' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_GetValue_ReturnValue) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_GetMaxValue_ReturnValue) == 0x000014, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_GetMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_GetValue_ReturnValue_1) == 0x000018, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_GetAttribInstance_ReturnValue) == 0x000040, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_SetupAttribEvents, CallFunc_GetOrCreateAttribInstance_ReturnValue) == 0x000048, "Member 'COMP_PlayerCameraEffects_C_SetupAttribEvents::CallFunc_GetOrCreateAttribInstance_ReturnValue' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.GetRampUpRampDown
// 0x0070 (0x0070 - 0x0000)
struct COMP_PlayerCameraEffects_C_GetRampUpRampDown final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaintainDuration;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RampUpDuration;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RampDownDuration;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetValue;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeSinceStart;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_RampDown;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_RampUp;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Maintain;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value_Target;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Current;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Start;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PlayerCameraEffects_C_GetRampUpRampDown) == 0x000004, "Wrong alignment on COMP_PlayerCameraEffects_C_GetRampUpRampDown");
static_assert(sizeof(COMP_PlayerCameraEffects_C_GetRampUpRampDown) == 0x000070, "Wrong size on COMP_PlayerCameraEffects_C_GetRampUpRampDown");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, StartTime) == 0x000000, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::StartTime' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CurrentTime) == 0x000004, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CurrentTime' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, MaintainDuration) == 0x000008, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::MaintainDuration' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, RampUpDuration) == 0x00000C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::RampUpDuration' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, RampDownDuration) == 0x000010, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::RampDownDuration' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, TargetValue) == 0x000014, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::TargetValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, NewValue) == 0x000018, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::NewValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, IsFinished) == 0x00001C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::IsFinished' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, TimeSinceStart) == 0x000020, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::TimeSinceStart' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Time_RampDown) == 0x000024, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Time_RampDown' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Time_RampUp) == 0x000028, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Time_RampUp' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Time_Maintain) == 0x00002C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Time_Maintain' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Value_Target) == 0x000030, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Value_Target' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Time_Current) == 0x000034, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Time_Current' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, Time_Start) == 0x000038, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::Time_Start' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Ease_ReturnValue) == 0x000048, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Less_FloatFloat_ReturnValue) == 0x00004C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000054, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000058, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000060, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000064, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000068, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PlayerCameraEffects_C_GetRampUpRampDown, CallFunc_Ease_ReturnValue_1) == 0x00006C, "Member 'COMP_PlayerCameraEffects_C_GetRampUpRampDown::CallFunc_Ease_ReturnValue_1' has a wrong offset!");

// Function COMP_PlayerCameraEffects.COMP_PlayerCameraEffects_C.UpdateDamageDirectionEffects
// 0x00A8 (0x00A8 - 0x0000)
struct COMP_PlayerCameraEffects_C_UpdateDamageDirectionEffects final
{
public:
	class UWidget*                                DamageIndicator;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CameraEffectInstance           CurrentInstance;                                   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentValue;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DirectionIndex;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           DamageIndicatorPanel;                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
