#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_HackerInventory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_WeaponRecoilTemplate_structs.hpp"


namespace SDK::Params
{

// Function COMP_HackerInventory.COMP_HackerInventory_C.OnWeaponHolstered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature final
{
public:
	class UITEM_WeaponBase_C*                     Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature");
static_assert(sizeof(COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature) == 0x000008, "Wrong size on COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature");
static_assert(offsetof(COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature, Weapon) == 0x000000, "Member 'COMP_HackerInventory_C_OnWeaponHolstered__DelegateSignature::Weapon' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.OnWeaponDrawn__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature final
{
public:
	class UITEM_WeaponBase_C*                     Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature");
static_assert(sizeof(COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature) == 0x000008, "Wrong size on COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature");
static_assert(offsetof(COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature, Weapon) == 0x000000, "Member 'COMP_HackerInventory_C_OnWeaponDrawn__DelegateSignature::Weapon' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.OnEquippedWeaponChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature final
{
public:
	class UITEM_WeaponBase_C*                     EquippedWeapon;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature");
static_assert(sizeof(COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature) == 0x000008, "Wrong size on COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature");
static_assert(offsetof(COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature, EquippedWeapon) == 0x000000, "Member 'COMP_HackerInventory_C_OnEquippedWeaponChanged__DelegateSignature::EquippedWeapon' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.ExecuteUbergraph_COMP_HackerInventory
// 0x0008 (0x0008 - 0x0000)
struct COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory) == 0x000004, "Wrong alignment on COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory");
static_assert(sizeof(COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory) == 0x000008, "Wrong size on COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory");
static_assert(offsetof(COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory, EntryPoint) == 0x000000, "Member 'COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'COMP_HackerInventory_C_ExecuteUbergraph_COMP_HackerInventory::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_HackerInventory_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_HackerInventory_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_HackerInventory_C_ReceiveTick");
static_assert(sizeof(COMP_HackerInventory_C_ReceiveTick) == 0x000004, "Wrong size on COMP_HackerInventory_C_ReceiveTick");
static_assert(offsetof(COMP_HackerInventory_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_HackerInventory_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.HasDiscoveredHeroicItem
// 0x0020 (0x0020 - 0x0000)
struct COMP_HackerInventory_C_HasDiscoveredHeroicItem final
{
public:
	class UClass*                                 HeroicItemClass;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetHeroicItemClass_HeroicItemClass;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_HasDiscoveredHeroicItem) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_HasDiscoveredHeroicItem");
static_assert(sizeof(COMP_HackerInventory_C_HasDiscoveredHeroicItem) == 0x000020, "Wrong size on COMP_HackerInventory_C_HasDiscoveredHeroicItem");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredHeroicItem, HeroicItemClass) == 0x000000, "Member 'COMP_HackerInventory_C_HasDiscoveredHeroicItem::HeroicItemClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredHeroicItem, Result) == 0x000008, "Member 'COMP_HackerInventory_C_HasDiscoveredHeroicItem::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredHeroicItem, CallFunc_GetHeroicItemClass_HeroicItemClass) == 0x000010, "Member 'COMP_HackerInventory_C_HasDiscoveredHeroicItem::CallFunc_GetHeroicItemClass_HeroicItemClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredHeroicItem, CallFunc_Set_Contains_ReturnValue) == 0x000018, "Member 'COMP_HackerInventory_C_HasDiscoveredHeroicItem::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.HasDiscoveredSuperiorHeroicItem
// 0x0068 (0x0068 - 0x0000)
struct COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem final
{
public:
	class UClass*                                 HeroicItemClass;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 HeroricUpgradeClass;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Upgrade_Base;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_Set_ToArray_Result;                       // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Upgrade_Base_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUpgradeRecurse_Result;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem");
static_assert(sizeof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem) == 0x000068, "Wrong size on COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, HeroicItemClass) == 0x000000, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::HeroicItemClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, Result) == 0x000008, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, HeroricUpgradeClass) == 0x000010, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::HeroricUpgradeClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, K2Node_ClassDynamicCast_AsITEM_Upgrade_Base) == 0x000018, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::K2Node_ClassDynamicCast_AsITEM_Upgrade_Base' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, Temp_int_Array_Index_Variable) == 0x000024, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_Set_ToArray_Result) == 0x000030, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_Array_Get_Item) == 0x000048, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, K2Node_ClassDynamicCast_AsITEM_Upgrade_Base_1) == 0x000058, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::K2Node_ClassDynamicCast_AsITEM_Upgrade_Base_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, K2Node_ClassDynamicCast_bSuccess_1) == 0x000060, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem, CallFunc_IsUpgradeRecurse_Result) == 0x000061, "Member 'COMP_HackerInventory_C_HasDiscoveredSuperiorHeroicItem::CallFunc_IsUpgradeRecurse_Result' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.CanPlayHeroicAction
// 0x0068 (0x0068 - 0x0000)
struct COMP_HackerInventory_C_CanPlayHeroicAction final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Montage;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeleporting_Result;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCinematicMontage_Result;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanStandUp_Result;                        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouchingOrTransitioning_Result;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  CallFunc_GetHackerOwner_Hacker;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipmentDisabled_Result;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeroicActionQueued_Result;              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_CanPlayHeroicAction) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_CanPlayHeroicAction");
static_assert(sizeof(COMP_HackerInventory_C_CanPlayHeroicAction) == 0x000068, "Wrong size on COMP_HackerInventory_C_CanPlayHeroicAction");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, Montage) == 0x000000, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::Montage' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, Result) == 0x000028, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, HackerPawn) == 0x000030, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::HackerPawn' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsTeleporting_Result) == 0x000038, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsTeleporting_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000040, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, K2Node_DynamicCast_AsAnim_Montage) == 0x000048, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsCinematicMontage_Result) == 0x000051, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsCinematicMontage_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_CanStandUp_Result) == 0x000052, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_CanStandUp_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsCrouchingOrTransitioning_Result) == 0x000053, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsCrouchingOrTransitioning_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_GetHackerOwner_Hacker) == 0x000058, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_GetHackerOwner_Hacker' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000061, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsEquipmentDisabled_Result) == 0x000062, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsEquipmentDisabled_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_IsHeroicActionQueued_Result) == 0x000063, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_IsHeroicActionQueued_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_Not_PreBool_ReturnValue_2) == 0x000064, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_CanPlayHeroicAction, CallFunc_Not_PreBool_ReturnValue_3) == 0x000065, "Member 'COMP_HackerInventory_C_CanPlayHeroicAction::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.IsHeroicActionQueued
// 0x0002 (0x0002 - 0x0000)
struct COMP_HackerInventory_C_IsHeroicActionQueued final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_IsHeroicActionQueued) == 0x000001, "Wrong alignment on COMP_HackerInventory_C_IsHeroicActionQueued");
static_assert(sizeof(COMP_HackerInventory_C_IsHeroicActionQueued) == 0x000002, "Wrong size on COMP_HackerInventory_C_IsHeroicActionQueued");
static_assert(offsetof(COMP_HackerInventory_C_IsHeroicActionQueued, Result) == 0x000000, "Member 'COMP_HackerInventory_C_IsHeroicActionQueued::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_IsHeroicActionQueued, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'COMP_HackerInventory_C_IsHeroicActionQueued::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.HasQueuedCinematicHeroicAction
// 0x0003 (0x0003 - 0x0000)
struct COMP_HackerInventory_C_HasQueuedCinematicHeroicAction final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCinematicMontage_Result;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_HasQueuedCinematicHeroicAction) == 0x000001, "Wrong alignment on COMP_HackerInventory_C_HasQueuedCinematicHeroicAction");
static_assert(sizeof(COMP_HackerInventory_C_HasQueuedCinematicHeroicAction) == 0x000003, "Wrong size on COMP_HackerInventory_C_HasQueuedCinematicHeroicAction");
static_assert(offsetof(COMP_HackerInventory_C_HasQueuedCinematicHeroicAction, Result) == 0x000000, "Member 'COMP_HackerInventory_C_HasQueuedCinematicHeroicAction::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasQueuedCinematicHeroicAction, CallFunc_IsCinematicMontage_Result) == 0x000001, "Member 'COMP_HackerInventory_C_HasQueuedCinematicHeroicAction::CallFunc_IsCinematicMontage_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_HasQueuedCinematicHeroicAction, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'COMP_HackerInventory_C_HasQueuedCinematicHeroicAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.GetOverrideHandheldDisplayProperties
// 0x0050 (0x0050 - 0x0000)
struct COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimInstanceClass;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_DisplayItem_C> K2Node_DynamicCast_AsINTERF_Display_Item;          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetDisplayProperties_SkeletalMesh;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetDisplayProperties_AnimInstanceClass;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetDisplayProperties_OverrideMaterial;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties");
static_assert(sizeof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties) == 0x000050, "Wrong size on COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, SkeletalMesh) == 0x000000, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, AnimInstanceClass) == 0x000008, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, OverrideMaterial) == 0x000010, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::OverrideMaterial' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, K2Node_DynamicCast_AsINTERF_Display_Item) == 0x000018, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::K2Node_DynamicCast_AsINTERF_Display_Item' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, CallFunc_GetDisplayProperties_SkeletalMesh) == 0x000030, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::CallFunc_GetDisplayProperties_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, CallFunc_GetDisplayProperties_AnimInstanceClass) == 0x000038, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::CallFunc_GetDisplayProperties_AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, CallFunc_GetDisplayProperties_OverrideMaterial) == 0x000040, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::CallFunc_GetDisplayProperties_OverrideMaterial' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'COMP_HackerInventory_C_GetOverrideHandheldDisplayProperties::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.GrantHeroicItem
// 0x00D8 (0x00D8 - 0x0000)
struct COMP_HackerInventory_C_GrantHeroicItem final
{
public:
	class UITEM_Base_C*                           HeroicItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            HeroicMontage;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UInventoryBag_C*                        PreferredBag;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreferredSlotIndex;                                // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    PlayerHUDWidget;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_RemoveItem_RemovedItem;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  CallFunc_GetHackerOwner_Hacker;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory_1;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWaitingToHolster_Result;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInventoryVisible_Result;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_GrantHeroicItem) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_GrantHeroicItem");
static_assert(sizeof(COMP_HackerInventory_C_GrantHeroicItem) == 0x0000D8, "Wrong size on COMP_HackerInventory_C_GrantHeroicItem");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, HeroicItem) == 0x000000, "Member 'COMP_HackerInventory_C_GrantHeroicItem::HeroicItem' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, HeroicMontage) == 0x000008, "Member 'COMP_HackerInventory_C_GrantHeroicItem::HeroicMontage' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, PreferredBag) == 0x000030, "Member 'COMP_HackerInventory_C_GrantHeroicItem::PreferredBag' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, PreferredSlotIndex) == 0x000038, "Member 'COMP_HackerInventory_C_GrantHeroicItem::PreferredSlotIndex' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, PlayerHUDWidget) == 0x000040, "Member 'COMP_HackerInventory_C_GrantHeroicItem::PlayerHUDWidget' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, HackerPawn) == 0x000048, "Member 'COMP_HackerInventory_C_GrantHeroicItem::HackerPawn' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_GetBag_Result) == 0x000058, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_GetInventory_Inventory) == 0x000060, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_RemoveItem_RemovedItem) == 0x000068, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_RemoveItem_RemovedItem' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_GetHackerOwner_Hacker) == 0x000078, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_GetHackerOwner_Hacker' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_GetInventory_Inventory_1) == 0x000080, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_GetInventory_Inventory_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000088, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000090, "Member 'COMP_HackerInventory_C_GrantHeroicItem::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'COMP_HackerInventory_C_GrantHeroicItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_GetNeuralHUD_Result) == 0x0000A0, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_GetNeuralHUD_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsWaitingToHolster_Result) == 0x0000A8, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsWaitingToHolster_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsValid_ReturnValue_4) == 0x0000A9, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000B0, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, K2Node_DynamicCast_AsAnim_Montage) == 0x0000B8, "Member 'COMP_HackerInventory_C_GrantHeroicItem::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'COMP_HackerInventory_C_GrantHeroicItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'COMP_HackerInventory_C_GrantHeroicItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_GrantHeroicItem, CallFunc_IsInventoryVisible_Result) == 0x0000D4, "Member 'COMP_HackerInventory_C_GrantHeroicItem::CallFunc_IsInventoryVisible_Result' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.TryAddHeroicItemToInventory
// 0x0040 (0x0040 - 0x0000)
struct COMP_HackerInventory_C_TryAddHeroicItemToInventory final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        BestBag;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddItemToSlot_Result;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_Result;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  CallFunc_GetHackerOwner_Hacker;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_TryAddHeroicItemToInventory) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_TryAddHeroicItemToInventory");
static_assert(sizeof(COMP_HackerInventory_C_TryAddHeroicItemToInventory) == 0x000040, "Wrong size on COMP_HackerInventory_C_TryAddHeroicItemToInventory");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, Result) == 0x000000, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, BestBag) == 0x000008, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::BestBag' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, HackerPawn) == 0x000010, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::HackerPawn' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_AddItemToSlot_Result) == 0x000019, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_AddItemToSlot_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_GetOuterObject_ReturnValue) == 0x000020, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_AddItem_Result) == 0x000028, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_AddItem_Result' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_GetHackerOwner_Hacker) == 0x000030, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_GetHackerOwner_Hacker' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_TryAddHeroicItemToInventory, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'COMP_HackerInventory_C_TryAddHeroicItemToInventory::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function COMP_HackerInventory.COMP_HackerInventory_C.PostInitializeEquipmentState
// 0x0110 (0x0110 - 0x0000)
struct COMP_HackerInventory_C_PostInitializeEquipmentState final
{
public:
	class UITEM_ConsumableBase_C*                 ConsumableBeingHeld;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           HeroicPickupMontage;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     HeroicWeapon;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     CurrentAction;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ExplosiveBase_C*                  K2Node_DynamicCast_AsITEM_Explosive_Base;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_HandheldConsumable_Base_C*        CallFunc_GetOrCreateHandheldItem_HandheldItem;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetOverrideHandheldDisplayProperties_SkeletalMesh; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetOverrideHandheldDisplayProperties_AnimInstanceClass; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetOverrideHandheldDisplayProperties_OverrideMaterial; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetDisplayMesh_Result;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetBestPickupClass_Result;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Deactivate_Result;                        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_ConsumableBase_C*                 K2Node_DynamicCast_AsITEM_Consumable_Base;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_GetCurrentAction_CurrentAction;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  CallFunc_GetHackerOwner_Hacker;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_TryBecomeActivatableImmediately_Result;   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_Result;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(COMP_HackerInventory_C_PostInitializeEquipmentState) == 0x000008, "Wrong alignment on COMP_HackerInventory_C_PostInitializeEquipmentState");
static_assert(sizeof(COMP_HackerInventory_C_PostInitializeEquipmentState) == 0x000110, "Wrong size on COMP_HackerInventory_C_PostInitializeEquipmentState");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, ConsumableBeingHeld) == 0x000000, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::ConsumableBeingHeld' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, HeroicPickupMontage) == 0x000008, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::HeroicPickupMontage' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, HeroicWeapon) == 0x000010, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::HeroicWeapon' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CurrentAction) == 0x000018, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CurrentAction' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, HackerPawn) == 0x000020, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::HackerPawn' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, K2Node_DynamicCast_AsITEM_Explosive_Base) == 0x000028, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::K2Node_DynamicCast_AsITEM_Explosive_Base' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_GetOrCreateHandheldItem_HandheldItem) == 0x000038, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_GetOrCreateHandheldItem_HandheldItem' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_GetOverrideHandheldDisplayProperties_SkeletalMesh) == 0x000048, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_GetOverrideHandheldDisplayProperties_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_GetOverrideHandheldDisplayProperties_AnimInstanceClass) == 0x000050, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_GetOverrideHandheldDisplayProperties_AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_GetOverrideHandheldDisplayProperties_OverrideMaterial) == 0x000058, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_GetOverrideHandheldDisplayProperties_OverrideMaterial' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_HackerInventory_C_PostInitializeEquipmentState, CallFunc_SetDisplayMesh_Result) == 0x000061, "Member 'COMP_HackerInventory_C_PostInitializeEquipmentState::CallFunc_SetDisplayMesh_Result' has a wrong offset!");
