#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_EnemyMovement

#include "Basic.hpp"

#include "ENUM_TargetType_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_SpeedType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_MoveSpeed_structs.hpp"
#include "ENUM_TargetAssignmentType_structs.hpp"


namespace SDK::Params
{

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.OnLocomotionChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature final
{
public:
	bool                                          IsMoving;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature");
static_assert(sizeof(COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature) == 0x000001, "Wrong size on COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature");
static_assert(offsetof(COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature, IsMoving) == 0x000000, "Member 'COMP_EnemyMovement_C_OnLocomotionChanged__DelegateSignature::IsMoving' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.OnTurningChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature final
{
public:
	bool                                          IsTurning;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature");
static_assert(sizeof(COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature) == 0x000001, "Wrong size on COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature");
static_assert(offsetof(COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature, IsTurning) == 0x000000, "Member 'COMP_EnemyMovement_C_OnTurningChanged__DelegateSignature::IsTurning' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.ExecuteUbergraph_COMP_EnemyMovement
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement");
static_assert(sizeof(COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement) == 0x000008, "Wrong size on COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement");
static_assert(offsetof(COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement, EntryPoint) == 0x000000, "Member 'COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'COMP_EnemyMovement_C_ExecuteUbergraph_COMP_EnemyMovement::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct COMP_EnemyMovement_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_ReceiveTick) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_ReceiveTick");
static_assert(sizeof(COMP_EnemyMovement_C_ReceiveTick) == 0x000004, "Wrong size on COMP_EnemyMovement_C_ReceiveTick");
static_assert(offsetof(COMP_EnemyMovement_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'COMP_EnemyMovement_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetMovePath
// 0x00B0 (0x00B0 - 0x0000)
struct COMP_EnemyMovement_C_SetMovePath final
{
public:
	bool                                          AutoStop;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_VoxelCullableNavAgent_C*          TargetNavComponent;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           DetectedPawn;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     NavTarget;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEventLocation_EventLocation;           // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryPathToLocation_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsIdentified_IsDetected;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStopPathing_ReturnValue;               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x9];                                       // 0x0047(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTargetTransform_Result;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPathToTransform_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPathToAgent_ReturnValue;               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_VoxelCullableNavAgent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetNavigationTarget_target;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetMovePath) == 0x000010, "Wrong alignment on COMP_EnemyMovement_C_SetMovePath");
static_assert(sizeof(COMP_EnemyMovement_C_SetMovePath) == 0x0000B0, "Wrong size on COMP_EnemyMovement_C_SetMovePath");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, AutoStop) == 0x000000, "Member 'COMP_EnemyMovement_C_SetMovePath::AutoStop' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, TargetNavComponent) == 0x000008, "Member 'COMP_EnemyMovement_C_SetMovePath::TargetNavComponent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, DetectedPawn) == 0x000010, "Member 'COMP_EnemyMovement_C_SetMovePath::DetectedPawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, NavTarget) == 0x000018, "Member 'COMP_EnemyMovement_C_SetMovePath::NavTarget' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000023, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000028, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetEventLocation_EventLocation) == 0x00002C, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetEventLocation_EventLocation' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000038, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_TryPathToLocation_ReturnValue) == 0x000044, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_TryPathToLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetIsIdentified_IsDetected) == 0x000045, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetIsIdentified_IsDetected' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_TryStopPathing_ReturnValue) == 0x000046, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_TryStopPathing_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetTargetTransform_Result) == 0x000050, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetTargetTransform_Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_TryPathToTransform_ReturnValue) == 0x000080, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_TryPathToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_TryPathToAgent_ReturnValue) == 0x000081, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_TryPathToAgent_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetComponentByClass_ReturnValue) == 0x000088, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetDetectedPawn_Pawn) == 0x000090, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_IsValid_ReturnValue_3) == 0x000099, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, K2Node_SwitchEnum_CmpSuccess) == 0x00009A, "Member 'COMP_EnemyMovement_C_SetMovePath::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMovePath, CallFunc_GetNavigationTarget_target) == 0x0000A0, "Member 'COMP_EnemyMovement_C_SetMovePath::CallFunc_GetNavigationTarget_target' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetBodyTarget
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyMovement_C_SetBodyTarget final
{
public:
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetBodyTarget) == 0x000008, "Wrong alignment on COMP_EnemyMovement_C_SetBodyTarget");
static_assert(sizeof(COMP_EnemyMovement_C_SetBodyTarget) == 0x000008, "Wrong size on COMP_EnemyMovement_C_SetBodyTarget");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyTarget, Target) == 0x000000, "Member 'COMP_EnemyMovement_C_SetBodyTarget::Target' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.UpdateMoveSpeed
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_UpdateMoveSpeed final
{
public:
	float                                         CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_UpdateMoveSpeed) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_UpdateMoveSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_UpdateMoveSpeed) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_UpdateMoveSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_UpdateMoveSpeed, CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent) == 0x000000, "Member 'COMP_EnemyMovement_C_UpdateMoveSpeed::CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_UpdateMoveSpeed, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'COMP_EnemyMovement_C_UpdateMoveSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_UpdateMoveSpeed, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'COMP_EnemyMovement_C_UpdateMoveSpeed::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetTargetMoveSpeed
// 0x0002 (0x0002 - 0x0000)
struct COMP_EnemyMovement_C_SetTargetMoveSpeed final
{
public:
	ENUM_MoveSpeed                                Speed;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SpeedType                                ChangeRate;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetTargetMoveSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_SetTargetMoveSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_SetTargetMoveSpeed) == 0x000002, "Wrong size on COMP_EnemyMovement_C_SetTargetMoveSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_SetTargetMoveSpeed, Speed) == 0x000000, "Member 'COMP_EnemyMovement_C_SetTargetMoveSpeed::Speed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetTargetMoveSpeed, ChangeRate) == 0x000001, "Member 'COMP_EnemyMovement_C_SetTargetMoveSpeed::ChangeRate' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetBodyRotateSpeed
// 0x0003 (0x0003 - 0x0000)
struct COMP_EnemyMovement_C_SetBodyRotateSpeed final
{
public:
	ENUM_SpeedType                                RotateSpeed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changed;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_SetBodyRotateSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_SetBodyRotateSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_SetBodyRotateSpeed) == 0x000003, "Wrong size on COMP_EnemyMovement_C_SetBodyRotateSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyRotateSpeed, RotateSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_SetBodyRotateSpeed::RotateSpeed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyRotateSpeed, Changed) == 0x000001, "Member 'COMP_EnemyMovement_C_SetBodyRotateSpeed::Changed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyRotateSpeed, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'COMP_EnemyMovement_C_SetBodyRotateSpeed::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.CanRotateMoveDirectionInstantly
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly");
static_assert(sizeof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly");
static_assert(offsetof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly, Result) == 0x000000, "Member 'COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly::Result' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly, CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent) == 0x000004, "Member 'COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly::CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x000008, "Member 'COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'COMP_EnemyMovement_C_CanRotateMoveDirectionInstantly::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetMoveDirection_Current
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_GetMoveDirection_Current final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetMoveDirection_Current) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_GetMoveDirection_Current");
static_assert(sizeof(COMP_EnemyMovement_C_GetMoveDirection_Current) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_GetMoveDirection_Current");
static_assert(offsetof(COMP_EnemyMovement_C_GetMoveDirection_Current, Direction) == 0x000000, "Member 'COMP_EnemyMovement_C_GetMoveDirection_Current::Direction' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetMoveDirection_RotationSpeed
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed final
{
public:
	ENUM_SpeedType                                RotationSpeed;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed) == 0x000001, "Wrong size on COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed, RotationSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_GetMoveDirection_RotationSpeed::RotationSpeed' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetMoveDirection_Current
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_SetMoveDirection_Current final
{
public:
	struct FVector                                MoveDirection;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetMoveDirection_Current) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_SetMoveDirection_Current");
static_assert(sizeof(COMP_EnemyMovement_C_SetMoveDirection_Current) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_SetMoveDirection_Current");
static_assert(offsetof(COMP_EnemyMovement_C_SetMoveDirection_Current, MoveDirection) == 0x000000, "Member 'COMP_EnemyMovement_C_SetMoveDirection_Current::MoveDirection' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetMoveDirection_RotationSpeed
// 0x0003 (0x0003 - 0x0000)
struct COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed final
{
public:
	ENUM_SpeedType                                RotationSpeed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changed;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed) == 0x000003, "Wrong size on COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed, RotationSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed::RotationSpeed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed, Changed) == 0x000001, "Member 'COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed::Changed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'COMP_EnemyMovement_C_SetMoveDirection_RotationSpeed::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetTargetMoveSpeed
// 0x0002 (0x0002 - 0x0000)
struct COMP_EnemyMovement_C_GetTargetMoveSpeed final
{
public:
	ENUM_MoveSpeed                                MoveSpeed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SpeedType                                ChangeRate;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetTargetMoveSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_GetTargetMoveSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_GetTargetMoveSpeed) == 0x000002, "Wrong size on COMP_EnemyMovement_C_GetTargetMoveSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_GetTargetMoveSpeed, MoveSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_GetTargetMoveSpeed::MoveSpeed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetTargetMoveSpeed, ChangeRate) == 0x000001, "Member 'COMP_EnemyMovement_C_GetTargetMoveSpeed::ChangeRate' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetMoveSpeedValue
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_GetMoveSpeedValue final
{
public:
	ENUM_MoveSpeed                                MoveSpeed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_GetMoveSpeedValue) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_GetMoveSpeedValue");
static_assert(sizeof(COMP_EnemyMovement_C_GetMoveSpeedValue) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_GetMoveSpeedValue");
static_assert(offsetof(COMP_EnemyMovement_C_GetMoveSpeedValue, MoveSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_GetMoveSpeedValue::MoveSpeed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetMoveSpeedValue, Speed) == 0x000004, "Member 'COMP_EnemyMovement_C_GetMoveSpeedValue::Speed' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetMoveSpeedValue, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'COMP_EnemyMovement_C_GetMoveSpeedValue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetBodyTargetType
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_SetBodyTargetType final
{
public:
	ENUM_TargetType                               TargetType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetBodyTargetType) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_SetBodyTargetType");
static_assert(sizeof(COMP_EnemyMovement_C_SetBodyTargetType) == 0x000001, "Wrong size on COMP_EnemyMovement_C_SetBodyTargetType");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyTargetType, TargetType) == 0x000000, "Member 'COMP_EnemyMovement_C_SetBodyTargetType::TargetType' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.DebugDrawAll
// 0x0100 (0x0100 - 0x0000)
struct COMP_EnemyMovement_C_DebugDrawAll final
{
public:
	struct FVector                                CallFunc_GetMoveDirection_Current_Direction;       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_DebugDrawAll) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_DebugDrawAll");
static_assert(sizeof(COMP_EnemyMovement_C_DebugDrawAll) == 0x000100, "Wrong size on COMP_EnemyMovement_C_DebugDrawAll");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_GetMoveDirection_Current_Direction) == 0x000000, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_GetMoveDirection_Current_Direction' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00000C, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000018, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000024, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_GetActorForwardVector_ReturnValue) == 0x00003C, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000048, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000054, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00006C, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000078, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000084, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000090, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00009C, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Not_PreBool_ReturnValue) == 0x00009D, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000A0, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0000AC, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_GetActorUpVector_ReturnValue) == 0x0000B8, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x0000C4, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000D0, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0000DC, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0000E8, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_DebugDrawAll, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0000F4, "Member 'COMP_EnemyMovement_C_DebugDrawAll::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetBodyRotationTargetType
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_GetBodyRotationTargetType final
{
public:
	ENUM_TargetType                               BodyRotationType_0;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetBodyRotationTargetType) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_GetBodyRotationTargetType");
static_assert(sizeof(COMP_EnemyMovement_C_GetBodyRotationTargetType) == 0x000001, "Wrong size on COMP_EnemyMovement_C_GetBodyRotationTargetType");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyRotationTargetType, BodyRotationType_0) == 0x000000, "Member 'COMP_EnemyMovement_C_GetBodyRotationTargetType::BodyRotationType_0' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetBodyRotateSpeed
// 0x0001 (0x0001 - 0x0000)
struct COMP_EnemyMovement_C_GetBodyRotateSpeed final
{
public:
	ENUM_SpeedType                                RotateSpeed;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetBodyRotateSpeed) == 0x000001, "Wrong alignment on COMP_EnemyMovement_C_GetBodyRotateSpeed");
static_assert(sizeof(COMP_EnemyMovement_C_GetBodyRotateSpeed) == 0x000001, "Wrong size on COMP_EnemyMovement_C_GetBodyRotateSpeed");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyRotateSpeed, RotateSpeed) == 0x000000, "Member 'COMP_EnemyMovement_C_GetBodyRotateSpeed::RotateSpeed' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetBodyDirectionCurrent
// 0x0030 (0x0030 - 0x0000)
struct COMP_EnemyMovement_C_SetBodyDirectionCurrent final
{
public:
	struct FVector                                BodyDirection;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasDirectionChanged;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewDirection;                                      // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_AngleBetweenNormals_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetBodyDirectionCurrent) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_SetBodyDirectionCurrent");
static_assert(sizeof(COMP_EnemyMovement_C_SetBodyDirectionCurrent) == 0x000030, "Wrong size on COMP_EnemyMovement_C_SetBodyDirectionCurrent");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, BodyDirection) == 0x000000, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::BodyDirection' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, DeltaSeconds) == 0x00000C, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, HasDirectionChanged) == 0x000010, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::HasDirectionChanged' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, NewDirection) == 0x000014, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::NewDirection' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000020, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000021, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000023, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_AngleBetweenNormals_ReturnValue) == 0x000024, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_AngleBetweenNormals_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetBodyDirectionCurrent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'COMP_EnemyMovement_C_SetBodyDirectionCurrent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetBodyDirectionCurrent
// 0x001C (0x001C - 0x0000)
struct COMP_EnemyMovement_C_GetBodyDirectionCurrent final
{
public:
	bool                                          TwoD;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BodyDirectionCurrent;                              // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetBodyDirectionCurrent) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_GetBodyDirectionCurrent");
static_assert(sizeof(COMP_EnemyMovement_C_GetBodyDirectionCurrent) == 0x00001C, "Wrong size on COMP_EnemyMovement_C_GetBodyDirectionCurrent");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyDirectionCurrent, TwoD) == 0x000000, "Member 'COMP_EnemyMovement_C_GetBodyDirectionCurrent::TwoD' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyDirectionCurrent, BodyDirectionCurrent) == 0x000004, "Member 'COMP_EnemyMovement_C_GetBodyDirectionCurrent::BodyDirectionCurrent' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyDirectionCurrent, CallFunc_Vector_Normal2D_ReturnValue) == 0x000010, "Member 'COMP_EnemyMovement_C_GetBodyDirectionCurrent::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetUnscaledMoveSpeedCurrent
// 0x0004 (0x0004 - 0x0000)
struct COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent final
{
public:
	float                                         MoveSpeedCurrent;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent");
static_assert(sizeof(COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent) == 0x000004, "Wrong size on COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent");
static_assert(offsetof(COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent, MoveSpeedCurrent) == 0x000000, "Member 'COMP_EnemyMovement_C_GetUnscaledMoveSpeedCurrent::MoveSpeedCurrent' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetMoveSpeedCurrent
// 0x0004 (0x0004 - 0x0000)
struct COMP_EnemyMovement_C_SetMoveSpeedCurrent final
{
public:
	float                                         MoveSpeedCurrent;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetMoveSpeedCurrent) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_SetMoveSpeedCurrent");
static_assert(sizeof(COMP_EnemyMovement_C_SetMoveSpeedCurrent) == 0x000004, "Wrong size on COMP_EnemyMovement_C_SetMoveSpeedCurrent");
static_assert(offsetof(COMP_EnemyMovement_C_SetMoveSpeedCurrent, MoveSpeedCurrent) == 0x000000, "Member 'COMP_EnemyMovement_C_SetMoveSpeedCurrent::MoveSpeedCurrent' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetBodyRotateSpeedValueByType
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType final
{
public:
	float                                         BodyRotateSpeed_0;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType");
static_assert(sizeof(COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType) == 0x000008, "Wrong size on COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType, BodyRotateSpeed_0) == 0x000000, "Member 'COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType::BodyRotateSpeed_0' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'COMP_EnemyMovement_C_GetBodyRotateSpeedValueByType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.SetAcceptanceRadius
// 0x000C (0x000C - 0x0000)
struct COMP_EnemyMovement_C_SetAcceptanceRadius final
{
public:
	float                                         AcceptanceRadius;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_SetAcceptanceRadius) == 0x000004, "Wrong alignment on COMP_EnemyMovement_C_SetAcceptanceRadius");
static_assert(sizeof(COMP_EnemyMovement_C_SetAcceptanceRadius) == 0x00000C, "Wrong size on COMP_EnemyMovement_C_SetAcceptanceRadius");
static_assert(offsetof(COMP_EnemyMovement_C_SetAcceptanceRadius, AcceptanceRadius) == 0x000000, "Member 'COMP_EnemyMovement_C_SetAcceptanceRadius::AcceptanceRadius' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetAcceptanceRadius, CallFunc_FMax_ReturnValue) == 0x000004, "Member 'COMP_EnemyMovement_C_SetAcceptanceRadius::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_EnemyMovement_C_SetAcceptanceRadius, CallFunc_Square_ReturnValue) == 0x000008, "Member 'COMP_EnemyMovement_C_SetAcceptanceRadius::CallFunc_Square_ReturnValue' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetPawn
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyMovement_C_GetPawn final
{
public:
	class APAWN_Enemy_C*                          Pawn_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetPawn) == 0x000008, "Wrong alignment on COMP_EnemyMovement_C_GetPawn");
static_assert(sizeof(COMP_EnemyMovement_C_GetPawn) == 0x000008, "Wrong size on COMP_EnemyMovement_C_GetPawn");
static_assert(offsetof(COMP_EnemyMovement_C_GetPawn, Pawn_0) == 0x000000, "Member 'COMP_EnemyMovement_C_GetPawn::Pawn_0' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.GetBodyTarget
// 0x0008 (0x0008 - 0x0000)
struct COMP_EnemyMovement_C_GetBodyTarget final
{
public:
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_EnemyMovement_C_GetBodyTarget) == 0x000008, "Wrong alignment on COMP_EnemyMovement_C_GetBodyTarget");
static_assert(sizeof(COMP_EnemyMovement_C_GetBodyTarget) == 0x000008, "Wrong size on COMP_EnemyMovement_C_GetBodyTarget");
static_assert(offsetof(COMP_EnemyMovement_C_GetBodyTarget, Target) == 0x000000, "Member 'COMP_EnemyMovement_C_GetBodyTarget::Target' has a wrong offset!");

// Function COMP_EnemyMovement.COMP_EnemyMovement_C.UpdateMoveDirection
// 0x0138 (0x0138 - 0x0000)
struct COMP_EnemyMovement_C_UpdateMoveDirection final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SpeedType                                MoveTurnType;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBodyValues;                                     // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RotationAxis;                                      // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeed;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetDirection;                                   // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetBodyTarget_Target;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_SpeedType                                CallFunc_GetMoveDirection_RotationSpeed_RotationSpeed; // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnVerticalPathSection_Result;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRotateMoveDirectionInstantly_Result;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
