#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_VoxelCullableNavAgent

#include "Basic.hpp"


namespace SDK::Params
{

// Function COMP_VoxelCullableNavAgent.COMP_VoxelCullableNavAgent_C.GetVoxelLevelManager
// 0x0020 (0x0020 - 0x0000)
struct COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager) == 0x000008, "Wrong alignment on COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager");
static_assert(sizeof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager) == 0x000020, "Wrong size on COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'COMP_VoxelCullableNavAgent_C_GetVoxelLevelManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function COMP_VoxelCullableNavAgent.COMP_VoxelCullableNavAgent_C.OnOverlapHazardLevelChanged
// 0x0028 (0x0028 - 0x0000)
struct COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged final
{
public:
	uint8                                         HazardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         HazardLevel;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged) == 0x000008, "Wrong alignment on COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged");
static_assert(sizeof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged) == 0x000028, "Wrong size on COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, HazardType) == 0x000000, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::HazardType' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, HazardLevel) == 0x000001, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::HazardLevel' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, ReturnValue) == 0x000002, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000018, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'COMP_VoxelCullableNavAgent_C_OnOverlapHazardLevelChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

