#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COMP_PhysicsImpactHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.OnImpactWithDamage__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  ImpactDamageInstance;                              // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         ImpactSpeed;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature) == 0x000038, "Wrong size on COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature, HitActor) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature::HitActor' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature, ImpactDamageInstance) == 0x000008, "Member 'COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature::ImpactDamageInstance' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature, ImpactSpeed) == 0x000030, "Member 'COMP_PhysicsImpactHandler_C_OnImpactWithDamage__DelegateSignature::ImpactSpeed' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.ExecuteUbergraph_COMP_PhysicsImpactHandler
// 0x0060 (0x0060 - 0x0000)
struct COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactLocation;                 // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_VolumeScale;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      K2Node_CustomEvent_PhysMaterial;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler) == 0x000060, "Wrong size on COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, EntryPoint) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, Temp_object_Variable) == 0x000008, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_CustomEvent_ImpactLocation) == 0x000010, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_CustomEvent_ImpactLocation' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_CustomEvent_VolumeScale) == 0x00001C, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_CustomEvent_VolumeScale' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_CustomEvent_PhysMaterial) == 0x000020, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_CustomEvent_PhysMaterial' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_DynamicCast_AsSound_Cue) == 0x000028, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000038, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler, K2Node_CustomEvent_Loaded) == 0x000058, "Member 'COMP_PhysicsImpactHandler_C_ExecuteUbergraph_COMP_PhysicsImpactHandler::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.PlayImpactSound
// 0x0018 (0x0018 - 0x0000)
struct COMP_PhysicsImpactHandler_C_PlayImpactSound final
{
public:
	struct FVector                                ImpactLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeScale;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_PlayImpactSound) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_PlayImpactSound");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_PlayImpactSound) == 0x000018, "Wrong size on COMP_PhysicsImpactHandler_C_PlayImpactSound");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_PlayImpactSound, ImpactLocation) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_PlayImpactSound::ImpactLocation' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_PlayImpactSound, VolumeScale) == 0x00000C, "Member 'COMP_PhysicsImpactHandler_C_PlayImpactSound::VolumeScale' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_PlayImpactSound, PhysMaterial) == 0x000010, "Member 'COMP_PhysicsImpactHandler_C_PlayImpactSound::PhysMaterial' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.OnLoaded_11AE4EBE489A0AC537EB32AE377168B1
// 0x0008 (0x0008 - 0x0000)
struct COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1) == 0x000008, "Wrong size on COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1, Loaded) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_OnLoaded_11AE4EBE489A0AC537EB32AE377168B1::Loaded' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.HasImpactProperties
// 0x0040 (0x0040 - 0x0000)
struct COMP_PhysicsImpactHandler_C_HasImpactProperties final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_HasImpactProperties) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_HasImpactProperties");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_HasImpactProperties) == 0x000040, "Wrong size on COMP_PhysicsImpactHandler_C_HasImpactProperties");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, Result) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::Result' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000008, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Len_ReturnValue) == 0x000018, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue_1) == 0x000020, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000030, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Len_ReturnValue_1) == 0x000034, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000038, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_BooleanOR_ReturnValue) == 0x000039, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_HasImpactProperties, CallFunc_BooleanOR_ReturnValue_1) == 0x00003A, "Member 'COMP_PhysicsImpactHandler_C_HasImpactProperties::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.SetColliderComponent
// 0x0030 (0x0030 - 0x0000)
struct COMP_PhysicsImpactHandler_C_SetColliderComponent final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasImpactProperties_Result;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_SetColliderComponent) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_SetColliderComponent");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_SetColliderComponent) == 0x000030, "Wrong size on COMP_PhysicsImpactHandler_C_SetColliderComponent");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, Component) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::Component' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, CallFunc_HasImpactProperties_Result) == 0x000008, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::CallFunc_HasImpactProperties_Result' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_SetColliderComponent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00002E, "Member 'COMP_PhysicsImpactHandler_C_SetColliderComponent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function COMP_PhysicsImpactHandler.COMP_PhysicsImpactHandler_C.EVENT_OnComponentHit
// 0x0418 (0x0418 - 0x0000)
struct COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         BaseDamage;                                        // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    DamageMod;                                         // 0x00D8(0x00A0)(Edit, BlueprintVisible)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                OtherAttribManager;                                // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedAudioComponent;                             // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactVelocity;                                    // 0x0190(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactSpeed;                                       // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactSpeedSquared;                                // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTimestamp;                                  // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasImpactProperties_Result;               // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribDamageInstance                  CallFunc_ApplyDamageMod_OutDamageInstance;         // 0x0280(0x0028)()
	class UAttribMod*                             CallFunc_ApplyDamageMod_ReturnValue;               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x033C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_ImpactData_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Square_ReturnValue;                       // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit) == 0x000008, "Wrong alignment on COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit");
static_assert(sizeof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit) == 0x000418, "Wrong size on COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, HitComponent) == 0x000000, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::HitComponent' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, OtherActor) == 0x000008, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::OtherActor' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, OtherComp) == 0x000010, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::OtherComp' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, NormalImpulse) == 0x000018, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, Hit) == 0x000024, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::Hit' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, BaseDamage) == 0x0000AC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::BaseDamage' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, DamageInstance) == 0x0000B0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::DamageInstance' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, DamageMod) == 0x0000D8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::DamageMod' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, ImpactData) == 0x000178, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::ImpactData' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, OtherAttribManager) == 0x000180, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::OtherAttribManager' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, SpawnedAudioComponent) == 0x000188, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::SpawnedAudioComponent' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, ImpactVelocity) == 0x000190, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::ImpactVelocity' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, ImpactSpeed) == 0x00019C, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::ImpactSpeed' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, ImpactSpeedSquared) == 0x0001A0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::ImpactSpeedSquared' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CurrentTimestamp) == 0x0001A4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CurrentTimestamp' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Sqrt_ReturnValue) == 0x0001AC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001B0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_HasImpactProperties_Result) == 0x0001C4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_HasImpactProperties_Result' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Not_PreBool_ReturnValue) == 0x0001C5, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C6, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001C7, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001C8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001CC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D1, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Time) == 0x0001D4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Distance) == 0x0001D8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Location) == 0x0001DC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Normal) == 0x0001F4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ImpactNormal) == 0x000200, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_PhysMat) == 0x000210, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitActor) == 0x000218, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitComponent) == 0x000220, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitBoneName) == 0x000228, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitItem) == 0x000230, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ElementIndex) == 0x000234, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_FaceIndex) == 0x000238, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_TraceStart) == 0x00023C, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_TraceEnd) == 0x000248, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000254, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_FMin_ReturnValue) == 0x000258, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000260, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Lerp_ReturnValue) == 0x000270, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Len_ReturnValue) == 0x000274, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000278, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_ApplyDamageMod_OutDamageInstance) == 0x000280, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_ApplyDamageMod_OutDamageInstance' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_ApplyDamageMod_ReturnValue) == 0x0002A8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_ApplyDamageMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002B0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002BC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002BD, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Time_1) == 0x0002C0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Distance_1) == 0x0002C4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Location_1) == 0x0002C8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002D4, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Normal_1) == 0x0002E0, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002EC, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_PhysMat_1) == 0x0002F8, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitActor_1) == 0x000300, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitComponent_1) == 0x000308, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitBoneName_1) == 0x000310, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_HitItem_1) == 0x000318, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ElementIndex_1) == 0x00031C, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_FaceIndex_1) == 0x000320, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_TraceStart_1) == 0x000324, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_TraceEnd_1) == 0x000330, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, Temp_name_Variable) == 0x00033C, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_SpawnObject_ReturnValue) == 0x000348, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_GetComponentByClass_ReturnValue) == 0x000350, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_VSizeSquared_ReturnValue) == 0x000358, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bBlockingHit_2) == 0x00035C, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x00035D, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Time_2) == 0x000360, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Distance_2) == 0x000364, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_Location_2) == 0x000368, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000374, "Member 'COMP_PhysicsImpactHandler_C_EVENT_OnComponentHit::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
