#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CON_Hacker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "STRUCT_UserTintOption_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "STRUCT_CharacterLoadoutSettings_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function CON_Hacker.CON_Hacker_C.OnUsingGamepadChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature final
{
public:
	bool                                          IsUsingGamepad_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature) == 0x000001, "Wrong alignment on CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature");
static_assert(sizeof(CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature) == 0x000001, "Wrong size on CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature");
static_assert(offsetof(CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature, IsUsingGamepad_0) == 0x000000, "Member 'CON_Hacker_C_OnUsingGamepadChanged__DelegateSignature::IsUsingGamepad_0' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.ExecuteUbergraph_CON_Hacker
// 0x0140 (0x0140 - 0x0000)
struct CON_Hacker_C_ExecuteUbergraph_CON_Hacker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0058(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0070(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_CustomEvent_LevelCollection;                // 0x00D0(0x0010)(NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_2;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_3;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLoadingScreenVisible_Result;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker) == 0x000008, "Wrong alignment on CON_Hacker_C_ExecuteUbergraph_CON_Hacker");
static_assert(sizeof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker) == 0x000140, "Wrong size on CON_Hacker_C_ExecuteUbergraph_CON_Hacker");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, EntryPoint) == 0x000000, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::EntryPoint' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000008, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character) == 0x000020, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_IsValidClass_ReturnValue) == 0x000038, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, Temp_class_Variable) == 0x000040, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character_1) == 0x000048, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_ClassDynamicCast_AsPAWN_System_Shock_Character_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_ClassDynamicCast_bSuccess_1) == 0x000050, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_InputKeyEvent_Key) == 0x000058, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_InputKeyEvent_Key_1) == 0x000070, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000088, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000089, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x00008C, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000090, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_GetGameInstance_ReturnValue) == 0x000098, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_AsGI_Single_Player) == 0x0000A0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_Event_DeltaSeconds) == 0x0000AC, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_K2_GetPawn_ReturnValue) == 0x0000B0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, Temp_float_Variable) == 0x0000B8, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x0000C0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_CustomEvent_LevelCollection) == 0x0000D0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_CustomEvent_LevelCollection' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000E0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x0000E8, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, Temp_float_Variable_1) == 0x0000F4, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, Temp_bool_Variable) == 0x000108, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_GetGameInstance_ReturnValue_2) == 0x000110, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_AsGI_Single_Player_2) == 0x000118, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_AsGI_Single_Player_2' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_Select_Default) == 0x000124, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_GetGameInstance_ReturnValue_3) == 0x000128, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_AsGI_Single_Player_3) == 0x000130, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_AsGI_Single_Player_3' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, K2Node_DynamicCast_bSuccess_4) == 0x000138, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_IsLoadingScreenVisible_Result) == 0x000139, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_IsLoadingScreenVisible_Result' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_ExecuteUbergraph_CON_Hacker, CallFunc_Not_PreBool_ReturnValue_1) == 0x00013A, "Member 'CON_Hacker_C_ExecuteUbergraph_CON_Hacker::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.LoadMapByCollection
// 0x0010 (0x0010 - 0x0000)
struct CON_Hacker_C_LoadMapByCollection final
{
public:
	struct FDataTableRowHandle                    LevelCollection;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_LoadMapByCollection) == 0x000008, "Wrong alignment on CON_Hacker_C_LoadMapByCollection");
static_assert(sizeof(CON_Hacker_C_LoadMapByCollection) == 0x000010, "Wrong size on CON_Hacker_C_LoadMapByCollection");
static_assert(offsetof(CON_Hacker_C_LoadMapByCollection, LevelCollection) == 0x000000, "Member 'CON_Hacker_C_LoadMapByCollection::LevelCollection' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CON_Hacker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CON_Hacker_C_ReceiveTick) == 0x000004, "Wrong alignment on CON_Hacker_C_ReceiveTick");
static_assert(sizeof(CON_Hacker_C_ReceiveTick) == 0x000004, "Wrong size on CON_Hacker_C_ReceiveTick");
static_assert(offsetof(CON_Hacker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CON_Hacker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.OnLoaded_34A5C8C24819FE7443A1378DEBB73993
// 0x0008 (0x0008 - 0x0000)
struct CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993) == 0x000008, "Wrong alignment on CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993");
static_assert(sizeof(CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993) == 0x000008, "Wrong size on CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993");
static_assert(offsetof(CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993, Loaded) == 0x000000, "Member 'CON_Hacker_C_OnLoaded_34A5C8C24819FE7443A1378DEBB73993::Loaded' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.InpActEvt_RightShift_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0");
static_assert(sizeof(CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0");
static_assert(offsetof(CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'CON_Hacker_C_InpActEvt_RightShift_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.InpActEvt_AnyKey_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1");
static_assert(sizeof(CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1");
static_assert(offsetof(CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'CON_Hacker_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.CompleteQuest
// 0x0090 (0x0090 - 0x0000)
struct CON_Hacker_C_CompleteQuest final
{
public:
	class FString                                 QuestName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SetCompletedStoryQuest_LogString;         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_CompleteQuest) == 0x000008, "Wrong alignment on CON_Hacker_C_CompleteQuest");
static_assert(sizeof(CON_Hacker_C_CompleteQuest) == 0x000090, "Wrong size on CON_Hacker_C_CompleteQuest");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, QuestName) == 0x000000, "Member 'CON_Hacker_C_CompleteQuest::QuestName' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, GameInstance) == 0x000010, "Member 'CON_Hacker_C_CompleteQuest::GameInstance' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'CON_Hacker_C_CompleteQuest::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'CON_Hacker_C_CompleteQuest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'CON_Hacker_C_CompleteQuest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_GetGameInstance_ReturnValue) == 0x000030, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, K2Node_DynamicCast_AsGI_Single_Player) == 0x000048, "Member 'CON_Hacker_C_CompleteQuest::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CON_Hacker_C_CompleteQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Array_Get_Item) == 0x000054, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_SetCompletedStoryQuest_LogString) == 0x000060, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_SetCompletedStoryQuest_LogString' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Conv_NameToString_ReturnValue) == 0x000078, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_CompleteQuest, CallFunc_Contains_ReturnValue) == 0x000088, "Member 'CON_Hacker_C_CompleteQuest::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.GetStoryQuestState
// 0x0068 (0x0068 - 0x0000)
struct CON_Hacker_C_GetStoryQuestState final
{
public:
	class FName                                   QuestName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CON_Hacker_C_GetStoryQuestState) == 0x000008, "Wrong alignment on CON_Hacker_C_GetStoryQuestState");
static_assert(sizeof(CON_Hacker_C_GetStoryQuestState) == 0x000068, "Wrong size on CON_Hacker_C_GetStoryQuestState");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, QuestName) == 0x000000, "Member 'CON_Hacker_C_GetStoryQuestState::QuestName' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, K2Node_DynamicCast_AsGI_Single_Player) == 0x000020, "Member 'CON_Hacker_C_GetStoryQuestState::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CON_Hacker_C_GetStoryQuestState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_HasCompletedStoryQuest_Completed) == 0x000040, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_Conv_BoolToString_ReturnValue) == 0x000048, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetStoryQuestState, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'CON_Hacker_C_GetStoryQuestState::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.GetAllStoryQuestStates
// 0x0098 (0x0098 - 0x0000)
struct CON_Hacker_C_GetAllStoryQuestStates final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_GetAllStoryQuestStates) == 0x000008, "Wrong alignment on CON_Hacker_C_GetAllStoryQuestStates");
static_assert(sizeof(CON_Hacker_C_GetAllStoryQuestStates) == 0x000098, "Wrong size on CON_Hacker_C_GetAllStoryQuestStates");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, GameInstance) == 0x000000, "Member 'CON_Hacker_C_GetAllStoryQuestStates::GameInstance' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CON_Hacker_C_GetAllStoryQuestStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CON_Hacker_C_GetAllStoryQuestStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'CON_Hacker_C_GetAllStoryQuestStates::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'CON_Hacker_C_GetAllStoryQuestStates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Array_Get_Item) == 0x00003C, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_HasCompletedStoryQuest_Completed) == 0x000044, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Conv_NameToString_ReturnValue) == 0x000048, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Conv_BoolToString_ReturnValue) == 0x000058, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_GetAllStoryQuestStates, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'CON_Hacker_C_GetAllStoryQuestStates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.TeleportToLocation
// 0x00B0 (0x00B0 - 0x0000)
struct CON_Hacker_C_TeleportToLocation final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y;                                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_TeleportToLocation) == 0x000008, "Wrong alignment on CON_Hacker_C_TeleportToLocation");
static_assert(sizeof(CON_Hacker_C_TeleportToLocation) == 0x0000B0, "Wrong size on CON_Hacker_C_TeleportToLocation");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, X) == 0x000000, "Member 'CON_Hacker_C_TeleportToLocation::X' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, Y) == 0x000004, "Member 'CON_Hacker_C_TeleportToLocation::Y' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, Z) == 0x000008, "Member 'CON_Hacker_C_TeleportToLocation::Z' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'CON_Hacker_C_TeleportToLocation::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'CON_Hacker_C_TeleportToLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000024, "Member 'CON_Hacker_C_TeleportToLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000AC, "Member 'CON_Hacker_C_TeleportToLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.TeleportToElevatorByIndex
// 0x0110 (0x0110 - 0x0000)
struct CON_Hacker_C_TeleportToElevatorByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_ElevatorDoors_Base_C*> ElevatorActors;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AINTERACT_ElevatorDoors_Base_C*         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_ElevatorDoors_Base_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CON_Hacker_C_TeleportToElevatorByIndex) == 0x000008, "Wrong alignment on CON_Hacker_C_TeleportToElevatorByIndex");
static_assert(sizeof(CON_Hacker_C_TeleportToElevatorByIndex) == 0x000110, "Wrong size on CON_Hacker_C_TeleportToElevatorByIndex");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, Index_0) == 0x000000, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, ElevatorActors) == 0x000008, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::ElevatorActors' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_Array_Get_Item) == 0x000018, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_GetActorForwardVector_ReturnValue) == 0x000024, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_GetAllActorsOfClass_OutActors) == 0x000058, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000074, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000080, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToElevatorByIndex, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000108, "Member 'CON_Hacker_C_TeleportToElevatorByIndex::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.TeleportToTerminalByIndex
// 0x0098 (0x0098 - 0x0000)
struct CON_Hacker_C_TeleportToTerminalByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PlayerPawn;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AINTERACT_CyberspaceTerminal_C*> TerminalActors;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AINTERACT_CyberspaceTerminal_C*         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_CyberspaceTerminal_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ReferenceParm)
};
static_assert(alignof(CON_Hacker_C_TeleportToTerminalByIndex) == 0x000008, "Wrong alignment on CON_Hacker_C_TeleportToTerminalByIndex");
static_assert(sizeof(CON_Hacker_C_TeleportToTerminalByIndex) == 0x000098, "Wrong size on CON_Hacker_C_TeleportToTerminalByIndex");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, Index_0) == 0x000000, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, PlayerPawn) == 0x000008, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::PlayerPawn' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, TerminalActors) == 0x000010, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::TerminalActors' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_GetActorForwardVector_ReturnValue) == 0x00002C, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000044, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_ComposeRotators_ReturnValue) == 0x00005C, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_GetPlayerPawn_ReturnValue) == 0x000078, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_K2_TeleportTo_ReturnValue) == 0x000080, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CON_Hacker_C_TeleportToTerminalByIndex, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'CON_Hacker_C_TeleportToTerminalByIndex::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");

// Function CON_Hacker.CON_Hacker_C.ForceHideCrosshairs
// 0x0028 (0x0028 - 0x0000)
struct CON_Hacker_C_ForceHideCrosshairs final
{
public:
	bool                                          HideState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
