#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CONTEXT_Selector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CONTEXT_Selector.CONTEXT_Selector_C.CreateSubMenuOptions
// 0x0010 (0x0010 - 0x0000)
struct CONTEXT_Selector_C_CreateSubMenuOptions final
{
public:
	TArray<class UCONTEXT_Base_C*>                ContextOptions;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(CONTEXT_Selector_C_CreateSubMenuOptions) == 0x000008, "Wrong alignment on CONTEXT_Selector_C_CreateSubMenuOptions");
static_assert(sizeof(CONTEXT_Selector_C_CreateSubMenuOptions) == 0x000010, "Wrong size on CONTEXT_Selector_C_CreateSubMenuOptions");
static_assert(offsetof(CONTEXT_Selector_C_CreateSubMenuOptions, ContextOptions) == 0x000000, "Member 'CONTEXT_Selector_C_CreateSubMenuOptions::ContextOptions' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.SetMouseOverSubMenu
// 0x0010 (0x0010 - 0x0000)
struct CONTEXT_Selector_C_SetMouseOverSubMenu final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOverSubMenu;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Selector_C_SetMouseOverSubMenu) == 0x000008, "Wrong alignment on CONTEXT_Selector_C_SetMouseOverSubMenu");
static_assert(sizeof(CONTEXT_Selector_C_SetMouseOverSubMenu) == 0x000010, "Wrong size on CONTEXT_Selector_C_SetMouseOverSubMenu");
static_assert(offsetof(CONTEXT_Selector_C_SetMouseOverSubMenu, Widget) == 0x000000, "Member 'CONTEXT_Selector_C_SetMouseOverSubMenu::Widget' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetMouseOverSubMenu, IsOverSubMenu) == 0x000008, "Member 'CONTEXT_Selector_C_SetMouseOverSubMenu::IsOverSubMenu' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetMouseOverSubMenu, CallFunc_Array_RemoveItem_ReturnValue) == 0x000009, "Member 'CONTEXT_Selector_C_SetMouseOverSubMenu::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetMouseOverSubMenu, CallFunc_Array_AddUnique_ReturnValue) == 0x00000C, "Member 'CONTEXT_Selector_C_SetMouseOverSubMenu::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.RemoveSubMenu
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Selector_C_RemoveSubMenu final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Selector_C_RemoveSubMenu) == 0x000001, "Wrong alignment on CONTEXT_Selector_C_RemoveSubMenu");
static_assert(sizeof(CONTEXT_Selector_C_RemoveSubMenu) == 0x000001, "Wrong size on CONTEXT_Selector_C_RemoveSubMenu");
static_assert(offsetof(CONTEXT_Selector_C_RemoveSubMenu, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CONTEXT_Selector_C_RemoveSubMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.SetSelectorExpandedState
// 0x0038 (0x0038 - 0x0000)
struct CONTEXT_Selector_C_SetSelectorExpandedState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCONTEXT_Base_C*>                CallFunc_CreateSubMenuOptions_ContextOptions;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_ContextSubMenu_C*               CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Selector_C_SetSelectorExpandedState) == 0x000008, "Wrong alignment on CONTEXT_Selector_C_SetSelectorExpandedState");
static_assert(sizeof(CONTEXT_Selector_C_SetSelectorExpandedState) == 0x000038, "Wrong size on CONTEXT_Selector_C_SetSelectorExpandedState");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, State) == 0x000000, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::State' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_CreateSubMenuOptions_ContextOptions) == 0x000008, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_CreateSubMenuOptions_ContextOptions' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_Create_ReturnValue) == 0x000028, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetSelectorExpandedState, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'CONTEXT_Selector_C_SetSelectorExpandedState::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CONTEXT_Selector_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CONTEXT_Selector_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on CONTEXT_Selector_C_EVENT_OnMouseEnter");
static_assert(sizeof(CONTEXT_Selector_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on CONTEXT_Selector_C_EVENT_OnMouseEnter");
static_assert(offsetof(CONTEXT_Selector_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CONTEXT_Selector_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CONTEXT_Selector_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.EVENT_OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CONTEXT_Selector_C_EVENT_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CONTEXT_Selector_C_EVENT_OnMouseLeave) == 0x000008, "Wrong alignment on CONTEXT_Selector_C_EVENT_OnMouseLeave");
static_assert(sizeof(CONTEXT_Selector_C_EVENT_OnMouseLeave) == 0x000070, "Wrong size on CONTEXT_Selector_C_EVENT_OnMouseLeave");
static_assert(offsetof(CONTEXT_Selector_C_EVENT_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CONTEXT_Selector_C_EVENT_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.ActivateOption
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Selector_C_ActivateOption final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Selector_C_ActivateOption) == 0x000001, "Wrong alignment on CONTEXT_Selector_C_ActivateOption");
static_assert(sizeof(CONTEXT_Selector_C_ActivateOption) == 0x000001, "Wrong size on CONTEXT_Selector_C_ActivateOption");
static_assert(offsetof(CONTEXT_Selector_C_ActivateOption, Result) == 0x000000, "Member 'CONTEXT_Selector_C_ActivateOption::Result' has a wrong offset!");

// Function CONTEXT_Selector.CONTEXT_Selector_C.SetOptionSelected
// 0x0002 (0x0002 - 0x0000)
struct CONTEXT_Selector_C_SetOptionSelected final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateMenu;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Selector_C_SetOptionSelected) == 0x000001, "Wrong alignment on CONTEXT_Selector_C_SetOptionSelected");
static_assert(sizeof(CONTEXT_Selector_C_SetOptionSelected) == 0x000002, "Wrong size on CONTEXT_Selector_C_SetOptionSelected");
static_assert(offsetof(CONTEXT_Selector_C_SetOptionSelected, State) == 0x000000, "Member 'CONTEXT_Selector_C_SetOptionSelected::State' has a wrong offset!");
static_assert(offsetof(CONTEXT_Selector_C_SetOptionSelected, UpdateMenu) == 0x000001, "Member 'CONTEXT_Selector_C_SetOptionSelected::UpdateMenu' has a wrong offset!");

}

