#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CONTEXT_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CONTEXT_Base.CONTEXT_Base_C.ExecuteUbergraph_CONTEXT_Base
// 0x0070 (0x0070 - 0x0000)
struct CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0034(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base) == 0x000008, "Wrong alignment on CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base");
static_assert(sizeof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base) == 0x000070, "Wrong size on CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, EntryPoint) == 0x000000, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, Temp_object_Variable) == 0x000020, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_DynamicCast_AsSound_Cue) == 0x000028, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_Event_MyGeometry) == 0x000034, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base, K2Node_Event_InDeltaTime) == 0x00006C, "Member 'CONTEXT_Base_C_ExecuteUbergraph_CONTEXT_Base::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.Tick
// 0x003C (0x003C - 0x0000)
struct CONTEXT_Base_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_Tick) == 0x000004, "Wrong alignment on CONTEXT_Base_C_Tick");
static_assert(sizeof(CONTEXT_Base_C_Tick) == 0x00003C, "Wrong size on CONTEXT_Base_C_Tick");
static_assert(offsetof(CONTEXT_Base_C_Tick, MyGeometry) == 0x000000, "Member 'CONTEXT_Base_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_Tick, InDeltaTime) == 0x000038, "Member 'CONTEXT_Base_C_Tick::InDeltaTime' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.OnLoaded_0FD3050149BDE249B2F90A9755E75934
// 0x0008 (0x0008 - 0x0000)
struct CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934) == 0x000008, "Wrong alignment on CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934");
static_assert(sizeof(CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934) == 0x000008, "Wrong size on CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934");
static_assert(offsetof(CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934, Loaded) == 0x000000, "Member 'CONTEXT_Base_C_OnLoaded_0FD3050149BDE249B2F90A9755E75934::Loaded' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.Initialize
// 0x0020 (0x0020 - 0x0000)
struct CONTEXT_Base_C_Initialize final
{
public:
	class UInventoryBag_C*                        Bag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Slot_0;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_InventoryContextMenu_C*         ContextWindow;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        CallFunc_GetMesh_Mesh;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_Initialize) == 0x000008, "Wrong alignment on CONTEXT_Base_C_Initialize");
static_assert(sizeof(CONTEXT_Base_C_Initialize) == 0x000020, "Wrong size on CONTEXT_Base_C_Initialize");
static_assert(offsetof(CONTEXT_Base_C_Initialize, Bag) == 0x000000, "Member 'CONTEXT_Base_C_Initialize::Bag' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_Initialize, Slot_0) == 0x000008, "Member 'CONTEXT_Base_C_Initialize::Slot_0' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_Initialize, ContextWindow) == 0x000010, "Member 'CONTEXT_Base_C_Initialize::ContextWindow' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_Initialize, CallFunc_GetMesh_Mesh) == 0x000018, "Member 'CONTEXT_Base_C_Initialize::CallFunc_GetMesh_Mesh' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetText
// 0x0008 (0x0008 - 0x0000)
struct CONTEXT_Base_C_GetText final
{
public:
	class UTextMeshWidget*                        TextMesh;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_GetText) == 0x000008, "Wrong alignment on CONTEXT_Base_C_GetText");
static_assert(sizeof(CONTEXT_Base_C_GetText) == 0x000008, "Wrong size on CONTEXT_Base_C_GetText");
static_assert(offsetof(CONTEXT_Base_C_GetText, TextMesh) == 0x000000, "Member 'CONTEXT_Base_C_GetText::TextMesh' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetItem
// 0x0010 (0x0010 - 0x0000)
struct CONTEXT_Base_C_GetItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_GetItem) == 0x000008, "Wrong alignment on CONTEXT_Base_C_GetItem");
static_assert(sizeof(CONTEXT_Base_C_GetItem) == 0x000010, "Wrong size on CONTEXT_Base_C_GetItem");
static_assert(offsetof(CONTEXT_Base_C_GetItem, Item) == 0x000000, "Member 'CONTEXT_Base_C_GetItem::Item' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetItem, CallFunc_GetSlotItem_Item) == 0x000008, "Member 'CONTEXT_Base_C_GetItem::CallFunc_GetSlotItem_Item' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetBagOwner
// 0x0028 (0x0028 - 0x0000)
struct CONTEXT_Base_C_GetBagOwner final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_GetBagOwner) == 0x000008, "Wrong alignment on CONTEXT_Base_C_GetBagOwner");
static_assert(sizeof(CONTEXT_Base_C_GetBagOwner) == 0x000028, "Wrong size on CONTEXT_Base_C_GetBagOwner");
static_assert(offsetof(CONTEXT_Base_C_GetBagOwner, Character) == 0x000000, "Member 'CONTEXT_Base_C_GetBagOwner::Character' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetBagOwner, CallFunc_GetInventory_Inventory) == 0x000008, "Member 'CONTEXT_Base_C_GetBagOwner::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetBagOwner, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'CONTEXT_Base_C_GetBagOwner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetBagOwner, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000018, "Member 'CONTEXT_Base_C_GetBagOwner::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetBagOwner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CONTEXT_Base_C_GetBagOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.IsOptionSelected
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Base_C_IsOptionSelected final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_IsOptionSelected) == 0x000001, "Wrong alignment on CONTEXT_Base_C_IsOptionSelected");
static_assert(sizeof(CONTEXT_Base_C_IsOptionSelected) == 0x000001, "Wrong size on CONTEXT_Base_C_IsOptionSelected");
static_assert(offsetof(CONTEXT_Base_C_IsOptionSelected, Result) == 0x000000, "Member 'CONTEXT_Base_C_IsOptionSelected::Result' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.CanOptionBeActivated
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Base_C_CanOptionBeActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_CanOptionBeActivated) == 0x000001, "Wrong alignment on CONTEXT_Base_C_CanOptionBeActivated");
static_assert(sizeof(CONTEXT_Base_C_CanOptionBeActivated) == 0x000001, "Wrong size on CONTEXT_Base_C_CanOptionBeActivated");
static_assert(offsetof(CONTEXT_Base_C_CanOptionBeActivated, Result) == 0x000000, "Member 'CONTEXT_Base_C_CanOptionBeActivated::Result' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.CanOptionBeDisplayed
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Base_C_CanOptionBeDisplayed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_CanOptionBeDisplayed) == 0x000001, "Wrong alignment on CONTEXT_Base_C_CanOptionBeDisplayed");
static_assert(sizeof(CONTEXT_Base_C_CanOptionBeDisplayed) == 0x000001, "Wrong size on CONTEXT_Base_C_CanOptionBeDisplayed");
static_assert(offsetof(CONTEXT_Base_C_CanOptionBeDisplayed, Result) == 0x000000, "Member 'CONTEXT_Base_C_CanOptionBeDisplayed::Result' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct CONTEXT_Base_C_GetMesh final
{
public:
	class UGridMeshWidget*                        Mesh;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_GetMesh) == 0x000008, "Wrong alignment on CONTEXT_Base_C_GetMesh");
static_assert(sizeof(CONTEXT_Base_C_GetMesh) == 0x000008, "Wrong size on CONTEXT_Base_C_GetMesh");
static_assert(offsetof(CONTEXT_Base_C_GetMesh, Mesh) == 0x000000, "Member 'CONTEXT_Base_C_GetMesh::Mesh' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CONTEXT_Base_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CONTEXT_Base_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on CONTEXT_Base_C_EVENT_OnMouseEnter");
static_assert(sizeof(CONTEXT_Base_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on CONTEXT_Base_C_EVENT_OnMouseEnter");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CONTEXT_Base_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CONTEXT_Base_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.EVENT_OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CONTEXT_Base_C_EVENT_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CONTEXT_Base_C_EVENT_OnMouseLeave) == 0x000008, "Wrong alignment on CONTEXT_Base_C_EVENT_OnMouseLeave");
static_assert(sizeof(CONTEXT_Base_C_EVENT_OnMouseLeave) == 0x000070, "Wrong size on CONTEXT_Base_C_EVENT_OnMouseLeave");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CONTEXT_Base_C_EVENT_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.EVENT_OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct CONTEXT_Base_C_EVENT_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_SetInventoryContextMenuEnabled_Result;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOptionBeActivated_Result;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActivateOption_Result;                    // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(CONTEXT_Base_C_EVENT_OnMouseButtonDown) == 0x000008, "Wrong alignment on CONTEXT_Base_C_EVENT_OnMouseButtonDown");
static_assert(sizeof(CONTEXT_Base_C_EVENT_OnMouseButtonDown) == 0x000220, "Wrong size on CONTEXT_Base_C_EVENT_OnMouseButtonDown");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, CallFunc_SetInventoryContextMenuEnabled_Result) == 0x000160, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::CallFunc_SetInventoryContextMenuEnabled_Result' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, CallFunc_CanOptionBeActivated_Result) == 0x000161, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::CallFunc_CanOptionBeActivated_Result' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, CallFunc_ActivateOption_Result) == 0x000162, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::CallFunc_ActivateOption_Result' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_EVENT_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'CONTEXT_Base_C_EVENT_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.ActivateOption
// 0x0001 (0x0001 - 0x0000)
struct CONTEXT_Base_C_ActivateOption final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_ActivateOption) == 0x000001, "Wrong alignment on CONTEXT_Base_C_ActivateOption");
static_assert(sizeof(CONTEXT_Base_C_ActivateOption) == 0x000001, "Wrong size on CONTEXT_Base_C_ActivateOption");
static_assert(offsetof(CONTEXT_Base_C_ActivateOption, Result) == 0x000000, "Member 'CONTEXT_Base_C_ActivateOption::Result' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetDisabledColor
// 0x0044 (0x0044 - 0x0000)
struct CONTEXT_Base_C_GetDisabledColor final
{
public:
	struct FColor                                 DisabledColor;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_GetDisabledColor) == 0x000004, "Wrong alignment on CONTEXT_Base_C_GetDisabledColor");
static_assert(sizeof(CONTEXT_Base_C_GetDisabledColor) == 0x000044, "Wrong size on CONTEXT_Base_C_GetDisabledColor");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, DisabledColor) == 0x000000, "Member 'CONTEXT_Base_C_GetDisabledColor::DisabledColor' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_GetMeshUIColor_Color) == 0x000004, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_GetMeshUIColor_Color_1) == 0x000008, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_GetMeshUIColor_Color_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x00001C, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_LinearColorLerp_ReturnValue) == 0x00002C, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x00003C, "Member 'CONTEXT_Base_C_GetDisabledColor::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetDisabledColor, K2Node_MakeStruct_Color) == 0x000040, "Member 'CONTEXT_Base_C_GetDisabledColor::K2Node_MakeStruct_Color' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.GetEnabledBackgroundColor
// 0x000C (0x000C - 0x0000)
struct CONTEXT_Base_C_GetEnabledBackgroundColor final
{
public:
	struct FColor                                 DisabledColor;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_GetEnabledBackgroundColor) == 0x000004, "Wrong alignment on CONTEXT_Base_C_GetEnabledBackgroundColor");
static_assert(sizeof(CONTEXT_Base_C_GetEnabledBackgroundColor) == 0x00000C, "Wrong size on CONTEXT_Base_C_GetEnabledBackgroundColor");
static_assert(offsetof(CONTEXT_Base_C_GetEnabledBackgroundColor, DisabledColor) == 0x000000, "Member 'CONTEXT_Base_C_GetEnabledBackgroundColor::DisabledColor' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetEnabledBackgroundColor, CallFunc_GetMeshUIColor_Color) == 0x000004, "Member 'CONTEXT_Base_C_GetEnabledBackgroundColor::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_GetEnabledBackgroundColor, K2Node_MakeStruct_Color) == 0x000008, "Member 'CONTEXT_Base_C_GetEnabledBackgroundColor::K2Node_MakeStruct_Color' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.OnUpdateColors
// 0x0040 (0x0040 - 0x0000)
struct CONTEXT_Base_C_OnUpdateColors final
{
public:
	bool                                          CanBeActivated;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridMeshWidget*                        CallFunc_GetMesh_Mesh;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOptionBeActivated_Result;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetEnabledBackgroundColor_DisabledColor;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default;                             // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        CallFunc_GetMesh_Mesh_1;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetDisabledColor_DisabledColor;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextMeshWidget*                        CallFunc_GetText_TextMesh;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_1;                           // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_2;                           // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CONTEXT_Base_C_OnUpdateColors) == 0x000008, "Wrong alignment on CONTEXT_Base_C_OnUpdateColors");
static_assert(sizeof(CONTEXT_Base_C_OnUpdateColors) == 0x000040, "Wrong size on CONTEXT_Base_C_OnUpdateColors");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CanBeActivated) == 0x000000, "Member 'CONTEXT_Base_C_OnUpdateColors::CanBeActivated' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, Temp_bool_Variable) == 0x000001, "Member 'CONTEXT_Base_C_OnUpdateColors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, Temp_bool_Variable_1) == 0x000002, "Member 'CONTEXT_Base_C_OnUpdateColors::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, Temp_bool_Variable_2) == 0x000003, "Member 'CONTEXT_Base_C_OnUpdateColors::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetMesh_Mesh) == 0x000008, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetMesh_Mesh' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_CanOptionBeActivated_Result) == 0x000010, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_CanOptionBeActivated_Result' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetMeshUIColor_Color) == 0x000014, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetEnabledBackgroundColor_DisabledColor) == 0x000018, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetEnabledBackgroundColor_DisabledColor' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, K2Node_Select_Default) == 0x00001C, "Member 'CONTEXT_Base_C_OnUpdateColors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetMesh_Mesh_1) == 0x000020, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetMesh_Mesh_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetDisabledColor_DisabledColor) == 0x000028, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetDisabledColor_DisabledColor' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetMeshUIColor_Color_1) == 0x00002C, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetMeshUIColor_Color_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, CallFunc_GetText_TextMesh) == 0x000030, "Member 'CONTEXT_Base_C_OnUpdateColors::CallFunc_GetText_TextMesh' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, K2Node_Select_Default_1) == 0x000038, "Member 'CONTEXT_Base_C_OnUpdateColors::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_OnUpdateColors, K2Node_Select_Default_2) == 0x00003C, "Member 'CONTEXT_Base_C_OnUpdateColors::K2Node_Select_Default_2' has a wrong offset!");

// Function CONTEXT_Base.CONTEXT_Base_C.SetOptionSelected
// 0x0004 (0x0004 - 0x0000)
struct CONTEXT_Base_C_SetOptionSelected final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateMenu;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOptionBeActivated_Result;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CONTEXT_Base_C_SetOptionSelected) == 0x000001, "Wrong alignment on CONTEXT_Base_C_SetOptionSelected");
static_assert(sizeof(CONTEXT_Base_C_SetOptionSelected) == 0x000004, "Wrong size on CONTEXT_Base_C_SetOptionSelected");
static_assert(offsetof(CONTEXT_Base_C_SetOptionSelected, State) == 0x000000, "Member 'CONTEXT_Base_C_SetOptionSelected::State' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_SetOptionSelected, UpdateMenu) == 0x000001, "Member 'CONTEXT_Base_C_SetOptionSelected::UpdateMenu' has a wrong offset!");
static_assert(offsetof(CONTEXT_Base_C_SetOptionSelected, CallFunc_CanOptionBeActivated_Result) == 0x000002, "Member 'CONTEXT_Base_C_SetOptionSelected::CallFunc_CanOptionBeActivated_Result' has a wrong offset!");
