#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreGame

#include "Basic.hpp"

#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CoreGame.CoreGameFunctionLibrary.AddDataTableRow
// 0x0018 (0x0018 - 0x0000)
struct CoreGameFunctionLibrary_AddDataTableRow final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_AddDataTableRow) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_AddDataTableRow");
static_assert(sizeof(CoreGameFunctionLibrary_AddDataTableRow) == 0x000018, "Wrong size on CoreGameFunctionLibrary_AddDataTableRow");
static_assert(offsetof(CoreGameFunctionLibrary_AddDataTableRow, DataTable) == 0x000000, "Member 'CoreGameFunctionLibrary_AddDataTableRow::DataTable' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddDataTableRow, RowName) == 0x000008, "Member 'CoreGameFunctionLibrary_AddDataTableRow::RowName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddDataTableRow, ReturnValue) == 0x000010, "Member 'CoreGameFunctionLibrary_AddDataTableRow::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AddStaticMeshComponent
// 0x0060 (0x0060 - 0x0000)
struct CoreGameFunctionLibrary_AddStaticMeshComponent final
{
public:
	class USceneComponent*                        AttachToComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0020(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0050(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_AddStaticMeshComponent) == 0x000010, "Wrong alignment on CoreGameFunctionLibrary_AddStaticMeshComponent");
static_assert(sizeof(CoreGameFunctionLibrary_AddStaticMeshComponent) == 0x000060, "Wrong size on CoreGameFunctionLibrary_AddStaticMeshComponent");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponent, AttachToComponent) == 0x000000, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponent::AttachToComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponent, StaticMesh) == 0x000008, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponent::StaticMesh' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponent, SocketName) == 0x000010, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponent::SocketName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponent, RelativeTransform) == 0x000020, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponent::RelativeTransform' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponent, ReturnValue) == 0x000050, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponent::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AddStaticMeshComponentInEditor
// 0x0050 (0x0050 - 0x0000)
struct CoreGameFunctionLibrary_AddStaticMeshComponentInEditor final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0040(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor) == 0x000010, "Wrong alignment on CoreGameFunctionLibrary_AddStaticMeshComponentInEditor");
static_assert(sizeof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor) == 0x000050, "Wrong size on CoreGameFunctionLibrary_AddStaticMeshComponentInEditor");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor, Owner) == 0x000000, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponentInEditor::Owner' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor, StaticMesh) == 0x000008, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponentInEditor::StaticMesh' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor, RelativeTransform) == 0x000010, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponentInEditor::RelativeTransform' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AddStaticMeshComponentInEditor, ReturnValue) == 0x000040, "Member 'CoreGameFunctionLibrary_AddStaticMeshComponentInEditor::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AngleBetweenNormals
// 0x001C (0x001C - 0x0000)
struct CoreGameFunctionLibrary_AngleBetweenNormals final
{
public:
	struct FVector                                SourceVector;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetVector;                                      // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_AngleBetweenNormals) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_AngleBetweenNormals");
static_assert(sizeof(CoreGameFunctionLibrary_AngleBetweenNormals) == 0x00001C, "Wrong size on CoreGameFunctionLibrary_AngleBetweenNormals");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenNormals, SourceVector) == 0x000000, "Member 'CoreGameFunctionLibrary_AngleBetweenNormals::SourceVector' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenNormals, TargetVector) == 0x00000C, "Member 'CoreGameFunctionLibrary_AngleBetweenNormals::TargetVector' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenNormals, ReturnValue) == 0x000018, "Member 'CoreGameFunctionLibrary_AngleBetweenNormals::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AngleBetweenVectors
// 0x001C (0x001C - 0x0000)
struct CoreGameFunctionLibrary_AngleBetweenVectors final
{
public:
	struct FVector                                SourceVector;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetVector;                                      // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_AngleBetweenVectors) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_AngleBetweenVectors");
static_assert(sizeof(CoreGameFunctionLibrary_AngleBetweenVectors) == 0x00001C, "Wrong size on CoreGameFunctionLibrary_AngleBetweenVectors");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenVectors, SourceVector) == 0x000000, "Member 'CoreGameFunctionLibrary_AngleBetweenVectors::SourceVector' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenVectors, TargetVector) == 0x00000C, "Member 'CoreGameFunctionLibrary_AngleBetweenVectors::TargetVector' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AngleBetweenVectors, ReturnValue) == 0x000018, "Member 'CoreGameFunctionLibrary_AngleBetweenVectors::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ApplySkeletalMeshBodyTransforms
// 0x0018 (0x0018 - 0x0000)
struct CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     BodyTransforms;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms");
static_assert(sizeof(CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms) == 0x000018, "Wrong size on CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms");
static_assert(offsetof(CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms, SkeletalMeshComponent) == 0x000000, "Member 'CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms, BodyTransforms) == 0x000008, "Member 'CoreGameFunctionLibrary_ApplySkeletalMeshBodyTransforms::BodyTransforms' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AttachAndModifyComponentOwnership
// 0x0018 (0x0018 - 0x0000)
struct CoreGameFunctionLibrary_AttachAndModifyComponentOwnership final
{
public:
	class USceneComponent*                        TransferComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_AttachAndModifyComponentOwnership) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_AttachAndModifyComponentOwnership");
static_assert(sizeof(CoreGameFunctionLibrary_AttachAndModifyComponentOwnership) == 0x000018, "Wrong size on CoreGameFunctionLibrary_AttachAndModifyComponentOwnership");
static_assert(offsetof(CoreGameFunctionLibrary_AttachAndModifyComponentOwnership, TransferComponent) == 0x000000, "Member 'CoreGameFunctionLibrary_AttachAndModifyComponentOwnership::TransferComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachAndModifyComponentOwnership, AttachToComponent) == 0x000008, "Member 'CoreGameFunctionLibrary_AttachAndModifyComponentOwnership::AttachToComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachAndModifyComponentOwnership, ReturnValue) == 0x000010, "Member 'CoreGameFunctionLibrary_AttachAndModifyComponentOwnership::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.AttachDistanceFieldMeshesToSkeletalMeshComponent
// 0x0058 (0x0058 - 0x0000)
struct CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    StaticMeshes;                                      // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CollisionProfileName;                              // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrefixKey;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Delimiter;                                         // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x0048(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent");
static_assert(sizeof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent) == 0x000058, "Wrong size on CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, SkeletalMeshComponent) == 0x000000, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, StaticMeshes) == 0x000008, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::StaticMeshes' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, bVisible) == 0x000018, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::bVisible' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, CollisionProfileName) == 0x00001C, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, PrefixKey) == 0x000028, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::PrefixKey' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, Delimiter) == 0x000038, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::Delimiter' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent, RelativeRotation) == 0x000048, "Member 'CoreGameFunctionLibrary_AttachDistanceFieldMeshesToSkeletalMeshComponent::RelativeRotation' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BatchSetCustomPrimitiveData
// 0x0028 (0x0028 - 0x0000)
struct CoreGameFunctionLibrary_BatchSetCustomPrimitiveData final
{
public:
	TArray<class UPrimitiveComponent*>            PrimitiveComponents;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         DataIndex;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Values;                                            // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BatchSetCustomPrimitiveData) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BatchSetCustomPrimitiveData");
static_assert(sizeof(CoreGameFunctionLibrary_BatchSetCustomPrimitiveData) == 0x000028, "Wrong size on CoreGameFunctionLibrary_BatchSetCustomPrimitiveData");
static_assert(offsetof(CoreGameFunctionLibrary_BatchSetCustomPrimitiveData, PrimitiveComponents) == 0x000000, "Member 'CoreGameFunctionLibrary_BatchSetCustomPrimitiveData::PrimitiveComponents' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BatchSetCustomPrimitiveData, DataIndex) == 0x000010, "Member 'CoreGameFunctionLibrary_BatchSetCustomPrimitiveData::DataIndex' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BatchSetCustomPrimitiveData, Values) == 0x000018, "Member 'CoreGameFunctionLibrary_BatchSetCustomPrimitiveData::Values' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BindMontageOnBlendOutStarted
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_BindMontageOnBlendOutStarted final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> Event;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BindMontageOnBlendOutStarted) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BindMontageOnBlendOutStarted");
static_assert(sizeof(CoreGameFunctionLibrary_BindMontageOnBlendOutStarted) == 0x000020, "Wrong size on CoreGameFunctionLibrary_BindMontageOnBlendOutStarted");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnBlendOutStarted, AnimInstance) == 0x000000, "Member 'CoreGameFunctionLibrary_BindMontageOnBlendOutStarted::AnimInstance' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnBlendOutStarted, Montage) == 0x000008, "Member 'CoreGameFunctionLibrary_BindMontageOnBlendOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnBlendOutStarted, Event) == 0x000010, "Member 'CoreGameFunctionLibrary_BindMontageOnBlendOutStarted::Event' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BindMontageOnEnded
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_BindMontageOnEnded final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UAnimMontage* Montage, bool bInterrupted)> Event;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BindMontageOnEnded) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BindMontageOnEnded");
static_assert(sizeof(CoreGameFunctionLibrary_BindMontageOnEnded) == 0x000020, "Wrong size on CoreGameFunctionLibrary_BindMontageOnEnded");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnEnded, AnimInstance) == 0x000000, "Member 'CoreGameFunctionLibrary_BindMontageOnEnded::AnimInstance' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnEnded, Montage) == 0x000008, "Member 'CoreGameFunctionLibrary_BindMontageOnEnded::Montage' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BindMontageOnEnded, Event) == 0x000010, "Member 'CoreGameFunctionLibrary_BindMontageOnEnded::Event' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BitShiftLeft
// 0x000C (0x000C - 0x0000)
struct CoreGameFunctionLibrary_BitShiftLeft final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShiftBy;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BitShiftLeft) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_BitShiftLeft");
static_assert(sizeof(CoreGameFunctionLibrary_BitShiftLeft) == 0x00000C, "Wrong size on CoreGameFunctionLibrary_BitShiftLeft");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftLeft, Value) == 0x000000, "Member 'CoreGameFunctionLibrary_BitShiftLeft::Value' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftLeft, ShiftBy) == 0x000004, "Member 'CoreGameFunctionLibrary_BitShiftLeft::ShiftBy' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftLeft, ReturnValue) == 0x000008, "Member 'CoreGameFunctionLibrary_BitShiftLeft::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BitShiftRight
// 0x000C (0x000C - 0x0000)
struct CoreGameFunctionLibrary_BitShiftRight final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShiftBy;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BitShiftRight) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_BitShiftRight");
static_assert(sizeof(CoreGameFunctionLibrary_BitShiftRight) == 0x00000C, "Wrong size on CoreGameFunctionLibrary_BitShiftRight");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftRight, Value) == 0x000000, "Member 'CoreGameFunctionLibrary_BitShiftRight::Value' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftRight, ShiftBy) == 0x000004, "Member 'CoreGameFunctionLibrary_BitShiftRight::ShiftBy' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BitShiftRight, ReturnValue) == 0x000008, "Member 'CoreGameFunctionLibrary_BitShiftRight::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BoneIsChildOf
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_BoneIsChildOf final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_BoneIsChildOf) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BoneIsChildOf");
static_assert(sizeof(CoreGameFunctionLibrary_BoneIsChildOf) == 0x000020, "Wrong size on CoreGameFunctionLibrary_BoneIsChildOf");
static_assert(offsetof(CoreGameFunctionLibrary_BoneIsChildOf, SkeletalMesh) == 0x000000, "Member 'CoreGameFunctionLibrary_BoneIsChildOf::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BoneIsChildOf, BoneName) == 0x000008, "Member 'CoreGameFunctionLibrary_BoneIsChildOf::BoneName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BoneIsChildOf, ParentBoneName) == 0x000010, "Member 'CoreGameFunctionLibrary_BoneIsChildOf::ParentBoneName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BoneIsChildOf, ReturnValue) == 0x000018, "Member 'CoreGameFunctionLibrary_BoneIsChildOf::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BreakEnumHandleToNames
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_BreakEnumHandleToNames final
{
public:
	struct FEnumHandle                            EnumHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   EnumHandleName;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EnumeratorName;                                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BreakEnumHandleToNames) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BreakEnumHandleToNames");
static_assert(sizeof(CoreGameFunctionLibrary_BreakEnumHandleToNames) == 0x000020, "Wrong size on CoreGameFunctionLibrary_BreakEnumHandleToNames");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToNames, EnumHandle) == 0x000000, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToNames::EnumHandle' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToNames, EnumHandleName) == 0x000010, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToNames::EnumHandleName' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToNames, EnumeratorName) == 0x000018, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToNames::EnumeratorName' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.BreakEnumHandleToStrings
// 0x0030 (0x0030 - 0x0000)
struct CoreGameFunctionLibrary_BreakEnumHandleToStrings final
{
public:
	struct FEnumHandle                            EnumHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 EnumHandleString;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnumeratorString;                                  // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_BreakEnumHandleToStrings) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_BreakEnumHandleToStrings");
static_assert(sizeof(CoreGameFunctionLibrary_BreakEnumHandleToStrings) == 0x000030, "Wrong size on CoreGameFunctionLibrary_BreakEnumHandleToStrings");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToStrings, EnumHandle) == 0x000000, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToStrings::EnumHandle' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToStrings, EnumHandleString) == 0x000010, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToStrings::EnumHandleString' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_BreakEnumHandleToStrings, EnumeratorString) == 0x000020, "Member 'CoreGameFunctionLibrary_BreakEnumHandleToStrings::EnumeratorString' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.CallEventByHandle
// 0x0018 (0x0018 - 0x0000)
struct CoreGameFunctionLibrary_CallEventByHandle final
{
public:
	struct FLatentEventHandle                     EventHandle;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_CallEventByHandle) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_CallEventByHandle");
static_assert(sizeof(CoreGameFunctionLibrary_CallEventByHandle) == 0x000018, "Wrong size on CoreGameFunctionLibrary_CallEventByHandle");
static_assert(offsetof(CoreGameFunctionLibrary_CallEventByHandle, EventHandle) == 0x000000, "Member 'CoreGameFunctionLibrary_CallEventByHandle::EventHandle' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CallEventByHandle, ReturnValue) == 0x000010, "Member 'CoreGameFunctionLibrary_CallEventByHandle::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.CallObjectEventByHandle
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_CallObjectEventByHandle final
{
public:
	struct FLatentObjectEventHandle               EventHandle;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_CallObjectEventByHandle) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_CallObjectEventByHandle");
static_assert(sizeof(CoreGameFunctionLibrary_CallObjectEventByHandle) == 0x000020, "Wrong size on CoreGameFunctionLibrary_CallObjectEventByHandle");
static_assert(offsetof(CoreGameFunctionLibrary_CallObjectEventByHandle, EventHandle) == 0x000000, "Member 'CoreGameFunctionLibrary_CallObjectEventByHandle::EventHandle' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CallObjectEventByHandle, Object) == 0x000010, "Member 'CoreGameFunctionLibrary_CallObjectEventByHandle::Object' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CallObjectEventByHandle, ReturnValue) == 0x000018, "Member 'CoreGameFunctionLibrary_CallObjectEventByHandle::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.CapsuleOverlapComponents
// 0x0060 (0x0060 - 0x0000)
struct CoreGameFunctionLibrary_CapsuleOverlapComponents final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CapsuleLocation;                                   // 0x0008(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CapsuleAxis;                                       // 0x0014(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UActorComponent>            ClassFilter;                                       // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            OutComponents;                                     // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_CapsuleOverlapComponents) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_CapsuleOverlapComponents");
static_assert(sizeof(CoreGameFunctionLibrary_CapsuleOverlapComponents) == 0x000060, "Wrong size on CoreGameFunctionLibrary_CapsuleOverlapComponents");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, WorldContextObject) == 0x000000, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::WorldContextObject' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, CapsuleLocation) == 0x000008, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::CapsuleLocation' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, CapsuleAxis) == 0x000014, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::CapsuleAxis' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, Radius) == 0x000020, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::Radius' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, HalfHeight) == 0x000024, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::HalfHeight' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, TraceChannel) == 0x000028, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::TraceChannel' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, ClassFilter) == 0x000030, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::ClassFilter' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, ActorsToIgnore) == 0x000038, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, OutComponents) == 0x000048, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::OutComponents' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_CapsuleOverlapComponents, ReturnValue) == 0x000058, "Member 'CoreGameFunctionLibrary_CapsuleOverlapComponents::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ClampAxes2D
// 0x0020 (0x0020 - 0x0000)
struct CoreGameFunctionLibrary_ClampAxes2D final
{
public:
	struct FVector2D                              Vector;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinAxisValues;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaxAxisValues;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ClampAxes2D) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_ClampAxes2D");
static_assert(sizeof(CoreGameFunctionLibrary_ClampAxes2D) == 0x000020, "Wrong size on CoreGameFunctionLibrary_ClampAxes2D");
static_assert(offsetof(CoreGameFunctionLibrary_ClampAxes2D, Vector) == 0x000000, "Member 'CoreGameFunctionLibrary_ClampAxes2D::Vector' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampAxes2D, MinAxisValues) == 0x000008, "Member 'CoreGameFunctionLibrary_ClampAxes2D::MinAxisValues' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampAxes2D, MaxAxisValues) == 0x000010, "Member 'CoreGameFunctionLibrary_ClampAxes2D::MaxAxisValues' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampAxes2D, ReturnValue) == 0x000018, "Member 'CoreGameFunctionLibrary_ClampAxes2D::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ClampPointToLozenge2D
// 0x0024 (0x0024 - 0x0000)
struct CoreGameFunctionLibrary_ClampPointToLozenge2D final
{
public:
	struct FVector2D                              Point;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LozengeCenter;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LozengeHalfExtents;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LozengeRadius;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ClampPointToLozenge2D) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_ClampPointToLozenge2D");
static_assert(sizeof(CoreGameFunctionLibrary_ClampPointToLozenge2D) == 0x000024, "Wrong size on CoreGameFunctionLibrary_ClampPointToLozenge2D");
static_assert(offsetof(CoreGameFunctionLibrary_ClampPointToLozenge2D, Point) == 0x000000, "Member 'CoreGameFunctionLibrary_ClampPointToLozenge2D::Point' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampPointToLozenge2D, LozengeCenter) == 0x000008, "Member 'CoreGameFunctionLibrary_ClampPointToLozenge2D::LozengeCenter' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampPointToLozenge2D, LozengeHalfExtents) == 0x000010, "Member 'CoreGameFunctionLibrary_ClampPointToLozenge2D::LozengeHalfExtents' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampPointToLozenge2D, LozengeRadius) == 0x000018, "Member 'CoreGameFunctionLibrary_ClampPointToLozenge2D::LozengeRadius' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClampPointToLozenge2D, ReturnValue) == 0x00001C, "Member 'CoreGameFunctionLibrary_ClampPointToLozenge2D::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ClearStaticMeshOverrideColorsForVertices
// 0x0068 (0x0068 - 0x0000)
struct CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices final
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<int32>                                   VertexIndices;                                     // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices");
static_assert(sizeof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices) == 0x000068, "Wrong size on CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices");
static_assert(offsetof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices, StaticMeshComponent) == 0x000000, "Member 'CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices, LODIndex) == 0x000008, "Member 'CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices::LODIndex' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices, VertexIndices) == 0x000010, "Member 'CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices::VertexIndices' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices, ReturnValue) == 0x000060, "Member 'CoreGameFunctionLibrary_ClearStaticMeshOverrideColorsForVertices::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ClosestPointOnBox
// 0x0034 (0x0034 - 0x0000)
struct CoreGameFunctionLibrary_ClosestPointOnBox final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ClosestPointOnBox) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_ClosestPointOnBox");
static_assert(sizeof(CoreGameFunctionLibrary_ClosestPointOnBox) == 0x000034, "Wrong size on CoreGameFunctionLibrary_ClosestPointOnBox");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointOnBox, Box) == 0x000000, "Member 'CoreGameFunctionLibrary_ClosestPointOnBox::Box' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointOnBox, Point) == 0x00001C, "Member 'CoreGameFunctionLibrary_ClosestPointOnBox::Point' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointOnBox, ReturnValue) == 0x000028, "Member 'CoreGameFunctionLibrary_ClosestPointOnBox::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ClosestPointsOnSegments
// 0x0048 (0x0048 - 0x0000)
struct CoreGameFunctionLibrary_ClosestPointsOnSegments final
{
public:
	struct FVector                                SegmentAStart;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SegmentAEnd;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SegmentBStart;                                     // 0x0018(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SegmentBEnd;                                       // 0x0024(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestOnA;                                        // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestOnB;                                        // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ClosestPointsOnSegments) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_ClosestPointsOnSegments");
static_assert(sizeof(CoreGameFunctionLibrary_ClosestPointsOnSegments) == 0x000048, "Wrong size on CoreGameFunctionLibrary_ClosestPointsOnSegments");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, SegmentAStart) == 0x000000, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::SegmentAStart' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, SegmentAEnd) == 0x00000C, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::SegmentAEnd' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, SegmentBStart) == 0x000018, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::SegmentBStart' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, SegmentBEnd) == 0x000024, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::SegmentBEnd' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, ClosestOnA) == 0x000030, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::ClosestOnA' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ClosestPointsOnSegments, ClosestOnB) == 0x00003C, "Member 'CoreGameFunctionLibrary_ClosestPointsOnSegments::ClosestOnB' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ComponentOverlapActors
// 0x0038 (0x0038 - 0x0000)
struct CoreGameFunctionLibrary_ComponentOverlapActors final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ClassFilter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_ComponentOverlapActors) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_ComponentOverlapActors");
static_assert(sizeof(CoreGameFunctionLibrary_ComponentOverlapActors) == 0x000038, "Wrong size on CoreGameFunctionLibrary_ComponentOverlapActors");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapActors, Component) == 0x000000, "Member 'CoreGameFunctionLibrary_ComponentOverlapActors::Component' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapActors, ClassFilter) == 0x000008, "Member 'CoreGameFunctionLibrary_ComponentOverlapActors::ClassFilter' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapActors, ActorsToIgnore) == 0x000010, "Member 'CoreGameFunctionLibrary_ComponentOverlapActors::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapActors, OutActors) == 0x000020, "Member 'CoreGameFunctionLibrary_ComponentOverlapActors::OutActors' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapActors, ReturnValue) == 0x000030, "Member 'CoreGameFunctionLibrary_ComponentOverlapActors::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ComponentOverlapComponents
// 0x0030 (0x0030 - 0x0000)
struct CoreGameFunctionLibrary_ComponentOverlapComponents final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            OutComponents;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CoreGameFunctionLibrary_ComponentOverlapComponents) == 0x000008, "Wrong alignment on CoreGameFunctionLibrary_ComponentOverlapComponents");
static_assert(sizeof(CoreGameFunctionLibrary_ComponentOverlapComponents) == 0x000030, "Wrong size on CoreGameFunctionLibrary_ComponentOverlapComponents");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapComponents, Component) == 0x000000, "Member 'CoreGameFunctionLibrary_ComponentOverlapComponents::Component' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapComponents, ActorsToIgnore) == 0x000008, "Member 'CoreGameFunctionLibrary_ComponentOverlapComponents::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapComponents, OutComponents) == 0x000018, "Member 'CoreGameFunctionLibrary_ComponentOverlapComponents::OutComponents' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComponentOverlapComponents, ReturnValue) == 0x000028, "Member 'CoreGameFunctionLibrary_ComponentOverlapComponents::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ComputeHorizontalFOV
// 0x0010 (0x0010 - 0x0000)
struct CoreGameFunctionLibrary_ComputeHorizontalFOV final
{
public:
	float                                         VerticalFOV;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewportSize;                                      // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreGameFunctionLibrary_ComputeHorizontalFOV) == 0x000004, "Wrong alignment on CoreGameFunctionLibrary_ComputeHorizontalFOV");
static_assert(sizeof(CoreGameFunctionLibrary_ComputeHorizontalFOV) == 0x000010, "Wrong size on CoreGameFunctionLibrary_ComputeHorizontalFOV");
static_assert(offsetof(CoreGameFunctionLibrary_ComputeHorizontalFOV, VerticalFOV) == 0x000000, "Member 'CoreGameFunctionLibrary_ComputeHorizontalFOV::VerticalFOV' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComputeHorizontalFOV, ViewportSize) == 0x000004, "Member 'CoreGameFunctionLibrary_ComputeHorizontalFOV::ViewportSize' has a wrong offset!");
static_assert(offsetof(CoreGameFunctionLibrary_ComputeHorizontalFOV, ReturnValue) == 0x00000C, "Member 'CoreGameFunctionLibrary_ComputeHorizontalFOV::ReturnValue' has a wrong offset!");

// Function CoreGame.CoreGameFunctionLibrary.ComputeVerticalFOV
