#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CORPSE_Human

#include "Basic.hpp"

#include "BodyType_structs.hpp"
#include "Enum_CorpseOutfits_structs.hpp"
#include "Enum_CauseOfDeath_structs.hpp"
#include "CORPSE_SkeletalBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_HumanCorpseLimbType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CORPSE_Human.CORPSE_Human_C
// 0x0038 (0x0440 - 0x0408)
class ACORPSE_Human_C final : public ACORPSE_SkeletalBase_C
{
public:
	class UBoxComponent*                          ScanBox;                                           // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBodyType                                     BodyType;                                          // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CorpseOutfits                            OutfitType;                                        // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CauseOfDeath                             Cause_Of_Death;                                    // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_413[0x1];                                      // 0x0413(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DismemberedLimbFlags;                              // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkinPigmentScalar;                                 // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BloodAmount_A;                                     // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         BloodAmount_B;                                     // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         BloodContrast;                                     // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                OutfitDetaill_A_Position_Offset;                   // 0x0428(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                OutfitDetaill_B_Position_Offset;                   // 0x0434(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void TryRandomizeBodyType();
	void TryRandomizeOutfit();
	void RandomizeTextureDetails();
	void DefineStartPose(class UAnimSequence* AnimSequence);
	void InitializeDismemberedLimbs();
	void ForceUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CORPSE_Human_C">();
	}
	static class ACORPSE_Human_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACORPSE_Human_C>();
	}
};
static_assert(alignof(ACORPSE_Human_C) == 0x000008, "Wrong alignment on ACORPSE_Human_C");
static_assert(sizeof(ACORPSE_Human_C) == 0x000440, "Wrong size on ACORPSE_Human_C");
static_assert(offsetof(ACORPSE_Human_C, ScanBox) == 0x000408, "Member 'ACORPSE_Human_C::ScanBox' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, BodyType) == 0x000410, "Member 'ACORPSE_Human_C::BodyType' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, OutfitType) == 0x000411, "Member 'ACORPSE_Human_C::OutfitType' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, Cause_Of_Death) == 0x000412, "Member 'ACORPSE_Human_C::Cause_Of_Death' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, DismemberedLimbFlags) == 0x000414, "Member 'ACORPSE_Human_C::DismemberedLimbFlags' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, SkinPigmentScalar) == 0x000418, "Member 'ACORPSE_Human_C::SkinPigmentScalar' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, BloodAmount_A) == 0x00041C, "Member 'ACORPSE_Human_C::BloodAmount_A' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, BloodAmount_B) == 0x000420, "Member 'ACORPSE_Human_C::BloodAmount_B' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, BloodContrast) == 0x000424, "Member 'ACORPSE_Human_C::BloodContrast' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, OutfitDetaill_A_Position_Offset) == 0x000428, "Member 'ACORPSE_Human_C::OutfitDetaill_A_Position_Offset' has a wrong offset!");
static_assert(offsetof(ACORPSE_Human_C, OutfitDetaill_B_Position_Offset) == 0x000434, "Member 'ACORPSE_Human_C::OutfitDetaill_B_Position_Offset' has a wrong offset!");

}

