#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Decoy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CYBR_Decoy.CYBR_Decoy_C.ExecuteUbergraph_CYBR_Decoy
// 0x0130 (0x0130 - 0x0000)
struct CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakePulsatingValue_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIMBP_Decoy_C*                        K2Node_DynamicCast_AsANIMBP_Decoy;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakePulsatingValue_ReturnValue_1;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakePulsatingValue_ReturnValue_2;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakePulsatingValue_ReturnValue_3;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy) == 0x000008, "Wrong alignment on CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy");
static_assert(sizeof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy) == 0x000130, "Wrong size on CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, EntryPoint) == 0x000000, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::EntryPoint' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_MakePulsatingValue_ReturnValue) == 0x000004, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_MakePulsatingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, K2Node_DynamicCast_AsANIMBP_Decoy) == 0x000018, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::K2Node_DynamicCast_AsANIMBP_Decoy' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000044, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000048, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_FMin_ReturnValue) == 0x00004C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_REase_ReturnValue) == 0x000050, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_MakePulsatingValue_ReturnValue_1) == 0x00005C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_MakePulsatingValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_MakePulsatingValue_ReturnValue_2) == 0x000064, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_MakePulsatingValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000070, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000074, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000078, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_MakePulsatingValue_ReturnValue_3) == 0x00007C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_MakePulsatingValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000080, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000084, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000088, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00008C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_MakeRotator_ReturnValue) == 0x000090, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_ComposeRotators_ReturnValue) == 0x00009C, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000A8, "Member 'CYBR_Decoy_C_ExecuteUbergraph_CYBR_Decoy::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CYBR_Decoy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Decoy_C_ReceiveTick) == 0x000004, "Wrong alignment on CYBR_Decoy_C_ReceiveTick");
static_assert(sizeof(CYBR_Decoy_C_ReceiveTick) == 0x000004, "Wrong size on CYBR_Decoy_C_ReceiveTick");
static_assert(offsetof(CYBR_Decoy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CYBR_Decoy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.EVENT_DeployDecoy
// 0x0068 (0x0068 - 0x0000)
struct CYBR_Decoy_C_EVENT_DeployDecoy final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Decoy_C_EVENT_DeployDecoy) == 0x000008, "Wrong alignment on CYBR_Decoy_C_EVENT_DeployDecoy");
static_assert(sizeof(CYBR_Decoy_C_EVENT_DeployDecoy) == 0x000068, "Wrong size on CYBR_Decoy_C_EVENT_DeployDecoy");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000010, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000058, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_DeployDecoy, CallFunc_Montage_Play_ReturnValue) == 0x000060, "Member 'CYBR_Decoy_C_EVENT_DeployDecoy::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.EVENT_PlaySearchAnimation
// 0x0020 (0x0020 - 0x0000)
struct CYBR_Decoy_C_EVENT_PlaySearchAnimation final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Decoy_C_EVENT_PlaySearchAnimation) == 0x000008, "Wrong alignment on CYBR_Decoy_C_EVENT_PlaySearchAnimation");
static_assert(sizeof(CYBR_Decoy_C_EVENT_PlaySearchAnimation) == 0x000020, "Wrong size on CYBR_Decoy_C_EVENT_PlaySearchAnimation");
static_assert(offsetof(CYBR_Decoy_C_EVENT_PlaySearchAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CYBR_Decoy_C_EVENT_PlaySearchAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_PlaySearchAnimation, CallFunc_Montage_Play_ReturnValue) == 0x000010, "Member 'CYBR_Decoy_C_EVENT_PlaySearchAnimation::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_PlaySearchAnimation, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'CYBR_Decoy_C_EVENT_PlaySearchAnimation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_PlaySearchAnimation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'CYBR_Decoy_C_EVENT_PlaySearchAnimation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.EVENT_AlertNearbyEnemies
// 0x0078 (0x0078 - 0x0000)
struct CYBR_Decoy_C_EVENT_AlertNearbyEnemies final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies) == 0x000008, "Wrong alignment on CYBR_Decoy_C_EVENT_AlertNearbyEnemies");
static_assert(sizeof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies) == 0x000078, "Wrong size on CYBR_Decoy_C_EVENT_AlertNearbyEnemies");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, Temp_object_Variable) == 0x000010, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, K2Node_MakeArray_Array) == 0x000020, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_SphereOverlapActors_OutActors) == 0x000040, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_SphereOverlapActors_ReturnValue) == 0x000050, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_Array_Get_Item) == 0x000058, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000068, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_AlertNearbyEnemies, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CYBR_Decoy_C_EVENT_AlertNearbyEnemies::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.EVENT_OnLifetimeExpired
// 0x00D0 (0x00D0 - 0x0000)
struct CYBR_Decoy_C_EVENT_OnLifetimeExpired final
{
public:
	struct FAttribModApplyData                    KillApplyData;                                     // 0x0000(0x00A0)(Edit, BlueprintVisible)
	struct FAttribDamageInstance                  CallFunc_ApplyDamageMod_OutDamageInstance;         // 0x00A0(0x0028)()
	class UAttribMod*                             CallFunc_ApplyDamageMod_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Decoy_C_EVENT_OnLifetimeExpired) == 0x000008, "Wrong alignment on CYBR_Decoy_C_EVENT_OnLifetimeExpired");
static_assert(sizeof(CYBR_Decoy_C_EVENT_OnLifetimeExpired) == 0x0000D0, "Wrong size on CYBR_Decoy_C_EVENT_OnLifetimeExpired");
static_assert(offsetof(CYBR_Decoy_C_EVENT_OnLifetimeExpired, KillApplyData) == 0x000000, "Member 'CYBR_Decoy_C_EVENT_OnLifetimeExpired::KillApplyData' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_OnLifetimeExpired, CallFunc_ApplyDamageMod_OutDamageInstance) == 0x0000A0, "Member 'CYBR_Decoy_C_EVENT_OnLifetimeExpired::CallFunc_ApplyDamageMod_OutDamageInstance' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_EVENT_OnLifetimeExpired, CallFunc_ApplyDamageMod_ReturnValue) == 0x0000C8, "Member 'CYBR_Decoy_C_EVENT_OnLifetimeExpired::CallFunc_ApplyDamageMod_ReturnValue' has a wrong offset!");

// Function CYBR_Decoy.CYBR_Decoy_C.OnCharacterDied
// 0x00E0 (0x00E0 - 0x0000)
struct CYBR_Decoy_C_OnCharacterDied final
{
public:
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 OtherActor;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCharacterDied_Result;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Decoy_C_OnCharacterDied) == 0x000010, "Wrong alignment on CYBR_Decoy_C_OnCharacterDied");
static_assert(sizeof(CYBR_Decoy_C_OnCharacterDied) == 0x0000E0, "Wrong size on CYBR_Decoy_C_OnCharacterDied");
static_assert(offsetof(CYBR_Decoy_C_OnCharacterDied, ImpactData) == 0x000000, "Member 'CYBR_Decoy_C_OnCharacterDied::ImpactData' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_OnCharacterDied, DamageInstance) == 0x000008, "Member 'CYBR_Decoy_C_OnCharacterDied::DamageInstance' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_OnCharacterDied, OtherActor) == 0x000030, "Member 'CYBR_Decoy_C_OnCharacterDied::OtherActor' has a wrong offset!");
static_assert(offsetof(CYBR_Decoy_C_OnCharacterDied, Result) == 0x000038, "Member 'CYBR_Decoy_C_OnCharacterDied::Result' has a wrong offset!");
