#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Switch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "CYBR_InteractBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CYBR_Switch.CYBR_Switch_C
// 0x0130 (0x0368 - 0x0238)
class ACYBR_Switch_C final : public ACYBR_InteractBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CYBR_Switch_C;                      // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   IceShield_MediumChunk4;                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_SmallChunk3;                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_LargeChunk1;                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_MediumChunk3;                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_SmallChunk1;                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_SmallChunk;                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceShield_MediumChunk2;                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        IceShieldNode;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Loop;                                        // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionSwitch;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBackplate;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActivateTimeline_Color_B007375E45A6B2748003D1AA3A5B0412; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActivateTimeline_LookAtAlpha_B007375E45A6B2748003D1AA3A5B0412; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ActivateTimeline__Direction_B007375E45A6B2748003D1AA3A5B0412; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ActivateTimeline;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACYBR_InteractBase_C*                   TargetInteract;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    SwitchQuest;                                       // 0x02D8(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   Switch_Message;                                    // 0x02E8(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           IdleColor;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACYBR_StaticWall_C*>             PathTiles;                                         // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          HighlightTrack;                                    // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               SwitchCue;                                         // 0x0328(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          StartsWithIceShields;                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         IceShieldBreakEffect;                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         IceShieldAbsorbEffect;                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CYBR_Switch(int32 EntryPoint);
	void BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);
	void ReceiveBeginPlay();
	void ActivateTimeline__UpdateFunc();
	void ActivateTimeline__FinishedFunc();
	void UserConstructionScript();
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void TryInteractWithTarget(class APAWN_SystemShockCharacter_C* Character);
	void TryCompleteStoryQuest();
	void UpdateMaterialParameters(const struct FLinearColor& Color);
	void UpdateShieldEffects(bool State, bool ShouldSpawnFX);
	void TryCreateAbsorbEffects(class UAttribDamageType* DamageType, class UOBJ_ImpactData_C* ImpactData);
	void ApplyIceShields();
	void EVENT_OnShieldValueChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CYBR_Switch_C">();
	}
	static class ACYBR_Switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACYBR_Switch_C>();
	}
};
static_assert(alignof(ACYBR_Switch_C) == 0x000008, "Wrong alignment on ACYBR_Switch_C");
static_assert(sizeof(ACYBR_Switch_C) == 0x000368, "Wrong size on ACYBR_Switch_C");
static_assert(offsetof(ACYBR_Switch_C, UberGraphFrame_CYBR_Switch_C) == 0x000238, "Member 'ACYBR_Switch_C::UberGraphFrame_CYBR_Switch_C' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_MediumChunk4) == 0x000240, "Member 'ACYBR_Switch_C::IceShield_MediumChunk4' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_SmallChunk3) == 0x000248, "Member 'ACYBR_Switch_C::IceShield_SmallChunk3' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_LargeChunk1) == 0x000250, "Member 'ACYBR_Switch_C::IceShield_LargeChunk1' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_MediumChunk3) == 0x000258, "Member 'ACYBR_Switch_C::IceShield_MediumChunk3' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_SmallChunk1) == 0x000260, "Member 'ACYBR_Switch_C::IceShield_SmallChunk1' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_SmallChunk) == 0x000268, "Member 'ACYBR_Switch_C::IceShield_SmallChunk' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShield_MediumChunk2) == 0x000270, "Member 'ACYBR_Switch_C::IceShield_MediumChunk2' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShieldNode) == 0x000278, "Member 'ACYBR_Switch_C::IceShieldNode' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, COMP_AttribManager) == 0x000280, "Member 'ACYBR_Switch_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, Audio_Loop) == 0x000288, "Member 'ACYBR_Switch_C::Audio_Loop' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, PointLight) == 0x000290, "Member 'ACYBR_Switch_C::PointLight' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, CollisionSwitch) == 0x000298, "Member 'ACYBR_Switch_C::CollisionSwitch' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, CollisionBackplate) == 0x0002A0, "Member 'ACYBR_Switch_C::CollisionBackplate' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, SkeletalMesh) == 0x0002A8, "Member 'ACYBR_Switch_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, ActivateTimeline_Color_B007375E45A6B2748003D1AA3A5B0412) == 0x0002B0, "Member 'ACYBR_Switch_C::ActivateTimeline_Color_B007375E45A6B2748003D1AA3A5B0412' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, ActivateTimeline_LookAtAlpha_B007375E45A6B2748003D1AA3A5B0412) == 0x0002C0, "Member 'ACYBR_Switch_C::ActivateTimeline_LookAtAlpha_B007375E45A6B2748003D1AA3A5B0412' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, ActivateTimeline__Direction_B007375E45A6B2748003D1AA3A5B0412) == 0x0002C4, "Member 'ACYBR_Switch_C::ActivateTimeline__Direction_B007375E45A6B2748003D1AA3A5B0412' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, ActivateTimeline) == 0x0002C8, "Member 'ACYBR_Switch_C::ActivateTimeline' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, TargetInteract) == 0x0002D0, "Member 'ACYBR_Switch_C::TargetInteract' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, SwitchQuest) == 0x0002D8, "Member 'ACYBR_Switch_C::SwitchQuest' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, Switch_Message) == 0x0002E8, "Member 'ACYBR_Switch_C::Switch_Message' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IdleColor) == 0x000300, "Member 'ACYBR_Switch_C::IdleColor' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, PathTiles) == 0x000310, "Member 'ACYBR_Switch_C::PathTiles' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, HighlightTrack) == 0x000320, "Member 'ACYBR_Switch_C::HighlightTrack' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, SwitchCue) == 0x000328, "Member 'ACYBR_Switch_C::SwitchCue' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, StartsWithIceShields) == 0x000350, "Member 'ACYBR_Switch_C::StartsWithIceShields' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShieldBreakEffect) == 0x000358, "Member 'ACYBR_Switch_C::IceShieldBreakEffect' has a wrong offset!");
static_assert(offsetof(ACYBR_Switch_C, IceShieldAbsorbEffect) == 0x000360, "Member 'ACYBR_Switch_C::IceShieldAbsorbEffect' has a wrong offset!");

}

