#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Barrier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function CYBR_Barrier.CYBR_Barrier_C.ExecuteUbergraph_CYBR_Barrier
// 0x000C (0x000C - 0x0000)
struct CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier) == 0x000004, "Wrong alignment on CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier");
static_assert(sizeof(CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier) == 0x00000C, "Wrong size on CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier");
static_assert(offsetof(CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier, EntryPoint) == 0x000000, "Member 'CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier::EntryPoint' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'CYBR_Barrier_C_ExecuteUbergraph_CYBR_Barrier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CYBR_Barrier_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_ReceiveTick) == 0x000004, "Wrong alignment on CYBR_Barrier_C_ReceiveTick");
static_assert(sizeof(CYBR_Barrier_C_ReceiveTick) == 0x000004, "Wrong size on CYBR_Barrier_C_ReceiveTick");
static_assert(offsetof(CYBR_Barrier_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CYBR_Barrier_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct CYBR_Barrier_C_UserConstructionScript final
{
public:
	struct FVector                                BoxHalfExtent;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Divide_IntPointInt_ReturnValue;           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_UserConstructionScript) == 0x000004, "Wrong alignment on CYBR_Barrier_C_UserConstructionScript");
static_assert(sizeof(CYBR_Barrier_C_UserConstructionScript) == 0x000028, "Wrong size on CYBR_Barrier_C_UserConstructionScript");
static_assert(offsetof(CYBR_Barrier_C_UserConstructionScript, BoxHalfExtent) == 0x000000, "Member 'CYBR_Barrier_C_UserConstructionScript::BoxHalfExtent' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UserConstructionScript, CallFunc_Divide_IntPointInt_ReturnValue) == 0x00000C, "Member 'CYBR_Barrier_C_UserConstructionScript::CallFunc_Divide_IntPointInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'CYBR_Barrier_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000018, "Member 'CYBR_Barrier_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'CYBR_Barrier_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.EVENT_OnEnemyDied
// 0x0038 (0x0038 - 0x0000)
struct CYBR_Barrier_C_EVENT_OnEnemyDied final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0008(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_EVENT_OnEnemyDied) == 0x000008, "Wrong alignment on CYBR_Barrier_C_EVENT_OnEnemyDied");
static_assert(sizeof(CYBR_Barrier_C_EVENT_OnEnemyDied) == 0x000038, "Wrong size on CYBR_Barrier_C_EVENT_OnEnemyDied");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnEnemyDied, Character) == 0x000000, "Member 'CYBR_Barrier_C_EVENT_OnEnemyDied::Character' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnEnemyDied, CallFunc_TryInteract_InteractResults) == 0x000008, "Member 'CYBR_Barrier_C_EVENT_OnEnemyDied::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnEnemyDied, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'CYBR_Barrier_C_EVENT_OnEnemyDied::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnEnemyDied, Temp_int_Variable) == 0x00002C, "Member 'CYBR_Barrier_C_EVENT_OnEnemyDied::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnEnemyDied, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'CYBR_Barrier_C_EVENT_OnEnemyDied::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.TryInteract
// 0x0158 (0x0158 - 0x0000)
struct CYBR_Barrier_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0048(0x0020)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x00B8(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00F0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x0118(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x0138(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_TryInteract) == 0x000008, "Wrong alignment on CYBR_Barrier_C_TryInteract");
static_assert(sizeof(CYBR_Barrier_C_TryInteract) == 0x000158, "Wrong size on CYBR_Barrier_C_TryInteract");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, SourceActor) == 0x000000, "Member 'CYBR_Barrier_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'CYBR_Barrier_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, InteractionType) == 0x000010, "Member 'CYBR_Barrier_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, InteractResults) == 0x000018, "Member 'CYBR_Barrier_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_DynamicCast_AsPAWN_Avatar) == 0x000038, "Member 'CYBR_Barrier_C_TryInteract::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CYBR_Barrier_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'CYBR_Barrier_C_TryInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_SwitchEnum_CmpSuccess_1) == 0x000042, "Member 'CYBR_Barrier_C_TryInteract::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000048, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeArray_Array) == 0x0000A8, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x0000B8, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'CYBR_Barrier_C_TryInteract::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000F0, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, CallFunc_Greater_IntInt_ReturnValue) == 0x000110, "Member 'CYBR_Barrier_C_TryInteract::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x000118, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x000138, "Member 'CYBR_Barrier_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.InitializeCyberBarrier
// 0x00A8 (0x00A8 - 0x0000)
struct CYBR_Barrier_C_InitializeCyberBarrier final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0028(0x0020)(HasGetValueTypeHash)
	ENUM_DoorState                                K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APAWN_SystemShockCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_CyberEnemy_C*                     CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_InitializeCyberBarrier) == 0x000008, "Wrong alignment on CYBR_Barrier_C_InitializeCyberBarrier");
static_assert(sizeof(CYBR_Barrier_C_InitializeCyberBarrier) == 0x0000A8, "Wrong size on CYBR_Barrier_C_InitializeCyberBarrier");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, GameInstance) == 0x000000, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::GameInstance' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_bool_Variable) == 0x000008, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_int_Variable) == 0x00000C, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_byte_Variable) == 0x000010, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, Temp_byte_Variable_1) == 0x000020, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_TryInteract_InteractResults) == 0x000028, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, K2Node_Select_Default) == 0x000048, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_NotEqual_NameName_ReturnValue) == 0x000068, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, K2Node_DynamicCast_AsGI_Single_Player) == 0x000070, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000079, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_HasCompletedStoryQuest_Completed) == 0x00007A, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_Array_Get_Item) == 0x000090, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_InitializeCyberBarrier, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'CYBR_Barrier_C_InitializeCyberBarrier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.TryOpenBarrier
// 0x0030 (0x0030 - 0x0000)
struct CYBR_Barrier_C_TryOpenBarrier final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Barrier_C_TryOpenBarrier) == 0x000008, "Wrong alignment on CYBR_Barrier_C_TryOpenBarrier");
static_assert(sizeof(CYBR_Barrier_C_TryOpenBarrier) == 0x000030, "Wrong size on CYBR_Barrier_C_TryOpenBarrier");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'CYBR_Barrier_C_TryOpenBarrier::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00000C, "Member 'CYBR_Barrier_C_TryOpenBarrier::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'CYBR_Barrier_C_TryOpenBarrier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'CYBR_Barrier_C_TryOpenBarrier::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000028, "Member 'CYBR_Barrier_C_TryOpenBarrier::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryOpenBarrier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'CYBR_Barrier_C_TryOpenBarrier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.TryCloseBarrier
// 0x0008 (0x0008 - 0x0000)
struct CYBR_Barrier_C_TryCloseBarrier final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Barrier_C_TryCloseBarrier) == 0x000004, "Wrong alignment on CYBR_Barrier_C_TryCloseBarrier");
static_assert(sizeof(CYBR_Barrier_C_TryCloseBarrier) == 0x000008, "Wrong size on CYBR_Barrier_C_TryCloseBarrier");
static_assert(offsetof(CYBR_Barrier_C_TryCloseBarrier, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'CYBR_Barrier_C_TryCloseBarrier::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_TryCloseBarrier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'CYBR_Barrier_C_TryCloseBarrier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.OnBarrierStateChanged
// 0x000A (0x000A - 0x0000)
struct CYBR_Barrier_C_OnBarrierStateChanged final
{
public:
	EVoxelNavModifierState                        Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelNavModifierState                        Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelNavModifierState                        K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_OnBarrierStateChanged) == 0x000001, "Wrong alignment on CYBR_Barrier_C_OnBarrierStateChanged");
static_assert(sizeof(CYBR_Barrier_C_OnBarrierStateChanged) == 0x00000A, "Wrong size on CYBR_Barrier_C_OnBarrierStateChanged");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_byte_Variable) == 0x000000, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_byte_Variable_1) == 0x000001, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_bool_Variable) == 0x000002, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_byte_Variable_2) == 0x000003, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_byte_Variable_3) == 0x000004, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, Temp_bool_Variable_1) == 0x000005, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, K2Node_Select_Default) == 0x000008, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_OnBarrierStateChanged, K2Node_Select_Default_1) == 0x000009, "Member 'CYBR_Barrier_C_OnBarrierStateChanged::K2Node_Select_Default_1' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.UpdateBarrierState
// 0x0034 (0x0034 - 0x0000)
struct CYBR_Barrier_C_UpdateBarrierState final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeProgress;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionProgress;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTransitionTime;                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_UpdateBarrierState) == 0x000004, "Wrong alignment on CYBR_Barrier_C_UpdateBarrierState");
static_assert(sizeof(CYBR_Barrier_C_UpdateBarrierState) == 0x000034, "Wrong size on CYBR_Barrier_C_UpdateBarrierState");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, DeltaSeconds) == 0x000000, "Member 'CYBR_Barrier_C_UpdateBarrierState::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, FadeProgress) == 0x000004, "Member 'CYBR_Barrier_C_UpdateBarrierState::FadeProgress' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, TransitionProgress) == 0x000008, "Member 'CYBR_Barrier_C_UpdateBarrierState::TransitionProgress' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, ElapsedTransitionTime) == 0x00000C, "Member 'CYBR_Barrier_C_UpdateBarrierState::ElapsedTransitionTime' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, Temp_bool_Variable) == 0x000010, "Member 'CYBR_Barrier_C_UpdateBarrierState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, Temp_byte_Variable) == 0x000011, "Member 'CYBR_Barrier_C_UpdateBarrierState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, Temp_byte_Variable_1) == 0x000012, "Member 'CYBR_Barrier_C_UpdateBarrierState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, Temp_bool_Variable_1) == 0x000013, "Member 'CYBR_Barrier_C_UpdateBarrierState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000015, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000016, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, K2Node_Select_Default) == 0x000017, "Member 'CYBR_Barrier_C_UpdateBarrierState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00001C, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, K2Node_Select_Default_1) == 0x000020, "Member 'CYBR_Barrier_C_UpdateBarrierState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_FMin_ReturnValue) == 0x000028, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00002C, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierState, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000030, "Member 'CYBR_Barrier_C_UpdateBarrierState::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.UpdateBarrierEffectsDimensions
// 0x0008 (0x0008 - 0x0000)
struct CYBR_Barrier_C_UpdateBarrierEffectsDimensions final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Barrier_C_UpdateBarrierEffectsDimensions) == 0x000004, "Wrong alignment on CYBR_Barrier_C_UpdateBarrierEffectsDimensions");
static_assert(sizeof(CYBR_Barrier_C_UpdateBarrierEffectsDimensions) == 0x000008, "Wrong size on CYBR_Barrier_C_UpdateBarrierEffectsDimensions");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierEffectsDimensions, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'CYBR_Barrier_C_UpdateBarrierEffectsDimensions::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_UpdateBarrierEffectsDimensions, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000004, "Member 'CYBR_Barrier_C_UpdateBarrierEffectsDimensions::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");

// Function CYBR_Barrier.CYBR_Barrier_C.EVENT_OnQuestStateChanged
// 0x0038 (0x0038 - 0x0000)
struct CYBR_Barrier_C_EVENT_OnQuestStateChanged final
{
public:
	class FName                                   StoryQuestName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0010(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Barrier_C_EVENT_OnQuestStateChanged) == 0x000008, "Wrong alignment on CYBR_Barrier_C_EVENT_OnQuestStateChanged");
static_assert(sizeof(CYBR_Barrier_C_EVENT_OnQuestStateChanged) == 0x000038, "Wrong size on CYBR_Barrier_C_EVENT_OnQuestStateChanged");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnQuestStateChanged, StoryQuestName) == 0x000000, "Member 'CYBR_Barrier_C_EVENT_OnQuestStateChanged::StoryQuestName' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnQuestStateChanged, Value) == 0x000008, "Member 'CYBR_Barrier_C_EVENT_OnQuestStateChanged::Value' has a wrong offset!");
static_assert(offsetof(CYBR_Barrier_C_EVENT_OnQuestStateChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000009, "Member 'CYBR_Barrier_C_EVENT_OnQuestStateChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
