#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Pickup_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CYBR_InteractBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CYBR_Pickup_Base.CYBR_Pickup_Base_C
// 0x0040 (0x0278 - 0x0238)
class ACYBR_Pickup_Base_C : public ACYBR_InteractBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CYBR_Pickup_Base_C;                 // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio_Loop;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       OverlapSphere;                                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PickupSkeletalMesh;                                // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCount;                                         // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              PickupCue;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeOutTimerHandle;                                // 0x0270(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CYBR_Pickup_Base(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void CanPickup(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void OnPickup(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void OnFadeOutPickup();
	void OnCleanup(bool* Result);
	void EVENT_OnFadeFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CYBR_Pickup_Base_C">();
	}
	static class ACYBR_Pickup_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACYBR_Pickup_Base_C>();
	}
};
static_assert(alignof(ACYBR_Pickup_Base_C) == 0x000008, "Wrong alignment on ACYBR_Pickup_Base_C");
static_assert(sizeof(ACYBR_Pickup_Base_C) == 0x000278, "Wrong size on ACYBR_Pickup_Base_C");
static_assert(offsetof(ACYBR_Pickup_Base_C, UberGraphFrame_CYBR_Pickup_Base_C) == 0x000238, "Member 'ACYBR_Pickup_Base_C::UberGraphFrame_CYBR_Pickup_Base_C' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, Audio_Loop) == 0x000240, "Member 'ACYBR_Pickup_Base_C::Audio_Loop' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, OverlapSphere) == 0x000248, "Member 'ACYBR_Pickup_Base_C::OverlapSphere' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, PickupSkeletalMesh) == 0x000250, "Member 'ACYBR_Pickup_Base_C::PickupSkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, ItemClass) == 0x000258, "Member 'ACYBR_Pickup_Base_C::ItemClass' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, ItemCount) == 0x000260, "Member 'ACYBR_Pickup_Base_C::ItemCount' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, PickupCue) == 0x000268, "Member 'ACYBR_Pickup_Base_C::PickupCue' has a wrong offset!");
static_assert(offsetof(ACYBR_Pickup_Base_C, FadeOutTimerHandle) == 0x000270, "Member 'ACYBR_Pickup_Base_C::FadeOutTimerHandle' has a wrong offset!");

}

