#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Pickup_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"


namespace SDK::Params
{

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.ExecuteUbergraph_CYBR_Pickup_Base
// 0x0020 (0x0020 - 0x0000)
struct CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPickup_Result;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnPickup_Result;                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base) == 0x000008, "Wrong alignment on CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base");
static_assert(sizeof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base) == 0x000020, "Wrong size on CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, EntryPoint) == 0x000000, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, K2Node_Event_OtherActor) == 0x000008, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000010, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, CallFunc_CanPickup_Result) == 0x000019, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::CallFunc_CanPickup_Result' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base, CallFunc_OnPickup_Result) == 0x00001A, "Member 'CYBR_Pickup_Base_C_ExecuteUbergraph_CYBR_Pickup_Base::CallFunc_OnPickup_Result' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct CYBR_Pickup_Base_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Pickup_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on CYBR_Pickup_Base_C_ReceiveActorBeginOverlap");
static_assert(sizeof(CYBR_Pickup_Base_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on CYBR_Pickup_Base_C_ReceiveActorBeginOverlap");
static_assert(offsetof(CYBR_Pickup_Base_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'CYBR_Pickup_Base_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.CanPickup
// 0x0020 (0x0020 - 0x0000)
struct CYBR_Pickup_Base_C_CanPickup final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_CanPickup) == 0x000008, "Wrong alignment on CYBR_Pickup_Base_C_CanPickup");
static_assert(sizeof(CYBR_Pickup_Base_C_CanPickup) == 0x000020, "Wrong size on CYBR_Pickup_Base_C_CanPickup");
static_assert(offsetof(CYBR_Pickup_Base_C_CanPickup, Character) == 0x000000, "Member 'CYBR_Pickup_Base_C_CanPickup::Character' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_CanPickup, Result) == 0x000008, "Member 'CYBR_Pickup_Base_C_CanPickup::Result' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_CanPickup, K2Node_DynamicCast_AsPAWN_Avatar) == 0x000010, "Member 'CYBR_Pickup_Base_C_CanPickup::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_CanPickup, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CYBR_Pickup_Base_C_CanPickup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.OnPickup
// 0x0030 (0x0030 - 0x0000)
struct CYBR_Pickup_Base_C_OnPickup final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrantItem_Result;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_OnPickup) == 0x000008, "Wrong alignment on CYBR_Pickup_Base_C_OnPickup");
static_assert(sizeof(CYBR_Pickup_Base_C_OnPickup) == 0x000030, "Wrong size on CYBR_Pickup_Base_C_OnPickup");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, Character) == 0x000000, "Member 'CYBR_Pickup_Base_C_OnPickup::Character' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, Result) == 0x000008, "Member 'CYBR_Pickup_Base_C_OnPickup::Result' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, CallFunc_IsValidClass_ReturnValue) == 0x000009, "Member 'CYBR_Pickup_Base_C_OnPickup::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, CallFunc_GetInventoryComponent_Inventory) == 0x000010, "Member 'CYBR_Pickup_Base_C_OnPickup::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000018, "Member 'CYBR_Pickup_Base_C_OnPickup::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnPickup, CallFunc_GrantItem_Result) == 0x000028, "Member 'CYBR_Pickup_Base_C_OnPickup::CallFunc_GrantItem_Result' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.OnFadeOutPickup
// 0x0028 (0x0028 - 0x0000)
struct CYBR_Pickup_Base_C_OnFadeOutPickup final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_OnFadeOutPickup) == 0x000008, "Wrong alignment on CYBR_Pickup_Base_C_OnFadeOutPickup");
static_assert(sizeof(CYBR_Pickup_Base_C_OnFadeOutPickup) == 0x000028, "Wrong size on CYBR_Pickup_Base_C_OnFadeOutPickup");
static_assert(offsetof(CYBR_Pickup_Base_C_OnFadeOutPickup, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CYBR_Pickup_Base_C_OnFadeOutPickup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnFadeOutPickup, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000010, "Member 'CYBR_Pickup_Base_C_OnFadeOutPickup::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnFadeOutPickup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'CYBR_Pickup_Base_C_OnFadeOutPickup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Pickup_Base_C_OnFadeOutPickup, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'CYBR_Pickup_Base_C_OnFadeOutPickup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.OnCleanup
// 0x0001 (0x0001 - 0x0000)
struct CYBR_Pickup_Base_C_OnCleanup final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_OnCleanup) == 0x000001, "Wrong alignment on CYBR_Pickup_Base_C_OnCleanup");
static_assert(sizeof(CYBR_Pickup_Base_C_OnCleanup) == 0x000001, "Wrong size on CYBR_Pickup_Base_C_OnCleanup");
static_assert(offsetof(CYBR_Pickup_Base_C_OnCleanup, Result) == 0x000000, "Member 'CYBR_Pickup_Base_C_OnCleanup::Result' has a wrong offset!");

// Function CYBR_Pickup_Base.CYBR_Pickup_Base_C.EVENT_OnFadeFinished
// 0x0001 (0x0001 - 0x0000)
struct CYBR_Pickup_Base_C_EVENT_OnFadeFinished final
{
public:
	bool                                          CallFunc_OnCleanup_Result;                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Pickup_Base_C_EVENT_OnFadeFinished) == 0x000001, "Wrong alignment on CYBR_Pickup_Base_C_EVENT_OnFadeFinished");
static_assert(sizeof(CYBR_Pickup_Base_C_EVENT_OnFadeFinished) == 0x000001, "Wrong size on CYBR_Pickup_Base_C_EVENT_OnFadeFinished");
static_assert(offsetof(CYBR_Pickup_Base_C_EVENT_OnFadeFinished, CallFunc_OnCleanup_Result) == 0x000000, "Member 'CYBR_Pickup_Base_C_EVENT_OnFadeFinished::CallFunc_OnCleanup_Result' has a wrong offset!");

}

