#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_StaticWall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"


namespace SDK::Params
{

// Function CYBR_StaticWall.CYBR_StaticWall_C.ExecuteUbergraph_CYBR_StaticWall
// 0x0004 (0x0004 - 0x0000)
struct CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall) == 0x000004, "Wrong alignment on CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall");
static_assert(sizeof(CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall) == 0x000004, "Wrong size on CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall");
static_assert(offsetof(CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall, EntryPoint) == 0x000000, "Member 'CYBR_StaticWall_C_ExecuteUbergraph_CYBR_StaticWall::EntryPoint' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct CYBR_StaticWall_C_UserConstructionScript final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UBatchedLevelVoxelization*              BatchedLevelVoxelization;                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_UserConstructionScript) == 0x000008, "Wrong alignment on CYBR_StaticWall_C_UserConstructionScript");
static_assert(sizeof(CYBR_StaticWall_C_UserConstructionScript) == 0x000018, "Wrong size on CYBR_StaticWall_C_UserConstructionScript");
static_assert(offsetof(CYBR_StaticWall_C_UserConstructionScript, WallLocation) == 0x000000, "Member 'CYBR_StaticWall_C_UserConstructionScript::WallLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_UserConstructionScript, BatchedLevelVoxelization) == 0x000010, "Member 'CYBR_StaticWall_C_UserConstructionScript::BatchedLevelVoxelization' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.GetVoxelIndexFromVoxelLocation
// 0x01A0 (0x01A0 - 0x0000)
struct CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation final
{
public:
	class UBatchedLevelVoxelization*              BatchedLevelVoxelization;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             VoxelLocation;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VoxelIndex;                                        // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             LocalVoxelLocation;                                // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             VoxelDimensions;                                   // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundsFullExtent;                             // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundsHalfExtent;                             // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalBoundsOrigin;                                 // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalLocation;                                     // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x00E4(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue_1;           // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_1;                     // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldCenterLocationFromVoxelLocation_ReturnValue; // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation) == 0x000010, "Wrong alignment on CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation");
static_assert(sizeof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation) == 0x0001A0, "Wrong size on CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, BatchedLevelVoxelization) == 0x000000, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::BatchedLevelVoxelization' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, VoxelLocation) == 0x000008, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::VoxelLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, VoxelIndex) == 0x000014, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::VoxelIndex' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, LocalVoxelLocation) == 0x000018, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::LocalVoxelLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, VoxelDimensions) == 0x000024, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::VoxelDimensions' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, LocalBoundsFullExtent) == 0x000030, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::LocalBoundsFullExtent' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, LocalBoundsHalfExtent) == 0x00003C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::LocalBoundsHalfExtent' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, LocalBoundsOrigin) == 0x000048, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::LocalBoundsOrigin' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, LocalLocation) == 0x000054, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::LocalLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, WorldLocation) == 0x000060, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::WorldLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Multiply_VectorInt_ReturnValue) == 0x00006C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Divide_VectorInt_ReturnValue) == 0x000078, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Multiply_IntInt_ReturnValue) == 0x000084, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_X) == 0x000088, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_Y) == 0x00008C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_Z) == 0x000090, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000094, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Round_ReturnValue) == 0x000098, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Round_ReturnValue_1) == 0x00009C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Max_ReturnValue) == 0x0000A0, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Max_ReturnValue_1) == 0x0000A4, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Round_ReturnValue_2) == 0x0000A8, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x0000AC, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Max_ReturnValue_2) == 0x0000B0, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Max_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, K2Node_MakeStruct_IntVector) == 0x0000B8, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::K2Node_MakeStruct_IntVector' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C8, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000CC, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Vector_SnappedToGrid_ReturnValue) == 0x0000D8, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Vector_SnappedToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_GetBounds_ReturnValue) == 0x0000E4, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000100, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Divide_VectorInt_ReturnValue_1) == 0x00010C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Divide_VectorInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_X_1) == 0x000118, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_Y_1) == 0x00011C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_BreakVector_Z_1) == 0x000120, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_FTrunc_ReturnValue) == 0x000124, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_FTrunc_ReturnValue_1) == 0x000128, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_FTrunc_ReturnValue_2) == 0x00012C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, K2Node_MakeStruct_IntVector_1) == 0x000130, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::K2Node_MakeStruct_IntVector_1' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000140, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_InverseTransformLocation_ReturnValue) == 0x000170, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_Vector_Zero_ReturnValue) == 0x00017C, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation, CallFunc_GetWorldCenterLocationFromVoxelLocation_ReturnValue) == 0x000188, "Member 'CYBR_StaticWall_C_GetVoxelIndexFromVoxelLocation::CallFunc_GetWorldCenterLocationFromVoxelLocation_ReturnValue' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.ActivateCell
// 0x0030 (0x0030 - 0x0000)
struct CYBR_StaticWall_C_ActivateCell final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGM_SinglePlayer_C*                     K2Node_DynamicCast_AsGM_Single_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BitShiftLeft_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Or_IntInt_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_ActivateCell) == 0x000008, "Wrong alignment on CYBR_StaticWall_C_ActivateCell");
static_assert(sizeof(CYBR_StaticWall_C_ActivateCell) == 0x000030, "Wrong size on CYBR_StaticWall_C_ActivateCell");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, WallLocation) == 0x000000, "Member 'CYBR_StaticWall_C_ActivateCell::WallLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'CYBR_StaticWall_C_ActivateCell::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, K2Node_DynamicCast_AsGM_Single_Player) == 0x000018, "Member 'CYBR_StaticWall_C_ActivateCell::K2Node_DynamicCast_AsGM_Single_Player' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CYBR_StaticWall_C_ActivateCell::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex) == 0x000024, "Member 'CYBR_StaticWall_C_ActivateCell::CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, CallFunc_BitShiftLeft_ReturnValue) == 0x000028, "Member 'CYBR_StaticWall_C_ActivateCell::CallFunc_BitShiftLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_ActivateCell, CallFunc_Or_IntInt_ReturnValue) == 0x00002C, "Member 'CYBR_StaticWall_C_ActivateCell::CallFunc_Or_IntInt_ReturnValue' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.DeactivateCell
// 0x0038 (0x0038 - 0x0000)
struct CYBR_StaticWall_C_DeactivateCell final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGM_SinglePlayer_C*                     K2Node_DynamicCast_AsGM_Single_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BitShiftLeft_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Not_Int_ReturnValue;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_DeactivateCell) == 0x000008, "Wrong alignment on CYBR_StaticWall_C_DeactivateCell");
static_assert(sizeof(CYBR_StaticWall_C_DeactivateCell) == 0x000038, "Wrong size on CYBR_StaticWall_C_DeactivateCell");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, WallLocation) == 0x000000, "Member 'CYBR_StaticWall_C_DeactivateCell::WallLocation' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'CYBR_StaticWall_C_DeactivateCell::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, K2Node_DynamicCast_AsGM_Single_Player) == 0x000018, "Member 'CYBR_StaticWall_C_DeactivateCell::K2Node_DynamicCast_AsGM_Single_Player' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CYBR_StaticWall_C_DeactivateCell::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex) == 0x000024, "Member 'CYBR_StaticWall_C_DeactivateCell::CallFunc_GetVoxelIndexFromVoxelLocation_VoxelIndex' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, CallFunc_BitShiftLeft_ReturnValue) == 0x000028, "Member 'CYBR_StaticWall_C_DeactivateCell::CallFunc_BitShiftLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, CallFunc_Not_Int_ReturnValue) == 0x00002C, "Member 'CYBR_StaticWall_C_DeactivateCell::CallFunc_Not_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_DeactivateCell, CallFunc_And_IntInt_ReturnValue) == 0x000030, "Member 'CYBR_StaticWall_C_DeactivateCell::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.SetCyberWallColor
// 0x0020 (0x0020 - 0x0000)
struct CYBR_StaticWall_C_SetCyberWallColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_SetCyberWallColor) == 0x000010, "Wrong alignment on CYBR_StaticWall_C_SetCyberWallColor");
static_assert(sizeof(CYBR_StaticWall_C_SetCyberWallColor) == 0x000020, "Wrong size on CYBR_StaticWall_C_SetCyberWallColor");
static_assert(offsetof(CYBR_StaticWall_C_SetCyberWallColor, NewColor) == 0x000000, "Member 'CYBR_StaticWall_C_SetCyberWallColor::NewColor' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_SetCyberWallColor, K2Node_MakeStruct_Vector4) == 0x000010, "Member 'CYBR_StaticWall_C_SetCyberWallColor::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.UpdateMeshVoxelFlags
// 0x0004 (0x0004 - 0x0000)
struct CYBR_StaticWall_C_UpdateMeshVoxelFlags final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_StaticWall_C_UpdateMeshVoxelFlags) == 0x000004, "Wrong alignment on CYBR_StaticWall_C_UpdateMeshVoxelFlags");
static_assert(sizeof(CYBR_StaticWall_C_UpdateMeshVoxelFlags) == 0x000004, "Wrong size on CYBR_StaticWall_C_UpdateMeshVoxelFlags");
static_assert(offsetof(CYBR_StaticWall_C_UpdateMeshVoxelFlags, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'CYBR_StaticWall_C_UpdateMeshVoxelFlags::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function CYBR_StaticWall.CYBR_StaticWall_C.SetLowFiBehaviorState
// 0x0090 (0x0090 - 0x0000)
struct CYBR_StaticWall_C_SetLowFiBehaviorState final
{
public:
	bool                                          NewLowFiState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         SkeletalMeshComponents;                            // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_StaticWall_C_SetLowFiBehaviorState) == 0x000008, "Wrong alignment on CYBR_StaticWall_C_SetLowFiBehaviorState");
static_assert(sizeof(CYBR_StaticWall_C_SetLowFiBehaviorState) == 0x000090, "Wrong size on CYBR_StaticWall_C_SetLowFiBehaviorState");
static_assert(offsetof(CYBR_StaticWall_C_SetLowFiBehaviorState, NewLowFiState) == 0x000000, "Member 'CYBR_StaticWall_C_SetLowFiBehaviorState::NewLowFiState' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_SetLowFiBehaviorState, SkeletalMeshComponents) == 0x000008, "Member 'CYBR_StaticWall_C_SetLowFiBehaviorState::SkeletalMeshComponents' has a wrong offset!");
static_assert(offsetof(CYBR_StaticWall_C_SetLowFiBehaviorState, NiagaraComponents) == 0x000018, "Member 'CYBR_StaticWall_C_SetLowFiBehaviorState::NiagaraComponents' has a wrong offset!");
