#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Decoy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PAWN_SystemShockCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CYBR_Decoy.CYBR_Decoy_C
// 0x0060 (0x06E0 - 0x0680)
class ACYBR_Decoy_C final : public APAWN_SystemShockCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CYBR_Decoy_C;                       // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Decoy_Loop;                                        // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DecoyLifespan;                                     // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StabilizeDuration;                                 // 0x0694(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StabilizeTimeElapsed;                              // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeploySourceRotation;                              // 0x069C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               DeployTargetRotation;                              // 0x06A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UANIMBP_Decoy_C*                        AnimInstance;                                      // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeployed;                                        // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SearchAnimTimerHandle;                             // 0x06C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AlertEnemiesTimerHandle;                           // 0x06D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DestroyTimerHandle;                                // 0x06D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CYBR_Decoy(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void EVENT_DeployDecoy();
	void EVENT_PlaySearchAnimation();
	void EVENT_AlertNearbyEnemies();
	void EVENT_OnLifetimeExpired();
	void EVENT_DelayedDestroyDecoy();
	void OnCharacterDied(class UOBJ_ImpactData_C* ImpactData, const struct FAttribDamageInstance& DamageInstance, class AActor* OtherActor, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CYBR_Decoy_C">();
	}
	static class ACYBR_Decoy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACYBR_Decoy_C>();
	}
};
static_assert(alignof(ACYBR_Decoy_C) == 0x000010, "Wrong alignment on ACYBR_Decoy_C");
static_assert(sizeof(ACYBR_Decoy_C) == 0x0006E0, "Wrong size on ACYBR_Decoy_C");
static_assert(offsetof(ACYBR_Decoy_C, UberGraphFrame_CYBR_Decoy_C) == 0x000680, "Member 'ACYBR_Decoy_C::UberGraphFrame_CYBR_Decoy_C' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, Decoy_Loop) == 0x000688, "Member 'ACYBR_Decoy_C::Decoy_Loop' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, DecoyLifespan) == 0x000690, "Member 'ACYBR_Decoy_C::DecoyLifespan' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, StabilizeDuration) == 0x000694, "Member 'ACYBR_Decoy_C::StabilizeDuration' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, StabilizeTimeElapsed) == 0x000698, "Member 'ACYBR_Decoy_C::StabilizeTimeElapsed' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, DeploySourceRotation) == 0x00069C, "Member 'ACYBR_Decoy_C::DeploySourceRotation' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, DeployTargetRotation) == 0x0006A8, "Member 'ACYBR_Decoy_C::DeployTargetRotation' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, AnimInstance) == 0x0006B8, "Member 'ACYBR_Decoy_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, IsDeployed) == 0x0006C0, "Member 'ACYBR_Decoy_C::IsDeployed' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, SearchAnimTimerHandle) == 0x0006C8, "Member 'ACYBR_Decoy_C::SearchAnimTimerHandle' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, AlertEnemiesTimerHandle) == 0x0006D0, "Member 'ACYBR_Decoy_C::AlertEnemiesTimerHandle' has a wrong offset!");
static_assert(offsetof(ACYBR_Decoy_C, DestroyTimerHandle) == 0x0006D8, "Member 'ACYBR_Decoy_C::DestroyTimerHandle' has a wrong offset!");

}

