#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CYBR_Switch

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function CYBR_Switch.CYBR_Switch_C.ExecuteUbergraph_CYBR_Switch
// 0x0068 (0x0068 - 0x0000)
struct CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  K2Node_ComponentBoundEvent_DamageInstance;         // 0x0010(0x0028)()
	class UObject*                                K2Node_ComponentBoundEvent_UserParams;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      K2Node_DynamicCast_AsOBJ_Impact_Data;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIMBP_CyberSwitch_C*                  K2Node_DynamicCast_AsANIMBP_Cyber_Switch;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch) == 0x000008, "Wrong alignment on CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch");
static_assert(sizeof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch) == 0x000068, "Wrong size on CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, EntryPoint) == 0x000000, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::EntryPoint' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_ComponentBoundEvent_OtherActor) == 0x000008, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_ComponentBoundEvent_DamageInstance) == 0x000010, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_ComponentBoundEvent_DamageInstance' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_ComponentBoundEvent_UserParams) == 0x000038, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_ComponentBoundEvent_UserParams' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_DynamicCast_AsOBJ_Impact_Data) == 0x000040, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_DynamicCast_AsOBJ_Impact_Data' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_DynamicCast_AsANIMBP_Cyber_Switch) == 0x000058, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_DynamicCast_AsANIMBP_Cyber_Switch' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'CYBR_Switch_C_ExecuteUbergraph_CYBR_Switch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                UserParams;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature) == 0x000008, "Wrong alignment on CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature");
static_assert(sizeof(CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature) == 0x000038, "Wrong size on CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature");
static_assert(offsetof(CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature, DamageInstance) == 0x000008, "Member 'CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature::DamageInstance' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature, UserParams) == 0x000030, "Member 'CYBR_Switch_C_BndEvt__CYBR_Switch_COMP_AttribManager_K2Node_ComponentBoundEvent_0_OnDamageSignature__DelegateSignature::UserParams' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.TryInteract
// 0x0118 (0x0118 - 0x0000)
struct CYBR_Switch_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         Avatar;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0068(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0088(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00A8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCollisionEnabled_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00D0(0x0020)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIMBP_CyberSwitch_C*                  K2Node_DynamicCast_AsANIMBP_Cyber_Switch;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Switch_C_TryInteract) == 0x000008, "Wrong alignment on CYBR_Switch_C_TryInteract");
static_assert(sizeof(CYBR_Switch_C_TryInteract) == 0x000118, "Wrong size on CYBR_Switch_C_TryInteract");
static_assert(offsetof(CYBR_Switch_C_TryInteract, SourceActor) == 0x000000, "Member 'CYBR_Switch_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'CYBR_Switch_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, InteractionType) == 0x000010, "Member 'CYBR_Switch_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, InteractResults) == 0x000018, "Member 'CYBR_Switch_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, Avatar) == 0x000038, "Member 'CYBR_Switch_C_TryInteract::Avatar' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'CYBR_Switch_C_TryInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_AsPAWN_Avatar) == 0x000048, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x000058, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000068, "Member 'CYBR_Switch_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000088, "Member 'CYBR_Switch_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000A8, "Member 'CYBR_Switch_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_K2_IsCollisionEnabled_ReturnValue) == 0x0000C8, "Member 'CYBR_Switch_C_TryInteract::CallFunc_K2_IsCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C9, "Member 'CYBR_Switch_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000D0, "Member 'CYBR_Switch_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F0, "Member 'CYBR_Switch_C_TryInteract::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_GetAnimInstance_ReturnValue) == 0x000100, "Member 'CYBR_Switch_C_TryInteract::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_AsANIMBP_Cyber_Switch) == 0x000108, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_AsANIMBP_Cyber_Switch' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'CYBR_Switch_C_TryInteract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000111, "Member 'CYBR_Switch_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteract, CallFunc_BooleanOR_ReturnValue) == 0x000112, "Member 'CYBR_Switch_C_TryInteract::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.TryInteractWithTarget
// 0x0040 (0x0040 - 0x0000)
struct CYBR_Switch_C_TryInteractWithTarget final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0018(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Switch_C_TryInteractWithTarget) == 0x000008, "Wrong alignment on CYBR_Switch_C_TryInteractWithTarget");
static_assert(sizeof(CYBR_Switch_C_TryInteractWithTarget) == 0x000040, "Wrong size on CYBR_Switch_C_TryInteractWithTarget");
static_assert(offsetof(CYBR_Switch_C_TryInteractWithTarget, Character) == 0x000000, "Member 'CYBR_Switch_C_TryInteractWithTarget::Character' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteractWithTarget, CallFunc_TryInteract_self_CastInput) == 0x000008, "Member 'CYBR_Switch_C_TryInteractWithTarget::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteractWithTarget, CallFunc_TryInteract_InteractResults) == 0x000018, "Member 'CYBR_Switch_C_TryInteractWithTarget::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryInteractWithTarget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'CYBR_Switch_C_TryInteractWithTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.TryCompleteStoryQuest
// 0x0028 (0x0028 - 0x0000)
struct CYBR_Switch_C_TryCompleteStoryQuest final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SetCompletedStoryQuest_LogString;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_TryCompleteStoryQuest) == 0x000008, "Wrong alignment on CYBR_Switch_C_TryCompleteStoryQuest");
static_assert(sizeof(CYBR_Switch_C_TryCompleteStoryQuest) == 0x000028, "Wrong size on CYBR_Switch_C_TryCompleteStoryQuest");
static_assert(offsetof(CYBR_Switch_C_TryCompleteStoryQuest, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'CYBR_Switch_C_TryCompleteStoryQuest::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCompleteStoryQuest, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'CYBR_Switch_C_TryCompleteStoryQuest::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCompleteStoryQuest, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CYBR_Switch_C_TryCompleteStoryQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCompleteStoryQuest, CallFunc_NotEqual_NameName_ReturnValue) == 0x000011, "Member 'CYBR_Switch_C_TryCompleteStoryQuest::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCompleteStoryQuest, CallFunc_SetCompletedStoryQuest_LogString) == 0x000018, "Member 'CYBR_Switch_C_TryCompleteStoryQuest::CallFunc_SetCompletedStoryQuest_LogString' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.UpdateMaterialParameters
// 0x0040 (0x0040 - 0x0000)
struct CYBR_Switch_C_UpdateMaterialParameters final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACYBR_StaticWall_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_UpdateMaterialParameters) == 0x000010, "Wrong alignment on CYBR_Switch_C_UpdateMaterialParameters");
static_assert(sizeof(CYBR_Switch_C_UpdateMaterialParameters) == 0x000040, "Wrong size on CYBR_Switch_C_UpdateMaterialParameters");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, Color) == 0x000000, "Member 'CYBR_Switch_C_UpdateMaterialParameters::Color' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CYBR_Switch_C_UpdateMaterialParameters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'CYBR_Switch_C_UpdateMaterialParameters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'CYBR_Switch_C_UpdateMaterialParameters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, CallFunc_Array_Get_Item) == 0x000020, "Member 'CYBR_Switch_C_UpdateMaterialParameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CYBR_Switch_C_UpdateMaterialParameters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'CYBR_Switch_C_UpdateMaterialParameters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateMaterialParameters, CallFunc_MakeVector4_ReturnValue) == 0x000030, "Member 'CYBR_Switch_C_UpdateMaterialParameters::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.UpdateShieldEffects
// 0x0068 (0x0068 - 0x0000)
struct CYBR_Switch_C_UpdateShieldEffects final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldSpawnFX;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_UpdateShieldEffects) == 0x000008, "Wrong alignment on CYBR_Switch_C_UpdateShieldEffects");
static_assert(sizeof(CYBR_Switch_C_UpdateShieldEffects) == 0x000068, "Wrong size on CYBR_Switch_C_UpdateShieldEffects");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, State) == 0x000000, "Member 'CYBR_Switch_C_UpdateShieldEffects::State' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, ShouldSpawnFX) == 0x000001, "Member 'CYBR_Switch_C_UpdateShieldEffects::ShouldSpawnFX' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, Temp_bool_Variable) == 0x000002, "Member 'CYBR_Switch_C_UpdateShieldEffects::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, Temp_byte_Variable) == 0x000003, "Member 'CYBR_Switch_C_UpdateShieldEffects::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, Temp_byte_Variable_1) == 0x000004, "Member 'CYBR_Switch_C_UpdateShieldEffects::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CYBR_Switch_C_UpdateShieldEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CYBR_Switch_C_UpdateShieldEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_GetChildrenComponents_Children) == 0x000018, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, K2Node_Select_Default) == 0x000028, "Member 'CYBR_Switch_C_UpdateShieldEffects::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_Array_Get_Item) == 0x000030, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000040, "Member 'CYBR_Switch_C_UpdateShieldEffects::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CYBR_Switch_C_UpdateShieldEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00004C, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_UpdateShieldEffects, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000060, "Member 'CYBR_Switch_C_UpdateShieldEffects::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.TryCreateAbsorbEffects
// 0x0068 (0x0068 - 0x0000)
struct CYBR_Switch_C_TryCreateAbsorbEffects final
{
public:
	class UAttribDamageType*                      DamageType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactDirection;                                   // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_TryCreateAbsorbEffects) == 0x000008, "Wrong alignment on CYBR_Switch_C_TryCreateAbsorbEffects");
static_assert(sizeof(CYBR_Switch_C_TryCreateAbsorbEffects) == 0x000068, "Wrong size on CYBR_Switch_C_TryCreateAbsorbEffects");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, DamageType) == 0x000000, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::DamageType' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, ImpactData) == 0x000008, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::ImpactData' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, ImpactDirection) == 0x000010, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::ImpactDirection' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000020, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002C, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_MakeRotFromX_ReturnValue) == 0x000030, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_Normal_ReturnValue) == 0x00003C, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000048, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_TryCreateAbsorbEffects, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000060, "Member 'CYBR_Switch_C_TryCreateAbsorbEffects::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.ApplyIceShields
// 0x00C0 (0x00C0 - 0x0000)
struct CYBR_Switch_C_ApplyIceShields final
{
public:
	struct FAttribModApplyData                    IceShieldApplyData;                                // 0x0000(0x00A0)(Edit, BlueprintVisible)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	class UAttributeDef*                          CallFunc_GetShieldAttrib_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CYBR_Switch_C_ApplyIceShields) == 0x000008, "Wrong alignment on CYBR_Switch_C_ApplyIceShields");
static_assert(sizeof(CYBR_Switch_C_ApplyIceShields) == 0x0000C0, "Wrong size on CYBR_Switch_C_ApplyIceShields");
static_assert(offsetof(CYBR_Switch_C_ApplyIceShields, IceShieldApplyData) == 0x000000, "Member 'CYBR_Switch_C_ApplyIceShields::IceShieldApplyData' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ApplyIceShields, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'CYBR_Switch_C_ApplyIceShields::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ApplyIceShields, CallFunc_GetShieldAttrib_ReturnValue) == 0x0000B0, "Member 'CYBR_Switch_C_ApplyIceShields::CallFunc_GetShieldAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_ApplyIceShields, CallFunc_ApplyMod_ReturnValue) == 0x0000B8, "Member 'CYBR_Switch_C_ApplyIceShields::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

// Function CYBR_Switch.CYBR_Switch_C.EVENT_OnShieldValueChanged
// 0x000C (0x000C - 0x0000)
struct CYBR_Switch_C_EVENT_OnShieldValueChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CYBR_Switch_C_EVENT_OnShieldValueChanged) == 0x000004, "Wrong alignment on CYBR_Switch_C_EVENT_OnShieldValueChanged");
static_assert(sizeof(CYBR_Switch_C_EVENT_OnShieldValueChanged) == 0x00000C, "Wrong size on CYBR_Switch_C_EVENT_OnShieldValueChanged");
static_assert(offsetof(CYBR_Switch_C_EVENT_OnShieldValueChanged, CurrValue) == 0x000000, "Member 'CYBR_Switch_C_EVENT_OnShieldValueChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_EVENT_OnShieldValueChanged, LastValue) == 0x000004, "Member 'CYBR_Switch_C_EVENT_OnShieldValueChanged::LastValue' has a wrong offset!");
static_assert(offsetof(CYBR_Switch_C_EVENT_OnShieldValueChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'CYBR_Switch_C_EVENT_OnShieldValueChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

