#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEBRIS_Functional_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DEBRIS_Functional_Base.DEBRIS_Functional_Base_C.ExecuteUbergraph_DEBRIS_Functional_Base
// 0x0004 (0x0004 - 0x0000)
struct DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base) == 0x000004, "Wrong alignment on DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base");
static_assert(sizeof(DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base) == 0x000004, "Wrong size on DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base");
static_assert(offsetof(DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base, EntryPoint) == 0x000000, "Member 'DEBRIS_Functional_Base_C_ExecuteUbergraph_DEBRIS_Functional_Base::EntryPoint' has a wrong offset!");

// Function DEBRIS_Functional_Base.DEBRIS_Functional_Base_C.InitializeFunctionalDebris
// 0x0014 (0x0014 - 0x0000)
struct DEBRIS_Functional_Base_C_InitializeFunctionalDebris final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEBRIS_Functional_Base_C_InitializeFunctionalDebris) == 0x000004, "Wrong alignment on DEBRIS_Functional_Base_C_InitializeFunctionalDebris");
static_assert(sizeof(DEBRIS_Functional_Base_C_InitializeFunctionalDebris) == 0x000014, "Wrong size on DEBRIS_Functional_Base_C_InitializeFunctionalDebris");
static_assert(offsetof(DEBRIS_Functional_Base_C_InitializeFunctionalDebris, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'DEBRIS_Functional_Base_C_InitializeFunctionalDebris::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DEBRIS_Functional_Base_C_InitializeFunctionalDebris, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'DEBRIS_Functional_Base_C_InitializeFunctionalDebris::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function DEBRIS_Functional_Base.DEBRIS_Functional_Base_C.EVENT_OnDisableAttribChanged
// 0x0010 (0x0010 - 0x0000)
struct DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged) == 0x000004, "Wrong alignment on DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged");
static_assert(sizeof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged) == 0x000010, "Wrong size on DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged");
static_assert(offsetof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged, CurrValue) == 0x000000, "Member 'DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged, LastValue) == 0x000004, "Member 'DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged, EmissiveStrength) == 0x000008, "Member 'DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'DEBRIS_Functional_Base_C_EVENT_OnDisableAttribChanged::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function DEBRIS_Functional_Base.DEBRIS_Functional_Base_C.UpdateMeshEmissiveStrength
// 0x000C (0x000C - 0x0000)
struct DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength) == 0x000004, "Wrong alignment on DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength");
static_assert(sizeof(DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength) == 0x00000C, "Wrong size on DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength");
static_assert(offsetof(DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength, Scale) == 0x000000, "Member 'DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'DEBRIS_Functional_Base_C_UpdateMeshEmissiveStrength::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

