#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEBRIS_Breakable_Base

#include "Basic.hpp"

#include "DEBRIS_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEBRIS_Breakable_Base.DEBRIS_Breakable_Base_C
// 0x0018 (0x0278 - 0x0260)
class ADEBRIS_Breakable_Base_C : public ADEBRIS_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DEBRIS_Breakable_Base_C;            // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Broken;                                            // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DEBRIS_Breakable_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void InitializeBreakableDebris();
	void IsBroken(bool* Result);
	void OnApplyDamageImpulse(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);
	void OnBreak(bool* Result);
	void OnDamaged(class UOBJ_ImpactData_C* ImpactData, bool* Result);
	void UpdateBrokenSettings(bool DuringBeginPlay);
	void EVENT_OnDamageReceived(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEBRIS_Breakable_Base_C">();
	}
	static class ADEBRIS_Breakable_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADEBRIS_Breakable_Base_C>();
	}
};
static_assert(alignof(ADEBRIS_Breakable_Base_C) == 0x000008, "Wrong alignment on ADEBRIS_Breakable_Base_C");
static_assert(sizeof(ADEBRIS_Breakable_Base_C) == 0x000278, "Wrong size on ADEBRIS_Breakable_Base_C");
static_assert(offsetof(ADEBRIS_Breakable_Base_C, UberGraphFrame_DEBRIS_Breakable_Base_C) == 0x000260, "Member 'ADEBRIS_Breakable_Base_C::UberGraphFrame_DEBRIS_Breakable_Base_C' has a wrong offset!");
static_assert(offsetof(ADEBRIS_Breakable_Base_C, COMP_AttribManager) == 0x000268, "Member 'ADEBRIS_Breakable_Base_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(ADEBRIS_Breakable_Base_C, Broken) == 0x000270, "Member 'ADEBRIS_Breakable_Base_C::Broken' has a wrong offset!");

}

