#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEBRIS_BreakableBioTank_Base

#include "Basic.hpp"

#include "DEBRIS_Breakable_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_BiohazardBarrelCondition_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEBRIS_BreakableBioTank_Base.DEBRIS_BreakableBioTank_Base_C
// 0x00F0 (0x0368 - 0x0278)
class ADEBRIS_BreakableBioTank_Base_C : public ADEBRIS_Breakable_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DEBRIS_BreakableBioTank_Base_C;     // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        ExplosionNode;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullablePropagator_C*        COMP_VoxelCullablePropagator;                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_9E5E9F88421F5C71AD15C5A74A8A4218; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9E5E9F88421F5C71AD15C5A74A8A4218; // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_BiohazardBarrelCondition                 Condition;                                         // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasWheels;                                         // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         BiohazardMaxLBP;                                   // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFXSystemAsset>          ExplodeFX;                                         // 0x02A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          SlimeFX;                                           // 0x02D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               DestroyCue;                                        // 0x02F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                DecalScale;                                        // 0x0320(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DecalMaterial;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            NormalMesh;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DamagedMesh;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BrokenMesh;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            WheelsMesh;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BioTankMaterial;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DissipationTimerHandle;                            // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DEBRIS_BreakableBioTank_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void FadeInDecal(class ADecalActor* DecalActor);
	void BndEvt__DEBRIS_BreakableBioTank_Base_COMP_VoxelCullablePropagator_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void GetMaxLBP(int32* BioLevel);
	void InitializeBioTank();
	void UpdateBioTankDescriptor();
	void UpdateBioTankMesh();
	void UpdateBioTankVisibility(bool VisbilityState);
	void SpawnDecal(class ADecalActor** Result);
	void GetBioTankWheelsComponent(class UStaticMeshComponent** MeshComponent);
	void IgnorePhysicsBodyCollisionTemporarily(float Duration);
	void EVENT_OnStartDissipatingHazard();
	void OnBreak(bool* Result);
	void UpdateBrokenSettings(bool DuringBeginPlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEBRIS_BreakableBioTank_Base_C">();
	}
	static class ADEBRIS_BreakableBioTank_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADEBRIS_BreakableBioTank_Base_C>();
	}
};
static_assert(alignof(ADEBRIS_BreakableBioTank_Base_C) == 0x000008, "Wrong alignment on ADEBRIS_BreakableBioTank_Base_C");
static_assert(sizeof(ADEBRIS_BreakableBioTank_Base_C) == 0x000368, "Wrong size on ADEBRIS_BreakableBioTank_Base_C");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, UberGraphFrame_DEBRIS_BreakableBioTank_Base_C) == 0x000278, "Member 'ADEBRIS_BreakableBioTank_Base_C::UberGraphFrame_DEBRIS_BreakableBioTank_Base_C' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, ExplosionNode) == 0x000280, "Member 'ADEBRIS_BreakableBioTank_Base_C::ExplosionNode' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, COMP_VoxelCullablePropagator) == 0x000288, "Member 'ADEBRIS_BreakableBioTank_Base_C::COMP_VoxelCullablePropagator' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, Timeline_0_NewTrack_0_9E5E9F88421F5C71AD15C5A74A8A4218) == 0x000290, "Member 'ADEBRIS_BreakableBioTank_Base_C::Timeline_0_NewTrack_0_9E5E9F88421F5C71AD15C5A74A8A4218' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, Timeline_0__Direction_9E5E9F88421F5C71AD15C5A74A8A4218) == 0x000294, "Member 'ADEBRIS_BreakableBioTank_Base_C::Timeline_0__Direction_9E5E9F88421F5C71AD15C5A74A8A4218' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, Timeline_0) == 0x000298, "Member 'ADEBRIS_BreakableBioTank_Base_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, Condition) == 0x0002A0, "Member 'ADEBRIS_BreakableBioTank_Base_C::Condition' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, HasWheels) == 0x0002A1, "Member 'ADEBRIS_BreakableBioTank_Base_C::HasWheels' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, BiohazardMaxLBP) == 0x0002A2, "Member 'ADEBRIS_BreakableBioTank_Base_C::BiohazardMaxLBP' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, ExplodeFX) == 0x0002A8, "Member 'ADEBRIS_BreakableBioTank_Base_C::ExplodeFX' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, SlimeFX) == 0x0002D0, "Member 'ADEBRIS_BreakableBioTank_Base_C::SlimeFX' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, DestroyCue) == 0x0002F8, "Member 'ADEBRIS_BreakableBioTank_Base_C::DestroyCue' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, DecalScale) == 0x000320, "Member 'ADEBRIS_BreakableBioTank_Base_C::DecalScale' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, DecalMaterial) == 0x000330, "Member 'ADEBRIS_BreakableBioTank_Base_C::DecalMaterial' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, NormalMesh) == 0x000338, "Member 'ADEBRIS_BreakableBioTank_Base_C::NormalMesh' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, DamagedMesh) == 0x000340, "Member 'ADEBRIS_BreakableBioTank_Base_C::DamagedMesh' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, BrokenMesh) == 0x000348, "Member 'ADEBRIS_BreakableBioTank_Base_C::BrokenMesh' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, WheelsMesh) == 0x000350, "Member 'ADEBRIS_BreakableBioTank_Base_C::WheelsMesh' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, BioTankMaterial) == 0x000358, "Member 'ADEBRIS_BreakableBioTank_Base_C::BioTankMaterial' has a wrong offset!");
static_assert(offsetof(ADEBRIS_BreakableBioTank_Base_C, DissipationTimerHandle) == 0x000360, "Member 'ADEBRIS_BreakableBioTank_Base_C::DissipationTimerHandle' has a wrong offset!");

}

