#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEBRIS_DynamicMesh

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"


namespace SDK::Params
{

// Function DEBRIS_DynamicMesh.DEBRIS_DynamicMesh_C.ExecuteUbergraph_DEBRIS_DynamicMesh
// 0x0004 (0x0004 - 0x0000)
struct DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh) == 0x000004, "Wrong alignment on DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh");
static_assert(sizeof(DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh) == 0x000004, "Wrong size on DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh");
static_assert(offsetof(DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh, EntryPoint) == 0x000000, "Member 'DEBRIS_DynamicMesh_C_ExecuteUbergraph_DEBRIS_DynamicMesh::EntryPoint' has a wrong offset!");

// Function DEBRIS_DynamicMesh.DEBRIS_DynamicMesh_C.ShouldSaveActor
// 0x0038 (0x0038 - 0x0000)
struct DEBRIS_DynamicMesh_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          K2Node_MakeStruct_StreamingSaveGameActorParams;    // 0x0020(0x0018)()
};
static_assert(alignof(DEBRIS_DynamicMesh_C_ShouldSaveActor) == 0x000008, "Wrong alignment on DEBRIS_DynamicMesh_C_ShouldSaveActor");
static_assert(sizeof(DEBRIS_DynamicMesh_C_ShouldSaveActor) == 0x000038, "Wrong size on DEBRIS_DynamicMesh_C_ShouldSaveActor");
static_assert(offsetof(DEBRIS_DynamicMesh_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'DEBRIS_DynamicMesh_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(DEBRIS_DynamicMesh_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'DEBRIS_DynamicMesh_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEBRIS_DynamicMesh_C_ShouldSaveActor, K2Node_MakeStruct_StreamingSaveGameActorParams) == 0x000020, "Member 'DEBRIS_DynamicMesh_C_ShouldSaveActor::K2Node_MakeStruct_StreamingSaveGameActorParams' has a wrong offset!");

// Function DEBRIS_DynamicMesh.DEBRIS_DynamicMesh_C.InitializeStaticMesh
// 0x0002 (0x0002 - 0x0000)
struct DEBRIS_DynamicMesh_C_InitializeStaticMesh final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEBRIS_DynamicMesh_C_InitializeStaticMesh) == 0x000001, "Wrong alignment on DEBRIS_DynamicMesh_C_InitializeStaticMesh");
static_assert(sizeof(DEBRIS_DynamicMesh_C_InitializeStaticMesh) == 0x000002, "Wrong size on DEBRIS_DynamicMesh_C_InitializeStaticMesh");
static_assert(offsetof(DEBRIS_DynamicMesh_C_InitializeStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'DEBRIS_DynamicMesh_C_InitializeStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEBRIS_DynamicMesh_C_InitializeStaticMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'DEBRIS_DynamicMesh_C_InitializeStaticMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

