#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_IsInPreferredRange

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DEC_IsInPreferredRange.DEC_IsInPreferredRange_C.PerformConditionCheckAI
// 0x0080 (0x0080 - 0x0000)
struct DEC_IsInPreferredRange_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToTarget;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PreferredRange;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          Enemy;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPreferredDistanceMinMax_PreferredDistance; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_IsInPreferredRange_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_IsInPreferredRange_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_IsInPreferredRange_C_PerformConditionCheckAI) == 0x000080, "Wrong size on DEC_IsInPreferredRange_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, DistanceToTarget) == 0x000014, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::DistanceToTarget' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, PreferredRange) == 0x000018, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::PreferredRange' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, Enemy) == 0x000020, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::Enemy' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000028, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_BreakVector2D_X) == 0x000034, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00004C, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_GetTarget_Target) == 0x000050, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_Get_Target_Location_Location) == 0x000058, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_Get_Target_Location_Location' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_Vector_Distance_ReturnValue) == 0x000064, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_GetPreferredDistanceMinMax_PreferredDistance) == 0x000068, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_GetPreferredDistanceMinMax_PreferredDistance' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_GetTarget_Target_1) == 0x000070, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_GetTarget_Target_1' has a wrong offset!");
static_assert(offsetof(DEC_IsInPreferredRange_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'DEC_IsInPreferredRange_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

