#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_CheckDistanceFromTarget

#include "Basic.hpp"

#include "ENUM_TargetAssignmentType_structs.hpp"
#include "AIModule_classes.hpp"
#include "ENUM_GreaterEqualLess_structs.hpp"
#include "ENUM_NormalHorizontalVertical_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEC_CheckDistanceFromTarget.DEC_CheckDistanceFromTarget_C
// 0x0010 (0x00B0 - 0x00A0)
class UDEC_CheckDistanceFromTarget_C final : public UBTDecorator_BlueprintBase
{
public:
	ENUM_TargetAssignmentType                     Target;                                            // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GreaterEqualLess                         CheckType;                                         // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_NormalHorizontalVertical                 MeasurementType;                                   // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuturePredicitionTime;                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEC_CheckDistanceFromTarget_C">();
	}
	static class UDEC_CheckDistanceFromTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEC_CheckDistanceFromTarget_C>();
	}
};
static_assert(alignof(UDEC_CheckDistanceFromTarget_C) == 0x000008, "Wrong alignment on UDEC_CheckDistanceFromTarget_C");
static_assert(sizeof(UDEC_CheckDistanceFromTarget_C) == 0x0000B0, "Wrong size on UDEC_CheckDistanceFromTarget_C");
static_assert(offsetof(UDEC_CheckDistanceFromTarget_C, Target) == 0x0000A0, "Member 'UDEC_CheckDistanceFromTarget_C::Target' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDistanceFromTarget_C, CheckType) == 0x0000A1, "Member 'UDEC_CheckDistanceFromTarget_C::CheckType' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDistanceFromTarget_C, MeasurementType) == 0x0000A2, "Member 'UDEC_CheckDistanceFromTarget_C::MeasurementType' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDistanceFromTarget_C, Distance) == 0x0000A4, "Member 'UDEC_CheckDistanceFromTarget_C::Distance' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDistanceFromTarget_C, FuturePredicitionTime) == 0x0000A8, "Member 'UDEC_CheckDistanceFromTarget_C::FuturePredicitionTime' has a wrong offset!");

}

