#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_HasCustomBehavior

#include "Basic.hpp"


namespace SDK::Params
{

// Function DEC_HasCustomBehavior.DEC_HasCustomBehavior_C.PerformConditionCheckAI
// 0x0040 (0x0040 - 0x0000)
struct DEC_HasCustomBehavior_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          CallFunc_GetActiveComboBehaviorTree_BehaviorTree;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_HasCustomBehavior_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_HasCustomBehavior_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_HasCustomBehavior_C_PerformConditionCheckAI) == 0x000040, "Wrong size on DEC_HasCustomBehavior_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, EnemyPawn) == 0x000018, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::EnemyPawn' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_GetActiveComboBehaviorTree_BehaviorTree) == 0x000030, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_GetActiveComboBehaviorTree_BehaviorTree' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_3) == 0x00003A, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_4) == 0x00003B, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00003C, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DEC_HasCustomBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_5) == 0x00003D, "Member 'DEC_HasCustomBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

}

