#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_HasIdleOverrideSequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function DEC_HasIdleOverrideSequence.DEC_HasIdleOverrideSequence_C.PerformConditionCheckAI
// 0x0060 (0x0060 - 0x0000)
struct DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          AnimInstance;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_GetIdleOverrideSequence_IdleOverride;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI) == 0x000060, "Wrong size on DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, AnimInstance) == 0x000018, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::AnimInstance' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000038, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, CallFunc_GetIdleOverrideSequence_IdleOverride) == 0x000050, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::CallFunc_GetIdleOverrideSequence_IdleOverride' has a wrong offset!");
static_assert(offsetof(DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'DEC_HasIdleOverrideSequence_C_PerformConditionCheckAI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

