#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_TriggerComboCooldown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEC_TriggerComboCooldown.DEC_TriggerComboCooldown_C
// 0x0018 (0x00B8 - 0x00A0)
class UDEC_TriggerComboCooldown_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          AlwaysTriggerEvenOnFail;                           // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DEC_TriggerComboCooldown(int32 EntryPoint);
	void ReceiveExecutionFinishAI(class AAIController* OwnerController, class APawn* ControlledPawn, EBTNodeResult NodeResult);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEC_TriggerComboCooldown_C">();
	}
	static class UDEC_TriggerComboCooldown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEC_TriggerComboCooldown_C>();
	}
};
static_assert(alignof(UDEC_TriggerComboCooldown_C) == 0x000008, "Wrong alignment on UDEC_TriggerComboCooldown_C");
static_assert(sizeof(UDEC_TriggerComboCooldown_C) == 0x0000B8, "Wrong size on UDEC_TriggerComboCooldown_C");
static_assert(offsetof(UDEC_TriggerComboCooldown_C, UberGraphFrame) == 0x0000A0, "Member 'UDEC_TriggerComboCooldown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDEC_TriggerComboCooldown_C, EnemyPawn) == 0x0000A8, "Member 'UDEC_TriggerComboCooldown_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UDEC_TriggerComboCooldown_C, AlwaysTriggerEvenOnFail) == 0x0000B0, "Member 'UDEC_TriggerComboCooldown_C::AlwaysTriggerEvenOnFail' has a wrong offset!");

}

