#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_LBC_ShouldPerformBehavior

#include "Basic.hpp"


namespace SDK::Params
{

// Function DEC_LBC_ShouldPerformBehavior.DEC_LBC_ShouldPerformBehavior_C.PerformConditionCheckAI
// 0x0050 (0x0050 - 0x0000)
struct DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalBehaviorComponent_C*              LBC;                                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalBehaviorComponent_C*              CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI) == 0x000050, "Wrong size on DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, LBC) == 0x000018, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::LBC' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, EnemyPawn) == 0x000020, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::EnemyPawn' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent) == 0x000030, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000038, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000040, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'DEC_LBC_ShouldPerformBehavior_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

