#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_HasEnemyTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function DEC_HasEnemyTarget.DEC_HasEnemyTarget_C.PerformConditionCheckAI
// 0x0070 (0x0070 - 0x0000)
struct DEC_HasEnemyTarget_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          Pawn;                                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target_2;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target_3;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_HasEnemyTarget_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_HasEnemyTarget_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_HasEnemyTarget_C_PerformConditionCheckAI) == 0x000070, "Wrong size on DEC_HasEnemyTarget_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, Result) == 0x000011, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::Result' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, Pawn) == 0x000018, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::Pawn' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_GetTarget_Target) == 0x000030, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_GetTarget_Target_1) == 0x000040, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_GetTarget_Target_1' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_1) == 0x000049, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_GetTarget_Target_2) == 0x000050, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_GetTarget_Target_2' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_2) == 0x000059, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_GetTarget_Target_3) == 0x000060, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_GetTarget_Target_3' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_3) == 0x000068, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DEC_HasEnemyTarget_C_PerformConditionCheckAI, CallFunc_Not_PreBool_ReturnValue_3) == 0x000069, "Member 'DEC_HasEnemyTarget_C_PerformConditionCheckAI::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");

}

