#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_IsAtSpawn

#include "Basic.hpp"

#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEC_IsAtSpawn.DEC_IsAtSpawn_C
// 0x0018 (0x00B8 - 0x00A0)
class UDEC_IsAtSpawn_C final : public UBTDecorator_BlueprintBase
{
public:
	bool                                          CheckLocation;                                     // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistance;                                       // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAtLocation;                                      // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CheckOrientation;                                  // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAngle;                                          // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOriented;                                        // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEC_IsAtSpawn_C">();
	}
	static class UDEC_IsAtSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEC_IsAtSpawn_C>();
	}
};
static_assert(alignof(UDEC_IsAtSpawn_C) == 0x000008, "Wrong alignment on UDEC_IsAtSpawn_C");
static_assert(sizeof(UDEC_IsAtSpawn_C) == 0x0000B8, "Wrong size on UDEC_IsAtSpawn_C");
static_assert(offsetof(UDEC_IsAtSpawn_C, CheckLocation) == 0x0000A0, "Member 'UDEC_IsAtSpawn_C::CheckLocation' has a wrong offset!");
static_assert(offsetof(UDEC_IsAtSpawn_C, MaxDistance) == 0x0000A4, "Member 'UDEC_IsAtSpawn_C::MaxDistance' has a wrong offset!");
static_assert(offsetof(UDEC_IsAtSpawn_C, IsAtLocation) == 0x0000A8, "Member 'UDEC_IsAtSpawn_C::IsAtLocation' has a wrong offset!");
static_assert(offsetof(UDEC_IsAtSpawn_C, CheckOrientation) == 0x0000A9, "Member 'UDEC_IsAtSpawn_C::CheckOrientation' has a wrong offset!");
static_assert(offsetof(UDEC_IsAtSpawn_C, MaxAngle) == 0x0000AC, "Member 'UDEC_IsAtSpawn_C::MaxAngle' has a wrong offset!");
static_assert(offsetof(UDEC_IsAtSpawn_C, IsOriented) == 0x0000B0, "Member 'UDEC_IsAtSpawn_C::IsOriented' has a wrong offset!");

}

