#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_TriggerComboCooldown

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function DEC_TriggerComboCooldown.DEC_TriggerComboCooldown_C.ExecuteUbergraph_DEC_TriggerComboCooldown
// 0x0030 (0x0030 - 0x0000)
struct DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_Event_NodeResult;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLastUsedComboIndex_LastComboIndex;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown) == 0x000008, "Wrong alignment on DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown");
static_assert(sizeof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown) == 0x000030, "Wrong size on DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, EntryPoint) == 0x000000, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::EntryPoint' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_Event_OwnerController) == 0x000008, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_Event_ControlledPawn) == 0x000010, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_Event_NodeResult) == 0x000018, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_Event_NodeResult' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown, CallFunc_GetLastUsedComboIndex_LastComboIndex) == 0x00002C, "Member 'DEC_TriggerComboCooldown_C_ExecuteUbergraph_DEC_TriggerComboCooldown::CallFunc_GetLastUsedComboIndex_LastComboIndex' has a wrong offset!");

// Function DEC_TriggerComboCooldown.DEC_TriggerComboCooldown_C.ReceiveExecutionFinishAI
// 0x0018 (0x0018 - 0x0000)
struct DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 NodeResult;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI) == 0x000008, "Wrong alignment on DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI");
static_assert(sizeof(DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI) == 0x000018, "Wrong size on DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI, OwnerController) == 0x000000, "Member 'DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI, ControlledPawn) == 0x000008, "Member 'DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI, NodeResult) == 0x000010, "Member 'DEC_TriggerComboCooldown_C_ReceiveExecutionFinishAI::NodeResult' has a wrong offset!");

// Function DEC_TriggerComboCooldown.DEC_TriggerComboCooldown_C.PerformConditionCheckAI
// 0x0018 (0x0018 - 0x0000)
struct DEC_TriggerComboCooldown_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DEC_TriggerComboCooldown_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on DEC_TriggerComboCooldown_C_PerformConditionCheckAI");
static_assert(sizeof(DEC_TriggerComboCooldown_C_PerformConditionCheckAI) == 0x000018, "Wrong size on DEC_TriggerComboCooldown_C_PerformConditionCheckAI");
static_assert(offsetof(DEC_TriggerComboCooldown_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'DEC_TriggerComboCooldown_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'DEC_TriggerComboCooldown_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(DEC_TriggerComboCooldown_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'DEC_TriggerComboCooldown_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");

}

