#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEC_CheckDetectionEvents

#include "Basic.hpp"

#include "ENUM_TargetAssignmentType_structs.hpp"
#include "ENUM_DetectionState_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DEC_CheckDetectionEvents.DEC_CheckDetectionEvents_C
// 0x0028 (0x00C8 - 0x00A0)
class UDEC_CheckDetectionEvents_C final : public UBTDecorator_BlueprintBase
{
public:
	TArray<ENUM_TargetAssignmentType>             TargetsToCheck;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<ENUM_DetectionState>                   AcceptedDetectionStates;                           // 0x00B0(0x0010)(Edit, BlueprintVisible)
	bool                                          CheckEveryDetectionEvent;                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void AllStates();
	void AllTargets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DEC_CheckDetectionEvents_C">();
	}
	static class UDEC_CheckDetectionEvents_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDEC_CheckDetectionEvents_C>();
	}
};
static_assert(alignof(UDEC_CheckDetectionEvents_C) == 0x000008, "Wrong alignment on UDEC_CheckDetectionEvents_C");
static_assert(sizeof(UDEC_CheckDetectionEvents_C) == 0x0000C8, "Wrong size on UDEC_CheckDetectionEvents_C");
static_assert(offsetof(UDEC_CheckDetectionEvents_C, TargetsToCheck) == 0x0000A0, "Member 'UDEC_CheckDetectionEvents_C::TargetsToCheck' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDetectionEvents_C, AcceptedDetectionStates) == 0x0000B0, "Member 'UDEC_CheckDetectionEvents_C::AcceptedDetectionStates' has a wrong offset!");
static_assert(offsetof(UDEC_CheckDetectionEvents_C, CheckEveryDetectionEvent) == 0x0000C0, "Member 'UDEC_CheckDetectionEvents_C::CheckEveryDetectionEvent' has a wrong offset!");

}

