#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DismembermentHeroGib_Static_Debris

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"


namespace SDK::Params
{

// Function DismembermentHeroGib_Static_Debris.DismembermentHeroGib_Static_Debris_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct DismembermentHeroGib_Static_Debris_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DismembermentHeroGib_Static_Debris_C_UserConstructionScript) == 0x000001, "Wrong alignment on DismembermentHeroGib_Static_Debris_C_UserConstructionScript");
static_assert(sizeof(DismembermentHeroGib_Static_Debris_C_UserConstructionScript) == 0x000001, "Wrong size on DismembermentHeroGib_Static_Debris_C_UserConstructionScript");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'DismembermentHeroGib_Static_Debris_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function DismembermentHeroGib_Static_Debris.DismembermentHeroGib_Static_Debris_C.ShouldSaveActor
// 0x0058 (0x0058 - 0x0000)
struct DismembermentHeroGib_Static_Debris_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          CallFunc_ShouldSaveActor_Params;                   // 0x0020(0x0018)()
	bool                                          CallFunc_ShouldSaveActor_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          K2Node_MakeStruct_StreamingSaveGameActorParams;    // 0x0040(0x0018)()
};
static_assert(alignof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor) == 0x000008, "Wrong alignment on DismembermentHeroGib_Static_Debris_C_ShouldSaveActor");
static_assert(sizeof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor) == 0x000058, "Wrong size on DismembermentHeroGib_Static_Debris_C_ShouldSaveActor");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'DismembermentHeroGib_Static_Debris_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'DismembermentHeroGib_Static_Debris_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor, CallFunc_ShouldSaveActor_Params) == 0x000020, "Member 'DismembermentHeroGib_Static_Debris_C_ShouldSaveActor::CallFunc_ShouldSaveActor_Params' has a wrong offset!");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor, CallFunc_ShouldSaveActor_ReturnValue) == 0x000038, "Member 'DismembermentHeroGib_Static_Debris_C_ShouldSaveActor::CallFunc_ShouldSaveActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DismembermentHeroGib_Static_Debris_C_ShouldSaveActor, K2Node_MakeStruct_StreamingSaveGameActorParams) == 0x000040, "Member 'DismembermentHeroGib_Static_Debris_C_ShouldSaveActor::K2Node_MakeStruct_StreamingSaveGameActorParams' has a wrong offset!");

}

