#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DismembermentLimb_HumanCorpse

#include "Basic.hpp"

#include "ENUM_HumanCorpseLimbType_structs.hpp"
#include "Enum_CorpseOutfits_structs.hpp"
#include "Engine_structs.hpp"
#include "BodyType_structs.hpp"
#include "Enum_CauseOfDeath_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DismembermentLimb_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DismembermentLimb_HumanCorpse.DismembermentLimb_HumanCorpse_C
// 0x0038 (0x02D0 - 0x0298)
class ADismembermentLimb_HumanCorpse_C final : public ADismembermentLimb_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DismembermentLimb_HumanCorpse_C;    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_HumanCorpseLimbType                      LimbType;                                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyType                                     BodyType;                                          // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CorpseOutfits                            OutfitType;                                        // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CauseOfDeath                             CauseOfDeath;                                      // 0x02A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkinPigmentScalar;                                 // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BloodAmountA;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         BloodAmountB;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         BloodContrast;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                OutfitDetaill_A_Position_Offset;                   // 0x02B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                OutfitDetaill_B_Position_Offset;                   // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DismembermentLimb_HumanCorpse(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeLimbActor(class USkeletalMesh* DisplayMesh, class USkeletalMeshComponent* SourcePoseMesh, class UOBJ_ImpactData_C* ImpactData);
	void UpdateSettingsFromCorpseActor();
	void TryRandomizeBodyType();
	void TryRandomizeOutfit();
	void ForceUpdateHumanCorpseLimb();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DismembermentLimb_HumanCorpse_C">();
	}
	static class ADismembermentLimb_HumanCorpse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADismembermentLimb_HumanCorpse_C>();
	}
};
static_assert(alignof(ADismembermentLimb_HumanCorpse_C) == 0x000008, "Wrong alignment on ADismembermentLimb_HumanCorpse_C");
static_assert(sizeof(ADismembermentLimb_HumanCorpse_C) == 0x0002D0, "Wrong size on ADismembermentLimb_HumanCorpse_C");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, UberGraphFrame_DismembermentLimb_HumanCorpse_C) == 0x000298, "Member 'ADismembermentLimb_HumanCorpse_C::UberGraphFrame_DismembermentLimb_HumanCorpse_C' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, LimbType) == 0x0002A0, "Member 'ADismembermentLimb_HumanCorpse_C::LimbType' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, BodyType) == 0x0002A1, "Member 'ADismembermentLimb_HumanCorpse_C::BodyType' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, OutfitType) == 0x0002A2, "Member 'ADismembermentLimb_HumanCorpse_C::OutfitType' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, CauseOfDeath) == 0x0002A3, "Member 'ADismembermentLimb_HumanCorpse_C::CauseOfDeath' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, SkinPigmentScalar) == 0x0002A4, "Member 'ADismembermentLimb_HumanCorpse_C::SkinPigmentScalar' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, BloodAmountA) == 0x0002A8, "Member 'ADismembermentLimb_HumanCorpse_C::BloodAmountA' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, BloodAmountB) == 0x0002AC, "Member 'ADismembermentLimb_HumanCorpse_C::BloodAmountB' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, BloodContrast) == 0x0002B0, "Member 'ADismembermentLimb_HumanCorpse_C::BloodContrast' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, OutfitDetaill_A_Position_Offset) == 0x0002B4, "Member 'ADismembermentLimb_HumanCorpse_C::OutfitDetaill_A_Position_Offset' has a wrong offset!");
static_assert(offsetof(ADismembermentLimb_HumanCorpse_C, OutfitDetaill_B_Position_Offset) == 0x0002C0, "Member 'ADismembermentLimb_HumanCorpse_C::OutfitDetaill_B_Position_Offset' has a wrong offset!");

}

