#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ELEVATOR_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_FailSucceedIgnore_structs.hpp"
#include "STRUCT_MusicParams_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_LevelAtmosphereSettings_structs.hpp"
#include "STRUC_ElevatorInfo_structs.hpp"
#include "ENUM_UpDown_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_LevelInfo_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_InnerOuter_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"


namespace SDK::Params
{

// Function ELEVATOR_Base.ELEVATOR_Base_C.ExecuteUbergraph_ELEVATOR_Base
// 0x0290 (0x0290 - 0x0000)
struct ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsElevatorOccupiedByPawn_Result;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryOpenElevatorDoors_Result;              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCloseDoors_ReturnValue;                // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyDoorClosing_Result;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00F8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UCullableVoxelActorComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetRoomAssignmentType_ReturnValue;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidOccupant_Result;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetActorLevel_ReturnValue;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveActorToLevel_ReturnValue;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStreamInTargetLevelCollection_Result;  // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bAudibleState;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartElevatorMusic_Result;             // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant_1;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryUnselectActiveControlButton_Result;    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStopElevatorMusic_Result;              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue;                       // 0x0260(0x0028)(HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base");
static_assert(sizeof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base) == 0x000290, "Wrong size on ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, EntryPoint) == 0x000000, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_Event_EndPlayReason) == 0x000005, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000008, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000010, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherComp_3) == 0x000018, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x000020, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000024, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000028, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x0000B0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherActor_2) == 0x0000B8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherComp_2) == 0x0000C0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x0000C8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_IsElevatorOccupiedByPawn_Result) == 0x0000CC, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_IsElevatorOccupiedByPawn_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_TryOpenElevatorDoors_Result) == 0x0000CD, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_TryOpenElevatorDoors_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000CE, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_CanCloseDoors_ReturnValue) == 0x0000CF, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_CanCloseDoors_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_IsAnyDoorClosing_Result) == 0x0000D0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_IsAnyDoorClosing_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x0000D1, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000D8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000E0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000E8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000F0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000F4, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_SweepResult) == 0x0000F8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_GetComponentByClass_ReturnValue) == 0x000180, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_SetRoomAssignmentType_ReturnValue) == 0x000189, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_SetRoomAssignmentType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000190, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_IsValidOccupant_Result) == 0x000199, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_IsValidOccupant_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x0001A0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_GetActorLevel_ReturnValue) == 0x0001B0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_GetActorLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_BooleanAND_ReturnValue) == 0x0001B8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_MoveActorToLevel_ReturnValue) == 0x0001B9, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_MoveActorToLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0001BC, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_IsValid_ReturnValue_1) == 0x0001CC, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_BooleanOR_ReturnValue) == 0x0001CD, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_TryStreamInTargetLevelCollection_Result) == 0x0001CE, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_TryStreamInTargetLevelCollection_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_GetSequencePlayer_ReturnValue) == 0x0001D0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_GetController_ReturnValue) == 0x0001D8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_bAudibleState) == 0x0001E0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_bAudibleState' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_TryStartElevatorMusic_Result) == 0x0001E1, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_TryStartElevatorMusic_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001E8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherActor) == 0x0001F0, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherComp) == 0x0001F8, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000200, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, Temp_object_Variable) == 0x000208, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_AsPAWN_Hacker_Implant_1) == 0x000210, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_AsPAWN_Hacker_Implant_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_bSuccess_2) == 0x000218, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_AsSound_Cue) == 0x000220, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_DynamicCast_bSuccess_3) == 0x000228, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_Not_PreBool_ReturnValue_2) == 0x000229, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_Not_PreBool_ReturnValue_3) == 0x00022A, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_CustomEvent_Loaded) == 0x000230, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_TryUnselectActiveControlButton_Result) == 0x000238, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_TryUnselectActiveControlButton_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00023C, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_Event_DeltaSeconds) == 0x00024C, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000250, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_Not_PreBool_ReturnValue_4) == 0x000258, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_TryStopElevatorMusic_Result) == 0x000259, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_TryStopElevatorMusic_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, K2Node_CustomEvent_SoundCue) == 0x000260, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::K2Node_CustomEvent_SoundCue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000288, "Member 'ELEVATOR_Base_C_ExecuteUbergraph_ELEVATOR_Base::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.PlayElevatorMovementSound
// 0x0028 (0x0028 - 0x0000)
struct ELEVATOR_Base_C_PlayElevatorMovementSound final
{
public:
	TSoftObjectPtr<class USoundCue>               SoundCue;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_PlayElevatorMovementSound) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_PlayElevatorMovementSound");
static_assert(sizeof(ELEVATOR_Base_C_PlayElevatorMovementSound) == 0x000028, "Wrong size on ELEVATOR_Base_C_PlayElevatorMovementSound");
static_assert(offsetof(ELEVATOR_Base_C_PlayElevatorMovementSound, SoundCue) == 0x000000, "Member 'ELEVATOR_Base_C_PlayElevatorMovementSound::SoundCue' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ELEVATOR_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on ELEVATOR_Base_C_ReceiveTick");
static_assert(sizeof(ELEVATOR_Base_C_ReceiveTick) == 0x000004, "Wrong size on ELEVATOR_Base_C_ReceiveTick");
static_assert(offsetof(ELEVATOR_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ELEVATOR_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_CompartmentSensor_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature final
{
public:
	bool                                          bAudibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong size on ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature, bAudibleState) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__ELEVATOR_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_4_CullableAudibilitySignature__DelegateSignature::bAudibleState' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'ELEVATOR_Base_C_BndEvt__CompartmentSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'ELEVATOR_Base_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ELEVATOR_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ELEVATOR_Base_C_ReceiveEndPlay");
static_assert(sizeof(ELEVATOR_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on ELEVATOR_Base_C_ReceiveEndPlay");
static_assert(offsetof(ELEVATOR_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ELEVATOR_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341
// 0x0008 (0x0008 - 0x0000)
struct ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341");
static_assert(sizeof(ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341) == 0x000008, "Wrong size on ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341");
static_assert(offsetof(ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341, Loaded) == 0x000000, "Member 'ELEVATOR_Base_C_OnLoaded_E8AF5A7C4E1C8638BDB1439B3EE08341::Loaded' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.EVENT_StartOpeningOuterDoor
// 0x0038 (0x0038 - 0x0000)
struct ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_ElevatorDoors_Base_C*         K2Node_DynamicCast_AsINTERACT_Elevator_Doors_Base; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActivateDoor_Result;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActivateDoor_Result_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsElevatorOccupiedByPawn_Result;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor) == 0x000008, "Wrong alignment on ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor");
static_assert(sizeof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor) == 0x000038, "Wrong size on ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, K2Node_DynamicCast_AsINTERACT_Elevator_Doors_Base) == 0x000010, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::K2Node_DynamicCast_AsINTERACT_Elevator_Doors_Base' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_ActivateDoor_Result) == 0x00001A, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_ActivateDoor_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_ActivateDoor_Result_1) == 0x00001B, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_ActivateDoor_Result_1' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_IsElevatorOccupiedByPawn_Result) == 0x00001C, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_IsElevatorOccupiedByPawn_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningOuterDoor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.EVENT_StartClosingOuterDoor
// 0x0002 (0x0002 - 0x0000)
struct ELEVATOR_Base_C_EVENT_StartClosingOuterDoor final
{
public:
	bool                                          CallFunc_ActivateDoor_Result;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ELEVATOR_Base_C_EVENT_StartClosingOuterDoor) == 0x000001, "Wrong alignment on ELEVATOR_Base_C_EVENT_StartClosingOuterDoor");
static_assert(sizeof(ELEVATOR_Base_C_EVENT_StartClosingOuterDoor) == 0x000002, "Wrong size on ELEVATOR_Base_C_EVENT_StartClosingOuterDoor");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartClosingOuterDoor, CallFunc_ActivateDoor_Result) == 0x000000, "Member 'ELEVATOR_Base_C_EVENT_StartClosingOuterDoor::CallFunc_ActivateDoor_Result' has a wrong offset!");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartClosingOuterDoor, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ELEVATOR_Base_C_EVENT_StartClosingOuterDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.EVENT_StartOpeningInnerDoor
// 0x0001 (0x0001 - 0x0000)
struct ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor final
{
public:
	bool                                          CallFunc_ActivateDoor_Result;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor) == 0x000001, "Wrong alignment on ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor");
static_assert(sizeof(ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor) == 0x000001, "Wrong size on ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor");
static_assert(offsetof(ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor, CallFunc_ActivateDoor_Result) == 0x000000, "Member 'ELEVATOR_Base_C_EVENT_StartOpeningInnerDoor::CallFunc_ActivateDoor_Result' has a wrong offset!");

// Function ELEVATOR_Base.ELEVATOR_Base_C.EVENT_OnStartedUnloadingLevelCollection
// 0x0008 (0x0008 - 0x0000)
struct ELEVATOR_Base_C_EVENT_OnStartedUnloadingLevelCollection final
{
public:
	int32                                         ElevatorIndex;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
