#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ELEVATOR_Freight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ELEVATOR_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ELEVATOR_Freight.ELEVATOR_Freight_C
// 0x0280 (0x0920 - 0x06A0)
class AELEVATOR_Freight_C final : public AELEVATOR_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ELEVATOR_Freight_C;                 // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FreightAmbSweet2;                                  // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door4;                                 // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FreightAmbSweet1;                                  // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FreightAmbSweet;                                   // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FreightAmb;                                        // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteriorDoorGlassR_DebrisVolume;                   // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteriorDoorGlassL_DebrisVolume;                   // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GlassCeilingB_DebrisVolume;                        // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GlassCeilingF_DebrisVolume;                        // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GlassCeilingM_DebrisVolume;                        // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotDoorL;                                         // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotDoorR;                                         // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_DoorInteriorR;               // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_DoorInteriorL;               // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BrokenGlass_Door;                                  // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ControlButton3_TargetBox;                          // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ControlButton2_TargetBox;                          // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ControlButton1_TargetBox;                          // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door1;                                 // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door6;                                 // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door5;                                 // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door3;                                 // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass_Door2;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass26;                                     // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass25;                                     // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass24;                                     // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass23;                                     // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass22;                                     // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass21;                                     // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass20;                                     // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass19;                                     // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass18;                                     // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass17;                                     // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass16;                                     // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass15;                                     // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass14;                                     // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass13;                                     // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass12;                                     // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass11;                                     // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass10;                                     // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass9;                                      // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass8;                                      // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BrokenGlass7;                                      // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorLF;                                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorLB;                                       // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorML;                                       // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorMR;                                       // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorRF;                                       // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotFloorRB;                                       // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorRB;                     // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorRF;                     // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorML;                     // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorMR;                     // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorLB;                     // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_FloorLF;                     // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_CeilingB;                    // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_CeilingF;                    // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FreightElevator_Glass_CeilingM;                    // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           BreakableGlassComponents;                          // 0x0880(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USpotLightComponent*>            BreakableDoorLights;                               // 0x0890(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	uint8                                         BrokenGlassBits;                                   // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A1[0x3];                                      // 0x08A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultLightIntensity;                             // 0x08A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          GlassBreakEffect;                                  // 0x08A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               GlassBreakSoundCue;                                // 0x08D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         ContributingRectLightCount;                        // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CeilingGlassDebrisTemplate;                        // 0x0900(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    DoorGlassDebrisTemplate;                           // 0x0910(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void UpdateEmissiveStrength(float Scale);
	void SetElevatorVisibility(bool VisibilityState);
	void UpdateDoorLightVisibility();
	void UpdateRectLightIntensity();
	void PlayGlassBreakEffects(class UStaticMeshComponent* BrokenGlassComponent);
	void InitializeElevator();
	void TryDamageGlass(const struct FAttribDamageInstance& DamageInstance, class UOBJ_ImpactData_C* ImpactData);
	void GetControlsMeshComponent(class UStaticMeshComponent** MeshComponent);
	void InitializeElevatorControls();
	void UserConstructionScript();
	void OnLoaded_0646D1694E49FA402640A8938BC55B31(class UObject* Loaded);
	void AsyncPlayGlassBreakParticleEffects(const struct FVector& Location, const struct FRotator& Rotation, bool IsDoorGlass);
	void BndEvt__ELEVATOR_Freight_COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);
	void ExecuteUbergraph_ELEVATOR_Freight(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ELEVATOR_Freight_C">();
	}
	static class AELEVATOR_Freight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AELEVATOR_Freight_C>();
	}
};
static_assert(alignof(AELEVATOR_Freight_C) == 0x000008, "Wrong alignment on AELEVATOR_Freight_C");
static_assert(sizeof(AELEVATOR_Freight_C) == 0x000920, "Wrong size on AELEVATOR_Freight_C");
static_assert(offsetof(AELEVATOR_Freight_C, UberGraphFrame_ELEVATOR_Freight_C) == 0x0006A0, "Member 'AELEVATOR_Freight_C::UberGraphFrame_ELEVATOR_Freight_C' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightAmbSweet2) == 0x0006A8, "Member 'AELEVATOR_Freight_C::FreightAmbSweet2' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door4) == 0x0006B0, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door4' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightAmbSweet1) == 0x0006B8, "Member 'AELEVATOR_Freight_C::FreightAmbSweet1' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightAmbSweet) == 0x0006C0, "Member 'AELEVATOR_Freight_C::FreightAmbSweet' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightAmb) == 0x0006C8, "Member 'AELEVATOR_Freight_C::FreightAmb' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, InteriorDoorGlassR_DebrisVolume) == 0x0006D0, "Member 'AELEVATOR_Freight_C::InteriorDoorGlassR_DebrisVolume' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, InteriorDoorGlassL_DebrisVolume) == 0x0006D8, "Member 'AELEVATOR_Freight_C::InteriorDoorGlassL_DebrisVolume' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, GlassCeilingB_DebrisVolume) == 0x0006E0, "Member 'AELEVATOR_Freight_C::GlassCeilingB_DebrisVolume' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, GlassCeilingF_DebrisVolume) == 0x0006E8, "Member 'AELEVATOR_Freight_C::GlassCeilingF_DebrisVolume' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, GlassCeilingM_DebrisVolume) == 0x0006F0, "Member 'AELEVATOR_Freight_C::GlassCeilingM_DebrisVolume' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotDoorL) == 0x0006F8, "Member 'AELEVATOR_Freight_C::SpotDoorL' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotDoorR) == 0x000700, "Member 'AELEVATOR_Freight_C::SpotDoorR' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_DoorInteriorR) == 0x000708, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_DoorInteriorR' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_DoorInteriorL) == 0x000710, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_DoorInteriorL' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door) == 0x000718, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, ControlButton3_TargetBox) == 0x000720, "Member 'AELEVATOR_Freight_C::ControlButton3_TargetBox' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, ControlButton2_TargetBox) == 0x000728, "Member 'AELEVATOR_Freight_C::ControlButton2_TargetBox' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, ControlButton1_TargetBox) == 0x000730, "Member 'AELEVATOR_Freight_C::ControlButton1_TargetBox' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door1) == 0x000738, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door1' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door6) == 0x000740, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door6' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door5) == 0x000748, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door5' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door3) == 0x000750, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door3' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass_Door2) == 0x000758, "Member 'AELEVATOR_Freight_C::BrokenGlass_Door2' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass26) == 0x000760, "Member 'AELEVATOR_Freight_C::BrokenGlass26' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass25) == 0x000768, "Member 'AELEVATOR_Freight_C::BrokenGlass25' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass24) == 0x000770, "Member 'AELEVATOR_Freight_C::BrokenGlass24' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass23) == 0x000778, "Member 'AELEVATOR_Freight_C::BrokenGlass23' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass22) == 0x000780, "Member 'AELEVATOR_Freight_C::BrokenGlass22' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass21) == 0x000788, "Member 'AELEVATOR_Freight_C::BrokenGlass21' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass20) == 0x000790, "Member 'AELEVATOR_Freight_C::BrokenGlass20' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass19) == 0x000798, "Member 'AELEVATOR_Freight_C::BrokenGlass19' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass18) == 0x0007A0, "Member 'AELEVATOR_Freight_C::BrokenGlass18' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass17) == 0x0007A8, "Member 'AELEVATOR_Freight_C::BrokenGlass17' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass16) == 0x0007B0, "Member 'AELEVATOR_Freight_C::BrokenGlass16' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass15) == 0x0007B8, "Member 'AELEVATOR_Freight_C::BrokenGlass15' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass14) == 0x0007C0, "Member 'AELEVATOR_Freight_C::BrokenGlass14' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass13) == 0x0007C8, "Member 'AELEVATOR_Freight_C::BrokenGlass13' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass12) == 0x0007D0, "Member 'AELEVATOR_Freight_C::BrokenGlass12' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass11) == 0x0007D8, "Member 'AELEVATOR_Freight_C::BrokenGlass11' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass10) == 0x0007E0, "Member 'AELEVATOR_Freight_C::BrokenGlass10' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass9) == 0x0007E8, "Member 'AELEVATOR_Freight_C::BrokenGlass9' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass8) == 0x0007F0, "Member 'AELEVATOR_Freight_C::BrokenGlass8' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlass7) == 0x0007F8, "Member 'AELEVATOR_Freight_C::BrokenGlass7' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorLF) == 0x000800, "Member 'AELEVATOR_Freight_C::SpotFloorLF' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorLB) == 0x000808, "Member 'AELEVATOR_Freight_C::SpotFloorLB' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorML) == 0x000810, "Member 'AELEVATOR_Freight_C::SpotFloorML' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorMR) == 0x000818, "Member 'AELEVATOR_Freight_C::SpotFloorMR' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorRF) == 0x000820, "Member 'AELEVATOR_Freight_C::SpotFloorRF' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, SpotFloorRB) == 0x000828, "Member 'AELEVATOR_Freight_C::SpotFloorRB' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, RectLight) == 0x000830, "Member 'AELEVATOR_Freight_C::RectLight' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorRB) == 0x000838, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorRB' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorRF) == 0x000840, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorRF' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorML) == 0x000848, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorML' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorMR) == 0x000850, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorMR' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorLB) == 0x000858, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorLB' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_FloorLF) == 0x000860, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_FloorLF' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_CeilingB) == 0x000868, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_CeilingB' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_CeilingF) == 0x000870, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_CeilingF' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, FreightElevator_Glass_CeilingM) == 0x000878, "Member 'AELEVATOR_Freight_C::FreightElevator_Glass_CeilingM' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BreakableGlassComponents) == 0x000880, "Member 'AELEVATOR_Freight_C::BreakableGlassComponents' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BreakableDoorLights) == 0x000890, "Member 'AELEVATOR_Freight_C::BreakableDoorLights' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, BrokenGlassBits) == 0x0008A0, "Member 'AELEVATOR_Freight_C::BrokenGlassBits' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, DefaultLightIntensity) == 0x0008A4, "Member 'AELEVATOR_Freight_C::DefaultLightIntensity' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, GlassBreakEffect) == 0x0008A8, "Member 'AELEVATOR_Freight_C::GlassBreakEffect' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, GlassBreakSoundCue) == 0x0008D0, "Member 'AELEVATOR_Freight_C::GlassBreakSoundCue' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, ContributingRectLightCount) == 0x0008F8, "Member 'AELEVATOR_Freight_C::ContributingRectLightCount' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, CeilingGlassDebrisTemplate) == 0x000900, "Member 'AELEVATOR_Freight_C::CeilingGlassDebrisTemplate' has a wrong offset!");
static_assert(offsetof(AELEVATOR_Freight_C, DoorGlassDebrisTemplate) == 0x000910, "Member 'AELEVATOR_Freight_C::DoorGlassDebrisTemplate' has a wrong offset!");

}

