#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMPGrenadeProjectile

#include "Basic.hpp"

#include "STRUCT_EnemyStats_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function EMPGrenadeProjectile.EMPGrenadeProjectile_C.OnDamageAppliedToActors
// 0x0358 (0x0358 - 0x0000)
struct EMPGrenadeProjectile_C_OnDamageAppliedToActors final
{
public:
	TMap<class UAttribMod*, struct FAttribDamageInstance> DamageInstances;                                   // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAttribModApplyData                    HealthDamageMod;                                   // 0x0050(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    ArmorReductionMod;                                 // 0x00F0(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    DisableMod;                                        // 0x0190(0x00A0)(Edit, BlueprintVisible)
	float                                         ActualDisableDuration;                             // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredDisableDuration;                            // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagneticEffectScale;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagneticResistance;                                // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScale;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribManagerComponent*                TargetAttribManager;                               // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           TargetCharacter;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             DamageMod;                                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAttribMod*>                     CallFunc_Map_Keys_Keys;                            // 0x0268(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDisableDurationScale_Result;           // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_2;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        CallFunc_GetTargetAttribInstance_ReturnValue;      // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribHandler*                         CallFunc_GetAttribHandler_ReturnValue;             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTargetActor_ReturnValue;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                K2Node_DynamicCast_AsAttrib_Manager_Component;     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EMPGrenadeProjectile_C_OnDamageAppliedToActors) == 0x000008, "Wrong alignment on EMPGrenadeProjectile_C_OnDamageAppliedToActors");
static_assert(sizeof(EMPGrenadeProjectile_C_OnDamageAppliedToActors) == 0x000358, "Wrong size on EMPGrenadeProjectile_C_OnDamageAppliedToActors");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, DamageInstances) == 0x000000, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::DamageInstances' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, HealthDamageMod) == 0x000050, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::HealthDamageMod' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, ArmorReductionMod) == 0x0000F0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::ArmorReductionMod' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, DisableMod) == 0x000190, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::DisableMod' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, ActualDisableDuration) == 0x000230, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::ActualDisableDuration' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, DesiredDisableDuration) == 0x000234, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::DesiredDisableDuration' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, MagneticEffectScale) == 0x000238, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::MagneticEffectScale' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, MagneticResistance) == 0x00023C, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::MagneticResistance' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, DamageScale) == 0x000240, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::DamageScale' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, TargetAttribManager) == 0x000248, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::TargetAttribManager' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, TargetCharacter) == 0x000250, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::TargetCharacter' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, TargetActor) == 0x000258, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::TargetActor' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, DamageMod) == 0x000260, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::DamageMod' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Map_Keys_Keys) == 0x000268, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Array_Length_ReturnValue) == 0x000278, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, Temp_int_Loop_Counter_Variable) == 0x00027C, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetAttribValue_ReturnValue) == 0x000280, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Less_IntInt_ReturnValue) == 0x000284, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Add_IntInt_ReturnValue) == 0x000288, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, Temp_int_Array_Index_Variable) == 0x00028C, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Array_Get_Item) == 0x000290, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_IsValid_ReturnValue) == 0x000298, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Add_FloatFloat_ReturnValue) == 0x00029C, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002A0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002A1, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0002A8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_IsValid_ReturnValue_1) == 0x0002B1, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_IsValid_ReturnValue_2) == 0x0002B2, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetInstigator_ReturnValue) == 0x0002B8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Divide_IntInt_ReturnValue) == 0x0002C0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0002C4, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002C8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetDisableDurationScale_Result) == 0x0002CC, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetDisableDurationScale_Result' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_ApplyMod_ReturnValue) == 0x0002D0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002D8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_IntInt_ReturnValue) == 0x0002DC, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002E0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0002E4, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002E8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002EC, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetValue_ReturnValue) == 0x0002F0, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0002F4, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetInstigator_ReturnValue_1) == 0x0002F8, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_ApplyMod_ReturnValue_1) == 0x000300, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000308, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetInstigator_ReturnValue_2) == 0x000310, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_ApplyMod_ReturnValue_2) == 0x000318, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_ApplyMod_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000320, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetTargetAttribInstance_ReturnValue) == 0x000328, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetTargetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetAttribHandler_ReturnValue) == 0x000330, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetAttribHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetTargetActor_ReturnValue) == 0x000338, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, CallFunc_GetOuterObject_ReturnValue) == 0x000340, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, K2Node_DynamicCast_AsAttrib_Manager_Component) == 0x000348, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::K2Node_DynamicCast_AsAttrib_Manager_Component' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_OnDamageAppliedToActors, K2Node_DynamicCast_bSuccess_1) == 0x000350, "Member 'EMPGrenadeProjectile_C_OnDamageAppliedToActors::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function EMPGrenadeProjectile.EMPGrenadeProjectile_C.GetDisableDurationScale
// 0x0070 (0x0070 - 0x0000)
struct EMPGrenadeProjectile_C_GetDisableDurationScale final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EnemyStats                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EMPGrenadeProjectile_C_GetDisableDurationScale) == 0x000008, "Wrong alignment on EMPGrenadeProjectile_C_GetDisableDurationScale");
static_assert(sizeof(EMPGrenadeProjectile_C_GetDisableDurationScale) == 0x000070, "Wrong size on EMPGrenadeProjectile_C_GetDisableDurationScale");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, Character) == 0x000000, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::Character' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, Result) == 0x000008, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::Result' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, CallFunc_IsPlayerControlled_ReturnValue) == 0x00000C, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000010, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EMPGrenadeProjectile_C_GetDisableDurationScale, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000069, "Member 'EMPGrenadeProjectile_C_GetDisableDurationScale::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

