#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Foil_C_Light

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Foil_C_Light.Foil_C_Light_C
// 0x0018 (0x0238 - 0x0220)
class AFoil_C_Light_C final : public AActor
{
public:
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Foil_C_Light_C">();
	}
	static class AFoil_C_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoil_C_Light_C>();
	}
};
static_assert(alignof(AFoil_C_Light_C) == 0x000008, "Wrong alignment on AFoil_C_Light_C");
static_assert(sizeof(AFoil_C_Light_C) == 0x000238, "Wrong size on AFoil_C_Light_C");
static_assert(offsetof(AFoil_C_Light_C, COMP_VoxelCullable) == 0x000220, "Member 'AFoil_C_Light_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AFoil_C_Light_C, SpotLight) == 0x000228, "Member 'AFoil_C_Light_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AFoil_C_Light_C, StaticMesh) == 0x000230, "Member 'AFoil_C_Light_C::StaticMesh' has a wrong offset!");

}

