#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FUNCLIB_Combat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_EnemyStats_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_EnemyAttackType_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "STRUCT_CombatDifficultySettings_structs.hpp"


namespace SDK::Params
{

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.HasClearShotToTargetFromLocation
// 0x01E0 (0x01E0 - 0x0000)
struct FUNCLIB_Combat_C_HasClearShotToTargetFromLocation final
{
public:
	class APAWN_Enemy_C*                          Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletRadius;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LinkedActor;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AimTargetLocation;                                 // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     SkillTarget;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetActorLinkedToEnemy_Result;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSkillTargetAimLocation_Locations;      // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_HasClearShotToTargetFromLocation");
static_assert(sizeof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation) == 0x0001E0, "Wrong size on FUNCLIB_Combat_C_HasClearShotToTargetFromLocation");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, Enemy) == 0x000000, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::Enemy' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, BarrelLocation) == 0x000008, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::BarrelLocation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, BulletRadius) == 0x000014, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::BulletRadius' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, __WorldContext) == 0x000018, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, Result) == 0x000020, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::Result' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, LinkedActor) == 0x000028, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::LinkedActor' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, AimTargetLocation) == 0x000030, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::AimTargetLocation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, SkillTarget) == 0x000040, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::SkillTarget' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, K2Node_MakeArray_Array) == 0x000050, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_GetActorLinkedToEnemy_Result) == 0x000060, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_GetActorLinkedToEnemy_Result' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_GetDetectedPawn_Pawn) == 0x000068, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, K2Node_MakeArray_Array_1) == 0x000070, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_SphereTraceSingle_OutHit) == 0x000080, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_SphereTraceSingle_ReturnValue) == 0x000108, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_Not_PreBool_ReturnValue) == 0x000109, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_GetGameInstance_ReturnValue) == 0x000110, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, K2Node_DynamicCast_AsGI_Single_Player) == 0x000118, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_GetSkillTargetAimLocation_Locations) == 0x000124, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_GetSkillTargetAimLocation_Locations' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue) == 0x000130, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000134, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_LineTraceSingle_OutHit) == 0x000140, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_LineTraceSingle_ReturnValue) == 0x0001C8, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C9, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_GetTarget_Target) == 0x0001D0, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromLocation, CallFunc_IsValid_ReturnValue_1) == 0x0001D8, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.HasClearShotToTargetFromSocket
// 0x00A0 (0x00A0 - 0x0000)
struct FUNCLIB_Combat_C_HasClearShotToTargetFromSocket final
{
public:
	class APAWN_Enemy_C*                          Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BarrelSocket;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletRadius;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LinkedActor;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AimTargetLocation;                                 // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     SkillTarget;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasClearShotToTargetFromLocation_Result;  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkillTargetAimLocation_Locations;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastSeenTimestamp_LastSeenTimestamp;   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_HasClearShotToTargetFromSocket");
static_assert(sizeof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket) == 0x0000A0, "Wrong size on FUNCLIB_Combat_C_HasClearShotToTargetFromSocket");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, Enemy) == 0x000000, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::Enemy' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, BarrelSocket) == 0x000008, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::BarrelSocket' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, BulletRadius) == 0x000010, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::BulletRadius' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, __WorldContext) == 0x000018, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, Result) == 0x000020, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::Result' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, LinkedActor) == 0x000028, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::LinkedActor' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, AimTargetLocation) == 0x000030, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::AimTargetLocation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, BarrelLocation) == 0x00003C, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::BarrelLocation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, SkillTarget) == 0x000048, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::SkillTarget' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000050, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_HasClearShotToTargetFromLocation_Result) == 0x000054, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_HasClearShotToTargetFromLocation_Result' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000064, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetSocketLocation_ReturnValue) == 0x000068, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetSkillTargetAimLocation_Locations) == 0x000074, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetSkillTargetAimLocation_Locations' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetLastSeenTimestamp_LastSeenTimestamp) == 0x000080, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetLastSeenTimestamp_LastSeenTimestamp' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetDetectedPawn_Pawn) == 0x000088, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_Less_FloatFloat_ReturnValue) == 0x000095, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_IsValid_ReturnValue_1) == 0x000096, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_IsValid_ReturnValue_2) == 0x000097, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_HasClearShotToTargetFromSocket, CallFunc_GetTarget_Target) == 0x000098, "Member 'FUNCLIB_Combat_C_HasClearShotToTargetFromSocket::CallFunc_GetTarget_Target' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetEffectiveArmorRatioFromDamage
// 0x0070 (0x0070 - 0x0000)
struct FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage final
{
public:
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockRatio;                                        // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageTickResult                CallFunc_Array_Get_Item;                           // 0x0038(0x0024)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage");
static_assert(sizeof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage) == 0x000070, "Wrong size on FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, DamageInstance) == 0x000000, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::DamageInstance' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, __WorldContext) == 0x000028, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, BlockRatio) == 0x000030, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::BlockRatio' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_Array_Get_Item) == 0x000038, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_FMax_ReturnValue) == 0x000064, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'FUNCLIB_Combat_C_GetEffectiveArmorRatioFromDamage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetMaxCombatTraceDistance
// 0x0010 (0x0010 - 0x0000)
struct FUNCLIB_Combat_C_GetMaxCombatTraceDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetMaxCombatTraceDistance) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetMaxCombatTraceDistance");
static_assert(sizeof(FUNCLIB_Combat_C_GetMaxCombatTraceDistance) == 0x000010, "Wrong size on FUNCLIB_Combat_C_GetMaxCombatTraceDistance");
static_assert(offsetof(FUNCLIB_Combat_C_GetMaxCombatTraceDistance, __WorldContext) == 0x000000, "Member 'FUNCLIB_Combat_C_GetMaxCombatTraceDistance::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetMaxCombatTraceDistance, Distance) == 0x000008, "Member 'FUNCLIB_Combat_C_GetMaxCombatTraceDistance::Distance' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetSkillTargetAimLocation
// 0x00B0 (0x00B0 - 0x0000)
struct FUNCLIB_Combat_C_GetSkillTargetAimLocation final
{
public:
	class APAWN_Enemy_C*                          SourcePawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Locations;                                         // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0xE];                                       // 0x0042(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetHeadTransform_Transform;               // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetSkillTargetAimLocation) == 0x000010, "Wrong alignment on FUNCLIB_Combat_C_GetSkillTargetAimLocation");
static_assert(sizeof(FUNCLIB_Combat_C_GetSkillTargetAimLocation) == 0x0000B0, "Wrong size on FUNCLIB_Combat_C_GetSkillTargetAimLocation");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, SourcePawn) == 0x000000, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::SourcePawn' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, __WorldContext) == 0x000008, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, Locations) == 0x000010, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::Locations' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, Target) == 0x000020, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::Target' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_Get_Target_Location_Location) == 0x000028, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_Get_Target_Location_Location' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_GetDetectedPawn_Pawn) == 0x000038, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_GetHeadTransform_Transform) == 0x000050, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_GetHeadTransform_Transform' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_BreakTransform_Location) == 0x000080, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_BreakTransform_Rotation) == 0x00008C, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_BreakTransform_Scale) == 0x000098, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_IsValid_ReturnValue_2) == 0x0000A4, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSkillTargetAimLocation, CallFunc_GetTarget_Target) == 0x0000A8, "Member 'FUNCLIB_Combat_C_GetSkillTargetAimLocation::CallFunc_GetTarget_Target' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetScaledCombatDamage
// 0x0090 (0x0090 - 0x0000)
struct FUNCLIB_Combat_C_GetScaledCombatDamage final
{
public:
	int32                                         BaseDamage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCyberspace;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Combat;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Mission;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Puzzle;               // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Cyber;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CombatDifficultySettings       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0048(0x0034)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetScaledCombatDamage) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetScaledCombatDamage");
static_assert(sizeof(FUNCLIB_Combat_C_GetScaledCombatDamage) == 0x000090, "Wrong size on FUNCLIB_Combat_C_GetScaledCombatDamage");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, BaseDamage) == 0x000000, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::BaseDamage' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, IsCyberspace) == 0x000004, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::IsCyberspace' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, __WorldContext) == 0x000008, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, DamageValue) == 0x000010, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::DamageValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, Temp_bool_Variable) == 0x000014, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, K2Node_DynamicCast_AsGI_Single_Player) == 0x000020, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDifficultyValues_Combat) == 0x000029, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDifficultyValues_Combat' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDifficultyValues_Mission) == 0x00002A, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDifficultyValues_Mission' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDifficultyValues_Puzzle) == 0x00002B, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDifficultyValues_Puzzle' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDifficultyValues_Cyber) == 0x00002C, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDifficultyValues_Cyber' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, K2Node_Select_Default) == 0x00002D, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000030, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDataTableRowFromName_OutRow) == 0x000048, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x00007C, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000080, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000088, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledCombatDamage, CallFunc_Round_ReturnValue) == 0x00008C, "Member 'FUNCLIB_Combat_C_GetScaledCombatDamage::CallFunc_Round_ReturnValue' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetScaledEnemyStatsDamage
// 0x0088 (0x0088 - 0x0000)
struct FUNCLIB_Combat_C_GetScaledEnemyStatsDamage final
{
public:
	struct FDataTableRowHandle                    EnemyStatsRowHandle;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	ENUM_EnemyAttackType                          AttackType;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BaseDamage;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_EnemyAttackType                          Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EnemyStats                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetScaledCombatDamage_DamageValue;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetScaledEnemyStatsDamage");
static_assert(sizeof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage) == 0x000088, "Wrong size on FUNCLIB_Combat_C_GetScaledEnemyStatsDamage");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, EnemyStatsRowHandle) == 0x000000, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::EnemyStatsRowHandle' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, AttackType) == 0x000010, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::AttackType' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, __WorldContext) == 0x000018, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, DamageValue) == 0x000020, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::DamageValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, BaseDamage) == 0x000024, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::BaseDamage' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, Temp_byte_Variable) == 0x000028, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000078, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, CallFunc_GetScaledCombatDamage_DamageValue) == 0x00007C, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::CallFunc_GetScaledCombatDamage_DamageValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyStatsDamage, K2Node_Select_Default) == 0x000080, "Member 'FUNCLIB_Combat_C_GetScaledEnemyStatsDamage::K2Node_Select_Default' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetScaledEnemyDamage
// 0x0020 (0x0020 - 0x0000)
struct FUNCLIB_Combat_C_GetScaledEnemyDamage final
{
public:
	class APAWN_Enemy_C*                          Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_EnemyAttackType                          AttackType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScaledEnemyStatsDamage_DamageValue;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetScaledEnemyDamage) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetScaledEnemyDamage");
static_assert(sizeof(FUNCLIB_Combat_C_GetScaledEnemyDamage) == 0x000020, "Wrong size on FUNCLIB_Combat_C_GetScaledEnemyDamage");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyDamage, Pawn) == 0x000000, "Member 'FUNCLIB_Combat_C_GetScaledEnemyDamage::Pawn' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyDamage, AttackType) == 0x000008, "Member 'FUNCLIB_Combat_C_GetScaledEnemyDamage::AttackType' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyDamage, __WorldContext) == 0x000010, "Member 'FUNCLIB_Combat_C_GetScaledEnemyDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyDamage, DamageValue) == 0x000018, "Member 'FUNCLIB_Combat_C_GetScaledEnemyDamage::DamageValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetScaledEnemyDamage, CallFunc_GetScaledEnemyStatsDamage_DamageValue) == 0x00001C, "Member 'FUNCLIB_Combat_C_GetScaledEnemyDamage::CallFunc_GetScaledEnemyStatsDamage_DamageValue' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetSolidShieldPhysicalMaterial
// 0x0010 (0x0010 - 0x0000)
struct FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial");
static_assert(sizeof(FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial) == 0x000010, "Wrong size on FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial");
static_assert(offsetof(FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial, __WorldContext) == 0x000000, "Member 'FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial, Result) == 0x000008, "Member 'FUNCLIB_Combat_C_GetSolidShieldPhysicalMaterial::Result' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetPermeableShieldPhysicalMaterial
// 0x0010 (0x0010 - 0x0000)
struct FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial) == 0x000008, "Wrong alignment on FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial");
static_assert(sizeof(FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial) == 0x000010, "Wrong size on FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial");
static_assert(offsetof(FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial, __WorldContext) == 0x000000, "Member 'FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial, Result) == 0x000008, "Member 'FUNCLIB_Combat_C_GetPermeableShieldPhysicalMaterial::Result' has a wrong offset!");

// Function FUNCLIB_Combat.FUNCLIB_Combat_C.GetAccuracyAdjustedRandomTargetDirection
// 0x00A0 (0x00A0 - 0x0000)
struct FUNCLIB_Combat_C_GetAccuracyAdjustedRandomTargetDirection final
{
public:
	struct FVector                                BarrelLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Accuracy;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinMaxSpreadRadius;                                // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRangeForSpreadCals;                             // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustedTargetDirection;                           // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledSpreadRadius;                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToTarget;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpreadHalfAngle;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionToTarget;                                 // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVectorNormalAndLength_OutLength;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorNormalAndLength_ReturnValue;     // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
