#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FUNCLIB_UserInterface

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "STRUCT_MediaObject_structs.hpp"
#include "ENUM_HackerGender_structs.hpp"


namespace SDK::Params
{

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetButtonLegendTextureForPlatformName
// 0x0050 (0x0050 - 0x0000)
struct FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName final
{
public:
	class FString                                 PlatformName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Texture;                                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture*>                       PlatformIconsTexture;                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         PlatformIndex;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName) == 0x000050, "Wrong size on FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, PlatformName) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::PlatformName' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, __WorldContext) == 0x000010, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, Texture) == 0x000018, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::Texture' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, PlatformIconsTexture) == 0x000020, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::PlatformIconsTexture' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, PlatformIndex) == 0x000030, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::PlatformIndex' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, K2Node_SwitchString_CmpSuccess) == 0x000034, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, K2Node_MakeArray_Array) == 0x000038, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName, CallFunc_Array_Get_Item) == 0x000048, "Member 'FUNCLIB_UserInterface_C_GetButtonLegendTextureForPlatformName::CallFunc_Array_Get_Item' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetKeyboardButtonAtlasIndex
// 0x0040 (0x0040 - 0x0000)
struct FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_5;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_6;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_7;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_8;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_9;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_10;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_11;         // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex) == 0x000040, "Wrong size on FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, Key) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::Key' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, __WorldContext) == 0x000018, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, Index_0) == 0x000020, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::Index_0' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000024, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000025, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000026, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000027, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x000028, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_5) == 0x000029, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_6) == 0x00002A, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_7) == 0x00002B, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_8) == 0x00002D, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_1) == 0x00002E, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_9) == 0x00002F, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_2) == 0x000030, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_10) == 0x000031, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_3) == 0x000032, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_11) == 0x000033, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_4) == 0x000034, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_5) == 0x000035, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_6) == 0x000036, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_7) == 0x000037, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_8) == 0x000038, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_9) == 0x000039, "Member 'FUNCLIB_UserInterface_C_GetKeyboardButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetMouseButtonAtlasIndex
// 0x0030 (0x0030 - 0x0000)
struct FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_5;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_6;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_7;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex) == 0x000030, "Wrong size on FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, Key) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::Key' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, __WorldContext) == 0x000018, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, Index_0) == 0x000020, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::Index_0' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000024, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000025, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000026, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000027, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x000029, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_5) == 0x00002A, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_6) == 0x00002B, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_7) == 0x00002C, "Member 'FUNCLIB_UserInterface_C_GetMouseButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_7' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetGamepadButtonAtlasIndex
// 0x0040 (0x0040 - 0x0000)
struct FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_5;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_6;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_7;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_8;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_9;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_10;         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_11;         // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_12;         // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_13;         // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_14;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_15;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_16;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_17;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_18;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_19;         // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex) == 0x000040, "Wrong size on FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, Key) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::Key' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, __WorldContext) == 0x000018, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, Index_0) == 0x000020, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::Index_0' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, Rotation) == 0x000024, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::Rotation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000028, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000029, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x00002A, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x00002B, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x00002C, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_5) == 0x00002D, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_6) == 0x00002E, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_7) == 0x00002F, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_8) == 0x000030, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_9) == 0x000031, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_BooleanOR_ReturnValue_1) == 0x000033, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_10) == 0x000034, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_11) == 0x000035, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_12) == 0x000036, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_13) == 0x000037, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_14) == 0x000038, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_15) == 0x000039, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_16) == 0x00003A, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_17) == 0x00003B, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_18) == 0x00003C, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex, CallFunc_EqualEqual_KeyKey_ReturnValue_19) == 0x00003D, "Member 'FUNCLIB_UserInterface_C_GetGamepadButtonAtlasIndex::CallFunc_EqualEqual_KeyKey_ReturnValue_19' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetCurrentPlatform
// 0x0028 (0x0028 - 0x0000)
struct FUNCLIB_UserInterface_C_GetCurrentPlatform final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PC;                                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Xbox;                                              // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Playstation;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SWITCH;                                            // 0x000B(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Console;                                           // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetCurrentPlatform) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetCurrentPlatform");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetCurrentPlatform) == 0x000028, "Wrong size on FUNCLIB_UserInterface_C_GetCurrentPlatform");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, __WorldContext) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, PC) == 0x000008, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::PC' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, Xbox) == 0x000009, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::Xbox' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, Playstation) == 0x00000A, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::Playstation' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, SWITCH) == 0x00000B, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::SWITCH' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, Console) == 0x00000C, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::Console' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetCurrentPlatform, K2Node_SwitchString_CmpSuccess) == 0x000020, "Member 'FUNCLIB_UserInterface_C_GetCurrentPlatform::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.FlickerElementHandler
// 0x0078 (0x0078 - 0x0000)
struct FUNCLIB_UserInterface_C_FlickerElementHandler final
{
public:
	class UWidget*                                InputWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlickerEnabled;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_DynamicCast_AsText;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        K2Node_DynamicCast_AsGrid_Mesh_Widget;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUNCLIB_UserInterface_C_FlickerElementHandler) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_FlickerElementHandler");
static_assert(sizeof(FUNCLIB_UserInterface_C_FlickerElementHandler) == 0x000078, "Wrong size on FUNCLIB_UserInterface_C_FlickerElementHandler");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, InputWidget) == 0x000000, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::InputWidget' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, FlickerEnabled) == 0x000008, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::FlickerEnabled' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, __WorldContext) == 0x000010, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::__WorldContext' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, DynamicMaterial) == 0x000018, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_AsText) == 0x000028, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_AsText' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000038, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_AsImage) == 0x000040, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_AsImage' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_AsGrid_Mesh_Widget) == 0x000058, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_AsGrid_Mesh_Widget' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_FlickerElementHandler, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000070, "Member 'FUNCLIB_UserInterface_C_FlickerElementHandler::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function FUNCLIB_UserInterface.FUNCLIB_UserInterface_C.GetFemaleVersionOfSubtitle
// 0x0268 (0x0268 - 0x0000)
struct FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubtitleRowName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MediaObject                    MediaDataStruct;                                   // 0x0018(0x0080)(Parm, OutParm, HasGetValueTypeHash)
	struct FSTRUCT_MediaObject                    MediaData;                                         // 0x0098(0x0080)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_HackerGender                             CallFunc_GetHackerGender_Result;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MediaObject                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0130(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MediaObject                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01E0(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle) == 0x000008, "Wrong alignment on FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle");
static_assert(sizeof(FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle) == 0x000268, "Wrong size on FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle, DataTable) == 0x000000, "Member 'FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle::DataTable' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle, SubtitleRowName) == 0x000008, "Member 'FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle::SubtitleRowName' has a wrong offset!");
static_assert(offsetof(FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle, __WorldContext) == 0x000010, "Member 'FUNCLIB_UserInterface_C_GetFemaleVersionOfSubtitle::__WorldContext' has a wrong offset!");
