#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GasGrenadeProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GasGrenadeProjectile.GasGrenadeProjectile_C.DetonateExplosive
// 0x0018 (0x0018 - 0x0000)
struct GasGrenadeProjectile_C_DetonateExplosive final
{
public:
	bool                                          CallFunc_MarkHasBeenDetonated_Success;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_PlayExplosionEffects_SpawnedFX;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATRIGGER_GasVolume_C*                   CallFunc_SpawnGasVolume_GasVolume;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GasGrenadeProjectile_C_DetonateExplosive) == 0x000008, "Wrong alignment on GasGrenadeProjectile_C_DetonateExplosive");
static_assert(sizeof(GasGrenadeProjectile_C_DetonateExplosive) == 0x000018, "Wrong size on GasGrenadeProjectile_C_DetonateExplosive");
static_assert(offsetof(GasGrenadeProjectile_C_DetonateExplosive, CallFunc_MarkHasBeenDetonated_Success) == 0x000000, "Member 'GasGrenadeProjectile_C_DetonateExplosive::CallFunc_MarkHasBeenDetonated_Success' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_DetonateExplosive, CallFunc_PlayExplosionEffects_SpawnedFX) == 0x000008, "Member 'GasGrenadeProjectile_C_DetonateExplosive::CallFunc_PlayExplosionEffects_SpawnedFX' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_DetonateExplosive, CallFunc_SpawnGasVolume_GasVolume) == 0x000010, "Member 'GasGrenadeProjectile_C_DetonateExplosive::CallFunc_SpawnGasVolume_GasVolume' has a wrong offset!");

// Function GasGrenadeProjectile.GasGrenadeProjectile_C.SpawnGasVolume
// 0x00F0 (0x00F0 - 0x0000)
struct GasGrenadeProjectile_C_SpawnGasVolume final
{
public:
	class ATRIGGER_GasVolume_C*                   GasVolume;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        StreamingLevel;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_GetLoadedLevel_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATRIGGER_GasVolume_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetLoadedLevel_ReturnValue_1;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATRIGGER_GasVolume_C*                   CallFunc_SpawnActorInLevel_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetPrimaryStreamingLevel_Level;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GasGrenadeProjectile_C_SpawnGasVolume) == 0x000010, "Wrong alignment on GasGrenadeProjectile_C_SpawnGasVolume");
static_assert(sizeof(GasGrenadeProjectile_C_SpawnGasVolume) == 0x0000F0, "Wrong size on GasGrenadeProjectile_C_SpawnGasVolume");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, GasVolume) == 0x000000, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::GasVolume' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, StreamingLevel) == 0x000008, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::StreamingLevel' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetInstigator_ReturnValue_1) == 0x000018, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent) == 0x000020, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1) == 0x000028, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000060, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetLoadedLevel_ReturnValue) == 0x000098, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetLoadedLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetLoadedLevel_ReturnValue_1) == 0x0000B8, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetLoadedLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_SpawnActorInLevel_ReturnValue) == 0x0000C0, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_SpawnActorInLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetGameInstance_ReturnValue) == 0x0000C8, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, K2Node_DynamicCast_AsGI_Single_Player) == 0x0000D0, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GasGrenadeProjectile_C_SpawnGasVolume, CallFunc_GetPrimaryStreamingLevel_Level) == 0x0000E0, "Member 'GasGrenadeProjectile_C_SpawnGasVolume::CallFunc_GetPrimaryStreamingLevel_Level' has a wrong offset!");

// Function GasGrenadeProjectile.GasGrenadeProjectile_C.SetHazardDamagePerSecond
// 0x0004 (0x0004 - 0x0000)
struct GasGrenadeProjectile_C_SetHazardDamagePerSecond final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GasGrenadeProjectile_C_SetHazardDamagePerSecond) == 0x000004, "Wrong alignment on GasGrenadeProjectile_C_SetHazardDamagePerSecond");
static_assert(sizeof(GasGrenadeProjectile_C_SetHazardDamagePerSecond) == 0x000004, "Wrong size on GasGrenadeProjectile_C_SetHazardDamagePerSecond");
static_assert(offsetof(GasGrenadeProjectile_C_SetHazardDamagePerSecond, Value) == 0x000000, "Member 'GasGrenadeProjectile_C_SetHazardDamagePerSecond::Value' has a wrong offset!");

}

