#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GI_SinglePlayer

#include "Basic.hpp"

#include "STRUCT_NarrativeSpeakers_structs.hpp"
#include "STRUCT_LevelInfo_structs.hpp"
#include "STRUCT_DisabledTileData_structs.hpp"
#include "ENUM_HackerGender_structs.hpp"
#include "STRUCT_AchievementClassData_structs.hpp"
#include "STRUCT_MissionDifficultySettings_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_MediaObject_structs.hpp"
#include "ENUM_GameDifficultyConfigCategory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_DialogueCaptionObject_structs.hpp"
#include "STRUCT_TutorialData_structs.hpp"
#include "STRUCT_KeycodeSettings_structs.hpp"
#include "STRUCT_AchievementData_structs.hpp"
#include "STRUCT_LevelAtmosphereSettings_structs.hpp"
#include "STRUCT_AsyncSoundParams_structs.hpp"
#include "STRUCT_AsyncSoundParamArray_structs.hpp"
#include "STRUCT_AsyncParticleParams_structs.hpp"
#include "STRUCT_AsyncParticleParamArray_structs.hpp"
#include "GameplayState_structs.hpp"
#include "CoreGame_structs.hpp"
#include "STRUCT_ItemDetailsIconParams_structs.hpp"
#include "ENUM_SharedBagType_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "MenuState_structs.hpp"
#include "InGameState_structs.hpp"
#include "STRUCT_MusicParams_structs.hpp"
#include "DLSSBlueprint_structs.hpp"
#include "ENUM_VolumeType_structs.hpp"
#include "STRUCT_CombatDifficultySettings_structs.hpp"
#include "ExplorationState_structs.hpp"
#include "STRUCT_LevelMusicSettings_structs.hpp"
#include "STRUCT_LevelRespawnData_structs.hpp"
#include "ENUM_MapType_structs.hpp"
#include "STRUCT_CurrentReinforcementSettings_structs.hpp"
#include "STRUCT_EnemyRespawnData_structs.hpp"
#include "STRUCT_EnemyReinforcementSettings_structs.hpp"
#include "STRUCT_LevelReinforcementSettings_structs.hpp"
#include "STRUCT_EnemyClassWeight_structs.hpp"
#include "STRUCT_EnemyReinforcementVolumes_structs.hpp"
#include "STRUCT_LevelCollection_structs.hpp"
#include "STRUCT_StoryQuestInfo_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"


namespace SDK::Params
{

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnSecurityLevelChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature final
{
public:
	int32                                         NewSecurityLevel;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature) == 0x000004, "Wrong size on GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature, NewSecurityLevel) == 0x000000, "Member 'GI_SinglePlayer_C_OnSecurityLevelChanged__DelegateSignature::NewSecurityLevel' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnStoryQuestChanged__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature final
{
public:
	class FName                                   StoryQuestName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature) == 0x00000C, "Wrong size on GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature, StoryQuestName) == 0x000000, "Member 'GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature::StoryQuestName' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature, Value) == 0x000008, "Member 'GI_SinglePlayer_C_OnStoryQuestChanged__DelegateSignature::Value' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnFinishedLoadingStreamLevel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature) == 0x000008, "Wrong size on GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature, LevelName) == 0x000000, "Member 'GI_SinglePlayer_C_OnFinishedLoadingStreamLevel__DelegateSignature::LevelName' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnStartUnloadingStreamLevel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature) == 0x000008, "Wrong size on GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature, LevelName) == 0x000000, "Member 'GI_SinglePlayer_C_OnStartUnloadingStreamLevel__DelegateSignature::LevelName' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnFinishedUnloadingStreamLevel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature) == 0x000008, "Wrong size on GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature, LevelName) == 0x000000, "Member 'GI_SinglePlayer_C_OnFinishedUnloadingStreamLevel__DelegateSignature::LevelName' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnComputerNodesChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature final
{
public:
	int32                                         NodesRemaining;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature) == 0x000004, "Wrong size on GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature, NodesRemaining) == 0x000000, "Member 'GI_SinglePlayer_C_OnComputerNodesChanged__DelegateSignature::NodesRemaining' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnTutorialCompleted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature final
{
public:
	class FName                                   TutorialName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature) == 0x000004, "Wrong alignment on GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature) == 0x000008, "Wrong size on GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature, TutorialName) == 0x000000, "Member 'GI_SinglePlayer_C_OnTutorialCompleted__DelegateSignature::TutorialName' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnPublicAddressStateChanged__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature final
{
public:
	class USoundCue*                              SoundCue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              PortraitTexture;                                   // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         RowCount;                                          // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColCount;                                          // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FrameRate;                                         // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature) == 0x000040, "Wrong size on GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature, SoundCue) == 0x000000, "Member 'GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature::SoundCue' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature, PortraitTexture) == 0x000008, "Member 'GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature::PortraitTexture' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature, RowCount) == 0x000030, "Member 'GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature::RowCount' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature, ColCount) == 0x000034, "Member 'GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature::ColCount' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature, FrameRate) == 0x000038, "Member 'GI_SinglePlayer_C_OnPublicAddressStateChanged__DelegateSignature::FrameRate' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnStoryQuestNotification__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature final
{
public:
	class FName                                   QuestName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NotificationText;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         NotificationDelay;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature) == 0x000008, "Wrong alignment on GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature) == 0x000028, "Wrong size on GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature, QuestName) == 0x000000, "Member 'GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature::QuestName' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature, NotificationText) == 0x000008, "Member 'GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature::NotificationText' has a wrong offset!");
static_assert(offsetof(GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature, NotificationDelay) == 0x000020, "Member 'GI_SinglePlayer_C_OnStoryQuestNotification__DelegateSignature::NotificationDelay' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.OnControllerConnectionStateChange__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature final
{
public:
	bool                                          ControllerConnectedState;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature) == 0x000001, "Wrong alignment on GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature");
static_assert(sizeof(GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature) == 0x000001, "Wrong size on GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature");
static_assert(offsetof(GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature, ControllerConnectedState) == 0x000000, "Member 'GI_SinglePlayer_C_OnControllerConnectionStateChange__DelegateSignature::ControllerConnectedState' has a wrong offset!");

// Function GI_SinglePlayer.GI_SinglePlayer_C.ExecuteUbergraph_GI_SinglePlayer
// 0x0F50 (0x0F50 - 0x0000)
struct GI_SinglePlayer_C_ExecuteUbergraph_GI_SinglePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_1;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_CustomEvent_AchievementHandle;              // 0x0050(0x0010)(NoDestructor)
	int32                                         K2Node_CustomEvent_UserTag;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementWriteCallbackProxy*         CallFunc_WriteAchievementProgress_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedAchievementProgress_bFoundID;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCachedAchievementProgress_Progress;    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteBinaryAchievement_Result;      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_7;                     // 0x0080(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_6;                     // 0x00A8(0x0028)(HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_AsyncSoundParams               K2Node_MakeStruct_STRUCT_AsyncSoundParams;         // 0x00F0(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_5;                     // 0x0170(0x0028)(HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_AttachToComponent_1;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SocketName_1;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_RelativeLocation_1;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_RelativeRotation_1;             // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_EffectParams                   K2Node_CustomEvent_SoundParameters;                // 0x01C0(0x0030)(ConstParm, HasGetValueTypeHash)
	TSoftObjectPtr<class USceneComponent>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01F0(0x0028)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_CustomEvent_System_4;                       // 0x0218(0x0028)(HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FSTRUCT_AsyncSoundParams               K2Node_MakeStruct_STRUCT_AsyncSoundParams_1;       // 0x0270(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FSTRUCT_AsyncParticleParams            K2Node_MakeStruct_STRUCT_AsyncParticleParams;      // 0x02F0(0x00A0)(ContainsInstancedReference, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_CustomEvent_System_3;                       // 0x0390(0x0028)(HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_AttachToComponent;              // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SocketName;                     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_RelativeLocation;               // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_RelativeRotation;               // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_EffectParams                   K2Node_CustomEvent_EffectsParameters;              // 0x03E0(0x0030)(ConstParm, HasGetValueTypeHash)
	struct FLatentObjectEventHandle               K2Node_CustomEvent_OnSpawnEvent;                   // 0x0410(0x0010)(ContainsInstancedReference)
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_4;                     // 0x0420(0x0028)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeInDuration_1;               // 0x0448(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartTime_1;                    // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_CustomEvent_AudioComponent_1;               // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0460(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USceneComponent>         CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0498(0x0028)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	struct FSTRUCT_AsyncParticleParams            K2Node_MakeStruct_STRUCT_AsyncParticleParams_1;    // 0x04C0(0x00A0)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0560(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_CustomEvent_System_2;                       // 0x0578(0x0028)(HasGetValueTypeHash)
	class UFXSystemComponent*                     K2Node_CustomEvent_SystemComponent_1;              // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_DynamicCast_AsParticle_System_Component;    // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryDecrementSystemComponentRefCount_Result; // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System;      // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryDecrementSystemComponentRefCount_Result_1; // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryIncrementSystemComponentRefCount_Result; // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C3[0x1];                                      // 0x05C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          K2Node_CustomEvent_System_1;                       // 0x05D0(0x0028)(HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_CustomEvent_SystemComponents_1;             // 0x05F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0610(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_TryIncrementSystemComponentRefCount_Result_1; // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDecrementSystemComponentRefCount_Result_2; // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_3;                     // 0x0648(0x0028)(HasGetValueTypeHash)
	TArray<class UAudioComponent*>                K2Node_CustomEvent_AudioComponents;                // 0x0670(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_HUD_C>         K2Node_DynamicCast_AsINTERF_HUD;                   // 0x0690(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnStartedLoadingGame_Result;              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A2[0x2];                                      // 0x06A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x06A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     K2Node_CustomEvent_SystemComponent;                // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C2[0x2];                                      // 0x06C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x06C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x06D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D5[0x3];                                      // 0x06D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXSystemComponent*>             K2Node_CustomEvent_SystemComponents;               // 0x06D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        K2Node_CustomEvent_SceneComponent;                 // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_2;                         // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFXSystemComponent*>             CallFunc_GetChildComponentsByClass_ReturnValue;    // 0x06F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_3;                         // 0x0708(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D[0x3];                                      // 0x071D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x072D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72E[0x2];                                      // 0x072E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_2;                     // 0x0730(0x0028)(HasGetValueTypeHash)
	struct FSTRUCT_AsyncSoundParams               K2Node_CustomEvent_SoundParams;                    // 0x0758(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x07F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F3[0x5];                                      // 0x07F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFXSystemAsset>          K2Node_CustomEvent_System;                         // 0x07F8(0x0028)(ConstParm, HasGetValueTypeHash)
	struct FSTRUCT_AsyncParticleParams            K2Node_CustomEvent_SystemParams;                   // 0x0820(0x00A0)(ConstParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x08C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C5[0x3];                                      // 0x08C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset;               // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x08D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8DA[0x2];                                      // 0x08DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x08DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8EC[0x4];                                      // 0x08EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_909[0x7];                                      // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_2;                  // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue_1;                     // 0x0930(0x0028)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x095C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_96C[0x4];                                      // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_3;                  // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981[0x7];                                      // 0x0981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         K2Node_DynamicCast_AsFXSystem_Asset_1;             // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFXSystemAsset>          CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_2; // 0x09A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAsyncSystemParamsFromQueue_Success; // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0xF];                                      // 0x09D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_AsyncParticleParams            CallFunc_RemoveAsyncSystemParamsFromQueue_SystemParams; // 0x09E0(0x00A0)(ContainsInstancedReference, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               K2Node_CustomEvent_SoundCue;                       // 0x0A80(0x0028)(HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FadeInDuration;                 // 0x0AA8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_StartTime;                      // 0x0AAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelAudioComponent*                   K2Node_CustomEvent_AudioComponent;                 // 0x0AB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0AB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ABA[0x6];                                      // 0x0ABA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_CustomEvent_LevelCollection_1;              // 0x0AC8(0x0010)(NoDestructor)
	bool                                          K2Node_CustomEvent_BlockOnLoad;                    // 0x0AD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD9[0x7];                                      // 0x0AD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_CustomEvent_LevelCollection;                // 0x0AE0(0x0010)(NoDestructor)
	TArray<class FName>                           K2Node_CustomEvent_LevelsToKeepLoaded;             // 0x0AF0(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0B08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0B0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B0D[0x3];                                      // 0x0B0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_LevelCollection                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0B10(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_LevelCollection                CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0B28(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B39[0x3];                                      // 0x0B39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0B3C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_TryUpdateCurrentSubLevelName_Result;      // 0x0B4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4D[0x3];                                      // 0x0B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0B50(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B61[0x7];                                      // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_4;                  // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_4;                            // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA9[0x3];                                      // 0x0BA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x0BAC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0BB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB9[0x3];                                      // 0x0BB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC1[0x3];                                      // 0x0BC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0BDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_5;                            // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF9[0x7];                                      // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C09[0x7];                                      // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Select_Default;                             // 0x0C10(0x0010)(ReferenceParm)
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_7;                         // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0C40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_5;                  // 0x0C48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0C50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C51[0x3];                                      // 0x0C51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_9;                         // 0x0C54(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0C5C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C6C[0x4];                                      // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0C80(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0C8C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0C98(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
