#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GI_SinglePlayer

#include "Basic.hpp"

#include "STRUCT_EnemyReinforcementVolumes_structs.hpp"
#include "StreamingSaveGameSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_LevelRespawnData_structs.hpp"
#include "MenuState_structs.hpp"
#include "ENUM_GameDifficultyConfigCategory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InGameState_structs.hpp"
#include "STRUCT_AchievementClassData_structs.hpp"
#include "GameplayState_structs.hpp"
#include "ExplorationState_structs.hpp"
#include "CoreGame_structs.hpp"
#include "STRUCT_AsyncParticleParamArray_structs.hpp"
#include "STRUCT_AsyncSoundParamArray_structs.hpp"
#include "STRUCT_DisabledTileData_structs.hpp"
#include "ENUM_HackerGender_structs.hpp"
#include "ENUM_SharedBagType_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "DLSSBlueprint_structs.hpp"
#include "ENUM_VolumeType_structs.hpp"
#include "ENUM_MapType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GI_SinglePlayer.GI_SinglePlayer_C
// 0x0B88 (0x0DB0 - 0x0228)
class UGI_SinglePlayer_C final : public USingleplayerGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   CurrentLevelName;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PreviousLevelName;                                 // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QueuedPrimaryLevelToLoad;                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CurrentLevelCollection;                            // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	FMulticastInlineDelegateProperty_             OnSecurityLevelChanged;                            // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           GameCountdownTimerHandle;                          // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GameCountdownSecondsRemaining;                     // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GameCountdownStartTimestamp;                       // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GameCountdownPeriodicUpdateDuration;               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelStreamingTimeDilation;                        // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelLevelManager*                     VoxelLevelManager;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             LevelRespawnChambers;                              // 0x0288(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TSet<class FName>                             CompletedTutorials;                                // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TSet<class FName>                             ChosenPuzzleNames;                                 // 0x0328(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<class FName>                           VisitedLevels;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMap<class FName, int32>                      LevelSecurity;                                     // 0x0388(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMap<class FName, int32>                      LevelComputerNodes;                                // 0x03D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMap<class FName, float>                      StoryQuests;                                       // 0x0428(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	FMulticastInlineDelegateProperty_             OnStoryQuestChanged;                               // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStoryQuestNotification;                          // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTutorialCompleted;                               // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFinishedLoadingStreamLevel;                      // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStartUnloadingStreamLevel;                       // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFinishedUnloadingStreamLevel;                    // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsBlockingLoad;                                    // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DisableStreaming;                                  // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasSeenTitleScreen;                                // 0x04DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldClearLevelDataAfterLoad;                     // 0x04DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LevelNamesToLoad;                                  // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           LevelNamesToUnload;                                // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnStartLoadingLevelCollection;                     // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStartUnloadingLevelCollection;                   // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFinishedLoadingLevelCollection;                  // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFinishedUnloadingLevelCollection;                // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UITEM_Base_C*>                   StashedTransferItems;                              // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	struct FVector                                LastLevelOffset;                                   // 0x0550(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnComputerNodesChanged;                            // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 QuicksaveSaveName;                                 // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 AutosaveSaveName;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ULevelStreaming*                        CurrentLoadingLevel;                               // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<TSoftClassPtr<class UClass>, int32>      EnemyToVolumeIndexMap;                             // 0x0598(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftClassPtr<class UClass>, int32>      EnemyPopulations;                                  // 0x05E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTRUCT_EnemyReinforcementVolumes> EnemyReinforcementVolumeLists;                     // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTRUCT_LevelRespawnData>       EnemyReinforcementDataPerLevel;                    // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	struct FTimerHandle                           NextRespawnTimerHandle;                            // 0x0658(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         NextAvailablePatrolPathID;                         // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSpawnedEnemyID;                                // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<int32>                                   FreePatrolPathSet;                                 // 0x0668(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<int32>                                   UsedPatrolPathSet;                                 // 0x06B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_MusicCue_C*                         CurrentMusicCue;                                   // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_MusicCue_C*>                 StoppedMusicCues;                                  // 0x0710(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   MusicLevelOverride;                                // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuState                                    MusicMenuState;                                    // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInGameState                                  MusicGameState;                                    // 0x0729(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayState                                MusicGameplayState;                                // 0x072A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ExplorationState                              MusicAmbienceState;                                // 0x072B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GameSettingsSaveSlotName;                          // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class USAVE_Settings_C*                       ShockSettings;                                     // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 DestructionCodeDigits;                             // 0x0748(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class UWIDGET_LoadingScreen_C*                LoadingScreen;                                     // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATRAP_Trigger_C*>                GroupedTrapActors;                                 // 0x0760(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UDataTable*                             KeycodeSettingsTable;                              // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<int32>                                   StoryKeycodes;                                     // 0x0778(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      RandomTaggedKeycodes;                              // 0x07C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<class UITEM_Base_C*>                   PendingLostItems;                                  // 0x0818(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<class UITEM_Base_C*>                   SharedLostItems;                                   // 0x0828(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TArray<class UITEM_Base_C*>                   SharedStorageItems;                                // 0x0838(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class FName                                   SharedStorageLevelName;                            // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               ItemIconCaptureComponent;                          // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               ItemDetailsCaptureComponent;                       // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FObjectClassCollection, class UTextureRenderTarget2D*> ItemGridRenderTargetMap;                           // 0x0860(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FObjectClassCollection, class UTextureRenderTarget2D*> ItemHotbarRenderTargetMap;                         // 0x08B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FIntPoint, class UTextureRenderTarget2D*> ItemDetailsRenderTargetMap;                        // 0x0900(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APICKUP_Base_C*                         LastItemIconPickupActor;                           // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         LastItemDetailsPickupActor;                        // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FObjectClassCollection>           PendingGridIconRenders;                            // 0x0960(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<struct FObjectClassCollection>           PendingHotbarIconRenders;                          // 0x09B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class APICKUP_Base_C*>                 PendingGridIconActors;                             // 0x0A00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           PendingIconTimerHandle;                            // 0x0A10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentCombatIntensity;                            // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentExplorationIntensity;                       // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RegionDiscoverIntensityGain;                       // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityDecayAmount;                              // 0x0A24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityDecayTime;                                // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           IntensityDecayTimerHandle;                         // 0x0A30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UFXSystemComponent*, int32>        AsyncSystemComponentRefCounts;                     // 0x0A38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class USceneComponent*, int32>           AsyncSceneComponentRefCounts;                      // 0x0A88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<TSoftObjectPtr<class UFXSystemAsset>, struct FSTRUCT_AsyncParticleParamArray> QueuedAsyncSystems;                                // 0x0AD8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<TSoftObjectPtr<class USoundCue>, struct FSTRUCT_AsyncSoundParamArray> QueuedAsyncSounds;                                 // 0x0B28(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          DebugReinforcements;                               // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APAWN_Enemy_C*>                  LowFiBehaviorEnemies;                              // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         CurrentLowFiEnemyIndex;                            // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B94[0x4];                                      // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LowFiBehaviorTimerHandle;                          // 0x0B98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugLowFiBehaviorEnemies;                         // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DefaultCultureFontTable;                           // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanModifyAchievements;                             // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasSynchronizedAchievements;                       // 0x0BB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB2[0x6];                                      // 0x0BB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CompletedAllAchievementHandle;                     // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMap<class FName, int32>                      LinearAchievementMap;                              // 0x0BC8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	TMap<class FName, struct FSTRUCT_AchievementClassData> UnorderedAchievementMap;                           // 0x0C18(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class UOBJ_TileDescriptorManager_C*           TileDescriptorManager;                             // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPeriodicGameCountdownEvent;                      // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         PublicAddressTimestamp;                            // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C84[0x4];                                      // 0x0C84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             PublicAddressMediaTable;                           // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PublicAddressRowName;                              // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPublicAddressStateChanged;                       // 0x0C98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                PublicAddressLocation;                             // 0x0CA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PublicAddressRadius;                               // 0x0CB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PublicAddressTimerHandle;                          // 0x0CB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   SaveGameLoadFailureText;                           // 0x0CC0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           AutosaveTimerHandle;                               // 0x0CD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneCaptureComponent2D*>       TickingCaptureComponents;                          // 0x0CE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         LastTickedCaptureComponentIndex;                   // 0x0CF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF4[0x4];                                      // 0x0CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SceneCaptureTimerHandle;                           // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class UStaticMeshComponent*>             PermDisabledTileComponents;                        // 0x0D00(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FSTRUCT_DisabledTileData>       TempDisabledTileComponents;                        // 0x0D50(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           TileComponentEnableTimerHandle;                    // 0x0D60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPendingLostItemsChanged;                         // 0x0D68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           AlarmLightTimerHandle;                             // 0x0D78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AlarmSpeaker_Base_C*>        ActiveAlarmSpeakers;                               // 0x0D80(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UUserWidget*                            CachedLoadingHUDWidget;                            // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_HackerGender                             HackerGender;                                      // 0x0D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D99[0x7];                                      // 0x0D99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnControllerConnectionStateChange;                 // 0x0DA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSecurityLevelChanged__DelegateSignature(int32 NewSecurityLevel);
	void OnStoryQuestChanged__DelegateSignature(class FName StoryQuestName, bool Value);
	void OnFinishedLoadingStreamLevel__DelegateSignature(class FName LevelName);
	void OnStartUnloadingStreamLevel__DelegateSignature(class FName LevelName);
	void OnFinishedUnloadingStreamLevel__DelegateSignature(class FName LevelName);
	void OnFinishedLoadingLevelCollection__DelegateSignature();
	void OnFinishedUnloadingLevelCollection__DelegateSignature();
	void OnComputerNodesChanged__DelegateSignature(int32 NodesRemaining);
	void OnStartLoadingLevelCollection__DelegateSignature();
	void OnStartUnloadingLevelCollection__DelegateSignature();
	void OnPeriodicGameCountdownEvent__DelegateSignature();
	void OnTutorialCompleted__DelegateSignature(class FName TutorialName);
