#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_CitadelStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreGame_structs.hpp"
#include "GM_SinglePlayer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_CitadelStation.GM_CitadelStation_C
// 0x0030 (0x0418 - 0x03E8)
class AGM_CitadelStation_C final : public AGM_SinglePlayer_C
{
public:
	struct FDataTableRowHandle                    StartingLevelCollection;                           // 0x03E8(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FEnumHandle>                    InitialMusicStates;                                // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnStartingLevelFinishedLoading;                    // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnStartingLevelFinishedLoading__DelegateSignature();
	void TryLoadStartingLevel(bool* Result);
	void EVENT_OnFinishedLoadingStartingLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GM_CitadelStation_C">();
	}
	static class AGM_CitadelStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_CitadelStation_C>();
	}
};
static_assert(alignof(AGM_CitadelStation_C) == 0x000008, "Wrong alignment on AGM_CitadelStation_C");
static_assert(sizeof(AGM_CitadelStation_C) == 0x000418, "Wrong size on AGM_CitadelStation_C");
static_assert(offsetof(AGM_CitadelStation_C, StartingLevelCollection) == 0x0003E8, "Member 'AGM_CitadelStation_C::StartingLevelCollection' has a wrong offset!");
static_assert(offsetof(AGM_CitadelStation_C, InitialMusicStates) == 0x0003F8, "Member 'AGM_CitadelStation_C::InitialMusicStates' has a wrong offset!");
static_assert(offsetof(AGM_CitadelStation_C, OnStartingLevelFinishedLoading) == 0x000408, "Member 'AGM_CitadelStation_C::OnStartingLevelFinishedLoading' has a wrong offset!");

}

