#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_SinglePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_DebrisFragmentInstance_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_Axis_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function GM_SinglePlayer.GM_SinglePlayer_C.ExecuteUbergraph_GM_SinglePlayer
// 0x03A8 (0x03A8 - 0x0000)
struct GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LoadoutName;                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ItemWithCount;                  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Name;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_State_1;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_ComputerNode_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	struct FAttribModApplyData                    K2Node_MakeStruct_AttribModApplyData;              // 0x0070(0x00A0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_State;                          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCurrentLevelName_Result;               // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APAWN_Enemy_C*>                  CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0138(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentLevel_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_1;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_2;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_3;                 // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_4;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_5;                 // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_SecurityCamera_C*>     CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0220(0x0010)(ReferenceParm)
	class AINTERACT_SecurityCamera_C*             CallFunc_Array_Get_Item_1;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23E[0x2];                                      // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_ComputerNode_C*               CallFunc_Array_Get_Item_2;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_2;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LevelName;                      // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMusicLevelOverride_Result;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_6;                 // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_2;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCyberspaceLifeSimulation_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_NewPlayer_1;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_3;           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAssignedCurrentLevel_Result;           // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B[0x1];                                      // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Zero_ReturnValue_1;                // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCurrentLevel_ReturnValue_1;            // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0354(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_ExitingController;                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0368(0x0010)(NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_4;           // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAchievementQueryCallbackProxy*         CallFunc_CacheAchievements_ReturnValue;            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer");
static_assert(sizeof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer) == 0x0003A8, "Wrong size on GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, EntryPoint) == 0x000000, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Array_Index_Variable) == 0x000014, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_bool_Variable) == 0x000018, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Loop_Counter_Variable_2) == 0x00001C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_LoadoutName) == 0x000028, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_LoadoutName' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_ItemWithCount) == 0x000038, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_ItemWithCount' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_Name) == 0x000048, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_State_1) == 0x000058, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_State_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_MakeStruct_AttribModApplyData) == 0x000070, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_MakeStruct_AttribModApplyData' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_State) == 0x000114, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000115, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_Enable_1) == 0x000116, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetGameInstance_ReturnValue) == 0x000118, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsGI_Single_Player) == 0x000120, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetCurrentLevelName_Result) == 0x00012C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetCurrentLevelName_Result' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000138, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_name_Variable) == 0x00014C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Less_IntInt_ReturnValue_1) == 0x000154, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_Select_Default) == 0x000158, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Vector_Zero_ReturnValue) == 0x000160, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_SetCurrentLevel_ReturnValue) == 0x000178, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_SetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker) == 0x000180, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_1) == 0x000190, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_1) == 0x000198, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Array_Index_Variable_1) == 0x0001A4, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_ApplyMod_ReturnValue) == 0x0001B0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001C0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_2) == 0x0001C8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_3) == 0x0001D0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_3) == 0x0001D8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001E0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_3) == 0x0001E8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_3' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_4) == 0x0001F0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_4) == 0x0001F8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_4' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_5) == 0x000200, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_5) == 0x000208, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_5) == 0x000210, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_5' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_6) == 0x000218, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000220, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Length_ReturnValue_2) == 0x000238, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Less_IntInt_ReturnValue_2) == 0x00023C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_IsValid_ReturnValue_1) == 0x00023D, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, Temp_int_Array_Index_Variable_2) == 0x000240, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Array_Get_Item_2) == 0x000248, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_ApplyMod_ReturnValue_1) == 0x000250, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_ApplyMod_ReturnValue_2) == 0x000258, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_ApplyMod_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_LevelName) == 0x000260, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000270, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Conv_StringToName_ReturnValue) == 0x000280, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetGameInstance_ReturnValue_1) == 0x000288, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CustomEvent_Enable) == 0x000290, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x000298, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_7) == 0x0002A0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetPlayerController_ReturnValue_6) == 0x0002A8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_SetMusicLevelOverride_Result) == 0x0002B0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_SetMusicLevelOverride_Result' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsCON_Hacker_6) == 0x0002B8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsCON_Hacker_6' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_8) == 0x0002C0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_Event_DeltaSeconds) == 0x0002C4, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetGameInstance_ReturnValue_2) == 0x0002C8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsGI_Single_Player_2) == 0x0002D0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsGI_Single_Player_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_9) == 0x0002D8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002DC, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_SpawnObject_ReturnValue) == 0x0002F0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_Event_NewPlayer_1) == 0x0002F8, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_Event_NewPlayer_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetGameInstance_ReturnValue_3) == 0x000300, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetGameInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_K2_GetPawn_ReturnValue) == 0x000308, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsGI_Single_Player_3) == 0x000310, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsGI_Single_Player_3' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_10) == 0x000318, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_HasAssignedCurrentLevel_Result) == 0x000319, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_HasAssignedCurrentLevel_Result' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Not_PreBool_ReturnValue) == 0x00031A, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Vector_Zero_ReturnValue_1) == 0x00031C, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Vector_Zero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000328, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000338, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000348, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000350, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_SetCurrentLevel_ReturnValue_1) == 0x000351, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_SetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000354, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_Event_ExitingController) == 0x000360, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_Event_ExitingController' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_MakeStruct_DataTableRowHandle) == 0x000368, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_GetGameInstance_ReturnValue_4) == 0x000378, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_GetGameInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_AsGI_Single_Player_4) == 0x000380, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_AsGI_Single_Player_4' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_DynamicCast_bSuccess_11) == 0x000388, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, K2Node_Event_NewPlayer) == 0x000390, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_CacheAchievements_ReturnValue) == 0x000398, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_CacheAchievements_ReturnValue' has a wrong offset!");
static_assert(offsetof(GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer, CallFunc_IsValid_ReturnValue_2) == 0x0003A0, "Member 'GM_SinglePlayer_C_ExecuteUbergraph_GM_SinglePlayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.K2_PostLogin
// 0x0008 (0x0008 - 0x0000)
struct GM_SinglePlayer_C_K2_PostLogin final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_K2_PostLogin) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_K2_PostLogin");
static_assert(sizeof(GM_SinglePlayer_C_K2_PostLogin) == 0x000008, "Wrong size on GM_SinglePlayer_C_K2_PostLogin");
static_assert(offsetof(GM_SinglePlayer_C_K2_PostLogin, NewPlayer) == 0x000000, "Member 'GM_SinglePlayer_C_K2_PostLogin::NewPlayer' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.K2_OnLogout
// 0x0008 (0x0008 - 0x0000)
struct GM_SinglePlayer_C_K2_OnLogout final
{
public:
	class AController*                            ExitingController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_K2_OnLogout) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_K2_OnLogout");
static_assert(sizeof(GM_SinglePlayer_C_K2_OnLogout) == 0x000008, "Wrong size on GM_SinglePlayer_C_K2_OnLogout");
static_assert(offsetof(GM_SinglePlayer_C_K2_OnLogout, ExitingController) == 0x000000, "Member 'GM_SinglePlayer_C_K2_OnLogout::ExitingController' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.HandleStartingNewPlayer
// 0x0008 (0x0008 - 0x0000)
struct GM_SinglePlayer_C_HandleStartingNewPlayer final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_HandleStartingNewPlayer) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_HandleStartingNewPlayer");
static_assert(sizeof(GM_SinglePlayer_C_HandleStartingNewPlayer) == 0x000008, "Wrong size on GM_SinglePlayer_C_HandleStartingNewPlayer");
static_assert(offsetof(GM_SinglePlayer_C_HandleStartingNewPlayer, NewPlayer) == 0x000000, "Member 'GM_SinglePlayer_C_HandleStartingNewPlayer::NewPlayer' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GM_SinglePlayer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_ReceiveTick) == 0x000004, "Wrong alignment on GM_SinglePlayer_C_ReceiveTick");
static_assert(sizeof(GM_SinglePlayer_C_ReceiveTick) == 0x000004, "Wrong size on GM_SinglePlayer_C_ReceiveTick");
static_assert(offsetof(GM_SinglePlayer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GM_SinglePlayer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdEnableDamageLog
// 0x0001 (0x0001 - 0x0000)
struct GM_SinglePlayer_C_CmdEnableDamageLog final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GM_SinglePlayer_C_CmdEnableDamageLog) == 0x000001, "Wrong alignment on GM_SinglePlayer_C_CmdEnableDamageLog");
static_assert(sizeof(GM_SinglePlayer_C_CmdEnableDamageLog) == 0x000001, "Wrong size on GM_SinglePlayer_C_CmdEnableDamageLog");
static_assert(offsetof(GM_SinglePlayer_C_CmdEnableDamageLog, Enable) == 0x000000, "Member 'GM_SinglePlayer_C_CmdEnableDamageLog::Enable' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdPlayMusicForlevel
// 0x0010 (0x0010 - 0x0000)
struct GM_SinglePlayer_C_CmdPlayMusicForlevel final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_CmdPlayMusicForlevel) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_CmdPlayMusicForlevel");
static_assert(sizeof(GM_SinglePlayer_C_CmdPlayMusicForlevel) == 0x000010, "Wrong size on GM_SinglePlayer_C_CmdPlayMusicForlevel");
static_assert(offsetof(GM_SinglePlayer_C_CmdPlayMusicForlevel, LevelName) == 0x000000, "Member 'GM_SinglePlayer_C_CmdPlayMusicForlevel::LevelName' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdRoomCulling
// 0x0001 (0x0001 - 0x0000)
struct GM_SinglePlayer_C_CmdRoomCulling final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GM_SinglePlayer_C_CmdRoomCulling) == 0x000001, "Wrong alignment on GM_SinglePlayer_C_CmdRoomCulling");
static_assert(sizeof(GM_SinglePlayer_C_CmdRoomCulling) == 0x000001, "Wrong size on GM_SinglePlayer_C_CmdRoomCulling");
static_assert(offsetof(GM_SinglePlayer_C_CmdRoomCulling, Enable) == 0x000000, "Member 'GM_SinglePlayer_C_CmdRoomCulling::Enable' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdGodMode
// 0x0001 (0x0001 - 0x0000)
struct GM_SinglePlayer_C_CmdGodMode final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GM_SinglePlayer_C_CmdGodMode) == 0x000001, "Wrong alignment on GM_SinglePlayer_C_CmdGodMode");
static_assert(sizeof(GM_SinglePlayer_C_CmdGodMode) == 0x000001, "Wrong size on GM_SinglePlayer_C_CmdGodMode");
static_assert(offsetof(GM_SinglePlayer_C_CmdGodMode, State) == 0x000000, "Member 'GM_SinglePlayer_C_CmdGodMode::State' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdDetectable
// 0x0001 (0x0001 - 0x0000)
struct GM_SinglePlayer_C_CmdDetectable final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GM_SinglePlayer_C_CmdDetectable) == 0x000001, "Wrong alignment on GM_SinglePlayer_C_CmdDetectable");
static_assert(sizeof(GM_SinglePlayer_C_CmdDetectable) == 0x000001, "Wrong size on GM_SinglePlayer_C_CmdDetectable");
static_assert(offsetof(GM_SinglePlayer_C_CmdDetectable, State) == 0x000000, "Member 'GM_SinglePlayer_C_CmdDetectable::State' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdCompleteQuest
// 0x0010 (0x0010 - 0x0000)
struct GM_SinglePlayer_C_CmdCompleteQuest final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_CmdCompleteQuest) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_CmdCompleteQuest");
static_assert(sizeof(GM_SinglePlayer_C_CmdCompleteQuest) == 0x000010, "Wrong size on GM_SinglePlayer_C_CmdCompleteQuest");
static_assert(offsetof(GM_SinglePlayer_C_CmdCompleteQuest, Name_0) == 0x000000, "Member 'GM_SinglePlayer_C_CmdCompleteQuest::Name_0' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdGrantItem
// 0x0010 (0x0010 - 0x0000)
struct GM_SinglePlayer_C_CmdGrantItem final
{
public:
	class FString                                 ItemWithCount;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_CmdGrantItem) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_CmdGrantItem");
static_assert(sizeof(GM_SinglePlayer_C_CmdGrantItem) == 0x000010, "Wrong size on GM_SinglePlayer_C_CmdGrantItem");
static_assert(offsetof(GM_SinglePlayer_C_CmdGrantItem, ItemWithCount) == 0x000000, "Member 'GM_SinglePlayer_C_CmdGrantItem::ItemWithCount' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.CmdGrantLoadout
// 0x0010 (0x0010 - 0x0000)
struct GM_SinglePlayer_C_CmdGrantLoadout final
{
public:
	class FString                                 LoadoutName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GM_SinglePlayer_C_CmdGrantLoadout) == 0x000008, "Wrong alignment on GM_SinglePlayer_C_CmdGrantLoadout");
static_assert(sizeof(GM_SinglePlayer_C_CmdGrantLoadout) == 0x000010, "Wrong size on GM_SinglePlayer_C_CmdGrantLoadout");
static_assert(offsetof(GM_SinglePlayer_C_CmdGrantLoadout, LoadoutName) == 0x000000, "Member 'GM_SinglePlayer_C_CmdGrantLoadout::LoadoutName' has a wrong offset!");

// Function GM_SinglePlayer.GM_SinglePlayer_C.AcquireAndPossessPawn
// 0x0180 (0x0180 - 0x0000)
struct GM_SinglePlayer_C_AcquireAndPossessPawn final
{
public:
	class UClass*                                 PawnClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PossessedPawn;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundGoodStart;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           CurrentStart;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStart*>                   PlayerStarts;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         PlayerPawns;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FTransform                             PlayerTransform;                                   // 0x0040(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class APawn*                                  NewPlayerPawn;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0090(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
