#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_DataReader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ITEM_HardwareBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HARDWARE_DataReader.HARDWARE_DataReader_C
// 0x0068 (0x02E8 - 0x0280)
class UHARDWARE_DataReader_C final : public UITEM_HardwareBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HARDWARE_DataReader_C;              // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 IncomingTransmissionMessage;                       // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             DataReaderMesh;                                    // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      DataReaderMaterial;                                // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HARDWARE_DataReader(int32 EntryPoint);
	void EnableMediaReaderDisplayMesh();
	void OnLoaded_2B54F99340094416C6C6069C21D1072C(class UObject* Loaded);
	void OnLoaded_65EE3A914F0C398482905DB02E5CDD54(class UObject* Loaded);
	void OnIncomingTransmission();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void OnAddedToInventory();
	void OnBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HARDWARE_DataReader_C">();
	}
	static class UHARDWARE_DataReader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHARDWARE_DataReader_C>();
	}
};
static_assert(alignof(UHARDWARE_DataReader_C) == 0x000008, "Wrong alignment on UHARDWARE_DataReader_C");
static_assert(sizeof(UHARDWARE_DataReader_C) == 0x0002E8, "Wrong size on UHARDWARE_DataReader_C");
static_assert(offsetof(UHARDWARE_DataReader_C, UberGraphFrame_HARDWARE_DataReader_C) == 0x000280, "Member 'UHARDWARE_DataReader_C::UberGraphFrame_HARDWARE_DataReader_C' has a wrong offset!");
static_assert(offsetof(UHARDWARE_DataReader_C, IncomingTransmissionMessage) == 0x000288, "Member 'UHARDWARE_DataReader_C::IncomingTransmissionMessage' has a wrong offset!");
static_assert(offsetof(UHARDWARE_DataReader_C, DataReaderMesh) == 0x000298, "Member 'UHARDWARE_DataReader_C::DataReaderMesh' has a wrong offset!");
static_assert(offsetof(UHARDWARE_DataReader_C, DataReaderMaterial) == 0x0002C0, "Member 'UHARDWARE_DataReader_C::DataReaderMaterial' has a wrong offset!");

}

