#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_EnergyShield_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ITEM_HardwareBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C
// 0x0040 (0x02C0 - 0x0280)
class UHARDWARE_EnergyShield_Base_C : public UITEM_HardwareBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HARDWARE_EnergyShield_Base_C;       // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FIntVector                             ShieldAbsorptionPerVersion;                        // 0x0288(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             ShieldEnergyEfficiencyBonusPerVersion;             // 0x0294(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             ShieldActivationEnergyCostPerVersion;              // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShieldEnergyDrainTickRatePerVersion;               // 0x02AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldBlinkDuration;                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HARDWARE_EnergyShield_Base(int32 EntryPoint);
	void UpdateHardwareState(bool IsEnabled, bool* Result);
	void OnUpgradedItem(class UITEM_UpgradeBase_C* PreviousItem, bool* Result);
	void OnEnergyShieldActivated();
	void ActivateShield(bool IsResuming);
	void DeactivateShield();
	void GetShieldAbsorption(int32* AbsorbPercent);
	void CanActivateHardware(bool* Result);
	void EVENT_OnShieldAttribChanged(float CurrValue, float LastValue);
	void GetShieldEnergyEfficiencyBonus(int32* Bonus);
	void GetHardwareFeatures(TArray<struct FSTRUCT_HardwareFeature>* Result);
	void EVENT_OnEnergyDepleted();
	void GetShieldActivationEnergyCost(int32* Result);
	void GetShieldEnergyDrainTickRate(float* Result);
	void OnBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HARDWARE_EnergyShield_Base_C">();
	}
	static class UHARDWARE_EnergyShield_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHARDWARE_EnergyShield_Base_C>();
	}
};
static_assert(alignof(UHARDWARE_EnergyShield_Base_C) == 0x000008, "Wrong alignment on UHARDWARE_EnergyShield_Base_C");
static_assert(sizeof(UHARDWARE_EnergyShield_Base_C) == 0x0002C0, "Wrong size on UHARDWARE_EnergyShield_Base_C");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, UberGraphFrame_HARDWARE_EnergyShield_Base_C) == 0x000280, "Member 'UHARDWARE_EnergyShield_Base_C::UberGraphFrame_HARDWARE_EnergyShield_Base_C' has a wrong offset!");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, ShieldAbsorptionPerVersion) == 0x000288, "Member 'UHARDWARE_EnergyShield_Base_C::ShieldAbsorptionPerVersion' has a wrong offset!");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, ShieldEnergyEfficiencyBonusPerVersion) == 0x000294, "Member 'UHARDWARE_EnergyShield_Base_C::ShieldEnergyEfficiencyBonusPerVersion' has a wrong offset!");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, ShieldActivationEnergyCostPerVersion) == 0x0002A0, "Member 'UHARDWARE_EnergyShield_Base_C::ShieldActivationEnergyCostPerVersion' has a wrong offset!");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, ShieldEnergyDrainTickRatePerVersion) == 0x0002AC, "Member 'UHARDWARE_EnergyShield_Base_C::ShieldEnergyDrainTickRatePerVersion' has a wrong offset!");
static_assert(offsetof(UHARDWARE_EnergyShield_Base_C, ShieldBlinkDuration) == 0x0002B8, "Member 'UHARDWARE_EnergyShield_Base_C::ShieldBlinkDuration' has a wrong offset!");

}

