#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_TurboBoots_V1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "HARDWARE_TurboBoots_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HARDWARE_TurboBoots_V1.HARDWARE_TurboBoots_V1_C
// 0x0340 (0x0738 - 0x03F8)
class UHARDWARE_TurboBoots_V1_C : public UHARDWARE_TurboBoots_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HARDWARE_TurboBoots_V1_C;           // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAttribModApplyData                    GroundFrictionApplyData;                           // 0x0400(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    BrakingDecelerationApplyData;                      // 0x04A0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    MoveAccelerationApplyData;                         // 0x0540(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    WalkableFloorAngleApplyData;                       // 0x05E0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TurboSkateDrainTickRate;                           // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousLocation;                                  // 0x0684(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousFloorNormal;                               // 0x0690(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastSurfaceMoveScale;                              // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasStandingOnGround;                               // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               TurboSkatesActivateSoundCue;                       // 0x06A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               TurboSkatesLoopSoundCue;                           // 0x06D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               TurboSkatesDeactivateSoundCue;                     // 0x06F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundCue*                              CachedTurboSkatesActivateSoundCue;                 // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CachedTurboSkatesLoopSoundCue;                     // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CachedTurboSkatesDeactivateSoundCue;               // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HARDWARE_TurboBoots_V1(int32 EntryPoint);
	void StreamTurboSkateAssets();
	void OnLoaded_1A73183248707E4A29F9079B9C66D522(class UObject* Loaded);
	void OnLoaded_1928F5A24E7107BF538A57B42B1B8166(class UObject* Loaded);
	void OnLoaded_C8C2481045482C986540308F248F6B4F(class UObject* Loaded);
	void OnTurboMechanismActivated(int32 VersionNumber, bool* Handled);
	void OnTurboMechanismDeactivated(int32 VersionNumber, bool* Handled);
	void OnTurboSkateStateChanged(bool State);
	void OnTurboBootTick(float DeltaTime, float TurboElapsedTime_0);
	void SetWasStandingOnGround(bool State);
	void GetWasStandingOnGround(bool* Result);
	void ComputeSurfaceMoveScale(float DampingFactor, float* Result);
	void GetLastSurfaceMoveScale(float* Result);
	void GetEnergyDrainTickRate(int32 VersionNumber, float* Result);
	void OnAddedToInventory();
	void OnBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HARDWARE_TurboBoots_V1_C">();
	}
	static class UHARDWARE_TurboBoots_V1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHARDWARE_TurboBoots_V1_C>();
	}
};
static_assert(alignof(UHARDWARE_TurboBoots_V1_C) == 0x000008, "Wrong alignment on UHARDWARE_TurboBoots_V1_C");
static_assert(sizeof(UHARDWARE_TurboBoots_V1_C) == 0x000738, "Wrong size on UHARDWARE_TurboBoots_V1_C");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, UberGraphFrame_HARDWARE_TurboBoots_V1_C) == 0x0003F8, "Member 'UHARDWARE_TurboBoots_V1_C::UberGraphFrame_HARDWARE_TurboBoots_V1_C' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, GroundFrictionApplyData) == 0x000400, "Member 'UHARDWARE_TurboBoots_V1_C::GroundFrictionApplyData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, BrakingDecelerationApplyData) == 0x0004A0, "Member 'UHARDWARE_TurboBoots_V1_C::BrakingDecelerationApplyData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, MoveAccelerationApplyData) == 0x000540, "Member 'UHARDWARE_TurboBoots_V1_C::MoveAccelerationApplyData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, WalkableFloorAngleApplyData) == 0x0005E0, "Member 'UHARDWARE_TurboBoots_V1_C::WalkableFloorAngleApplyData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, TurboSkateDrainTickRate) == 0x000680, "Member 'UHARDWARE_TurboBoots_V1_C::TurboSkateDrainTickRate' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, PreviousLocation) == 0x000684, "Member 'UHARDWARE_TurboBoots_V1_C::PreviousLocation' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, PreviousFloorNormal) == 0x000690, "Member 'UHARDWARE_TurboBoots_V1_C::PreviousFloorNormal' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, LastSurfaceMoveScale) == 0x00069C, "Member 'UHARDWARE_TurboBoots_V1_C::LastSurfaceMoveScale' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, WasStandingOnGround) == 0x0006A0, "Member 'UHARDWARE_TurboBoots_V1_C::WasStandingOnGround' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, TurboSkatesActivateSoundCue) == 0x0006A8, "Member 'UHARDWARE_TurboBoots_V1_C::TurboSkatesActivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, TurboSkatesLoopSoundCue) == 0x0006D0, "Member 'UHARDWARE_TurboBoots_V1_C::TurboSkatesLoopSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, TurboSkatesDeactivateSoundCue) == 0x0006F8, "Member 'UHARDWARE_TurboBoots_V1_C::TurboSkatesDeactivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, CachedTurboSkatesActivateSoundCue) == 0x000720, "Member 'UHARDWARE_TurboBoots_V1_C::CachedTurboSkatesActivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, CachedTurboSkatesLoopSoundCue) == 0x000728, "Member 'UHARDWARE_TurboBoots_V1_C::CachedTurboSkatesLoopSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V1_C, CachedTurboSkatesDeactivateSoundCue) == 0x000730, "Member 'UHARDWARE_TurboBoots_V1_C::CachedTurboSkatesDeactivateSoundCue' has a wrong offset!");

}

