#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_EnergyShield_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_HardwareFeature_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.ExecuteUbergraph_HARDWARE_EnergyShield_Base
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActivated_Result;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base) == 0x000008, "Wrong size on HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base, EntryPoint) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base, CallFunc_GetIsActivated_Result) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_ExecuteUbergraph_HARDWARE_EnergyShield_Base::CallFunc_GetIsActivated_Result' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.UpdateHardwareState
// 0x0003 (0x0003 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_UpdateHardwareState final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateHardwareState_Result;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_UpdateHardwareState) == 0x000001, "Wrong alignment on HARDWARE_EnergyShield_Base_C_UpdateHardwareState");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_UpdateHardwareState) == 0x000003, "Wrong size on HARDWARE_EnergyShield_Base_C_UpdateHardwareState");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_UpdateHardwareState, IsEnabled) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_UpdateHardwareState::IsEnabled' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_UpdateHardwareState, Result) == 0x000001, "Member 'HARDWARE_EnergyShield_Base_C_UpdateHardwareState::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_UpdateHardwareState, CallFunc_UpdateHardwareState_Result) == 0x000002, "Member 'HARDWARE_EnergyShield_Base_C_UpdateHardwareState::CallFunc_UpdateHardwareState_Result' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.OnUpgradedItem
// 0x0010 (0x0010 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_OnUpgradedItem final
{
public:
	class UITEM_UpgradeBase_C*                    PreviousItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsActivated_Result;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnUpgradedItem_Result;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_OnUpgradedItem");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem) == 0x000010, "Wrong size on HARDWARE_EnergyShield_Base_C_OnUpgradedItem");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem, PreviousItem) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_OnUpgradedItem::PreviousItem' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem, Result) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_OnUpgradedItem::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem, CallFunc_GetIsActivated_Result) == 0x000009, "Member 'HARDWARE_EnergyShield_Base_C_OnUpgradedItem::CallFunc_GetIsActivated_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnUpgradedItem, CallFunc_OnUpgradedItem_Result) == 0x00000A, "Member 'HARDWARE_EnergyShield_Base_C_OnUpgradedItem::CallFunc_OnUpgradedItem_Result' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.OnEnergyShieldActivated
// 0x0060 (0x0060 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated final
{
public:
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UAttribInstance*                        CallFunc_GetOrCreateAttribInstance_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_2;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttributeDef*                          CallFunc_GetShieldAttrib_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetOrCreateAttribInstance_ReturnValue_1;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated) == 0x000060, "Wrong size on HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetOwnerCharacter_Character) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000018, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetOwnerCharacter_Character_1) == 0x000028, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetOwnerCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetOrCreateAttribInstance_ReturnValue) == 0x000040, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetOrCreateAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetOwnerCharacter_Character_2) == 0x000048, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetOwnerCharacter_Character_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetShieldAttrib_ReturnValue) == 0x000050, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetShieldAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated, CallFunc_GetOrCreateAttribInstance_ReturnValue_1) == 0x000058, "Member 'HARDWARE_EnergyShield_Base_C_OnEnergyShieldActivated::CallFunc_GetOrCreateAttribInstance_ReturnValue_1' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.ActivateShield
// 0x0398 (0x0398 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_ActivateShield final
{
public:
	bool                                          IsResuming;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShieldAbsorption;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ShieldBonusCategory;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribModApplyData                    ShieldEnergyEfficiencyMod;                         // 0x0010(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    EnergyShieldBlinkMod;                              // 0x00B0(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    EnergyShieldMod;                                   // 0x0150(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    EnergyDrainMod;                                    // 0x01F0(0x00A0)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    EnergyCostMod;                                     // 0x0290(0x00A0)(Edit, BlueprintVisible)
	class UCOMP_AttribManager_C*                  OwnerAttribManager;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShieldEnergyDrainTickRate_Result;      // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_2;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldActivationEnergyCost_Result;     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_3;                   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldEnergyEfficiencyBonus_Bonus;     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_4;                   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldAbsorption_AbsorbPercent;        // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_ActivateShield) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_ActivateShield");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_ActivateShield) == 0x000398, "Wrong size on HARDWARE_EnergyShield_Base_C_ActivateShield");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, IsResuming) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::IsResuming' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, ShieldAbsorption) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::ShieldAbsorption' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, ShieldBonusCategory) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::ShieldBonusCategory' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, ShieldEnergyEfficiencyMod) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::ShieldEnergyEfficiencyMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, EnergyShieldBlinkMod) == 0x0000B0, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::EnergyShieldBlinkMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, EnergyShieldMod) == 0x000150, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::EnergyShieldMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, EnergyDrainMod) == 0x0001F0, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::EnergyDrainMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, EnergyCostMod) == 0x000290, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::EnergyCostMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, OwnerAttribManager) == 0x000330, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::OwnerAttribManager' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000338, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_ApplyMod_ReturnValue) == 0x000340, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000348, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00034C, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_ApplyMod_ReturnValue_1) == 0x000350, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_GetOwnerCharacter_Character) == 0x000358, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_GetShieldEnergyDrainTickRate_Result) == 0x000360, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_GetShieldEnergyDrainTickRate_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_ApplyMod_ReturnValue_2) == 0x000368, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_ApplyMod_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_GetShieldActivationEnergyCost_Result) == 0x000370, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_GetShieldActivationEnergyCost_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000374, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_ApplyMod_ReturnValue_3) == 0x000378, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_ApplyMod_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_GetShieldEnergyEfficiencyBonus_Bonus) == 0x000380, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_GetShieldEnergyEfficiencyBonus_Bonus' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000384, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_ApplyMod_ReturnValue_4) == 0x000388, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_ApplyMod_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_ActivateShield, CallFunc_GetShieldAbsorption_AbsorbPercent) == 0x000390, "Member 'HARDWARE_EnergyShield_Base_C_ActivateShield::CallFunc_GetShieldAbsorption_AbsorbPercent' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.DeactivateShield
// 0x0058 (0x0058 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_DeactivateShield final
{
public:
	class UAttribInstance*                        ShieldAttribInstance;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttributeDef*                          CallFunc_GetShieldAttrib_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_2;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_DeactivateShield) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_DeactivateShield");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_DeactivateShield) == 0x000058, "Wrong size on HARDWARE_EnergyShield_Base_C_DeactivateShield");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, ShieldAttribInstance) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::ShieldAttribInstance' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_GetOwnerCharacter_Character_1) == 0x000030, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_GetOwnerCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_GetShieldAttrib_ReturnValue) == 0x000038, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_GetShieldAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_GetOwnerCharacter_Character_2) == 0x000040, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_GetOwnerCharacter_Character_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_GetAttribInstance_ReturnValue) == 0x000048, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_DeactivateShield, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x000050, "Member 'HARDWARE_EnergyShield_Base_C_DeactivateShield::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.GetShieldAbsorption
// 0x0014 (0x0014 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_GetShieldAbsorption final
{
public:
	int32                                         AbsorbPercent;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVersionNumber_Version;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_GetShieldAbsorption");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption) == 0x000014, "Wrong size on HARDWARE_EnergyShield_Base_C_GetShieldAbsorption");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption, AbsorbPercent) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldAbsorption::AbsorbPercent' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption, Temp_int_Variable) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldAbsorption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption, CallFunc_GetVersionNumber_Version) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldAbsorption::CallFunc_GetVersionNumber_Version' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldAbsorption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldAbsorption, K2Node_Select_Default) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldAbsorption::K2Node_Select_Default' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.CanActivateHardware
// 0x0038 (0x0038 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_CanActivateHardware final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_AttribManager_C*                  OwnerAttribManager;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttributeDef*                          CallFunc_GetShieldAttrib_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldActivationEnergyCost_Result;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_CanActivateHardware) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_CanActivateHardware");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_CanActivateHardware) == 0x000038, "Wrong size on HARDWARE_EnergyShield_Base_C_CanActivateHardware");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, Result) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, OwnerAttribManager) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::OwnerAttribManager' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_GetShieldAttrib_ReturnValue) == 0x000018, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_GetShieldAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_GetShieldActivationEnergyCost_Result) == 0x000020, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_GetShieldActivationEnergyCost_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_GetAttribValue_ReturnValue_1) == 0x000024, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_GetAttribValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002D, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_CanActivateHardware, CallFunc_GetOwnerCharacter_Character) == 0x000030, "Member 'HARDWARE_EnergyShield_Base_C_CanActivateHardware::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.EVENT_OnShieldAttribChanged
// 0x000C (0x000C - 0x0000)
struct HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deactivate_Result;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged) == 0x00000C, "Wrong size on HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged, CurrValue) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged, LastValue) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged, CallFunc_Deactivate_Result) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged::CallFunc_Deactivate_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'HARDWARE_EnergyShield_Base_C_EVENT_OnShieldAttribChanged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.GetShieldEnergyEfficiencyBonus
// 0x0014 (0x0014 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus final
{
public:
	int32                                         Bonus;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVersionNumber_Version;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus) == 0x000014, "Wrong size on HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus, Bonus) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus::Bonus' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus, Temp_int_Variable) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus, CallFunc_GetVersionNumber_Version) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus::CallFunc_GetVersionNumber_Version' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus, K2Node_Select_Default) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyEfficiencyBonus::K2Node_Select_Default' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.GetHardwareFeatures
// 0x01C0 (0x01C0 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_GetHardwareFeatures final
{
public:
	TArray<struct FSTRUCT_HardwareFeature>        Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   CallFunc_ReplaceHardwareInputActionStringInText_Result; // 0x0010(0x0018)()
	float                                         CallFunc_GetShieldEnergyDrainTickRate_Result;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_ComputeJpmFromTickRate_Result;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldEnergyEfficiencyBonus_Bonus;     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShieldAbsorption_AbsorbPercent;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0178(0x0018)()
	struct FSTRUCT_HardwareFeature                K2Node_MakeStruct_STRUCT_HardwareFeature;          // 0x0190(0x0020)(HasGetValueTypeHash)
	TArray<struct FSTRUCT_HardwareFeature>        K2Node_MakeArray_Array_2;                          // 0x01B0(0x0010)(ReferenceParm)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures) == 0x000008, "Wrong alignment on HARDWARE_EnergyShield_Base_C_GetHardwareFeatures");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures) == 0x0001C0, "Wrong size on HARDWARE_EnergyShield_Base_C_GetHardwareFeatures");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, Result) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_ReplaceHardwareInputActionStringInText_Result) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_ReplaceHardwareInputActionStringInText_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_GetShieldEnergyDrainTickRate_Result) == 0x000028, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_GetShieldEnergyDrainTickRate_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_ComputeJpmFromTickRate_Result) == 0x000070, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_ComputeJpmFromTickRate_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_GetShieldEnergyEfficiencyBonus_Bonus) == 0x000074, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_GetShieldEnergyEfficiencyBonus_Bonus' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_GetShieldAbsorption_AbsorbPercent) == 0x000078, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_GetShieldAbsorption_AbsorbPercent' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeArray_Array) == 0x000100, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_Format_ReturnValue) == 0x000110, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeStruct_FormatArgumentData_3) == 0x000128, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeArray_Array_1) == 0x000168, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, CallFunc_Format_ReturnValue_1) == 0x000178, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeStruct_STRUCT_HardwareFeature) == 0x000190, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeStruct_STRUCT_HardwareFeature' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetHardwareFeatures, K2Node_MakeArray_Array_2) == 0x0001B0, "Member 'HARDWARE_EnergyShield_Base_C_GetHardwareFeatures::K2Node_MakeArray_Array_2' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.EVENT_OnEnergyDepleted
// 0x0001 (0x0001 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted final
{
public:
	bool                                          CallFunc_Deactivate_Result;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted) == 0x000001, "Wrong alignment on HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted) == 0x000001, "Wrong size on HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted, CallFunc_Deactivate_Result) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_EVENT_OnEnergyDepleted::CallFunc_Deactivate_Result' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.GetShieldActivationEnergyCost
// 0x0014 (0x0014 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVersionNumber_Version;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost) == 0x000014, "Wrong size on HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost, Result) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost, Temp_int_Variable) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost, CallFunc_GetVersionNumber_Version) == 0x000008, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost::CallFunc_GetVersionNumber_Version' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost, K2Node_Select_Default) == 0x000010, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldActivationEnergyCost::K2Node_Select_Default' has a wrong offset!");

// Function HARDWARE_EnergyShield_Base.HARDWARE_EnergyShield_Base_C.GetShieldEnergyDrainTickRate
// 0x0020 (0x0020 - 0x0000)
struct HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVersionNumber_Version;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate) == 0x000004, "Wrong alignment on HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate");
static_assert(sizeof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate) == 0x000020, "Wrong size on HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate, Result) == 0x000000, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate, Temp_int_Variable) == 0x000004, "Member 'HARDWARE_EnergyShield_Base_C_GetShieldEnergyDrainTickRate::Temp_int_Variable' has a wrong offset!");
