#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_TurboBoots_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.ExecuteUbergraph_HARDWARE_TurboBoots_V2
// 0x0098 (0x0098 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2) == 0x000098, "Wrong size on HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, EntryPoint) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CustomEvent_Loaded_2) == 0x000028, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, Temp_object_Variable) == 0x000030, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_AsSound_Cue) == 0x000038, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CustomEvent_Loaded_1) == 0x000048, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, Temp_object_Variable_1) == 0x000050, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_AsSound_Cue_1) == 0x000058, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_AsSound_Cue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CustomEvent_Loaded) == 0x000068, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, Temp_object_Variable_2) == 0x000070, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_AsSound_Cue_2) == 0x000078, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_AsSound_Cue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'HARDWARE_TurboBoots_V2_C_ExecuteUbergraph_HARDWARE_TurboBoots_V2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnLoaded_3E27AC674C68943FE06D9EB0998605A6
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6) == 0x000008, "Wrong size on HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6, Loaded) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnLoaded_3E27AC674C68943FE06D9EB0998605A6::Loaded' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0) == 0x000008, "Wrong size on HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0, Loaded) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0::Loaded' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnLoaded_0D0E241446932C46CEADE994B9873A1F
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F) == 0x000008, "Wrong size on HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F, Loaded) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnLoaded_0D0E241446932C46CEADE994B9873A1F::Loaded' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnTurboMechanismActivated
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated final
{
public:
	int32                                         VersionNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Handled;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnTurboMechanismActivated_Handled;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated) == 0x000004, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated) == 0x000008, "Wrong size on HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated, VersionNumber) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated::VersionNumber' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated, Handled) == 0x000004, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated::Handled' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated, CallFunc_OnTurboMechanismActivated_Handled) == 0x000006, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismActivated::CallFunc_OnTurboMechanismActivated_Handled' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnTurboMechanismDeactivated
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated final
{
public:
	int32                                         VersionNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Handled;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnTurboMechanismDeactivated_Handled;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated) == 0x000004, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated) == 0x000008, "Wrong size on HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated, VersionNumber) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated::VersionNumber' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated, Handled) == 0x000004, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated::Handled' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated, CallFunc_OnTurboMechanismDeactivated_Handled) == 0x000006, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboMechanismDeactivated::CallFunc_OnTurboMechanismDeactivated_Handled' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.StartJumpJetLiftOff
// 0x0030 (0x0030 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff final
{
public:
	class UAttribMod*                             LowGravity;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_GetActiveModWithCategory_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVersionNumber_Version;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActivateTurboMechanism_Result;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff) == 0x000030, "Wrong size on HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, LowGravity) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::LowGravity' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_GetAttribInstance_ReturnValue) == 0x000010, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_GetActiveModWithCategory_ReturnValue) == 0x000018, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_GetActiveModWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_GetVersionNumber_Version) == 0x000024, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_GetVersionNumber_Version' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff, CallFunc_ActivateTurboMechanism_Result) == 0x000028, "Member 'HARDWARE_TurboBoots_V2_C_StartJumpJetLiftOff::CallFunc_ActivateTurboMechanism_Result' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnJumpJetStateChanged
// 0x0070 (0x0070 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        GravityScaleAttribInstance;                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        AirControlAttribInstance;                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CharacterOwner;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExpireModsMatchingCategory_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExpireModsMatchingCategory_ReturnValue_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_Actor;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged) == 0x000070, "Wrong size on HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, State) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::State' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, GravityScaleAttribInstance) == 0x000008, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::GravityScaleAttribInstance' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, AirControlAttribInstance) == 0x000010, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::AirControlAttribInstance' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CharacterOwner) == 0x000018, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CharacterOwner' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_IsValid_ReturnValue_2) == 0x000022, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_ExpireModsMatchingCategory_ReturnValue) == 0x000024, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_ExpireModsMatchingCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_GetAttribInstance_ReturnValue) == 0x000028, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_ApplyMod_ReturnValue) == 0x000030, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_IsValid_ReturnValue_3) == 0x000038, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_ExpireModsMatchingCategory_ReturnValue_1) == 0x00003C, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_ExpireModsMatchingCategory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_GetAttribInstance_ReturnValue_1) == 0x000040, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_GetAttribInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_GetOwnerActor_Actor) == 0x000048, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_GetOwnerActor_Actor' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_ApplyMod_ReturnValue_1) == 0x000050, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000058, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged, CallFunc_GetOwnerCharacter_Character) == 0x000068, "Member 'HARDWARE_TurboBoots_V2_C_OnJumpJetStateChanged::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");

// Function HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C.OnTurboBootTick
// 0x02B0 (0x02B0 - 0x0000)
struct HARDWARE_TurboBoots_V2_C_OnTurboBootTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurboElapsedTime_0;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpTranslation;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpHeightB;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpHeightA;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpJetElapsedTimeB;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpJetElapsedTimeA;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravityScale;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             LowGravityAttribMod;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        GravityAttribInstance;                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 HackerOwner;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveModWithCategory_ReturnValue;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_GetActiveModWithCategory_ReturnValue;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveVersionNumber_VersionNumber;     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeactivateTurboMechanism_Result;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWasStandingOnGround_Result;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveVersionNumber_VersionNumber_1;   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0224(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick) == 0x000008, "Wrong alignment on HARDWARE_TurboBoots_V2_C_OnTurboBootTick");
static_assert(sizeof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick) == 0x0002B0, "Wrong size on HARDWARE_TurboBoots_V2_C_OnTurboBootTick");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, DeltaTime) == 0x000000, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, TurboElapsedTime_0) == 0x000004, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::TurboElapsedTime_0' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, JumpTranslation) == 0x000008, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::JumpTranslation' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, JumpHeightB) == 0x00000C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::JumpHeightB' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, JumpHeightA) == 0x000010, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::JumpHeightA' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, JumpJetElapsedTimeB) == 0x000014, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::JumpJetElapsedTimeB' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, JumpJetElapsedTimeA) == 0x000018, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::JumpJetElapsedTimeA' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, GravityScale) == 0x00001C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::GravityScale' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, LowGravityAttribMod) == 0x000020, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::LowGravityAttribMod' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, GravityAttribInstance) == 0x000028, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::GravityAttribInstance' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, HackerOwner) == 0x000030, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::HackerOwner' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_bool_Variable) == 0x000038, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_float_Variable) == 0x00003C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_float_Variable_1) == 0x000040, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_float_Variable_2) == 0x000044, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_HasActiveModWithCategory_ReturnValue) == 0x000048, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_HasActiveModWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x00004C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, K2Node_MakeArray_Array) == 0x000058, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue) == 0x000074, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_bool_Variable_1) == 0x000078, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00008C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000098, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009A, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Less_FloatFloat_ReturnValue) == 0x00009B, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_bool_Variable_2) == 0x0000A4, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, K2Node_Select_Default) == 0x0000AC, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetValue_ReturnValue) == 0x0000B0, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, Temp_object_Variable) == 0x0000B8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000C8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000150, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Not_PreBool_ReturnValue_1) == 0x000151, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetActiveModWithCategory_ReturnValue) == 0x000158, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetActiveModWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000160, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000164, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, K2Node_Select_Default_1) == 0x000168, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetAttribInstance_ReturnValue) == 0x000170, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetActiveVersionNumber_VersionNumber) == 0x000178, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetActiveVersionNumber_VersionNumber' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_DeactivateTurboMechanism_Result) == 0x00017C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_DeactivateTurboMechanism_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000180, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000184, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_FMax_ReturnValue) == 0x000188, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00018C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000190, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_X) == 0x00019C, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_Y) == 0x0001A0, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_Z) == 0x0001A4, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Conv_FloatToString_ReturnValue) == 0x0001A8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_X_1) == 0x0001B8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_Y_1) == 0x0001BC, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_BreakVector_Z_1) == 0x0001C0, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_FInterpTo_Constant_ReturnValue) == 0x0001C4, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetFloatValue_ReturnValue) == 0x0001C8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_MakeVector_ReturnValue_1) == 0x0001CC, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_GetWasStandingOnGround_Result) == 0x0001D8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_GetWasStandingOnGround_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0001DC, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, K2Node_Select_Default_2) == 0x0001E0, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001E4, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_TurboBoots_V2_C_OnTurboBootTick, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001E8, "Member 'HARDWARE_TurboBoots_V2_C_OnTurboBootTick::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
