#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_DataReader

#include "Basic.hpp"


namespace SDK::Params
{

// Function HARDWARE_DataReader.HARDWARE_DataReader_C.ExecuteUbergraph_HARDWARE_DataReader
// 0x0098 (0x0098 - 0x0000)
struct HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_DynamicCast_AsMaterial_Interface;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader) == 0x000008, "Wrong alignment on HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader");
static_assert(sizeof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader) == 0x000098, "Wrong size on HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, EntryPoint) == 0x000000, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::EntryPoint' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_CustomEvent_Loaded_1) == 0x000010, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000018, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, Temp_object_Variable) == 0x000028, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_AsStatic_Mesh) == 0x000030, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, Temp_object_Variable_1) == 0x000048, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_AsMaterial_Interface) == 0x000050, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_AsMaterial_Interface' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, CallFunc_GetOwnerCharacter_Character_1) == 0x000060, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::CallFunc_GetOwnerCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_AsPAWN_Hacker_Implant_1) == 0x000068, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_AsPAWN_Hacker_Implant_1' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, CallFunc_SetStaticMesh_ReturnValue) == 0x000084, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'HARDWARE_DataReader_C_ExecuteUbergraph_HARDWARE_DataReader::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function HARDWARE_DataReader.HARDWARE_DataReader_C.OnLoaded_2B54F99340094416C6C6069C21D1072C
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C) == 0x000008, "Wrong alignment on HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C");
static_assert(sizeof(HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C) == 0x000008, "Wrong size on HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C");
static_assert(offsetof(HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C, Loaded) == 0x000000, "Member 'HARDWARE_DataReader_C_OnLoaded_2B54F99340094416C6C6069C21D1072C::Loaded' has a wrong offset!");

// Function HARDWARE_DataReader.HARDWARE_DataReader_C.OnLoaded_65EE3A914F0C398482905DB02E5CDD54
// 0x0008 (0x0008 - 0x0000)
struct HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54) == 0x000008, "Wrong alignment on HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54");
static_assert(sizeof(HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54) == 0x000008, "Wrong size on HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54");
static_assert(offsetof(HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54, Loaded) == 0x000000, "Member 'HARDWARE_DataReader_C_OnLoaded_65EE3A914F0C398482905DB02E5CDD54::Loaded' has a wrong offset!");

// Function HARDWARE_DataReader.HARDWARE_DataReader_C.OnIncomingTransmission
// 0x0040 (0x0040 - 0x0000)
struct HARDWARE_DataReader_C_OnIncomingTransmission final
{
public:
	class USkeletalMeshComponent*                 DisplayMeshComponent;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetDisplayMeshComponent_MeshComponent;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HARDWARE_DataReader_C_OnIncomingTransmission) == 0x000008, "Wrong alignment on HARDWARE_DataReader_C_OnIncomingTransmission");
static_assert(sizeof(HARDWARE_DataReader_C_OnIncomingTransmission) == 0x000040, "Wrong size on HARDWARE_DataReader_C_OnIncomingTransmission");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, DisplayMeshComponent) == 0x000000, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::DisplayMeshComponent' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000028, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_OnIncomingTransmission, CallFunc_GetDisplayMeshComponent_MeshComponent) == 0x000038, "Member 'HARDWARE_DataReader_C_OnIncomingTransmission::CallFunc_GetDisplayMeshComponent_MeshComponent' has a wrong offset!");

// Function HARDWARE_DataReader.HARDWARE_DataReader_C.ReceiveAnimationMessage
// 0x0018 (0x0018 - 0x0000)
struct HARDWARE_DataReader_C_ReceiveAnimationMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveAnimationMessage_Result;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_DataReader_C_ReceiveAnimationMessage) == 0x000008, "Wrong alignment on HARDWARE_DataReader_C_ReceiveAnimationMessage");
static_assert(sizeof(HARDWARE_DataReader_C_ReceiveAnimationMessage) == 0x000018, "Wrong size on HARDWARE_DataReader_C_ReceiveAnimationMessage");
static_assert(offsetof(HARDWARE_DataReader_C_ReceiveAnimationMessage, Message) == 0x000000, "Member 'HARDWARE_DataReader_C_ReceiveAnimationMessage::Message' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ReceiveAnimationMessage, Result) == 0x000010, "Member 'HARDWARE_DataReader_C_ReceiveAnimationMessage::Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ReceiveAnimationMessage, CallFunc_ReceiveAnimationMessage_Result) == 0x000011, "Member 'HARDWARE_DataReader_C_ReceiveAnimationMessage::CallFunc_ReceiveAnimationMessage_Result' has a wrong offset!");
static_assert(offsetof(HARDWARE_DataReader_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000012, "Member 'HARDWARE_DataReader_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

