#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_NavUnit_V2

#include "Basic.hpp"


namespace SDK::Params
{

// Function HARDWARE_NavUnit_V2.HARDWARE_NavUnit_V2_C.GetMapFilterTags
// 0x00C8 (0x00C8 - 0x0000)
struct HARDWARE_NavUnit_V2_C_GetMapFilterTags final
{
public:
	TSet<class FName>                             Tags;                                              // 0x0000(0x0050)(Parm, OutParm)
	TSet<class FName>                             ResultTags;                                        // 0x0050(0x0050)(Edit, BlueprintVisible)
	TArray<class FName>                           Temp_name_Variable;                                // 0x00A0(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHARDWARE_Nav_Unit_V1;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HARDWARE_NavUnit_V2_C_GetMapFilterTags) == 0x000008, "Wrong alignment on HARDWARE_NavUnit_V2_C_GetMapFilterTags");
static_assert(sizeof(HARDWARE_NavUnit_V2_C_GetMapFilterTags) == 0x0000C8, "Wrong size on HARDWARE_NavUnit_V2_C_GetMapFilterTags");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, Tags) == 0x000000, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::Tags' has a wrong offset!");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, ResultTags) == 0x000050, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::ResultTags' has a wrong offset!");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, Temp_name_Variable) == 0x0000A0, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000B0, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, K2Node_ClassDynamicCast_AsHARDWARE_Nav_Unit_V1) == 0x0000B8, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::K2Node_ClassDynamicCast_AsHARDWARE_Nav_Unit_V1' has a wrong offset!");
static_assert(offsetof(HARDWARE_NavUnit_V2_C_GetMapFilterTags, K2Node_ClassDynamicCast_bSuccess) == 0x0000C0, "Member 'HARDWARE_NavUnit_V2_C_GetMapFilterTags::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

}

