#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HARDWARE_TurboBoots_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "HARDWARE_TurboBoots_V1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HARDWARE_TurboBoots_V2.HARDWARE_TurboBoots_V2_C
// 0x01F0 (0x0928 - 0x0738)
class UHARDWARE_TurboBoots_V2_C : public UHARDWARE_TurboBoots_V1_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HARDWARE_TurboBoots_V2_C;           // 0x0738(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAttribModApplyData                    AirControlModData;                                 // 0x0740(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    GravityScaleModData;                               // 0x07E0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            JumpJetHeightCurve;                                // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpJetMaxHeight;                                  // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpJetLiftOffDuration;                            // 0x088C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpJetDrainTickRate;                              // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugJumpJetHeight;                                // 0x0894(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               JumpJetActivateSoundCue;                           // 0x0898(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               JumpJetLoopSoundCue;                               // 0x08C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               JumpJetDeactivateSoundCue;                         // 0x08E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundCue*                              CachedJumpJetActivateSoundCue;                     // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CachedJumpJetLoopSoundCue;                         // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              CachedJumpJetDeactivateSoundCue;                   // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HARDWARE_TurboBoots_V2(int32 EntryPoint);
	void StreamJumpJetAssets();
	void OnLoaded_3E27AC674C68943FE06D9EB0998605A6(class UObject* Loaded);
	void OnLoaded_95DB74F34A7FBA233C35E89D05DAF9E0(class UObject* Loaded);
	void OnLoaded_0D0E241446932C46CEADE994B9873A1F(class UObject* Loaded);
	void OnTurboMechanismActivated(int32 VersionNumber, bool* Handled);
	void OnTurboMechanismDeactivated(int32 VersionNumber, bool* Handled);
	void StartJumpJetLiftOff();
	void OnJumpJetStateChanged(bool State);
	void OnTurboBootTick(float DeltaTime, float TurboElapsedTime_0);
	void GetEnergyDrainTickRate(int32 VersionNumber, float* Result);
	void OnAddedToInventory();
	void OnBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HARDWARE_TurboBoots_V2_C">();
	}
	static class UHARDWARE_TurboBoots_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHARDWARE_TurboBoots_V2_C>();
	}
};
static_assert(alignof(UHARDWARE_TurboBoots_V2_C) == 0x000008, "Wrong alignment on UHARDWARE_TurboBoots_V2_C");
static_assert(sizeof(UHARDWARE_TurboBoots_V2_C) == 0x000928, "Wrong size on UHARDWARE_TurboBoots_V2_C");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, UberGraphFrame_HARDWARE_TurboBoots_V2_C) == 0x000738, "Member 'UHARDWARE_TurboBoots_V2_C::UberGraphFrame_HARDWARE_TurboBoots_V2_C' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, AirControlModData) == 0x000740, "Member 'UHARDWARE_TurboBoots_V2_C::AirControlModData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, GravityScaleModData) == 0x0007E0, "Member 'UHARDWARE_TurboBoots_V2_C::GravityScaleModData' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetHeightCurve) == 0x000880, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetHeightCurve' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetMaxHeight) == 0x000888, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetMaxHeight' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetLiftOffDuration) == 0x00088C, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetLiftOffDuration' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetDrainTickRate) == 0x000890, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetDrainTickRate' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, DebugJumpJetHeight) == 0x000894, "Member 'UHARDWARE_TurboBoots_V2_C::DebugJumpJetHeight' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetActivateSoundCue) == 0x000898, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetActivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetLoopSoundCue) == 0x0008C0, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetLoopSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, JumpJetDeactivateSoundCue) == 0x0008E8, "Member 'UHARDWARE_TurboBoots_V2_C::JumpJetDeactivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, CachedJumpJetActivateSoundCue) == 0x000910, "Member 'UHARDWARE_TurboBoots_V2_C::CachedJumpJetActivateSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, CachedJumpJetLoopSoundCue) == 0x000918, "Member 'UHARDWARE_TurboBoots_V2_C::CachedJumpJetLoopSoundCue' has a wrong offset!");
static_assert(offsetof(UHARDWARE_TurboBoots_V2_C, CachedJumpJetDeactivateSoundCue) == 0x000920, "Member 'UHARDWARE_TurboBoots_V2_C::CachedJumpJetDeactivateSoundCue' has a wrong offset!");

}

