#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImpactFunctionLibrary

#include "Basic.hpp"

#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_DebrisFragmentData_structs.hpp"
#include "STRUCT_ImpactParams_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"
#include "STRUCT_AsyncParticleParams_structs.hpp"


namespace SDK::Params
{

// Function ImpactFunctionLibrary.ImpactFunctionLibrary_C.CreateImpactEffects
// 0x0140 (0x0140 - 0x0000)
struct ImpactFunctionLibrary_C_CreateImpactEffects final
{
public:
	class UDataTable*                             ImpactTable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactDirection;                                   // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SurfaceDirection;                                  // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      Physical_Material;                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Player_Owner;                                      // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DetectionRadius;                                   // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSTRUCT_EffectParams                   SoundParameters;                                   // 0x0088(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FSTRUCT_EffectParams                   EffectParameters;                                  // 0x00B8(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactEffectResults            Results;                                           // 0x00F8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FLatentObjectEventHandle               K2Node_MakeStruct_LatentObjectEventHandle;         // 0x0110(0x0010)(ContainsInstancedReference)
	bool                                          CallFunc_CreateImpactEffectsWithEvent_Success;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactEffectResults            CallFunc_CreateImpactEffectsWithEvent_Results;     // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(ImpactFunctionLibrary_C_CreateImpactEffects) == 0x000008, "Wrong alignment on ImpactFunctionLibrary_C_CreateImpactEffects");
static_assert(sizeof(ImpactFunctionLibrary_C_CreateImpactEffects) == 0x000140, "Wrong size on ImpactFunctionLibrary_C_CreateImpactEffects");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, ImpactTable) == 0x000000, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::ImpactTable' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, ImpactLocation) == 0x000008, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::ImpactLocation' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, ImpactDirection) == 0x000014, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::ImpactDirection' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, SurfaceDirection) == 0x000020, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::SurfaceDirection' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, Physical_Material) == 0x000030, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::Physical_Material' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, HitActor) == 0x000038, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::HitActor' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, HitComponent) == 0x000040, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::HitComponent' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, BoneName) == 0x000048, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::BoneName' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, Player_Owner) == 0x000050, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::Player_Owner' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, DetectionRadius) == 0x000058, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::DetectionRadius' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, DamageInstance) == 0x000060, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::DamageInstance' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, SoundParameters) == 0x000088, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::SoundParameters' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, EffectParameters) == 0x0000B8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::EffectParameters' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, __WorldContext) == 0x0000E8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::__WorldContext' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, Success) == 0x0000F0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::Success' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, Results) == 0x0000F8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::Results' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, K2Node_MakeStruct_LatentObjectEventHandle) == 0x000110, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::K2Node_MakeStruct_LatentObjectEventHandle' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, CallFunc_CreateImpactEffectsWithEvent_Success) == 0x000120, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::CallFunc_CreateImpactEffectsWithEvent_Success' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffects, CallFunc_CreateImpactEffectsWithEvent_Results) == 0x000128, "Member 'ImpactFunctionLibrary_C_CreateImpactEffects::CallFunc_CreateImpactEffectsWithEvent_Results' has a wrong offset!");

// Function ImpactFunctionLibrary.ImpactFunctionLibrary_C.CreateImpactEffectsWithEvent
// 0x04C0 (0x04C0 - 0x0000)
struct ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent final
{
public:
	class UDataTable*                             ImpactTable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactDirection;                                   // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SurfaceDirection;                                  // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      Physical_Material;                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Player_Owner;                                      // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DetectionRadius;                                   // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSTRUCT_EffectParams                   SoundParameters;                                   // 0x0088(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FSTRUCT_EffectParams                   EffectParameters;                                  // 0x00B8(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FLatentObjectEventHandle               OnEffectsSpawned;                                  // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactEffectResults            Results;                                           // 0x0108(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCOMP_SkinnedDecalSampler_C*            Component_Decal_Sampler;                           // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EffectsRotation;                                   // 0x0128(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HitComponentTransform;                             // 0x0140(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FVector                                NudgedImpactLocation;                              // 0x0170(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactParams                   ImpactParams;                                      // 0x0180(0x0058)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    ComponentToImpact;                                 // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_Conv_VectorToQuaternion_ReturnValue;      // 0x0200(0x0010)(IsPlainOldData, NoDestructor)
	struct FNamedVector                           K2Node_MakeStruct_NamedVector;                     // 0x0210(0x0014)(NoDestructor)
	bool                                          CallFunc_GetImpactParamsForSurfaceType_Found;      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactParams                   CallFunc_GetImpactParamsForSurfaceType_Result;     // 0x0228(0x0058)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FNamedVector                           K2Node_MakeStruct_NamedVector_1;                   // 0x0280(0x0014)(NoDestructor)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamedVector>                   K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEffectiveArmorRatioFromDamage_BlockRatio; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SpawnDecal_ReturnValue;                   // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue_1;   // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPrimitiveComponent>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0320(0x0028)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_354[0xC];                                      // 0x0354(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0360(0x0030)(IsPlainOldData, NoDestructor)
	struct FSTRUCT_AsyncParticleParams            K2Node_MakeStruct_STRUCT_AsyncParticleParams;      // 0x0390(0x00A0)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FSTRUCT_ImpactEffectResults            K2Node_MakeStruct_STRUCT_ImpactEffectResults;      // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetReflectionVector_ReturnValue;          // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetComponentToImpact_ResultComponent;     // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_SkinnedDecalSampler_C*            CallFunc_GetComponentToImpact_ResultSkinnedDecalSampler; // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent) == 0x000010, "Wrong alignment on ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent");
static_assert(sizeof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent) == 0x0004C0, "Wrong size on ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, ImpactTable) == 0x000000, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::ImpactTable' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, ImpactLocation) == 0x000008, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::ImpactLocation' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, ImpactDirection) == 0x000014, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::ImpactDirection' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, SurfaceDirection) == 0x000020, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::SurfaceDirection' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, Physical_Material) == 0x000030, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::Physical_Material' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, HitActor) == 0x000038, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::HitActor' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, HitComponent) == 0x000040, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::HitComponent' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, BoneName) == 0x000048, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::BoneName' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, Player_Owner) == 0x000050, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::Player_Owner' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, DetectionRadius) == 0x000058, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::DetectionRadius' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, DamageInstance) == 0x000060, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::DamageInstance' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, SoundParameters) == 0x000088, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::SoundParameters' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, EffectParameters) == 0x0000B8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::EffectParameters' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, OnEffectsSpawned) == 0x0000E8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::OnEffectsSpawned' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, __WorldContext) == 0x0000F8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, Success) == 0x000100, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::Success' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, Results) == 0x000108, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::Results' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, Component_Decal_Sampler) == 0x000120, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::Component_Decal_Sampler' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, EffectsRotation) == 0x000128, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::EffectsRotation' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, HitComponentTransform) == 0x000140, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::HitComponentTransform' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, NudgedImpactLocation) == 0x000170, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::NudgedImpactLocation' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, ImpactParams) == 0x000180, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::ImpactParams' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, GameInstance) == 0x0001D8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::GameInstance' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, ComponentToImpact) == 0x0001E0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::ComponentToImpact' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Multiply_VectorInt_ReturnValue) == 0x0001E8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Conv_VectorToQuaternion_ReturnValue) == 0x000200, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Conv_VectorToQuaternion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_MakeStruct_NamedVector) == 0x000210, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_MakeStruct_NamedVector' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetImpactParamsForSurfaceType_Found) == 0x000224, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetImpactParamsForSurfaceType_Found' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetImpactParamsForSurfaceType_Result) == 0x000228, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetImpactParamsForSurfaceType_Result' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_MakeStruct_NamedVector_1) == 0x000280, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_MakeStruct_NamedVector_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_MakeArray_Array) == 0x000298, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002A8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Multiply_IntInt_ReturnValue) == 0x0002AC, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetEffectiveArmorRatioFromDamage_BlockRatio) == 0x0002B0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetEffectiveArmorRatioFromDamage_BlockRatio' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002B4, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0002B8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Add_IntInt_ReturnValue) == 0x0002BC, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_IsValid_ReturnValue) == 0x0002C0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002C4, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_SelectInt_ReturnValue) == 0x0002C8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_SpawnDecal_ReturnValue) == 0x0002CC, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_SpawnDecal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetSocketTransform_ReturnValue) == 0x0002D0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_InverseTransformLocation_ReturnValue) == 0x000300, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_IsValid_ReturnValue_1) == 0x00030C, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_InverseTransformLocation_ReturnValue_1) == 0x000310, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_InverseTransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00031C, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000320, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_InverseTransformRotation_ReturnValue) == 0x000348, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_MakeTransform_ReturnValue) == 0x000360, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_MakeStruct_STRUCT_AsyncParticleParams) == 0x000390, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_MakeStruct_STRUCT_AsyncParticleParams' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_MakeStruct_STRUCT_ImpactEffectResults) == 0x000430, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_MakeStruct_STRUCT_ImpactEffectResults' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetGameInstance_ReturnValue) == 0x000448, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_DynamicCast_AsGI_Single_Player) == 0x000450, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, K2Node_DynamicCast_bSuccess) == 0x000458, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00045C, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_Add_VectorVector_ReturnValue) == 0x000468, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetReflectionVector_ReturnValue) == 0x000474, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetReflectionVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_VLerp_ReturnValue) == 0x000480, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_MakeRotFromX_ReturnValue) == 0x00048C, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_ComposeRotators_ReturnValue) == 0x000498, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_IsValid_ReturnValue_2) == 0x0004A4, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetComponentToImpact_ResultComponent) == 0x0004A8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetComponentToImpact_ResultComponent' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_GetComponentToImpact_ResultSkinnedDecalSampler) == 0x0004B0, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_GetComponentToImpact_ResultSkinnedDecalSampler' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent, CallFunc_IsValid_ReturnValue_3) == 0x0004B8, "Member 'ImpactFunctionLibrary_C_CreateImpactEffectsWithEvent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function ImpactFunctionLibrary.ImpactFunctionLibrary_C.CreateSoundDetectionEvent
// 0x0190 (0x0190 - 0x0000)
struct ImpactFunctionLibrary_C_CreateSoundDetectionEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           SourcePawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_EnemySensingComponent_C*          SensingComponent;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ActorInAudibleRange;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FVector2D>         ActorInAudibleRangeMap;                            // 0x0040(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyAware_Result;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x00B8(0x0010)(ReferenceParm)
	class AINTERACT_SentryTurret_HostileBase_C*   K2Node_DynamicCast_AsINTERACT_Sentry_Turret_Hostile_Base; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSentryTurretAware_Result;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ConstParm, ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, struct FVector2D>         CallFunc_GetCullableActorsInAudibleRangeToPoint_ReturnValue; // 0x0138(0x0050)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent) == 0x000008, "Wrong alignment on ImpactFunctionLibrary_C_CreateSoundDetectionEvent");
static_assert(sizeof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent) == 0x000190, "Wrong size on ImpactFunctionLibrary_C_CreateSoundDetectionEvent");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, SourcePawn) == 0x000000, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::SourcePawn' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, Location) == 0x000008, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::Location' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, Radius) == 0x000014, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::Radius' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, __WorldContext) == 0x000018, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, TargetLocation) == 0x000020, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::TargetLocation' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, SensingComponent) == 0x000030, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::SensingComponent' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, ActorInAudibleRange) == 0x000038, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::ActorInAudibleRange' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, ActorInAudibleRangeMap) == 0x000040, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::ActorInAudibleRangeMap' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, GameInstance) == 0x000090, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::GameInstance' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_AsPAWN_Enemy) == 0x0000A0, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_IsEnemyAware_Result) == 0x0000B4, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_IsEnemyAware_Result' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_BooleanAND_ReturnValue) == 0x0000B5, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Map_Keys_Keys) == 0x0000B8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_AsINTERACT_Sentry_Turret_Hostile_Base) == 0x0000C8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_AsINTERACT_Sentry_Turret_Hostile_Base' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_IsSentryTurretAware_Result) == 0x0000E0, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_IsSentryTurretAware_Result' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_IsAlive_Result) == 0x0000E1, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E2, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Map_Find_Value) == 0x0000EC, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Map_Find_ReturnValue) == 0x0000F4, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_BreakVector2D_X) == 0x000104, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_BreakVector2D_Y) == 0x000108, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_MakeArray_Array) == 0x000110, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_GetGameInstance_ReturnValue) == 0x000120, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_AsGI_Single_Player) == 0x000128, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_GetCullableActorsInAudibleRangeToPoint_ReturnValue) == 0x000138, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_GetCullableActorsInAudibleRangeToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpactFunctionLibrary_C_CreateSoundDetectionEvent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000188, "Member 'ImpactFunctionLibrary_C_CreateSoundDetectionEvent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function ImpactFunctionLibrary.ImpactFunctionLibrary_C.CreateVisualDetectionEvent
// 0x0108 (0x0108 - 0x0000)
struct ImpactFunctionLibrary_C_CreateVisualDetectionEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           SourcePawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceVoxelVisibilityBetweenPoints_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyAware_Result;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
