#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_BulkheadDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERACT_BulkheadDoor.INTERACT_BulkheadDoor_C.UpdateDoorEmissiveStrength
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateDoorEmissiveStrength_Strength;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength");
static_assert(sizeof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength) == 0x000010, "Wrong size on INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength");
static_assert(offsetof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength, Strength) == 0x000004, "Member 'INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength::Strength' has a wrong offset!");
static_assert(offsetof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength, CallFunc_UpdateDoorEmissiveStrength_Strength) == 0x000008, "Member 'INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength::CallFunc_UpdateDoorEmissiveStrength_Strength' has a wrong offset!");
static_assert(offsetof(INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_BulkheadDoor_C_UpdateDoorEmissiveStrength::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

