#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Cryobed_PlayerStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Cryobed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_Cryobed_PlayerStart.INTERACT_Cryobed_PlayerStart_C
// 0x0070 (0x03F8 - 0x0388)
class AINTERACT_Cryobed_PlayerStart_C final : public AINTERACT_Cryobed_C
{
public:
	class USceneComponent*                        HackerMaintainNode;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CryobedQuest;                                      // 0x0390(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TSoftObjectPtr<class UAnimSequenceBase>       IdleOverrideAnimSequence;                          // 0x03A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            HackerWakeMontage;                                 // 0x03C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UMOVECONTROL_Cryobed_C*                 CryobedMoveControl;                                // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginCryobedWakeupSequence();
	void EVENT_OnGameStartedFromCryobed();
	void EVENT_StartPlayerWakeUp();
	void EVENT_WakeUpActionEnd();
	void EVENT_RemoveIdleOverride();
	void InitializeCryobed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_Cryobed_PlayerStart_C">();
	}
	static class AINTERACT_Cryobed_PlayerStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_Cryobed_PlayerStart_C>();
	}
};
static_assert(alignof(AINTERACT_Cryobed_PlayerStart_C) == 0x000008, "Wrong alignment on AINTERACT_Cryobed_PlayerStart_C");
static_assert(sizeof(AINTERACT_Cryobed_PlayerStart_C) == 0x0003F8, "Wrong size on AINTERACT_Cryobed_PlayerStart_C");
static_assert(offsetof(AINTERACT_Cryobed_PlayerStart_C, HackerMaintainNode) == 0x000388, "Member 'AINTERACT_Cryobed_PlayerStart_C::HackerMaintainNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_PlayerStart_C, CryobedQuest) == 0x000390, "Member 'AINTERACT_Cryobed_PlayerStart_C::CryobedQuest' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_PlayerStart_C, IdleOverrideAnimSequence) == 0x0003A0, "Member 'AINTERACT_Cryobed_PlayerStart_C::IdleOverrideAnimSequence' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_PlayerStart_C, HackerWakeMontage) == 0x0003C8, "Member 'AINTERACT_Cryobed_PlayerStart_C::HackerWakeMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_PlayerStart_C, CryobedMoveControl) == 0x0003F0, "Member 'AINTERACT_Cryobed_PlayerStart_C::CryobedMoveControl' has a wrong offset!");

}

