#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Screen_Broadcast_Base

#include "Basic.hpp"

#include "STRUCT_KeycodeSettings_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_MissionDifficultySettings_structs.hpp"
#include "STRUCT_BroadcastData_structs.hpp"
#include "STRUCT_NarrativeSpeakers_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.ExecuteUbergraph_INTERACT_Screen_Broadcast_Base
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFinishedContent_Result;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayCurrentContent_Result;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_PortraitTexture;                // 0x0010(0x0028)(HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RowCount;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ColCount;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_FrameRate;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bAudibleState;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleToFrustum;      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base) == 0x0000A8, "Wrong size on INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, EntryPoint) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_HasFinishedContent_Result) == 0x000004, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_HasFinishedContent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_TryPlayCurrentContent_Result) == 0x000006, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_TryPlayCurrentContent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_NotEqual_NameName_ReturnValue) == 0x000007, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_GetRenderTarget_ReturnValue) == 0x000008, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_GetRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_PortraitTexture) == 0x000010, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_PortraitTexture' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_RowCount) == 0x000038, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_RowCount' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_ColCount) == 0x00003C, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_ColCount' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_FrameRate) == 0x000040, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_FrameRate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_Delay) == 0x000044, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_DynamicCast_AsTexture_2D) == 0x000058, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_IsValid_ReturnValue_1) == 0x000074, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, Temp_object_Variable) == 0x000088, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x000090, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_DynamicCast_AsTexture_2D_1) == 0x000098, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_ComponentBoundEvent_bAudibleState) == 0x0000A1, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_ComponentBoundEvent_bAudibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, K2Node_ComponentBoundEvent_bVisibleToFrustum) == 0x0000A2, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::K2Node_ComponentBoundEvent_bVisibleToFrustum' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base, CallFunc_IsValid_ReturnValue_2) == 0x0000A3, "Member 'INTERACT_Screen_Broadcast_Base_C_ExecuteUbergraph_INTERACT_Screen_Broadcast_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature final
{
public:
	bool                                          bVisibleToFrustum;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature, bVisibleToFrustum) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_4_ObserverFrustumStateSignature__DelegateSignature::bVisibleToFrustum' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature final
{
public:
	bool                                          bAudibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature, bAudibleState) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_3_CullableAudibilitySignature__DelegateSignature::bAudibleState' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_BndEvt__INTERACT_Screen_Broadcast_Base_COMP_VoxelObserver_K2Node_ComponentBoundEvent_2_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.AsyncLoadPublicAddressPortrait
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait final
{
public:
	TSoftObjectPtr<class UTexture2D>              PortraitTexture;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         RowCount;                                          // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColCount;                                          // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FrameRate;                                         // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait) == 0x000038, "Wrong size on INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait, PortraitTexture) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait::PortraitTexture' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait, RowCount) == 0x000028, "Member 'INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait::RowCount' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait, ColCount) == 0x00002C, "Member 'INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait::ColCount' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait, FrameRate) == 0x000030, "Member 'INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait::FrameRate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait, Delay) == 0x000034, "Member 'INTERACT_Screen_Broadcast_Base_C_AsyncLoadPublicAddressPortrait::Delay' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_ReceiveTick");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_Screen_Broadcast_Base_C_ReceiveTick");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507) == 0x000008, "Wrong size on INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507, Loaded) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_OnLoaded_90F5C4264F7326CC7BFFE9AEC0BB8507::Loaded' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_UserConstructionScript");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript) == 0x000018, "Wrong size on INTERACT_Screen_Broadcast_Base_C_UserConstructionScript");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript, CallFunc_GetNumMaterials_ReturnValue) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_UserConstructionScript::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'INTERACT_Screen_Broadcast_Base_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Screen_Broadcast_Base_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'INTERACT_Screen_Broadcast_Base_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'INTERACT_Screen_Broadcast_Base_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.InitializeScreenState
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_InitializeScreenState final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetOrCreateRenderTarget_RenderTarget;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_InitializeScreenState");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState) == 0x000028, "Wrong size on INTERACT_Screen_Broadcast_Base_C_InitializeScreenState");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeScreenState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState, CallFunc_IsAlive_Result) == 0x000010, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeScreenState::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState, CallFunc_GetOrCreateRenderTarget_RenderTarget) == 0x000018, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeScreenState::CallFunc_GetOrCreateRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeScreenState, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeScreenState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.InitializeAttributes
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_InitializeAttributes final
{
public:
	TDelegate<void(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_InitializeAttributes");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes) == 0x000028, "Wrong size on INTERACT_Screen_Broadcast_Base_C_InitializeAttributes");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeAttributes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000014, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'INTERACT_Screen_Broadcast_Base_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.SetStaticParameter
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_SetStaticParameter final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCurrent;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SetTarget;                                         // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_SetStaticParameter) == 0x000004, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_SetStaticParameter");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_SetStaticParameter) == 0x000008, "Wrong size on INTERACT_Screen_Broadcast_Base_C_SetStaticParameter");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetStaticParameter, Value) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_SetStaticParameter::Value' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetStaticParameter, SetCurrent) == 0x000004, "Member 'INTERACT_Screen_Broadcast_Base_C_SetStaticParameter::SetCurrent' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetStaticParameter, SetTarget) == 0x000005, "Member 'INTERACT_Screen_Broadcast_Base_C_SetStaticParameter::SetTarget' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.SetActiveParameter
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_SetActiveParameter final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetCurrent;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SetTarget;                                         // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_SetActiveParameter) == 0x000004, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_SetActiveParameter");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_SetActiveParameter) == 0x000008, "Wrong size on INTERACT_Screen_Broadcast_Base_C_SetActiveParameter");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetActiveParameter, Value) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_SetActiveParameter::Value' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetActiveParameter, SetCurrent) == 0x000004, "Member 'INTERACT_Screen_Broadcast_Base_C_SetActiveParameter::SetCurrent' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetActiveParameter, SetTarget) == 0x000005, "Member 'INTERACT_Screen_Broadcast_Base_C_SetActiveParameter::SetTarget' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.SetScreenActive
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_SetScreenActive final
{
public:
	bool                                          ScreenActive;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFinishedContent_Result;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive) == 0x000001, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_SetScreenActive");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive) == 0x000004, "Wrong size on INTERACT_Screen_Broadcast_Base_C_SetScreenActive");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive, ScreenActive) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_SetScreenActive::ScreenActive' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive, CallFunc_HasFinishedContent_Result) == 0x000001, "Member 'INTERACT_Screen_Broadcast_Base_C_SetScreenActive::CallFunc_HasFinishedContent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive, CallFunc_NotEqual_NameName_ReturnValue) == 0x000002, "Member 'INTERACT_Screen_Broadcast_Base_C_SetScreenActive::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_SetScreenActive, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'INTERACT_Screen_Broadcast_Base_C_SetScreenActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.TryInteract
// 0x00E0 (0x00E0 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0058(0x0020)(HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0088(0x0020)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               K2Node_Select_Default;                             // 0x00B0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayCurrentContent_Result;             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_TryInteract");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_TryInteract) == 0x0000E0, "Wrong size on INTERACT_Screen_Broadcast_Base_C_TryInteract");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_NotEqual_NameName_ReturnValue) == 0x000048, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000058, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x000078, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000088, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, Temp_bool_Variable) == 0x0000A8, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, K2Node_Select_Default) == 0x0000B0, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x0000D8, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_TryPlayCurrentContent_Result) == 0x0000D9, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_TryPlayCurrentContent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DA, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_IsValid_ReturnValue) == 0x0000DB, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000DC, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000DD, "Member 'INTERACT_Screen_Broadcast_Base_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.PlayBroadcast
// 0x00C0 (0x00C0 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_PlayBroadcast final
{
public:
	TSoftClassPtr<class UClass>                   ContentClass;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         TargetKeycodeValue;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Keycode_C*                   KeycodeContent;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MissionDifficultySettings      CallFunc_GetMissionDifficultySettings_Settings;    // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUniqueRandomKeycode_Keycode;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_KeycodeSettings                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBROADCAST_Keycode_C*                   K2Node_DynamicCast_AsBROADCAST_Keycode;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDrawSize_ReturnValue;                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float TargetValue, bool Instant)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_BroadcastScreen_C*              CallFunc_GetBroadcastScreenWidget_Screen;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      CallFunc_CreateBroadcast_Result;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_PlayBroadcast");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast) == 0x0000C0, "Wrong size on INTERACT_Screen_Broadcast_Base_C_PlayBroadcast");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, ContentClass) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::ContentClass' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, TargetKeycodeValue) == 0x000028, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::TargetKeycodeValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, GameInstance) == 0x000030, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, KeycodeContent) == 0x000038, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::KeycodeContent' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_NotEqual_NameName_ReturnValue) == 0x000040, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetMissionDifficultySettings_Settings) == 0x000044, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetMissionDifficultySettings_Settings' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_DynamicCast_AsGI_Single_Player) == 0x000058, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetUniqueRandomKeycode_Keycode) == 0x000064, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetUniqueRandomKeycode_Keycode' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_DynamicCast_AsBROADCAST_Keycode) == 0x000078, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_DynamicCast_AsBROADCAST_Keycode' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetDrawSize_ReturnValue) == 0x000084, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetDrawSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_GetBroadcastScreenWidget_Screen) == 0x0000B0, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_GetBroadcastScreenWidget_Screen' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_PlayBroadcast, CallFunc_CreateBroadcast_Result) == 0x0000B8, "Member 'INTERACT_Screen_Broadcast_Base_C_PlayBroadcast::CallFunc_CreateBroadcast_Result' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.StopBroadcast
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_StopBroadcast final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_BroadcastScreen_C*              CallFunc_GetBroadcastScreenWidget_Screen;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Screen_Broadcast_Base_C_StopBroadcast) == 0x000008, "Wrong alignment on INTERACT_Screen_Broadcast_Base_C_StopBroadcast");
static_assert(sizeof(INTERACT_Screen_Broadcast_Base_C_StopBroadcast) == 0x000010, "Wrong size on INTERACT_Screen_Broadcast_Base_C_StopBroadcast");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_StopBroadcast, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'INTERACT_Screen_Broadcast_Base_C_StopBroadcast::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Screen_Broadcast_Base_C_StopBroadcast, CallFunc_GetBroadcastScreenWidget_Screen) == 0x000008, "Member 'INTERACT_Screen_Broadcast_Base_C_StopBroadcast::CallFunc_GetBroadcastScreenWidget_Screen' has a wrong offset!");

// Function INTERACT_Screen_Broadcast_Base.INTERACT_Screen_Broadcast_Base_C.TryCreateBroadcastComponent
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Screen_Broadcast_Base_C_TryCreateBroadcastComponent final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_BroadcastScreen_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
