#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_LogisticsLift

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.OnCargoSpawned__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature final
{
public:
	class AINTERACT_LogisticsLift_C*              LogisticsLift;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CargoActor_0;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature");
static_assert(sizeof(INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature) == 0x000010, "Wrong size on INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature");
static_assert(offsetof(INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature, LogisticsLift) == 0x000000, "Member 'INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature::LogisticsLift' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature, CargoActor_0) == 0x000008, "Member 'INTERACT_LogisticsLift_C_OnCargoSpawned__DelegateSignature::CargoActor_0' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.OnCargoDelivered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature final
{
public:
	class AINTERACT_LogisticsLift_C*              LogisticsLift;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CargoActor_0;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature");
static_assert(sizeof(INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature) == 0x000010, "Wrong size on INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature");
static_assert(offsetof(INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature, LogisticsLift) == 0x000000, "Member 'INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature::LogisticsLift' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature, CargoActor_0) == 0x000008, "Member 'INTERACT_LogisticsLift_C_OnCargoDelivered__DelegateSignature::CargoActor_0' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.ExecuteUbergraph_INTERACT_LogisticsLift
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift) == 0x000004, "Wrong alignment on INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift");
static_assert(sizeof(INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift) == 0x000008, "Wrong size on INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift");
static_assert(offsetof(INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift, EntryPoint) == 0x000000, "Member 'INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_LogisticsLift_C_ExecuteUbergraph_INTERACT_LogisticsLift::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_LogisticsLift_C_BndEvt__INTERACT_LogisticsLift_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.InitializeLogisticsLift
// 0x002C (0x002C - 0x0000)
struct INTERACT_LogisticsLift_C_InitializeLogisticsLift final
{
public:
	float                                         CallFunc_GetElapsedTimeInState_Result;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimeInState_Result_1;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimeInState_Result_2;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimeInState_Result_3;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_InitializeLogisticsLift) == 0x000004, "Wrong alignment on INTERACT_LogisticsLift_C_InitializeLogisticsLift");
static_assert(sizeof(INTERACT_LogisticsLift_C_InitializeLogisticsLift) == 0x00002C, "Wrong size on INTERACT_LogisticsLift_C_InitializeLogisticsLift");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_GetElapsedTimeInState_Result) == 0x000000, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_GetElapsedTimeInState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_GetElapsedTimeInState_Result_1) == 0x000004, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_GetElapsedTimeInState_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_GetElapsedTimeInState_Result_2) == 0x000008, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_GetElapsedTimeInState_Result_2' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_GetElapsedTimeInState_Result_3) == 0x00000C, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_GetElapsedTimeInState_Result_3' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, CallFunc_FMax_ReturnValue_1) == 0x000024, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeLogisticsLift, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'INTERACT_LogisticsLift_C_InitializeLogisticsLift::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_LogisticsLift_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_LogisticsLift_C_InitializeAttributes");
static_assert(sizeof(INTERACT_LogisticsLift_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_LogisticsLift_C_InitializeAttributes");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_LogisticsLift_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_LogisticsLift_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.InitializeCompartmentActorStates
// 0x0130 (0x0130 - 0x0000)
struct INTERACT_LogisticsLift_C_InitializeCompartmentActorStates final
{
public:
	class AActor*                                 CompartmentActor;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Base_C*                         K2Node_DynamicCast_AsPICKUP_Base;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADEBRIS_Base_C*                         K2Node_DynamicCast_AsDEBRIS_Base;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates) == 0x000010, "Wrong alignment on INTERACT_LogisticsLift_C_InitializeCompartmentActorStates");
static_assert(sizeof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates) == 0x000130, "Wrong size on INTERACT_LogisticsLift_C_InitializeCompartmentActorStates");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CompartmentActor) == 0x000000, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CompartmentActor' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000008, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, Temp_int_Array_Index_Variable) == 0x000014, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_X) == 0x000024, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Y) == 0x000028, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Z) == 0x00002C, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000038, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_MakeArray_Array) == 0x000070, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_MakeArray_Array_1) == 0x000080, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_ComponentOverlapActors_OutActors) == 0x000090, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_ComponentOverlapActors_ReturnValue) == 0x0000A0, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_ComponentOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Map_Length_ReturnValue) == 0x0000A4, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000BC, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_X_1) == 0x0000C8, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Y_1) == 0x0000CC, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Z_1) == 0x0000D0, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_AsPICKUP_Base) == 0x0000D8, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_AsPICKUP_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_AsDEBRIS_Base) == 0x0000E8, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_AsDEBRIS_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000F4, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_X_2) == 0x000110, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Y_2) == 0x000114, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_BreakVector_Z_2) == 0x000118, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeCompartmentActorStates, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000120, "Member 'INTERACT_LogisticsLift_C_InitializeCompartmentActorStates::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.InitializeTileDescriptor
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_LogisticsLift_C_InitializeTileDescriptor final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescriptionFromStaticMesh_DescriptionText; // 0x0018(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_InitializeTileDescriptor) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_InitializeTileDescriptor");
static_assert(sizeof(INTERACT_LogisticsLift_C_InitializeTileDescriptor) == 0x000038, "Wrong size on INTERACT_LogisticsLift_C_InitializeTileDescriptor");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeTileDescriptor, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'INTERACT_LogisticsLift_C_InitializeTileDescriptor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeTileDescriptor, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'INTERACT_LogisticsLift_C_InitializeTileDescriptor::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeTileDescriptor, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_LogisticsLift_C_InitializeTileDescriptor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeTileDescriptor, CallFunc_GetDescriptionFromStaticMesh_DescriptionText) == 0x000018, "Member 'INTERACT_LogisticsLift_C_InitializeTileDescriptor::CallFunc_GetDescriptionFromStaticMesh_DescriptionText' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_InitializeTileDescriptor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'INTERACT_LogisticsLift_C_InitializeTileDescriptor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.IsLogisticsLiftReady
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_LogisticsLift_C_IsLogisticsLiftReady final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_IsLogisticsLiftReady");
static_assert(sizeof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady) == 0x000030, "Wrong size on INTERACT_LogisticsLift_C_IsLogisticsLiftReady");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, Result) == 0x000000, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, Temp_object_Variable) == 0x000008, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, CallFunc_ComponentOverlapActors_OutActors) == 0x000018, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, CallFunc_ComponentOverlapActors_ReturnValue) == 0x000028, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::CallFunc_ComponentOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftReady, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftReady::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.IsLogisticsLiftFunctional
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional) == 0x000001, "Wrong alignment on INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional");
static_assert(sizeof(INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional) == 0x000001, "Wrong size on INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional");
static_assert(offsetof(INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional, Result) == 0x000000, "Member 'INTERACT_LogisticsLift_C_IsLogisticsLiftFunctional::Result' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.GetLogisticsLiftState
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_LogisticsLift_C_GetLogisticsLiftState final
{
public:
	ENUM_DoorState                                Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_GetLogisticsLiftState) == 0x000001, "Wrong alignment on INTERACT_LogisticsLift_C_GetLogisticsLiftState");
static_assert(sizeof(INTERACT_LogisticsLift_C_GetLogisticsLiftState) == 0x000001, "Wrong size on INTERACT_LogisticsLift_C_GetLogisticsLiftState");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetLogisticsLiftState, Result) == 0x000000, "Member 'INTERACT_LogisticsLift_C_GetLogisticsLiftState::Result' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.GetElapsedTimeInState
// 0x000C (0x000C - 0x0000)
struct INTERACT_LogisticsLift_C_GetElapsedTimeInState final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_GetElapsedTimeInState) == 0x000004, "Wrong alignment on INTERACT_LogisticsLift_C_GetElapsedTimeInState");
static_assert(sizeof(INTERACT_LogisticsLift_C_GetElapsedTimeInState) == 0x00000C, "Wrong size on INTERACT_LogisticsLift_C_GetElapsedTimeInState");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetElapsedTimeInState, Result) == 0x000000, "Member 'INTERACT_LogisticsLift_C_GetElapsedTimeInState::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetElapsedTimeInState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'INTERACT_LogisticsLift_C_GetElapsedTimeInState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetElapsedTimeInState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_LogisticsLift_C_GetElapsedTimeInState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.GetSpawnedEnemyName
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_LogisticsLift_C_GetSpawnedEnemyName final
{
public:
	class UClass*                                 EnemyClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EnemyName;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_RequestNewSpawnedEnemyName_EnemyName;     // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_GetSpawnedEnemyName");
static_assert(sizeof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName) == 0x000030, "Wrong size on INTERACT_LogisticsLift_C_GetSpawnedEnemyName");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, EnemyClass) == 0x000000, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::EnemyClass' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, EnemyName) == 0x000008, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::EnemyName' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, K2Node_DynamicCast_AsGI_Single_Player) == 0x000018, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_GetSpawnedEnemyName, CallFunc_RequestNewSpawnedEnemyName_EnemyName) == 0x000024, "Member 'INTERACT_LogisticsLift_C_GetSpawnedEnemyName::CallFunc_RequestNewSpawnedEnemyName_EnemyName' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.EnableMeshComponentTicks
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_LogisticsLift_C_EnableMeshComponentTicks final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_LogisticsLift_C_EnableMeshComponentTicks) == 0x000008, "Wrong alignment on INTERACT_LogisticsLift_C_EnableMeshComponentTicks");
static_assert(sizeof(INTERACT_LogisticsLift_C_EnableMeshComponentTicks) == 0x000010, "Wrong size on INTERACT_LogisticsLift_C_EnableMeshComponentTicks");
static_assert(offsetof(INTERACT_LogisticsLift_C_EnableMeshComponentTicks, State) == 0x000000, "Member 'INTERACT_LogisticsLift_C_EnableMeshComponentTicks::State' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_EnableMeshComponentTicks, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'INTERACT_LogisticsLift_C_EnableMeshComponentTicks::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function INTERACT_LogisticsLift.INTERACT_LogisticsLift_C.TryMakeCompartmentItemsLost
// 0x01B0 (0x01B0 - 0x0000)
struct INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost final
{
public:
	class APAWN_Enemy_C*                          CurrentEnemy;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGenerateLoot_Result;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_2;                          // 0x0118(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors_1;       // 0x0178(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue_1;     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Base_C*                         K2Node_DynamicCast_AsPICKUP_Base;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost) == 0x000010, "Wrong alignment on INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost");
static_assert(sizeof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost) == 0x0001B0, "Wrong size on INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CurrentEnemy) == 0x000000, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CurrentEnemy' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, GameInstance) == 0x000008, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, Temp_int_Array_Index_Variable) == 0x000010, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, Temp_object_Variable) == 0x000018, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_GetActorBounds_Origin) == 0x000034, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_GetActorBounds_BoxExtent) == 0x000040, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_X) == 0x00004C, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_Y) == 0x000050, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_Z) == 0x000054, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_GetInventoryComponent_Inventory) == 0x000058, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_TryGenerateLoot_Result) == 0x000060, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_TryGenerateLoot_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_X_1) == 0x000070, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_Y_1) == 0x000074, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_BreakVector_Z_1) == 0x000078, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000080, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, Temp_int_Loop_Counter_Variable_1) == 0x0000B4, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B8, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, K2Node_MakeArray_Array) == 0x0000C0, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost, CallFunc_ComponentOverlapActors_OutActors) == 0x0000D0, "Member 'INTERACT_LogisticsLift_C_TryMakeCompartmentItemsLost::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
