#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_RespawnChamber

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.ExecuteUbergraph_INTERACT_RespawnChamber
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber) == 0x000004, "Wrong alignment on INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber");
static_assert(sizeof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber) == 0x000010, "Wrong size on INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber");
static_assert(offsetof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber, EntryPoint) == 0x000000, "Member 'INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_RespawnChamber_C_ExecuteUbergraph_INTERACT_RespawnChamber::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_RespawnChamber_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_RespawnChamber_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RespawnChamber_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_RespawnChamber_C_ReceiveTick");
static_assert(sizeof(INTERACT_RespawnChamber_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_RespawnChamber_C_ReceiveTick");
static_assert(offsetof(INTERACT_RespawnChamber_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_RespawnChamber_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.InitializeRespawnChamber
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_RespawnChamber_C_InitializeRespawnChamber final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentLevelName_Result;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_RespawnChamber_Window_C*        K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRespawnChamberActiveForLevel_Result;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RespawnChamber_C_InitializeRespawnChamber) == 0x000008, "Wrong alignment on INTERACT_RespawnChamber_C_InitializeRespawnChamber");
static_assert(sizeof(INTERACT_RespawnChamber_C_InitializeRespawnChamber) == 0x000050, "Wrong size on INTERACT_RespawnChamber_C_InitializeRespawnChamber");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_GetCurrentLevelName_Result) == 0x000028, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_GetCurrentLevelName_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window) == 0x000030, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_IsRespawnChamberActiveForLevel_Result) == 0x000039, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_IsRespawnChamberActiveForLevel_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_InitializeRespawnChamber, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000048, "Member 'INTERACT_RespawnChamber_C_InitializeRespawnChamber::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.OnHackerRespawned
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_RespawnChamber_C_OnHackerRespawned final
{
public:
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RespawnHealthPercent;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHealth;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkSpeed;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousEnergy;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RespawnChamber_C_OnHackerRespawned) == 0x000008, "Wrong alignment on INTERACT_RespawnChamber_C_OnHackerRespawned");
static_assert(sizeof(INTERACT_RespawnChamber_C_OnHackerRespawned) == 0x000018, "Wrong size on INTERACT_RespawnChamber_C_OnHackerRespawned");
static_assert(offsetof(INTERACT_RespawnChamber_C_OnHackerRespawned, HackerPawn) == 0x000000, "Member 'INTERACT_RespawnChamber_C_OnHackerRespawned::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_OnHackerRespawned, RespawnHealthPercent) == 0x000008, "Member 'INTERACT_RespawnChamber_C_OnHackerRespawned::RespawnHealthPercent' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_OnHackerRespawned, MaxHealth) == 0x00000C, "Member 'INTERACT_RespawnChamber_C_OnHackerRespawned::MaxHealth' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_OnHackerRespawned, WalkSpeed) == 0x000010, "Member 'INTERACT_RespawnChamber_C_OnHackerRespawned::WalkSpeed' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_OnHackerRespawned, PreviousEnergy) == 0x000014, "Member 'INTERACT_RespawnChamber_C_OnHackerRespawned::PreviousEnergy' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.UpdateConversion
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_RespawnChamber_C_UpdateConversion final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RespawnChamber_C_UpdateConversion) == 0x000004, "Wrong alignment on INTERACT_RespawnChamber_C_UpdateConversion");
static_assert(sizeof(INTERACT_RespawnChamber_C_UpdateConversion) == 0x000018, "Wrong size on INTERACT_RespawnChamber_C_UpdateConversion");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, Progress) == 0x000000, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::Progress' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateConversion, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'INTERACT_RespawnChamber_C_UpdateConversion::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.PlayWindowMontage
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_RespawnChamber_C_PlayWindowMontage final
{
public:
	bool                                          ShouldOpen;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimBP_RespawnChamber_Window_C*        AnimInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0028(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimBP_RespawnChamber_Window_C*        K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_PlayWindowMontage) == 0x000008, "Wrong alignment on INTERACT_RespawnChamber_C_PlayWindowMontage");
static_assert(sizeof(INTERACT_RespawnChamber_C_PlayWindowMontage) == 0x000088, "Wrong size on INTERACT_RespawnChamber_C_PlayWindowMontage");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, ShouldOpen) == 0x000000, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::ShouldOpen' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, AnimInstance) == 0x000008, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::AnimInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, Temp_bool_Variable) == 0x000010, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_Select_Default) == 0x000028, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000050, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_DynamicCast_AsAnim_Montage) == 0x000058, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, CallFunc_Montage_Play_ReturnValue) == 0x000064, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window) == 0x000078, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_DynamicCast_AsAnim_BP_Respawn_Chamber_Window' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayWindowMontage, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'INTERACT_RespawnChamber_C_PlayWindowMontage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.UpdateFlicker
// 0x00A0 (0x00A0 - 0x0000)
struct INTERACT_RespawnChamber_C_UpdateFlicker final
{
public:
	bool                                          Update_G;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Update_R;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConversionProgress;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_4;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_UpdateFlicker) == 0x000004, "Wrong alignment on INTERACT_RespawnChamber_C_UpdateFlicker");
static_assert(sizeof(INTERACT_RespawnChamber_C_UpdateFlicker) == 0x0000A0, "Wrong size on INTERACT_RespawnChamber_C_UpdateFlicker");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Update_G) == 0x000000, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Update_G' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Update_R) == 0x000001, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Update_R' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, ConversionProgress) == 0x000004, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::ConversionProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Index_0) == 0x000008, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Index_0' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000020, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000024, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000028, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00002C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomBool_ReturnValue) == 0x000030, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Temp_bool_Variable) == 0x000031, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000034, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000038, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Temp_bool_Variable_1) == 0x00003C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003D, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, K2Node_Select_Default) == 0x000040, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000044, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Temp_float_Variable) == 0x00004C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Temp_float_Variable_1) == 0x000050, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x000058, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000064, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x00006C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000070, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000074, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000078, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x00007C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomBool_ReturnValue_1) == 0x000080, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, Temp_bool_Variable_2) == 0x000081, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, K2Node_Select_Default_1) == 0x000084, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000088, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, K2Node_Select_Default_2) == 0x00008C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x000090, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000094, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GetGameTimeInSeconds_ReturnValue_4) == 0x000098, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GetGameTimeInSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateFlicker, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x00009C, "Member 'INTERACT_RespawnChamber_C_UpdateFlicker::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.UpdateMaterials
// 0x002C (0x002C - 0x0000)
struct INTERACT_RespawnChamber_C_UpdateMaterials final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RespawnChamber_C_UpdateMaterials) == 0x000004, "Wrong alignment on INTERACT_RespawnChamber_C_UpdateMaterials");
static_assert(sizeof(INTERACT_RespawnChamber_C_UpdateMaterials) == 0x00002C, "Wrong size on INTERACT_RespawnChamber_C_UpdateMaterials");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, Progress) == 0x000000, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::Progress' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, Temp_bool_Variable) == 0x000004, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, Temp_bool_Variable_1) == 0x000005, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, Temp_bool_Variable_2) == 0x000006, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue_1) == 0x00000C, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue_2) == 0x000010, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue_3) == 0x000014, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue_4) == 0x000018, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, CallFunc_Lerp_ReturnValue_5) == 0x00001C, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, K2Node_Select_Default) == 0x000020, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, K2Node_Select_Default_1) == 0x000024, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateMaterials, K2Node_Select_Default_2) == 0x000028, "Member 'INTERACT_RespawnChamber_C_UpdateMaterials::K2Node_Select_Default_2' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.PlayRespawnChamberSFX
// 0x00B8 (0x00B8 - 0x0000)
struct INTERACT_RespawnChamber_C_PlayRespawnChamberSFX final
{
public:
	struct FDataTableRowHandle                    MediaHandle;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0030(0x0030)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayPublicAddressMessage_Result;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x00A8(0x0010)(NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX) == 0x000008, "Wrong alignment on INTERACT_RespawnChamber_C_PlayRespawnChamberSFX");
static_assert(sizeof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX) == 0x0000B8, "Wrong size on INTERACT_RespawnChamber_C_PlayRespawnChamberSFX");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, MediaHandle) == 0x000000, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::MediaHandle' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_MakeArray_Array) == 0x000010, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_MakeArray_Array_1) == 0x000020, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000030, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_DynamicCast_AsGI_Single_Player) == 0x000078, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, CallFunc_TryPlayPublicAddressMessage_Result) == 0x000081, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::CallFunc_TryPlayPublicAddressMessage_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, CallFunc_GetGameInstance_ReturnValue_1) == 0x000088, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, Temp_bool_Variable) == 0x000090, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x000098, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_PlayRespawnChamberSFX, K2Node_Select_Default) == 0x0000A8, "Member 'INTERACT_RespawnChamber_C_PlayRespawnChamberSFX::K2Node_Select_Default' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.TryCompleteRespawnGameEvent
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent) == 0x000008, "Wrong alignment on INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent");
static_assert(sizeof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent) == 0x000020, "Wrong size on INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent");
static_assert(offsetof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent, GameInstance) == 0x000000, "Member 'INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_RespawnChamber_C_TryCompleteRespawnGameEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.IsRespawnChamberActivated
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_RespawnChamber_C_IsRespawnChamberActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_IsRespawnChamberActivated) == 0x000001, "Wrong alignment on INTERACT_RespawnChamber_C_IsRespawnChamberActivated");
static_assert(sizeof(INTERACT_RespawnChamber_C_IsRespawnChamberActivated) == 0x000001, "Wrong size on INTERACT_RespawnChamber_C_IsRespawnChamberActivated");
static_assert(offsetof(INTERACT_RespawnChamber_C_IsRespawnChamberActivated, Result) == 0x000000, "Member 'INTERACT_RespawnChamber_C_IsRespawnChamberActivated::Result' has a wrong offset!");

// Function INTERACT_RespawnChamber.INTERACT_RespawnChamber_C.UpdateVisibility
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_RespawnChamber_C_UpdateVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RespawnChamber_C_UpdateVisibility) == 0x000001, "Wrong alignment on INTERACT_RespawnChamber_C_UpdateVisibility");
static_assert(sizeof(INTERACT_RespawnChamber_C_UpdateVisibility) == 0x000004, "Wrong size on INTERACT_RespawnChamber_C_UpdateVisibility");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateVisibility, VisibilityState) == 0x000000, "Member 'INTERACT_RespawnChamber_C_UpdateVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateVisibility, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000001, "Member 'INTERACT_RespawnChamber_C_UpdateVisibility::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'INTERACT_RespawnChamber_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RespawnChamber_C_UpdateVisibility, CallFunc_Less_FloatFloat_ReturnValue) == 0x000003, "Member 'INTERACT_RespawnChamber_C_UpdateVisibility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

