#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SalvageStation

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.ExecuteUbergraph_INTERACT_SalvageStation
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        K2Node_ComponentBoundEvent_Bag;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SlotIndex;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation");
static_assert(sizeof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation) == 0x000018, "Wrong size on INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation");
static_assert(offsetof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation, EntryPoint) == 0x000000, "Member 'INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation, K2Node_ComponentBoundEvent_Bag) == 0x000008, "Member 'INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation::K2Node_ComponentBoundEvent_Bag' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation, K2Node_ComponentBoundEvent_SlotIndex) == 0x000010, "Member 'INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation::K2Node_ComponentBoundEvent_SlotIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'INTERACT_SalvageStation_C_ExecuteUbergraph_INTERACT_SalvageStation::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SalvageStation_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SalvageStation_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_SalvageStation_C_ReceiveTick");
static_assert(sizeof(INTERACT_SalvageStation_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_SalvageStation_C_ReceiveTick");
static_assert(offsetof(INTERACT_SalvageStation_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_SalvageStation_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature final
{
public:
	class UInventoryBag_C*                        Bag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature");
static_assert(sizeof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature) == 0x000010, "Wrong size on INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature");
static_assert(offsetof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature, Bag) == 0x000000, "Member 'INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature, SlotIndex) == 0x000008, "Member 'INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature::SlotIndex' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_SalvageStation_C_BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.GetTargetShape
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_SalvageStation_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProcessingScrap_Result;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDispensingCoins_Result;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLootableOpened_Result;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInventoryEmpty_Result;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_GetTargetShape");
static_assert(sizeof(INTERACT_SalvageStation_C_GetTargetShape) == 0x000020, "Wrong size on INTERACT_SalvageStation_C_GetTargetShape");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_SalvageStation_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_IsProcessingScrap_Result) == 0x000010, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_IsProcessingScrap_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_IsDispensingCoins_Result) == 0x000011, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_IsDispensingCoins_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_IsLootableOpened_Result) == 0x000014, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_IsLootableOpened_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_IsInventoryEmpty_Result) == 0x000015, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_IsInventoryEmpty_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_Not_PreBool_ReturnValue_2) == 0x000016, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_Not_PreBool_ReturnValue_3) == 0x000017, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000019, "Member 'INTERACT_SalvageStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.TryInteract
// 0x0190 (0x0190 - 0x0000)
struct INTERACT_SalvageStation_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0040(0x0020)(HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0070(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x0090(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00B0(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x00D0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsRecyclerFunctional_Result;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartProcessingScrap_Result;           // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x00F8(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_6;        // 0x0118(0x0020)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetRecycleCoinValue_Value;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_7;        // 0x0140(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0168(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_TryInteract");
static_assert(sizeof(INTERACT_SalvageStation_C_TryInteract) == 0x000190, "Wrong size on INTERACT_SalvageStation_C_TryInteract");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_SalvageStation_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_SalvageStation_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_SalvageStation_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_SalvageStation_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, Character) == 0x000038, "Member 'INTERACT_SalvageStation_C_TryInteract::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000040, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000060, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000070, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x000090, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000B0, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x0000D0, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_IsRecyclerFunctional_Result) == 0x0000F0, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_IsRecyclerFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F1, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_TryStartProcessingScrap_Result) == 0x0000F2, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_TryStartProcessingScrap_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x0000F8, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_6) == 0x000118, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_6' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_GetRecycleCoinValue_Value) == 0x000138, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_GetRecycleCoinValue_Value' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_Greater_ByteByte_ReturnValue) == 0x000139, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_7) == 0x000140, "Member 'INTERACT_SalvageStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_7' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000160, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000168, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000188, "Member 'INTERACT_SalvageStation_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.IsProcessingScrap
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_SalvageStation_C_IsProcessingScrap final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_IsProcessingScrap) == 0x000001, "Wrong alignment on INTERACT_SalvageStation_C_IsProcessingScrap");
static_assert(sizeof(INTERACT_SalvageStation_C_IsProcessingScrap) == 0x000002, "Wrong size on INTERACT_SalvageStation_C_IsProcessingScrap");
static_assert(offsetof(INTERACT_SalvageStation_C_IsProcessingScrap, Result) == 0x000000, "Member 'INTERACT_SalvageStation_C_IsProcessingScrap::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_IsProcessingScrap, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'INTERACT_SalvageStation_C_IsProcessingScrap::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.InitializeRecycleStation
// 0x0005 (0x0005 - 0x0000)
struct INTERACT_SalvageStation_C_InitializeRecycleStation final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartCoinDispenseTimer_Result;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDispensingCoins_Result;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartRecycleProcessTimer_Result;       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProcessingScrap_Result;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_InitializeRecycleStation) == 0x000001, "Wrong alignment on INTERACT_SalvageStation_C_InitializeRecycleStation");
static_assert(sizeof(INTERACT_SalvageStation_C_InitializeRecycleStation) == 0x000005, "Wrong size on INTERACT_SalvageStation_C_InitializeRecycleStation");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeRecycleStation, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'INTERACT_SalvageStation_C_InitializeRecycleStation::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeRecycleStation, CallFunc_TryStartCoinDispenseTimer_Result) == 0x000001, "Member 'INTERACT_SalvageStation_C_InitializeRecycleStation::CallFunc_TryStartCoinDispenseTimer_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeRecycleStation, CallFunc_IsDispensingCoins_Result) == 0x000002, "Member 'INTERACT_SalvageStation_C_InitializeRecycleStation::CallFunc_IsDispensingCoins_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeRecycleStation, CallFunc_TryStartRecycleProcessTimer_Result) == 0x000003, "Member 'INTERACT_SalvageStation_C_InitializeRecycleStation::CallFunc_TryStartRecycleProcessTimer_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeRecycleStation, CallFunc_IsProcessingScrap_Result) == 0x000004, "Member 'INTERACT_SalvageStation_C_InitializeRecycleStation::CallFunc_IsProcessingScrap_Result' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_SalvageStation_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SalvageStation_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_SalvageStation_C_InitializeAttributes");
static_assert(sizeof(INTERACT_SalvageStation_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_SalvageStation_C_InitializeAttributes");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_SalvageStation_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_SalvageStation_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.ToggleDrumDoor
// 0x00E0 (0x00E0 - 0x0000)
struct INTERACT_SalvageStation_C_ToggleDrumDoor final
{
public:
	float                                         MontageDuration;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MontageStartTime;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMontagePosition;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ActiveMontage;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetLootVisibility_Result;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLootableOpened_Result;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_GetPosition_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLootableOpened_Result_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLootableOpened_Result_2;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0078(0x0028)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UANIMBP_SalvageStation_C*               K2Node_DynamicCast_AsANIMBP_Salvage_Station;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_ToggleDrumDoor) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_ToggleDrumDoor");
static_assert(sizeof(INTERACT_SalvageStation_C_ToggleDrumDoor) == 0x0000E0, "Wrong size on INTERACT_SalvageStation_C_ToggleDrumDoor");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, MontageDuration) == 0x000000, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::MontageDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, MontageStartTime) == 0x000004, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::MontageStartTime' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CurrentMontagePosition) == 0x000008, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CurrentMontagePosition' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, ActiveMontage) == 0x000010, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::ActiveMontage' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_FMax_ReturnValue) == 0x00002C, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_TrySetLootVisibility_Result) == 0x000030, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_TrySetLootVisibility_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_IsLootableOpened_Result) == 0x000040, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_IsLootableOpened_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, Temp_bool_Variable) == 0x000041, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000044, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_Montage_GetPosition_ReturnValue) == 0x000054, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_Montage_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_IsLootableOpened_Result_1) == 0x000058, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_IsLootableOpened_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000060, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000068, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_IsLootableOpened_Result_2) == 0x000070, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_IsLootableOpened_Result_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_Select_Default) == 0x000078, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0000A0, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000A8, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_DynamicCast_AsAnim_Montage) == 0x0000B0, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0000C0, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, CallFunc_Montage_Play_ReturnValue) == 0x0000C8, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_DynamicCast_AsANIMBP_Salvage_Station) == 0x0000D0, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_DynamicCast_AsANIMBP_Salvage_Station' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_ToggleDrumDoor, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'INTERACT_SalvageStation_C_ToggleDrumDoor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.StopChanneling
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_SalvageStation_C_StopChanneling final
{
public:
	class AActor*                                 NewChannelingInteract;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopChanneling_Result;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLootableOpened_Result;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_StopChanneling) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_StopChanneling");
static_assert(sizeof(INTERACT_SalvageStation_C_StopChanneling) == 0x000010, "Wrong size on INTERACT_SalvageStation_C_StopChanneling");
static_assert(offsetof(INTERACT_SalvageStation_C_StopChanneling, NewChannelingInteract) == 0x000000, "Member 'INTERACT_SalvageStation_C_StopChanneling::NewChannelingInteract' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_StopChanneling, Result) == 0x000008, "Member 'INTERACT_SalvageStation_C_StopChanneling::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_StopChanneling, CallFunc_StopChanneling_Result) == 0x000009, "Member 'INTERACT_SalvageStation_C_StopChanneling::CallFunc_StopChanneling_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_StopChanneling, CallFunc_IsLootableOpened_Result) == 0x00000A, "Member 'INTERACT_SalvageStation_C_StopChanneling::CallFunc_IsLootableOpened_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_StopChanneling, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'INTERACT_SalvageStation_C_StopChanneling::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.UpdateEmissiveStrength
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SalvageStation_C_UpdateEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SalvageStation_C_UpdateEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_SalvageStation_C_UpdateEmissiveStrength");
static_assert(sizeof(INTERACT_SalvageStation_C_UpdateEmissiveStrength) == 0x000004, "Wrong size on INTERACT_SalvageStation_C_UpdateEmissiveStrength");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_SalvageStation_C_UpdateEmissiveStrength::Scale' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.UpdateRecycleMaterialStates
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_SalvageStation_C_UpdateRecycleMaterialStates final
{
public:
	uint8                                         CoinValue;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetRecycleCoinValue_Value;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0xD];                                        // 0x0003(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetRecycleCoinValue_Value_1;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInventoryEmpty_Result;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDispensingCoins_Result;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProcessingScrap_Result;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLootableOpened_Result;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates) == 0x000010, "Wrong alignment on INTERACT_SalvageStation_C_UpdateRecycleMaterialStates");
static_assert(sizeof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates) == 0x000060, "Wrong size on INTERACT_SalvageStation_C_UpdateRecycleMaterialStates");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CoinValue) == 0x000000, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CoinValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_GetRecycleCoinValue_Value) == 0x000001, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_GetRecycleCoinValue_Value' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_Greater_ByteByte_ReturnValue) == 0x000002, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_MakeVector4_ReturnValue) == 0x000010, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_GetRecycleCoinValue_Value_1) == 0x000020, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_GetRecycleCoinValue_Value_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_MakeVector4_ReturnValue_1) == 0x000030, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_MakeVector4_ReturnValue_2) == 0x000040, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_IsInventoryEmpty_Result) == 0x000050, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_IsInventoryEmpty_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_IsDispensingCoins_Result) == 0x000051, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_IsDispensingCoins_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_IsProcessingScrap_Result) == 0x000052, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_IsProcessingScrap_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_UpdateRecycleMaterialStates, CallFunc_IsLootableOpened_Result) == 0x000053, "Member 'INTERACT_SalvageStation_C_UpdateRecycleMaterialStates::CallFunc_IsLootableOpened_Result' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.TryCompleteGameEventOnInteract
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract");
static_assert(sizeof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract) == 0x000018, "Wrong size on INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract");
static_assert(offsetof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract, CallFunc_NotEqual_NameName_ReturnValue) == 0x000011, "Member 'INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'INTERACT_SalvageStation_C_TryCompleteGameEventOnInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.TryStartProcessingScrap
// 0x0080 (0x0080 - 0x0000)
struct INTERACT_SalvageStation_C_TryStartProcessingScrap final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0030(0x0030)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartRecycleProcessTimer_Result;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProcessingScrap_Result;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SalvageStation_C_TryStartProcessingScrap) == 0x000008, "Wrong alignment on INTERACT_SalvageStation_C_TryStartProcessingScrap");
static_assert(sizeof(INTERACT_SalvageStation_C_TryStartProcessingScrap) == 0x000080, "Wrong size on INTERACT_SalvageStation_C_TryStartProcessingScrap");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, Character) == 0x000000, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, Result) == 0x000008, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, K2Node_MakeArray_Array) == 0x000010, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, K2Node_MakeArray_Array_1) == 0x000020, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000030, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, K2Node_DynamicCast_AsGI_Single_Player) == 0x000068, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, CallFunc_TryStartRecycleProcessTimer_Result) == 0x000071, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::CallFunc_TryStartRecycleProcessTimer_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000074, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, CallFunc_IsProcessingScrap_Result) == 0x000078, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::CallFunc_IsProcessingScrap_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SalvageStation_C_TryStartProcessingScrap, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'INTERACT_SalvageStation_C_TryStartProcessingScrap::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_SalvageStation.INTERACT_SalvageStation_C.TryStartRecycleProcessTimer
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_SalvageStation_C_TryStartRecycleProcessTimer final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
