#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_BlastDoor

#include "Basic.hpp"

#include "INTERACT_DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_BlastDoor.INTERACT_BlastDoor_C
// 0x0038 (0x0690 - 0x0658)
class AINTERACT_BlastDoor_C final : public AINTERACT_DoorBase_C
{
public:
	class UBoxComponent*                          DoorFrameRight;                                    // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameFloor;                                    // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameLeft;                                     // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameCeiling;                                  // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Back;                                    // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Front;                                   // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorFrameMesh;                                     // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_BlastDoor_C">();
	}
	static class AINTERACT_BlastDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_BlastDoor_C>();
	}
};
static_assert(alignof(AINTERACT_BlastDoor_C) == 0x000008, "Wrong alignment on AINTERACT_BlastDoor_C");
static_assert(sizeof(AINTERACT_BlastDoor_C) == 0x000690, "Wrong size on AINTERACT_BlastDoor_C");
static_assert(offsetof(AINTERACT_BlastDoor_C, DoorFrameRight) == 0x000658, "Member 'AINTERACT_BlastDoor_C::DoorFrameRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, DoorFrameFloor) == 0x000660, "Member 'AINTERACT_BlastDoor_C::DoorFrameFloor' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, DoorFrameLeft) == 0x000668, "Member 'AINTERACT_BlastDoor_C::DoorFrameLeft' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, DoorFrameCeiling) == 0x000670, "Member 'AINTERACT_BlastDoor_C::DoorFrameCeiling' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, TargetBox_Back) == 0x000678, "Member 'AINTERACT_BlastDoor_C::TargetBox_Back' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, TargetBox_Front) == 0x000680, "Member 'AINTERACT_BlastDoor_C::TargetBox_Front' has a wrong offset!");
static_assert(offsetof(AINTERACT_BlastDoor_C, DoorFrameMesh) == 0x000688, "Member 'AINTERACT_BlastDoor_C::DoorFrameMesh' has a wrong offset!");

}

