#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Laptop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "ENUM_HackerGender_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Laptop.INTERACT_Laptop_C.TransitionToCutsceneFOV
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Laptop_C_TransitionToCutsceneFOV final
{
public:
	float                                         NewFOV;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOV_Result;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Laptop_C_TransitionToCutsceneFOV) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_TransitionToCutsceneFOV");
static_assert(sizeof(INTERACT_Laptop_C_TransitionToCutsceneFOV) == 0x000048, "Wrong size on INTERACT_Laptop_C_TransitionToCutsceneFOV");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, NewFOV) == 0x000000, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::NewFOV' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000018, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_GetShockSettingsForCurrentUser_Settings_1) == 0x000038, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_GetShockSettingsForCurrentUser_Settings_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_GetFOV_Result) == 0x000040, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_GetFOV_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TransitionToCutsceneFOV, CallFunc_Ease_ReturnValue) == 0x000044, "Member 'INTERACT_Laptop_C_TransitionToCutsceneFOV::CallFunc_Ease_ReturnValue' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.UpdateSceneMeshEmissives
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Laptop_C_UpdateSceneMeshEmissives final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetActorLevel_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkeletalMeshActor*>             CallFunc_GetAllActorsOfClassInSubLevel_ReturnValue; // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_UpdateSceneMeshEmissives) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_UpdateSceneMeshEmissives");
static_assert(sizeof(INTERACT_Laptop_C_UpdateSceneMeshEmissives) == 0x000050, "Wrong size on INTERACT_Laptop_C_UpdateSceneMeshEmissives");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, SkeletalMeshComponent) == 0x000000, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, Temp_int_Array_Index_Variable) == 0x000008, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000C, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00000D, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00000E, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00000F, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_BooleanOR_ReturnValue_1) == 0x000015, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_BooleanOR_ReturnValue_2) == 0x00001C, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_GetActorLevel_ReturnValue) == 0x000020, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_GetActorLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_GetAllActorsOfClassInSubLevel_ReturnValue) == 0x000028, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_GetAllActorsOfClassInSubLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_Array_Get_Item) == 0x000040, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_UpdateSceneMeshEmissives, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'INTERACT_Laptop_C_UpdateSceneMeshEmissives::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.EVENT_OnLaptopSequenceFinished
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOV_Result;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished");
static_assert(sizeof(INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished) == 0x000010, "Wrong size on INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished, CallFunc_GetFOV_Result) == 0x000008, "Member 'INTERACT_Laptop_C_EVENT_OnLaptopSequenceFinished::CallFunc_GetFOV_Result' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.OnInteractedWithApartmentActor
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Laptop_C_OnInteractedWithApartmentActor final
{
public:
	class AINTERACT_Base_C*                       InteractActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_OnInteractedWithApartmentActor) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_OnInteractedWithApartmentActor");
static_assert(sizeof(INTERACT_Laptop_C_OnInteractedWithApartmentActor) == 0x000038, "Wrong size on INTERACT_Laptop_C_OnInteractedWithApartmentActor");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, InteractActor) == 0x000000, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::InteractActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_RandomFloatInRange_ReturnValue) == 0x00000C, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_Array_Contains_ReturnValue) == 0x000010, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_Not_PreBool_ReturnValue_1) == 0x000024, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_OnInteractedWithApartmentActor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'INTERACT_Laptop_C_OnInteractedWithApartmentActor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.NextScreen
// 0x00C0 (0x00C0 - 0x0000)
struct INTERACT_Laptop_C_NextScreen final
{
public:
	TSoftClassPtr<class UClass>                   NewContent;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDrawSize_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_3;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_4;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_4;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_5;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_5;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_6;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_6;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_BroadcastScreen_C*              K2Node_DynamicCast_AsWIDGET_Broadcast_Screen;      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBROADCAST_Base_C*                      CallFunc_PlayBroadcast_Result;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_NextScreen) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_NextScreen");
static_assert(sizeof(INTERACT_Laptop_C_NextScreen) == 0x0000C0, "Wrong size on INTERACT_Laptop_C_NextScreen");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, NewContent) == 0x000000, "Member 'INTERACT_Laptop_C_NextScreen::NewContent' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetDrawSize_ReturnValue) == 0x000028, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetDrawSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue) == 0x000030, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000038, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_1) == 0x000040, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_2) == 0x000048, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000050, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000051, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_3) == 0x000058, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x000060, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_4) == 0x000068, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_4) == 0x000070, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_5) == 0x000078, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_5) == 0x000080, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000081, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_IsValid_ReturnValue) == 0x000082, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetObjectClass_ReturnValue_6) == 0x000088, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetObjectClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_EqualEqual_ClassClass_ReturnValue_6) == 0x000090, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_EqualEqual_ClassClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000098, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, K2Node_DynamicCast_AsWIDGET_Broadcast_Screen) == 0x0000A0, "Member 'INTERACT_Laptop_C_NextScreen::K2Node_DynamicCast_AsWIDGET_Broadcast_Screen' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'INTERACT_Laptop_C_NextScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_PlayBroadcast_Result) == 0x0000B0, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_PlayBroadcast_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_NextScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'INTERACT_Laptop_C_NextScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.EVENT_LaptopMoveExpired
// 0x00C8 (0x00C8 - 0x0000)
struct INTERACT_Laptop_C_EVENT_LaptopMoveExpired final
{
public:
	class UMOVECONTROL_Base_C*                    MoveControl;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CameraSceneComponent;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       PlayerCamera;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_AddComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_WorldMove_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_EVENT_LaptopMoveExpired");
static_assert(sizeof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired) == 0x0000C8, "Wrong size on INTERACT_Laptop_C_EVENT_LaptopMoveExpired");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, MoveControl) == 0x000000, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::MoveControl' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CameraSceneComponent) == 0x000008, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CameraSceneComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, PlayerCamera) == 0x000010, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::PlayerCamera' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_AddComponentByClass_ReturnValue) == 0x000018, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_RegisterMoveControl_Result) == 0x000038, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_RegisterMoveControl_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000039, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00003C, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_EVENT_LaptopMoveExpired, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x0000C4, "Member 'INTERACT_Laptop_C_EVENT_LaptopMoveExpired::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.GetTargetShape
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Laptop_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Laptop_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_GetTargetShape");
static_assert(sizeof(INTERACT_Laptop_C_GetTargetShape) == 0x000010, "Wrong size on INTERACT_Laptop_C_GetTargetShape");
static_assert(offsetof(INTERACT_Laptop_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_Laptop_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_Laptop_C_GetTargetShape::ShapeComponent' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.StartMountingLaptop
// 0x00C8 (0x00C8 - 0x0000)
struct INTERACT_Laptop_C_StartMountingLaptop final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimpleHUD_C*                    K2Node_DynamicCast_AsWIDGET_Simple_HUD;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0050(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput_1;             // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults_1;            // 0x0088(0x0020)(HasGetValueTypeHash)
	TDelegate<void(class UMOVECONTROL_Base_C* MoveControl)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UMOVECONTROL_Laptop_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_StartMountingLaptop) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_StartMountingLaptop");
static_assert(sizeof(INTERACT_Laptop_C_StartMountingLaptop) == 0x0000C8, "Wrong size on INTERACT_Laptop_C_StartMountingLaptop");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Laptop_C_StartMountingLaptop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'INTERACT_Laptop_C_StartMountingLaptop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_GetSequencePlayer_ReturnValue) == 0x000028, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, K2Node_DynamicCast_AsWIDGET_Simple_HUD) == 0x000030, "Member 'INTERACT_Laptop_C_StartMountingLaptop::K2Node_DynamicCast_AsWIDGET_Simple_HUD' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'INTERACT_Laptop_C_StartMountingLaptop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_TryInteract_self_CastInput) == 0x000040, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_TryInteract_InteractResults) == 0x000050, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_TryInteract_self_CastInput_1) == 0x000078, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_TryInteract_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_TryInteract_InteractResults_1) == 0x000088, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_TryInteract_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'INTERACT_Laptop_C_StartMountingLaptop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_SpawnObject_ReturnValue) == 0x0000B8, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_StartMountingLaptop, CallFunc_RegisterMoveControl_Result) == 0x0000C0, "Member 'INTERACT_Laptop_C_StartMountingLaptop::CallFunc_RegisterMoveControl_Result' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.TryInitializeLaptopScreen
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Laptop_C_TryInitializeLaptopScreen final
{
public:
	class UTextureRenderTarget2D*                 CallFunc_GetRenderTarget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_TryInitializeLaptopScreen) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_TryInitializeLaptopScreen");
static_assert(sizeof(INTERACT_Laptop_C_TryInitializeLaptopScreen) == 0x000018, "Wrong size on INTERACT_Laptop_C_TryInitializeLaptopScreen");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeLaptopScreen, CallFunc_GetRenderTarget_ReturnValue) == 0x000000, "Member 'INTERACT_Laptop_C_TryInitializeLaptopScreen::CallFunc_GetRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeLaptopScreen, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'INTERACT_Laptop_C_TryInitializeLaptopScreen::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeLaptopScreen, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'INTERACT_Laptop_C_TryInitializeLaptopScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeLaptopScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'INTERACT_Laptop_C_TryInitializeLaptopScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.TryInitializeHackerMeshes
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Laptop_C_TryInitializeHackerMeshes final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_HackerGender                             CallFunc_GetHackerGender_Result;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_TryInitializeHackerMeshes) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_TryInitializeHackerMeshes");
static_assert(sizeof(INTERACT_Laptop_C_TryInitializeHackerMeshes) == 0x000020, "Wrong size on INTERACT_Laptop_C_TryInitializeHackerMeshes");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, CallFunc_GetHackerGender_Result) == 0x000019, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::CallFunc_GetHackerGender_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInitializeHackerMeshes, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'INTERACT_Laptop_C_TryInitializeHackerMeshes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.TryInteract
// 0x0168 (0x0168 - 0x0000)
struct INTERACT_Laptop_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0038(0x0020)(HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0068(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x0088(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00A8(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x00C8(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x00E8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouchingOrTransitioning_Result;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AngleBetweenVectors_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Laptop_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_Laptop_C_TryInteract");
static_assert(sizeof(INTERACT_Laptop_C_TryInteract) == 0x000168, "Wrong size on INTERACT_Laptop_C_TryInteract");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_Laptop_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_Laptop_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_Laptop_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_Laptop_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000038, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000058, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000068, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x000088, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000A8, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x0000C8, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x0000E8, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_IsCrouchingOrTransitioning_Result) == 0x000108, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_IsCrouchingOrTransitioning_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_IsFalling_ReturnValue) == 0x000109, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x00010A, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x00010B, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_BooleanAND_ReturnValue) == 0x00010C, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_BooleanAND_ReturnValue_1) == 0x00011C, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_GetActorForwardVector_ReturnValue) == 0x000120, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000138, "Member 'INTERACT_Laptop_C_TryInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000148, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_AngleBetweenVectors_ReturnValue) == 0x000160, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_AngleBetweenVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_Less_FloatFloat_ReturnValue) == 0x000164, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Laptop_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_2) == 0x000165, "Member 'INTERACT_Laptop_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Laptop_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Laptop_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_Laptop_C_ReceiveTick");
static_assert(sizeof(INTERACT_Laptop_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_Laptop_C_ReceiveTick");
static_assert(offsetof(INTERACT_Laptop_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_Laptop_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_Laptop.INTERACT_Laptop_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Laptop_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Laptop_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on INTERACT_Laptop_C_ReceiveEndPlay");
static_assert(sizeof(INTERACT_Laptop_C_ReceiveEndPlay) == 0x000001, "Wrong size on INTERACT_Laptop_C_ReceiveEndPlay");
static_assert(offsetof(INTERACT_Laptop_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'INTERACT_Laptop_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

