#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_RobotRechargeStation

#include "Basic.hpp"

#include "ENUM_RechargeAlertCondition_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "INTERACT_Base_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_RobotRechargeStation.INTERACT_RobotRechargeStation_C
// 0x0250 (0x0558 - 0x0308)
class AINTERACT_RobotRechargeStation_C final : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_RobotRechargeStation_C;    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent1;                                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent0;                                   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent3;                                   // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent2;                                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PadCollisionRight;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PadCollisionLeft;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PadCollisionBot;                                   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PadCollisionTop;                                   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          MainCollision;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RechargeStation;                                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CenterCollision;                                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCollision;                                     // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          RechargingEnemy;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ActivateMontage;                                   // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            DeactivateMontage;                                 // 0x03B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ENUM_RechargeAlertCondition                   AlertCondition;                                    // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenInitialized;                                // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsActivated;                                       // 0x03DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsRechargeStationAudible;                          // 0x03DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribModApplyData                    DisableApplyData;                                  // 0x03E0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UNiagaraSystem>          ActivateCenterFX;                                  // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          ActivateCenterIdleFX;                              // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          ActivateArmFX;                                     // 0x04D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          ActivateArmIdleFX;                                 // 0x04F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   CenterSocketName;                                  // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ArmSocketNames;                                    // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ArmLocationOffsets;                                // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRotator>                       ArmRotationOffsets;                                // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_INTERACT_RobotRechargeStation(int32 EntryPoint);
	void BndEvt__INTERACT_RobotRechargeStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature(bool bAudibleState);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void InitializeRechargeStation();
	void InitializeAttributes();
	void UpdateMeshEmissive(float Value);
	void OnEnemyStartedRecharging();
	void TryDeactivateRechargeStation(bool* Result);
	void EVENT_OnRechargingEnemyDied(class APAWN_SystemShockCharacter_C* Character);
	void AlertNearbyRechargeStations();
	void EVENT_OnRechargingEnemyDamaged(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);
	void UpdateRechargeAnimationState(bool State);
	void UpdateRechargeEffects(bool State);
	void UpdateRechargeStationVisibility(bool VisibilityState);
	void UpdateRechargeStationAudibility(bool AudibilityState);
	void BindRechargingEnemyEvents();
	void UnbindRechargingEnemyEvents();
	void EVENT_OnRechargeEffectSpawned(class UObject* Object);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_RobotRechargeStation_C">();
	}
	static class AINTERACT_RobotRechargeStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_RobotRechargeStation_C>();
	}
};
static_assert(alignof(AINTERACT_RobotRechargeStation_C) == 0x000008, "Wrong alignment on AINTERACT_RobotRechargeStation_C");
static_assert(sizeof(AINTERACT_RobotRechargeStation_C) == 0x000558, "Wrong size on AINTERACT_RobotRechargeStation_C");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, UberGraphFrame_INTERACT_RobotRechargeStation_C) == 0x000308, "Member 'AINTERACT_RobotRechargeStation_C::UberGraphFrame_INTERACT_RobotRechargeStation_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, COMP_AttribManager) == 0x000310, "Member 'AINTERACT_RobotRechargeStation_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, LightComponent1) == 0x000318, "Member 'AINTERACT_RobotRechargeStation_C::LightComponent1' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, LightComponent0) == 0x000320, "Member 'AINTERACT_RobotRechargeStation_C::LightComponent0' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, LightComponent3) == 0x000328, "Member 'AINTERACT_RobotRechargeStation_C::LightComponent3' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, LightComponent2) == 0x000330, "Member 'AINTERACT_RobotRechargeStation_C::LightComponent2' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, PadCollisionRight) == 0x000338, "Member 'AINTERACT_RobotRechargeStation_C::PadCollisionRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, PadCollisionLeft) == 0x000340, "Member 'AINTERACT_RobotRechargeStation_C::PadCollisionLeft' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, PadCollisionBot) == 0x000348, "Member 'AINTERACT_RobotRechargeStation_C::PadCollisionBot' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, PadCollisionTop) == 0x000350, "Member 'AINTERACT_RobotRechargeStation_C::PadCollisionTop' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, MainCollision) == 0x000358, "Member 'AINTERACT_RobotRechargeStation_C::MainCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, COMP_VoxelCullable) == 0x000360, "Member 'AINTERACT_RobotRechargeStation_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, RechargeStation) == 0x000368, "Member 'AINTERACT_RobotRechargeStation_C::RechargeStation' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, CenterCollision) == 0x000370, "Member 'AINTERACT_RobotRechargeStation_C::CenterCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, TileCollision) == 0x000378, "Member 'AINTERACT_RobotRechargeStation_C::TileCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, RechargingEnemy) == 0x000380, "Member 'AINTERACT_RobotRechargeStation_C::RechargingEnemy' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ActivateMontage) == 0x000388, "Member 'AINTERACT_RobotRechargeStation_C::ActivateMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, DeactivateMontage) == 0x0003B0, "Member 'AINTERACT_RobotRechargeStation_C::DeactivateMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, AlertCondition) == 0x0003D8, "Member 'AINTERACT_RobotRechargeStation_C::AlertCondition' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, HasBeenInitialized) == 0x0003D9, "Member 'AINTERACT_RobotRechargeStation_C::HasBeenInitialized' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, IsActivated) == 0x0003DA, "Member 'AINTERACT_RobotRechargeStation_C::IsActivated' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, IsRechargeStationAudible) == 0x0003DB, "Member 'AINTERACT_RobotRechargeStation_C::IsRechargeStationAudible' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, DisableApplyData) == 0x0003E0, "Member 'AINTERACT_RobotRechargeStation_C::DisableApplyData' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ActivateCenterFX) == 0x000480, "Member 'AINTERACT_RobotRechargeStation_C::ActivateCenterFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ActivateCenterIdleFX) == 0x0004A8, "Member 'AINTERACT_RobotRechargeStation_C::ActivateCenterIdleFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ActivateArmFX) == 0x0004D0, "Member 'AINTERACT_RobotRechargeStation_C::ActivateArmFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ActivateArmIdleFX) == 0x0004F8, "Member 'AINTERACT_RobotRechargeStation_C::ActivateArmIdleFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, CenterSocketName) == 0x000520, "Member 'AINTERACT_RobotRechargeStation_C::CenterSocketName' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ArmSocketNames) == 0x000528, "Member 'AINTERACT_RobotRechargeStation_C::ArmSocketNames' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ArmLocationOffsets) == 0x000538, "Member 'AINTERACT_RobotRechargeStation_C::ArmLocationOffsets' has a wrong offset!");
static_assert(offsetof(AINTERACT_RobotRechargeStation_C, ArmRotationOffsets) == 0x000548, "Member 'AINTERACT_RobotRechargeStation_C::ArmRotationOffsets' has a wrong offset!");

}

