#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_CapsuleDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERACT_CapsuleDoor.INTERACT_CapsuleDoor_C.GetTargetShape
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_CapsuleDoor_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CapsuleDoor_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_CapsuleDoor_C_GetTargetShape");
static_assert(sizeof(INTERACT_CapsuleDoor_C_GetTargetShape) == 0x000018, "Wrong size on INTERACT_CapsuleDoor_C_GetTargetShape");
static_assert(offsetof(INTERACT_CapsuleDoor_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_CapsuleDoor_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_CapsuleDoor_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_CapsuleDoor_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_CapsuleDoor_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'INTERACT_CapsuleDoor_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CapsuleDoor_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'INTERACT_CapsuleDoor_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

}

