#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Button

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_ButtonColorType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Button.INTERACT_Button_C.ExecuteUbergraph_INTERACT_Button
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button) == 0x000004, "Wrong alignment on INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button");
static_assert(sizeof(INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button) == 0x000008, "Wrong size on INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button");
static_assert(offsetof(INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button, EntryPoint) == 0x000000, "Member 'INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_Button_C_ExecuteUbergraph_INTERACT_Button::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_Button_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Button_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_ButtonColorType                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ButtonColorType                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonFunctional_Result;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_ButtonColorType                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetButtonColor_ButtonColor;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_UserConstructionScript) == 0x000004, "Wrong alignment on INTERACT_Button_C_UserConstructionScript");
static_assert(sizeof(INTERACT_Button_C_UserConstructionScript) == 0x000018, "Wrong size on INTERACT_Button_C_UserConstructionScript");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'INTERACT_Button_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, Temp_byte_Variable) == 0x000001, "Member 'INTERACT_Button_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000002, "Member 'INTERACT_Button_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, CallFunc_IsButtonFunctional_Result) == 0x000003, "Member 'INTERACT_Button_C_UserConstructionScript::CallFunc_IsButtonFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, K2Node_Select_Default) == 0x000004, "Member 'INTERACT_Button_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UserConstructionScript, CallFunc_GetButtonColor_ButtonColor) == 0x000008, "Member 'INTERACT_Button_C_UserConstructionScript::CallFunc_GetButtonColor_ButtonColor' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.GetTargetShape
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Button_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_Button_C_GetTargetShape");
static_assert(sizeof(INTERACT_Button_C_GetTargetShape) == 0x000018, "Wrong size on INTERACT_Button_C_GetTargetShape");
static_assert(offsetof(INTERACT_Button_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_Button_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_Button_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'INTERACT_Button_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.OnBrokenInteraction
// 0x00A0 (0x00A0 - 0x0000)
struct INTERACT_Button_C_OnBrokenInteraction final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsButtonPoweredOn_Result;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_OnBrokenInteraction) == 0x000010, "Wrong alignment on INTERACT_Button_C_OnBrokenInteraction");
static_assert(sizeof(INTERACT_Button_C_OnBrokenInteraction) == 0x0000A0, "Wrong size on INTERACT_Button_C_OnBrokenInteraction");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, Result) == 0x000000, "Member 'INTERACT_Button_C_OnBrokenInteraction::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_IsButtonPoweredOn_Result) == 0x000019, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_IsButtonPoweredOn_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GetGameInstance_ReturnValue_1) == 0x000028, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GetGameInstance_ReturnValue_2) == 0x000030, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x000038, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_AsGI_Single_Player_2) == 0x000048, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_AsGI_Single_Player_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'INTERACT_Button_C_OnBrokenInteraction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000054, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000060, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000064, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00006C, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnBrokenInteraction, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'INTERACT_Button_C_OnBrokenInteraction::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.InitializeButtonState
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Button_C_InitializeButtonState final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_InitializeButtonState) == 0x000001, "Wrong alignment on INTERACT_Button_C_InitializeButtonState");
static_assert(sizeof(INTERACT_Button_C_InitializeButtonState) == 0x000002, "Wrong size on INTERACT_Button_C_InitializeButtonState");
static_assert(offsetof(INTERACT_Button_C_InitializeButtonState, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'INTERACT_Button_C_InitializeButtonState::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_InitializeButtonState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'INTERACT_Button_C_InitializeButtonState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.SetButtonMeshColor
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_Button_C_SetButtonMeshColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_SetButtonMeshColor) == 0x000010, "Wrong alignment on INTERACT_Button_C_SetButtonMeshColor");
static_assert(sizeof(INTERACT_Button_C_SetButtonMeshColor) == 0x000030, "Wrong size on INTERACT_Button_C_SetButtonMeshColor");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, Color) == 0x000000, "Member 'INTERACT_Button_C_SetButtonMeshColor::Color' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, CallFunc_BreakColor_R) == 0x000010, "Member 'INTERACT_Button_C_SetButtonMeshColor::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, CallFunc_BreakColor_G) == 0x000014, "Member 'INTERACT_Button_C_SetButtonMeshColor::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, CallFunc_BreakColor_B) == 0x000018, "Member 'INTERACT_Button_C_SetButtonMeshColor::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, CallFunc_BreakColor_A) == 0x00001C, "Member 'INTERACT_Button_C_SetButtonMeshColor::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_SetButtonMeshColor, K2Node_MakeStruct_Vector4) == 0x000020, "Member 'INTERACT_Button_C_SetButtonMeshColor::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.UpdateButtonColor
// 0x001C (0x001C - 0x0000)
struct INTERACT_Button_C_UpdateButtonColor final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetButtonColor_ButtonColor;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ButtonColorType                          Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ButtonColorType                          Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_ButtonColorType                          Temp_byte_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEveryTargetInteractUnlocked_Result;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsButtonFunctional_Result;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_ButtonColorType                          K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ButtonColorType                          K2Node_Select_Default_1;                           // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_UpdateButtonColor) == 0x000004, "Wrong alignment on INTERACT_Button_C_UpdateButtonColor");
static_assert(sizeof(INTERACT_Button_C_UpdateButtonColor) == 0x00001C, "Wrong size on INTERACT_Button_C_UpdateButtonColor");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, Temp_bool_Variable) == 0x000000, "Member 'INTERACT_Button_C_UpdateButtonColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, CallFunc_GetButtonColor_ButtonColor) == 0x000004, "Member 'INTERACT_Button_C_UpdateButtonColor::CallFunc_GetButtonColor_ButtonColor' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, Temp_byte_Variable) == 0x000014, "Member 'INTERACT_Button_C_UpdateButtonColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, Temp_byte_Variable_1) == 0x000015, "Member 'INTERACT_Button_C_UpdateButtonColor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, Temp_bool_Variable_1) == 0x000016, "Member 'INTERACT_Button_C_UpdateButtonColor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, Temp_byte_Variable_2) == 0x000017, "Member 'INTERACT_Button_C_UpdateButtonColor::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, CallFunc_IsEveryTargetInteractUnlocked_Result) == 0x000018, "Member 'INTERACT_Button_C_UpdateButtonColor::CallFunc_IsEveryTargetInteractUnlocked_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, CallFunc_IsButtonFunctional_Result) == 0x000019, "Member 'INTERACT_Button_C_UpdateButtonColor::CallFunc_IsButtonFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, K2Node_Select_Default) == 0x00001A, "Member 'INTERACT_Button_C_UpdateButtonColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonColor, K2Node_Select_Default_1) == 0x00001B, "Member 'INTERACT_Button_C_UpdateButtonColor::K2Node_Select_Default_1' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.StartButtonPulse
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Button_C_StartButtonPulse final
{
public:
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_StartButtonPulse) == 0x000004, "Wrong alignment on INTERACT_Button_C_StartButtonPulse");
static_assert(sizeof(INTERACT_Button_C_StartButtonPulse) == 0x000004, "Wrong size on INTERACT_Button_C_StartButtonPulse");
static_assert(offsetof(INTERACT_Button_C_StartButtonPulse, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000000, "Member 'INTERACT_Button_C_StartButtonPulse::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.TickButtonPulse
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Button_C_TickButtonPulse final
{
public:
	float                                         PulseProgress;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetButtonColor_ButtonColor;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetButtonColorWhilePulsing_PulseValue;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_TickButtonPulse) == 0x000008, "Wrong alignment on INTERACT_Button_C_TickButtonPulse");
static_assert(sizeof(INTERACT_Button_C_TickButtonPulse) == 0x000050, "Wrong size on INTERACT_Button_C_TickButtonPulse");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, PulseProgress) == 0x000000, "Member 'INTERACT_Button_C_TickButtonPulse::PulseProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_GetButtonColor_ButtonColor) == 0x000008, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_GetButtonColor_ButtonColor' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'INTERACT_Button_C_TickButtonPulse::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_GetButtonColorWhilePulsing_PulseValue) == 0x000030, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_GetButtonColorWhilePulsing_PulseValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000040, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TickButtonPulse, CallFunc_FClamp_ReturnValue) == 0x00004C, "Member 'INTERACT_Button_C_TickButtonPulse::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.OnLockedInteraction
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Button_C_OnLockedInteraction final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnLockedInteraction_Result;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_OnLockedInteraction) == 0x000001, "Wrong alignment on INTERACT_Button_C_OnLockedInteraction");
static_assert(sizeof(INTERACT_Button_C_OnLockedInteraction) == 0x000002, "Wrong size on INTERACT_Button_C_OnLockedInteraction");
static_assert(offsetof(INTERACT_Button_C_OnLockedInteraction, Result) == 0x000000, "Member 'INTERACT_Button_C_OnLockedInteraction::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnLockedInteraction, CallFunc_OnLockedInteraction_Result) == 0x000001, "Member 'INTERACT_Button_C_OnLockedInteraction::CallFunc_OnLockedInteraction_Result' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.TryUpdateRetriggerTimer
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Button_C_TryUpdateRetriggerTimer final
{
public:
	float                                         TimerDuration;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTimeSinceRetrigger;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_TryUpdateRetriggerTimer) == 0x000008, "Wrong alignment on INTERACT_Button_C_TryUpdateRetriggerTimer");
static_assert(sizeof(INTERACT_Button_C_TryUpdateRetriggerTimer) == 0x000048, "Wrong size on INTERACT_Button_C_TryUpdateRetriggerTimer");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, TimerDuration) == 0x000000, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::TimerDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, ElapsedTimeSinceRetrigger) == 0x000004, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::ElapsedTimeSinceRetrigger' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x00000C, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x000014, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000040, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_TryUpdateRetriggerTimer, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'INTERACT_Button_C_TryUpdateRetriggerTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.EVENT_OnRetriggerButton
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Button_C_EVENT_OnRetriggerButton final
{
public:
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0000(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_C_EVENT_OnRetriggerButton) == 0x000008, "Wrong alignment on INTERACT_Button_C_EVENT_OnRetriggerButton");
static_assert(sizeof(INTERACT_Button_C_EVENT_OnRetriggerButton) == 0x000020, "Wrong size on INTERACT_Button_C_EVENT_OnRetriggerButton");
static_assert(offsetof(INTERACT_Button_C_EVENT_OnRetriggerButton, CallFunc_TryInteract_InteractResults) == 0x000000, "Member 'INTERACT_Button_C_EVENT_OnRetriggerButton::CallFunc_TryInteract_InteractResults' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.GetInteractBusy
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Button_C_GetInteractBusy final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BusyMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_GetInteractBusy) == 0x000008, "Wrong alignment on INTERACT_Button_C_GetInteractBusy");
static_assert(sizeof(INTERACT_Button_C_GetInteractBusy) == 0x000028, "Wrong size on INTERACT_Button_C_GetInteractBusy");
static_assert(offsetof(INTERACT_Button_C_GetInteractBusy, Result) == 0x000000, "Member 'INTERACT_Button_C_GetInteractBusy::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_GetInteractBusy, BusyMessage) == 0x000008, "Member 'INTERACT_Button_C_GetInteractBusy::BusyMessage' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_GetInteractBusy, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000020, "Member 'INTERACT_Button_C_GetInteractBusy::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.UpdateButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Button_C_UpdateButtonVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetButtonColor_ButtonColor;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_UpdateButtonVisibility) == 0x000004, "Wrong alignment on INTERACT_Button_C_UpdateButtonVisibility");
static_assert(sizeof(INTERACT_Button_C_UpdateButtonVisibility) == 0x000018, "Wrong size on INTERACT_Button_C_UpdateButtonVisibility");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonVisibility, VisibilityState) == 0x000000, "Member 'INTERACT_Button_C_UpdateButtonVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonVisibility, CallFunc_GetButtonColor_ButtonColor) == 0x000004, "Member 'INTERACT_Button_C_UpdateButtonVisibility::CallFunc_GetButtonColor_ButtonColor' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_UpdateButtonVisibility, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000014, "Member 'INTERACT_Button_C_UpdateButtonVisibility::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");

// Function INTERACT_Button.INTERACT_Button_C.OnInteractSuccess
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Button_C_OnInteractSuccess final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Button_C> K2Node_DynamicCast_AsINTERF_ANIM_Button;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleButton_Result;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_C_OnInteractSuccess) == 0x000008, "Wrong alignment on INTERACT_Button_C_OnInteractSuccess");
static_assert(sizeof(INTERACT_Button_C_OnInteractSuccess) == 0x000048, "Wrong size on INTERACT_Button_C_OnInteractSuccess");
static_assert(offsetof(INTERACT_Button_C_OnInteractSuccess, SourceActor) == 0x000000, "Member 'INTERACT_Button_C_OnInteractSuccess::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnInteractSuccess, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000008, "Member 'INTERACT_Button_C_OnInteractSuccess::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_C_OnInteractSuccess, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'INTERACT_Button_C_OnInteractSuccess::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
