#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Ladder

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Ladder.INTERACT_Ladder_C.ExecuteUbergraph_INTERACT_Ladder
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0038(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder");
static_assert(sizeof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder) == 0x000060, "Wrong size on INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, EntryPoint) == 0x000000, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000008, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_Array_Get_Item) == 0x000018, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000028, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_Greater_IntInt_ReturnValue) == 0x000031, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_TryInteract_InteractResults) == 0x000038, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'INTERACT_Ladder_C_ExecuteUbergraph_INTERACT_Ladder::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Ladder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Ladder_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_Ladder_C_ReceiveTick");
static_assert(sizeof(INTERACT_Ladder_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_Ladder_C_ReceiveTick");
static_assert(offsetof(INTERACT_Ladder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_Ladder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.InitializeLadder
// 0x0058 (0x0058 - 0x0000)
struct INTERACT_Ladder_C_InitializeLadder final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Ladder_C_InitializeLadder) == 0x000004, "Wrong alignment on INTERACT_Ladder_C_InitializeLadder");
static_assert(sizeof(INTERACT_Ladder_C_InitializeLadder) == 0x000058, "Wrong size on INTERACT_Ladder_C_InitializeLadder");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000004, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_X) == 0x000014, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_Y) == 0x000018, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_Z) == 0x00001C, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000020, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'INTERACT_Ladder_C_InitializeLadder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_X_1) == 0x00003C, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_Y_1) == 0x000040, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_BreakVector_Z_1) == 0x000044, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00004C, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Round_ReturnValue) == 0x000050, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_InitializeLadder, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'INTERACT_Ladder_C_InitializeLadder::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.ResumeMounting
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Ladder_C_ResumeMounting final
{
public:
	class APAWN_Hacker_Simple_C*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RungToMount;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MountLocation;                                     // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBestMountRungIndex_Rung_index;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRungLocationFromIndex_Result;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetChannelingInteractable_Result;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Ladder_C_ResumeMounting) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_ResumeMounting");
static_assert(sizeof(INTERACT_Ladder_C_ResumeMounting) == 0x000050, "Wrong size on INTERACT_Ladder_C_ResumeMounting");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, Player) == 0x000000, "Member 'INTERACT_Ladder_C_ResumeMounting::Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, RungToMount) == 0x000008, "Member 'INTERACT_Ladder_C_ResumeMounting::RungToMount' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, MountLocation) == 0x00000C, "Member 'INTERACT_Ladder_C_ResumeMounting::MountLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_GetBestMountRungIndex_Rung_index) == 0x000018, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_GetBestMountRungIndex_Rung_index' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_GetRungLocationFromIndex_Result) == 0x00001C, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_GetRungLocationFromIndex_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_Add_VectorVector_ReturnValue) == 0x000034, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_GetChannelingInteractable_Result) == 0x000040, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_GetChannelingInteractable_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_ResumeMounting, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'INTERACT_Ladder_C_ResumeMounting::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.BeginMounting
// 0x0118 (0x0118 - 0x0000)
struct INTERACT_Ladder_C_BeginMounting final
{
public:
	class APAWN_Hacker_Simple_C*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMountingFromTop;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MountDuration;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MountSpeed;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MountLocation;                                     // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RungToMount;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRungLocationFromIndex_Result;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBestMountRungIndex_Rung_index;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_4;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFallingMountTime_Time;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Ladder_C_BeginMounting) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_BeginMounting");
static_assert(sizeof(INTERACT_Ladder_C_BeginMounting) == 0x000118, "Wrong size on INTERACT_Ladder_C_BeginMounting");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, Player) == 0x000000, "Member 'INTERACT_Ladder_C_BeginMounting::Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, IsMountingFromTop) == 0x000008, "Member 'INTERACT_Ladder_C_BeginMounting::IsMountingFromTop' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, MountDuration) == 0x00000C, "Member 'INTERACT_Ladder_C_BeginMounting::MountDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, MountSpeed) == 0x000010, "Member 'INTERACT_Ladder_C_BeginMounting::MountSpeed' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, MountLocation) == 0x000014, "Member 'INTERACT_Ladder_C_BeginMounting::MountLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, RungToMount) == 0x000020, "Member 'INTERACT_Ladder_C_BeginMounting::RungToMount' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_GetRungLocationFromIndex_Result) == 0x000024, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_GetRungLocationFromIndex_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_GetBestMountRungIndex_Rung_index) == 0x000030, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_GetBestMountRungIndex_Rung_index' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000040, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_X) == 0x000054, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Y) == 0x000058, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Z) == 0x00005C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_X_1) == 0x000060, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Y_1) == 0x000064, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00006C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_GetGravityZ_ReturnValue) == 0x000078, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000080, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_X_2) == 0x00008C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Y_2) == 0x000090, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Z_2) == 0x000094, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_IsFalling_ReturnValue) == 0x000098, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x00009C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000A4, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_X_3) == 0x0000AC, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Y_3) == 0x0000B0, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Z_3) == 0x0000B4, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_VSize2D_ReturnValue) == 0x0000B8, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000BC, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000C0, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BooleanAND_ReturnValue) == 0x0000C4, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_VSize_ReturnValue) == 0x0000E0, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E4, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000F0, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, Temp_bool_Variable) == 0x0000F4, "Member 'INTERACT_Ladder_C_BeginMounting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_X_4) == 0x0000F8, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Y_4) == 0x0000FC, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_BreakVector_Z_4) == 0x000100, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, K2Node_Select_Default) == 0x000104, "Member 'INTERACT_Ladder_C_BeginMounting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000108, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_GetFallingMountTime_Time) == 0x00010C, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_GetFallingMountTime_Time' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_BeginMounting, CallFunc_FMax_ReturnValue) == 0x000110, "Member 'INTERACT_Ladder_C_BeginMounting::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.FinishDismounting
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Ladder_C_FinishDismounting final
{
public:
	class UMOVECONTROL_Base_C*                    MoveControl;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Ladder_C_FinishDismounting) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_FinishDismounting");
static_assert(sizeof(INTERACT_Ladder_C_FinishDismounting) == 0x000020, "Wrong size on INTERACT_Ladder_C_FinishDismounting");
static_assert(offsetof(INTERACT_Ladder_C_FinishDismounting, MoveControl) == 0x000000, "Member 'INTERACT_Ladder_C_FinishDismounting::MoveControl' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_FinishDismounting, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000008, "Member 'INTERACT_Ladder_C_FinishDismounting::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_FinishDismounting, CallFunc_Array_Contains_ReturnValue) == 0x000018, "Member 'INTERACT_Ladder_C_FinishDismounting::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.CreateLadderMoveControl
// 0x0120 (0x0120 - 0x0000)
struct INTERACT_Ladder_C_CreateLadderMoveControl final
{
public:
	class APAWN_Hacker_Simple_C*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnToFaceLadder;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MountLocation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MountDuration;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_WorldMove_C*               MountMoveControl;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UMOVECONTROL_Base_C* MoveControl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UMOVECONTROL_WorldMove_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Ladder_C_CreateLadderMoveControl) == 0x000010, "Wrong alignment on INTERACT_Ladder_C_CreateLadderMoveControl");
static_assert(sizeof(INTERACT_Ladder_C_CreateLadderMoveControl) == 0x000120, "Wrong size on INTERACT_Ladder_C_CreateLadderMoveControl");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, Player) == 0x000000, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, TurnToFaceLadder) == 0x000008, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::TurnToFaceLadder' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, MountLocation) == 0x00000C, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::MountLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, MountDuration) == 0x000018, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::MountDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, MountMoveControl) == 0x000020, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::MountMoveControl' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_GetInventoryComponent_Inventory) == 0x000030, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_GetRelativeTransform_ReturnValue) == 0x000050, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakTransform_Location) == 0x00008C, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakTransform_Scale) == 0x0000A4, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Roll_1) == 0x0000B4, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Pitch_1) == 0x0000B8, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Yaw_1) == 0x0000BC, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_MakeRotator_ReturnValue) == 0x0000C0, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000CC, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Roll_2) == 0x0000E4, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Pitch_2) == 0x0000E8, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_BreakRotator_Yaw_2) == 0x0000EC, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_MakeRotator_ReturnValue_1) == 0x0000F0, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_RegisterMoveControl_Result) == 0x0000FC, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_RegisterMoveControl_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_CreateLadderMoveControl, CallFunc_SpawnObject_ReturnValue) == 0x000110, "Member 'INTERACT_Ladder_C_CreateLadderMoveControl::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.OnEnterGrabVolume
// 0x00D8 (0x00D8 - 0x0000)
struct INTERACT_Ladder_C_OnEnterGrabVolume final
{
public:
	class UPrimitiveComponent*                    Overlapped_Component;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other_Actor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Other_Comp;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Other_Body_Index;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          From_Sweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Sweep_Result;                                      // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x00B8(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Ladder_C_OnEnterGrabVolume) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_OnEnterGrabVolume");
static_assert(sizeof(INTERACT_Ladder_C_OnEnterGrabVolume) == 0x0000D8, "Wrong size on INTERACT_Ladder_C_OnEnterGrabVolume");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, Overlapped_Component) == 0x000000, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::Overlapped_Component' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, Other_Actor) == 0x000008, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::Other_Actor' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, Other_Comp) == 0x000010, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::Other_Comp' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, Other_Body_Index) == 0x000018, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::Other_Body_Index' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, From_Sweep) == 0x00001C, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::From_Sweep' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, Sweep_Result) == 0x000020, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::Sweep_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0000A8, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Ladder_C_OnEnterGrabVolume, CallFunc_TryInteract_InteractResults) == 0x0000B8, "Member 'INTERACT_Ladder_C_OnEnterGrabVolume::CallFunc_TryInteract_InteractResults' has a wrong offset!");

// Function INTERACT_Ladder.INTERACT_Ladder_C.CanMountLadder
// 0x0080 (0x0080 - 0x0000)
struct INTERACT_Ladder_C_CanMountLadder final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMountingFromTop;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReferenceForwardVector;                            // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterBusy_Result;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastInputVector_ReturnValue;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AngleBetweenNormals_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Ladder_C_CanMountLadder) == 0x000008, "Wrong alignment on INTERACT_Ladder_C_CanMountLadder");
static_assert(sizeof(INTERACT_Ladder_C_CanMountLadder) == 0x000080, "Wrong size on INTERACT_Ladder_C_CanMountLadder");
