#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Isotope_XMinus22_Receptacle

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.ExecuteUbergraph_INTERACT_Isotope_X-22_Receptacle
// 0x000C (0x000C - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle) == 0x000004, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle) == 0x00000C, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle, EntryPoint) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.BndEvt__INTERACT_Isotope_X-22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.GetTargetShape
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        CallFunc_GetTargetShape_ShapeComponent;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape) == 0x000018, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape, CallFunc_GetTargetShape_ShapeComponent) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_GetTargetShape::CallFunc_GetTargetShape_ShapeComponent' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.InitializeIsotopeReceptacle
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Iso_XMinus22_Receptacle_C*      K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle) == 0x000018, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle, K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle::K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_InitializeIsotopeReceptacle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.SetReceptacleActivated
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated) == 0x000004, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated) == 0x000008, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated, State) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated::State' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_SetReceptacleActivated::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryInteract
// 0x0170 (0x0170 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_FindAndCacheRequiredItem_Result;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0068(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x00A0(0x0020)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryBeginChannelingSequence_Result;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayPublicAddressMessage_Result;       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryOpenCompartment_Result;                // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00E8(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x0108(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_CanPerformChannelingSequence_Result;      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x0130(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0150(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract) == 0x000170, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, HackerPawn) == 0x000038, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000040, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_FindAndCacheRequiredItem_Result) == 0x000060, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_FindAndCacheRequiredItem_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000068, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000088, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000090, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x0000A0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_GetGameInstance_ReturnValue) == 0x0000D0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x0000D8, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_TryBeginChannelingSequence_Result) == 0x0000E1, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_TryBeginChannelingSequence_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_TryPlayPublicAddressMessage_Result) == 0x0000E2, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_TryPlayPublicAddressMessage_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_TryOpenCompartment_Result) == 0x0000E3, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_TryOpenCompartment_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000E8, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x000108, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, CallFunc_CanPerformChannelingSequence_Result) == 0x000128, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::CallFunc_CanPerformChannelingSequence_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x000130, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000150, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryInteractWhileHoldingIsotope
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope final
{
public:
	class APAWN_Hacker_Simple_C*                  Hacker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0008(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_TryOpenCompartment_Result;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0030(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope) == 0x000050, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope, Hacker) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope::Hacker' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope, InteractResults) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope, CallFunc_TryOpenCompartment_Result) == 0x000028, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope::CallFunc_TryOpenCompartment_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope, CallFunc_TryInteract_InteractResults) == 0x000030, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInteractWhileHoldingIsotope::CallFunc_TryInteract_InteractResults' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryDrawIsotope
// 0x00D0 (0x00D0 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope final
{
public:
	class APAWN_Hacker_Simple_C*                  Hacker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Isotope_XMinus22_C*             IsotopePickup;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UITEM_Base_C>               RequiredItemClass;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPICKUP_Isotope_X_22;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AttachAndModifyComponentOwnership_ReturnValue; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AttachAndModifyComponentOwnership_ReturnValue_1; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Isotope_XMinus22_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope) == 0x000010, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope) == 0x0000D0, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, Hacker) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::Hacker' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, Result) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, IsotopePickup) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::IsotopePickup' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, RequiredItemClass) == 0x000018, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::RequiredItemClass' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000020, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, K2Node_ClassDynamicCast_AsPICKUP_Isotope_X_22) == 0x000028, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::K2Node_ClassDynamicCast_AsPICKUP_Isotope_X_22' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, K2Node_ClassDynamicCast_bSuccess) == 0x000030, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_AttachAndModifyComponentOwnership_ReturnValue) == 0x000033, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_AttachAndModifyComponentOwnership_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_AttachAndModifyComponentOwnership_ReturnValue_1) == 0x000034, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_AttachAndModifyComponentOwnership_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000035, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000036, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x000037, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_MakeTransform_ReturnValue_1) == 0x000070, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A8, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, CallFunc_LoadClassAsset_Blocking_ReturnValue_1) == 0x0000B8, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::CallFunc_LoadClassAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, K2Node_ClassDynamicCast_AsITEM_Base) == 0x0000C0, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::K2Node_ClassDynamicCast_AsITEM_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope, K2Node_ClassDynamicCast_bSuccess_1) == 0x0000C8, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryDrawIsotope::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryInsertIsotope
// 0x0068 (0x0068 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope final
{
public:
	class APAWN_Hacker_Simple_C*                  Hacker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayPublicAddressMessage_Result;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope) == 0x000068, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, Hacker) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::Hacker' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, Result) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, K2Node_DynamicCast_AsGI_Single_Player) == 0x000020, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_TryPlayPublicAddressMessage_Result) == 0x000029, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_TryPlayPublicAddressMessage_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_TryInteract_self_CastInput) == 0x000030, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_TryInteract_InteractResults) == 0x000040, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryInsertIsotope::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.EVENT_OnDisableAttribChanged
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged) == 0x000004, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged) == 0x000010, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged, CurrValue) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged, LastValue) == 0x000004, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged, EmissiveStrength) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_EVENT_OnDisableAttribChanged::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.ReceiveAnimationMessage
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_Base_C*                    CallFunc_GetChannelingMoveControl_Result;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMOVECONTROL_Base_C*                    CallFunc_GetChannelingMoveControl_Result_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryInsertIsotope_Result;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryDrawIsotope_Result;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCloseCompartment_Result;               // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage) == 0x000030, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, Message) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::Message' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, Result) == 0x000010, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_GetChannelingMoveControl_Result) == 0x000018, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_GetChannelingMoveControl_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_GetChannelingMoveControl_Result_1) == 0x000020, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_GetChannelingMoveControl_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_TryInsertIsotope_Result) == 0x000028, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_TryInsertIsotope_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_TryDrawIsotope_Result) == 0x000029, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_TryDrawIsotope_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_TryCloseCompartment_Result) == 0x00002A, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_TryCloseCompartment_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00002B, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00002C, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00002D, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryOpenCompartment
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MontageDuration;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Iso_XMinus22_Receptacle_C*      K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment");
static_assert(sizeof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment) == 0x000060, "Wrong size on INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, Result) == 0x000000, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, MontageDuration) == 0x000004, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::MontageDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000028, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, K2Node_DynamicCast_AsAnim_Montage) == 0x000038, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_Montage_Play_ReturnValue) == 0x000044, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000048, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle) == 0x000050, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'INTERACT_Isotope_XMinus22_Receptacle_C_TryOpenCompartment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C.TryCloseCompartment
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Isotope_XMinus22_Receptacle_C_TryCloseCompartment final
{
public:
	bool                                          CloseImmediately;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Iso_XMinus22_Receptacle_C*      K2Node_DynamicCast_AsAnim_BP_Iso_X_22_Receptacle;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Isotope_XMinus22_Receptacle_C_TryCloseCompartment) == 0x000008, "Wrong alignment on INTERACT_Isotope_XMinus22_Receptacle_C_TryCloseCompartment");
