#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ScreenCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_SentryTurret_Base_classes.hpp"
#include "ENUM_DoorState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_ScreenCamera.INTERACT_ScreenCamera_C
// 0x0098 (0x0568 - 0x04D0)
class AINTERACT_ScreenCamera_C final : public AINTERACT_SentryTurret_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_ScreenCamera_C;            // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Resolution;                                        // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         YawPatrolDegrees;                                  // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialPatrolDelay;                                // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolRestDelay;                                   // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolYawSpeed;                                    // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SourceCameraYaw;                                   // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionStartTimestamp;                          // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AINTERACT_Base_C*>                 RegisteredScreens;                                 // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DeployTimerHandle;                                 // 0x0560(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_ScreenCamera(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeScreenCamera();
	void RegisterDisplayScreen(class AINTERACT_Base_C* ScreenActor, bool State);
	void GetOrCreateRenderTarget(class UTextureRenderTarget2D** RenderTarget_0);
	void TryDestroyRenderTarget();
	void UpdateSwivelYaw(bool PlaySounds);
	void HasTickBehaviorWhilePerceptible(bool* Result);
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	void OnTakeDamage(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams, bool* Result);
	void TickSentryTurret(float DeltaSeconds);
	void OnSentryTurretStartedConcealing();
	void OnSentryTurretFinishedConcealing();
	void TryStartCaptureTimer();
	void TryStopCaptureTimer();
	void TryStartDeployTimer();
	void EVENT_OnTryDeployScreenCamera();
	void OnSentryTurretFinishedDeploying();
	void OnMagneticDisableStateChanged(bool DisableState);
	void OnTickStateChanged(bool State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_ScreenCamera_C">();
	}
	static class AINTERACT_ScreenCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_ScreenCamera_C>();
	}
};
static_assert(alignof(AINTERACT_ScreenCamera_C) == 0x000008, "Wrong alignment on AINTERACT_ScreenCamera_C");
static_assert(sizeof(AINTERACT_ScreenCamera_C) == 0x000568, "Wrong size on AINTERACT_ScreenCamera_C");
static_assert(offsetof(AINTERACT_ScreenCamera_C, UberGraphFrame_INTERACT_ScreenCamera_C) == 0x0004D0, "Member 'AINTERACT_ScreenCamera_C::UberGraphFrame_INTERACT_ScreenCamera_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, SceneCaptureComponent2D) == 0x0004D8, "Member 'AINTERACT_ScreenCamera_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, Resolution) == 0x0004E0, "Member 'AINTERACT_ScreenCamera_C::Resolution' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, YawPatrolDegrees) == 0x0004E4, "Member 'AINTERACT_ScreenCamera_C::YawPatrolDegrees' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, Yaw) == 0x0004E8, "Member 'AINTERACT_ScreenCamera_C::Yaw' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, Pitch) == 0x0004EC, "Member 'AINTERACT_ScreenCamera_C::Pitch' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, InitialPatrolDelay) == 0x0004F0, "Member 'AINTERACT_ScreenCamera_C::InitialPatrolDelay' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, PatrolRestDelay) == 0x0004F4, "Member 'AINTERACT_ScreenCamera_C::PatrolRestDelay' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, PatrolYawSpeed) == 0x0004F8, "Member 'AINTERACT_ScreenCamera_C::PatrolYawSpeed' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, SourceCameraYaw) == 0x0004FC, "Member 'AINTERACT_ScreenCamera_C::SourceCameraYaw' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, TransitionStartTimestamp) == 0x000500, "Member 'AINTERACT_ScreenCamera_C::TransitionStartTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, RegisteredScreens) == 0x000508, "Member 'AINTERACT_ScreenCamera_C::RegisteredScreens' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, RenderTarget) == 0x000558, "Member 'AINTERACT_ScreenCamera_C::RenderTarget' has a wrong offset!");
static_assert(offsetof(AINTERACT_ScreenCamera_C, DeployTimerHandle) == 0x000560, "Member 'AINTERACT_ScreenCamera_C::DeployTimerHandle' has a wrong offset!");

}

