#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_MedicalDoor_Secret_LatticeWall

#include "Basic.hpp"

#include "INTERACT_SecretDoor_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_MedicalDoor_Secret_LatticeWall.INTERACT_MedicalDoor_Secret_LatticeWall_C
// 0x0020 (0x0688 - 0x0668)
class AINTERACT_MedicalDoor_Secret_LatticeWall_C final : public AINTERACT_SecretDoor_Base_C
{
public:
	class UBoxComponent*                          DoorFrameCeiling;                                  // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameFloor;                                    // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameRight;                                    // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameLeft;                                     // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_MedicalDoor_Secret_LatticeWall_C">();
	}
	static class AINTERACT_MedicalDoor_Secret_LatticeWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_MedicalDoor_Secret_LatticeWall_C>();
	}
};
static_assert(alignof(AINTERACT_MedicalDoor_Secret_LatticeWall_C) == 0x000008, "Wrong alignment on AINTERACT_MedicalDoor_Secret_LatticeWall_C");
static_assert(sizeof(AINTERACT_MedicalDoor_Secret_LatticeWall_C) == 0x000688, "Wrong size on AINTERACT_MedicalDoor_Secret_LatticeWall_C");
static_assert(offsetof(AINTERACT_MedicalDoor_Secret_LatticeWall_C, DoorFrameCeiling) == 0x000668, "Member 'AINTERACT_MedicalDoor_Secret_LatticeWall_C::DoorFrameCeiling' has a wrong offset!");
static_assert(offsetof(AINTERACT_MedicalDoor_Secret_LatticeWall_C, DoorFrameFloor) == 0x000670, "Member 'AINTERACT_MedicalDoor_Secret_LatticeWall_C::DoorFrameFloor' has a wrong offset!");
static_assert(offsetof(AINTERACT_MedicalDoor_Secret_LatticeWall_C, DoorFrameRight) == 0x000678, "Member 'AINTERACT_MedicalDoor_Secret_LatticeWall_C::DoorFrameRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_MedicalDoor_Secret_LatticeWall_C, DoorFrameLeft) == 0x000680, "Member 'AINTERACT_MedicalDoor_Secret_LatticeWall_C::DoorFrameLeft' has a wrong offset!");

}

