#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SentryTurret_Base

#include "Basic.hpp"

#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_CombatDifficultySettings_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.ExecuteUbergraph_INTERACT_SentryTurret_Base
// 0x000C (0x000C - 0x0000)
struct INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bAudibleState;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base) == 0x00000C, "Wrong size on INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base, EntryPoint) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base, K2Node_ComponentBoundEvent_bAudibleState) == 0x000005, "Member 'INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base::K2Node_ComponentBoundEvent_bAudibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_ExecuteUbergraph_INTERACT_SentryTurret_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SentryTurret_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_ReceiveTick");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_SentryTurret_Base_C_ReceiveTick");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature final
{
public:
	bool                                          bAudibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature, bAudibleState) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_1_CullableAudibilitySignature__DelegateSignature::bAudibleState' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_BndEvt__INTERACT_SentryTurret_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.IsSentryTurretEnabled
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled) == 0x000001, "Wrong size on INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_IsSentryTurretEnabled::Result' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.IsSentryTurretAudible
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SentryTurret_Base_C_IsSentryTurretAudible final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_IsSentryTurretAudible) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_IsSentryTurretAudible");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_IsSentryTurretAudible) == 0x000001, "Wrong size on INTERACT_SentryTurret_Base_C_IsSentryTurretAudible");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_IsSentryTurretAudible, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_IsSentryTurretAudible::Result' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.CanDeploySentryTurret
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SentryTurret_Base_C_CanDeploySentryTurret final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSentryTurretEnabled_Result;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_CanDeploySentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret) == 0x000004, "Wrong size on INTERACT_SentryTurret_Base_C_CanDeploySentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_CanDeploySentryTurret::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret, CallFunc_IsAlive_Result) == 0x000001, "Member 'INTERACT_SentryTurret_Base_C_CanDeploySentryTurret::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret, CallFunc_IsSentryTurretEnabled_Result) == 0x000002, "Member 'INTERACT_SentryTurret_Base_C_CanDeploySentryTurret::CallFunc_IsSentryTurretEnabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_CanDeploySentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'INTERACT_SentryTurret_Base_C_CanDeploySentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.SetSentryTurretRelativePitch
// 0x0098 (0x0098 - 0x0000)
struct INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch) == 0x000098, "Wrong size on INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch, Pitch) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch::Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativePitch::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.SetSentryTurretRelativeYaw
// 0x0098 (0x0098 - 0x0000)
struct INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw) == 0x000098, "Wrong size on INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw, Yaw) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw::Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretRelativeYaw::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.GetSentryTurretRelativeYaw
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw) == 0x000010, "Wrong size on INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw, CallFunc_BreakRotator_Roll) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw, CallFunc_BreakRotator_Pitch) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw, CallFunc_BreakRotator_Yaw) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_GetSentryTurretRelativeYaw::CallFunc_BreakRotator_Yaw' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.GetTurretRelativeRotation
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation final
{
public:
	struct FRotator                               Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation) == 0x000030, "Wrong size on INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Roll) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Pitch) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Yaw) == 0x000014, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Roll_1) == 0x000018, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Pitch_1) == 0x00001C, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_BreakRotator_Yaw_1) == 0x000020, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation, CallFunc_MakeRotator_ReturnValue) == 0x000024, "Member 'INTERACT_SentryTurret_Base_C_GetTurretRelativeRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.InitializeSentryTurret
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SentryTurret_Base_C_InitializeSentryTurret final
{
public:
	bool                                          OnBeginPlay;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSentryTurretEnabled_Result;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSentryTurretEnabled_Result_1;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_InitializeSentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret) == 0x000004, "Wrong size on INTERACT_SentryTurret_Base_C_InitializeSentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret, OnBeginPlay) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_InitializeSentryTurret::OnBeginPlay' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret, CallFunc_IsSentryTurretEnabled_Result) == 0x000001, "Member 'INTERACT_SentryTurret_Base_C_InitializeSentryTurret::CallFunc_IsSentryTurretEnabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret, CallFunc_IsSentryTurretEnabled_Result_1) == 0x000002, "Member 'INTERACT_SentryTurret_Base_C_InitializeSentryTurret::CallFunc_IsSentryTurretEnabled_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_InitializeSentryTurret, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'INTERACT_SentryTurret_Base_C_InitializeSentryTurret::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.SetupAttributeBinds
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_SentryTurret_Base_C_SetupAttributeBinds final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_SetupAttributeBinds) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_SetupAttributeBinds");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_SetupAttributeBinds) == 0x000014, "Wrong size on INTERACT_SentryTurret_Base_C_SetupAttributeBinds");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetupAttributeBinds, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_SetupAttributeBinds::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetupAttributeBinds, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_SetupAttributeBinds::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.TickSentryTurret
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_SentryTurret_Base_C_TickSentryTurret final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_TickSentryTurret) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_TickSentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_TickSentryTurret) == 0x000008, "Wrong size on INTERACT_SentryTurret_Base_C_TickSentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurret, DeltaSeconds) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurret::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurret, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurret::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.TickSentryTurretTransition
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_SentryTurret_Base_C_TickSentryTurretTransition final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateProgress;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_TickSentryTurretTransition");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition) == 0x000014, "Wrong size on INTERACT_SentryTurret_Base_C_TickSentryTurretTransition");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition, DeltaSeconds) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurretTransition::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition, StateProgress) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurretTransition::StateProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurretTransition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurretTransition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TickSentryTurretTransition, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_TickSentryTurretTransition::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.TryDeploySentryTurret
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_SentryTurret_Base_C_TryDeploySentryTurret final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDeploySentryTurret_Result;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_TryDeploySentryTurret) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_Base_C_TryDeploySentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_TryDeploySentryTurret) == 0x000010, "Wrong size on INTERACT_SentryTurret_Base_C_TryDeploySentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryDeploySentryTurret, SourceActor) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_TryDeploySentryTurret::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryDeploySentryTurret, Result) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_TryDeploySentryTurret::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryDeploySentryTurret, CallFunc_CanDeploySentryTurret_Result) == 0x000009, "Member 'INTERACT_SentryTurret_Base_C_TryDeploySentryTurret::CallFunc_CanDeploySentryTurret_Result' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.ForceDeploySentryTurret
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevElapsedStateTime;                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret) == 0x000018, "Wrong size on INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret, SourceActor) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret, PrevElapsedStateTime) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret::PrevElapsedStateTime' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_ForceDeploySentryTurret::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.TryConcealSentryTurret
// 0x0003 (0x0003 - 0x0000)
struct INTERACT_SentryTurret_Base_C_TryConcealSentryTurret final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSentryTurretEnabled_Result;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_TryConcealSentryTurret) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_TryConcealSentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_TryConcealSentryTurret) == 0x000003, "Wrong size on INTERACT_SentryTurret_Base_C_TryConcealSentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryConcealSentryTurret, Result) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_TryConcealSentryTurret::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryConcealSentryTurret, CallFunc_IsSentryTurretEnabled_Result) == 0x000001, "Member 'INTERACT_SentryTurret_Base_C_TryConcealSentryTurret::CallFunc_IsSentryTurretEnabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_TryConcealSentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'INTERACT_SentryTurret_Base_C_TryConcealSentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.ForceConcealSentryTurret
// 0x000C (0x000C - 0x0000)
struct INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret final
{
public:
	float                                         PrevElapsedStateTime;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret) == 0x00000C, "Wrong size on INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret, PrevElapsedStateTime) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret::PrevElapsedStateTime' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_ForceConcealSentryTurret::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.UpdateSentryTurretTransition
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition final
{
public:
	float                                         StateProgress;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_2;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_3;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryChangeTickState_Result;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryChangeTickState_Result_1;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition) == 0x000030, "Wrong size on INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, StateProgress) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::StateProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000005, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_FMin_ReturnValue) == 0x000014, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Ease_ReturnValue) == 0x00001C, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Ease_ReturnValue_1) == 0x000020, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Ease_ReturnValue_2) == 0x000024, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Ease_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_Ease_ReturnValue_3) == 0x000028, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_Ease_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_TryChangeTickState_Result) == 0x00002C, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_TryChangeTickState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, CallFunc_TryChangeTickState_Result_1) == 0x00002D, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::CallFunc_TryChangeTickState_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition, K2Node_SwitchEnum_CmpSuccess) == 0x00002E, "Member 'INTERACT_SentryTurret_Base_C_UpdateSentryTurretTransition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.UpdateDomeMeshLocation
// 0x009C (0x009C - 0x0000)
struct INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation final
{
public:
	float                                         DeployProgress;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation) == 0x00009C, "Wrong size on INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation, DeployProgress) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation::DeployProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000014, "Member 'INTERACT_SentryTurret_Base_C_UpdateDomeMeshLocation::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.UpdateDoorMeshLocations
// 0x0138 (0x0138 - 0x0000)
struct INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations final
{
public:
	float                                         OpenProgress;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDoorOpenDistance;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations) == 0x000138, "Wrong size on INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, OpenProgress) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::OpenProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CurrentDoorOpenDistance) == 0x000004, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CurrentDoorOpenDistance' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_MakeVector_ReturnValue_1) == 0x000018, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000024, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000B0, "Member 'INTERACT_SentryTurret_Base_C_UpdateDoorMeshLocations::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.UpdateMeshEmissiveStrength
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength final
{
public:
	float                                         Strength;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength) == 0x000004, "Wrong size on INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength, Strength) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_UpdateMeshEmissiveStrength::Strength' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.SetSentryTurretVisibility
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryChangeTickState_Result;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility) == 0x000004, "Wrong size on INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility, VisibilityState) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility, CallFunc_IsAlive_Result) == 0x000002, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility, CallFunc_TryChangeTickState_Result) == 0x000003, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretVisibility::CallFunc_TryChangeTickState_Result' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.SetSentryTurretAudibility
// 0x0003 (0x0003 - 0x0000)
struct INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility final
{
public:
	bool                                          AudibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryChangeTickState_Result;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility) == 0x000003, "Wrong size on INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility, AudibilityState) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility::AudibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility, CallFunc_IsAlive_Result) == 0x000001, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility, CallFunc_TryChangeTickState_Result) == 0x000002, "Member 'INTERACT_SentryTurret_Base_C_SetSentryTurretAudibility::CallFunc_TryChangeTickState_Result' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.GetTurretYawAngleToLocation
// 0x0044 (0x0044 - 0x0000)
struct INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignedAngleBetweenOnPlane_ReturnValue;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation");
static_assert(sizeof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation) == 0x000044, "Wrong size on INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, Location) == 0x000000, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, Result) == 0x00000C, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x00001C, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, CallFunc_Vector_Up_ReturnValue) == 0x000034, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation, CallFunc_SignedAngleBetweenOnPlane_ReturnValue) == 0x000040, "Member 'INTERACT_SentryTurret_Base_C_GetTurretYawAngleToLocation::CallFunc_SignedAngleBetweenOnPlane_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_Base.INTERACT_SentryTurret_Base_C.GetTurretPitchAngleToLocation
// 0x0064 (0x0064 - 0x0000)
struct INTERACT_SentryTurret_Base_C_GetTurretPitchAngleToLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
