#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_WallSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_UpDown_structs.hpp"
#include "INTERACT_Button_Base_classes.hpp"
#include "ENUM_ButtonColorType_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_WallSwitch.INTERACT_WallSwitch_C
// 0x0188 (0x0590 - 0x0408)
class AINTERACT_WallSwitch_C final : public AINTERACT_Button_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_WallSwitch_C;              // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SoundLocation;                                     // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Switch;                                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SparkNode;                                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox;                                         // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ENUM_UpDown                                   StartState;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_UpDown                                   State;                                             // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AINTERACT_WallSwitch_C*>         PairedSwitches;                                    // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TSoftObjectPtr<class UAnimMontage>            SwitchUpMontage;                                   // 0x0458(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            SwitchDownMontage;                                 // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          BrokenFX;                                          // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         SparkStartedTimestamp;                             // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SparkDuration;                                     // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SwitchUpCue;                                       // 0x04D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SwitchDownCue;                                     // 0x0500(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               BrokenSoundCue;                                    // 0x0528(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   DeactivatedMessage;                                // 0x0550(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class USoundCue>               PoweredDownSoundCue;                               // 0x0568(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_WallSwitch(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void SetState(ENUM_UpDown State_0);
	void UserConstructionScript();
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void OnBrokenInteraction(bool* Result);
	void PlayInteractionSound();
	void UpdateSwitchState(ENUM_UpDown InState);
	void UpdateLockLightColor();
	void InitializeButtonState();
	void GetSuccessMessage(class FText* Result);
	void OnTargetLockStateChanged();
	void UpdateSwitchVisibility(bool VisibilityState);
	void OnInteractSuccess(class AActor* SourceActor);
	void OnButtonBecameDysfunctional();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_WallSwitch_C">();
	}
	static class AINTERACT_WallSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_WallSwitch_C>();
	}
};
static_assert(alignof(AINTERACT_WallSwitch_C) == 0x000008, "Wrong alignment on AINTERACT_WallSwitch_C");
static_assert(sizeof(AINTERACT_WallSwitch_C) == 0x000590, "Wrong size on AINTERACT_WallSwitch_C");
static_assert(offsetof(AINTERACT_WallSwitch_C, UberGraphFrame_INTERACT_WallSwitch_C) == 0x000408, "Member 'AINTERACT_WallSwitch_C::UberGraphFrame_INTERACT_WallSwitch_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, COMP_VoxelCullable) == 0x000410, "Member 'AINTERACT_WallSwitch_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SoundLocation) == 0x000418, "Member 'AINTERACT_WallSwitch_C::SoundLocation' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SK_Switch) == 0x000420, "Member 'AINTERACT_WallSwitch_C::SK_Switch' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SparkNode) == 0x000428, "Member 'AINTERACT_WallSwitch_C::SparkNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, ScanBox) == 0x000430, "Member 'AINTERACT_WallSwitch_C::ScanBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, TargetBox) == 0x000438, "Member 'AINTERACT_WallSwitch_C::TargetBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, StartState) == 0x000440, "Member 'AINTERACT_WallSwitch_C::StartState' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, State) == 0x000441, "Member 'AINTERACT_WallSwitch_C::State' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, PairedSwitches) == 0x000448, "Member 'AINTERACT_WallSwitch_C::PairedSwitches' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SwitchUpMontage) == 0x000458, "Member 'AINTERACT_WallSwitch_C::SwitchUpMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SwitchDownMontage) == 0x000480, "Member 'AINTERACT_WallSwitch_C::SwitchDownMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, BrokenFX) == 0x0004A8, "Member 'AINTERACT_WallSwitch_C::BrokenFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SparkStartedTimestamp) == 0x0004D0, "Member 'AINTERACT_WallSwitch_C::SparkStartedTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SparkDuration) == 0x0004D4, "Member 'AINTERACT_WallSwitch_C::SparkDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SwitchUpCue) == 0x0004D8, "Member 'AINTERACT_WallSwitch_C::SwitchUpCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, SwitchDownCue) == 0x000500, "Member 'AINTERACT_WallSwitch_C::SwitchDownCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, BrokenSoundCue) == 0x000528, "Member 'AINTERACT_WallSwitch_C::BrokenSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, DeactivatedMessage) == 0x000550, "Member 'AINTERACT_WallSwitch_C::DeactivatedMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_WallSwitch_C, PoweredDownSoundCue) == 0x000568, "Member 'AINTERACT_WallSwitch_C::PoweredDownSoundCue' has a wrong offset!");

}

