#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SecurityCamera

#include "Basic.hpp"

#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreGame_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "STRUCT_CombatDifficultySettings_structs.hpp"
#include "ENUM_DetectionState_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.ExecuteUbergraph_INTERACT_SecurityCamera
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result_1;                         // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Pawn_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Location_1;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Pawn;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Location;               // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Loudness;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Character;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_EventLocation;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           K2Node_ComponentBoundEvent_NewState;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           K2Node_ComponentBoundEvent_OldState;               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera");
static_assert(sizeof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera) == 0x000088, "Wrong size on INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, EntryPoint) == 0x000000, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_bVisibleState) == 0x000014, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, CallFunc_IsVisible_ReturnValue) == 0x00001C, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, CallFunc_IsVisible_ReturnValue_1) == 0x00001D, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, CallFunc_IsAlive_Result) == 0x00001E, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, CallFunc_IsAlive_Result_1) == 0x00001F, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::CallFunc_IsAlive_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Pawn_1) == 0x000020, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Pawn_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Location_1) == 0x000028, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Location_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Pawn) == 0x000038, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Location) == 0x000040, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Loudness) == 0x00004C, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Loudness' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, Temp_object_Variable) == 0x000050, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_Character) == 0x000058, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_EventLocation) == 0x000060, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_NewState) == 0x00006C, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_NewState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_ComponentBoundEvent_OldState) == 0x00006D, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_ComponentBoundEvent_OldState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_DynamicCast_AsSound_Cue) == 0x000070, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera, K2Node_CustomEvent_Loaded) == 0x000080, "Member 'INTERACT_SecurityCamera_C_ExecuteUbergraph_INTERACT_SecurityCamera::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventLocation;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           NewState;                                          // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           OldState;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, Character) == 0x000000, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, EventLocation) == 0x000008, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, NewState) == 0x000014, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::NewState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, OldState) == 0x000015, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::OldState' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Pawn) == 0x000000, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Location) == 0x000008, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Loudness) == 0x000014, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Loudness' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature, Pawn) == 0x000000, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature::Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature, Location) == 0x000008, "Member 'INTERACT_SecurityCamera_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature::Location' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SecurityCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_SecurityCamera_C_ReceiveTick");
static_assert(sizeof(INTERACT_SecurityCamera_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_SecurityCamera_C_ReceiveTick");
static_assert(offsetof(INTERACT_SecurityCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_SecurityCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_SecurityCamera_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6");
static_assert(sizeof(INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6) == 0x000008, "Wrong size on INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6, Loaded) == 0x000000, "Member 'INTERACT_SecurityCamera_C_OnLoaded_4C2C4C564E0DC948B0D6B7848445A4D6::Loaded' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.InitializeCameraState
// 0x00C0 (0x00C0 - 0x0000)
struct INTERACT_SecurityCamera_C_InitializeCameraState final
{
public:
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                TargetScanLocation;                                // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_SecurityCamera_C*               AnimInstance;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeInCurrentState_Result;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           CallFunc_GetDetectionState_Result;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEventWithHighestRating_DetectionEvent; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_SecurityCamera_C*               K2Node_DynamicCast_AsAnim_BP_Security_Camera;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartAlertTimer_Result;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityCamera_C_InitializeCameraState) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_InitializeCameraState");
static_assert(sizeof(INTERACT_SecurityCamera_C_InitializeCameraState) == 0x0000C0, "Wrong size on INTERACT_SecurityCamera_C_InitializeCameraState");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, DetectionEvent) == 0x000000, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::DetectionEvent' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, TargetRotation) == 0x000008, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::TargetRotation' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, TargetScanLocation) == 0x000014, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::TargetScanLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, AnimInstance) == 0x000020, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::AnimInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetTimeInCurrentState_Result) == 0x000028, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetTimeInCurrentState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetDetectionState_Result) == 0x00002C, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetDetectionState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetDetectionEventWithHighestRating_DetectionEvent) == 0x000030, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetDetectionEventWithHighestRating_DetectionEvent' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, K2Node_DynamicCast_AsAnim_BP_Security_Camera) == 0x000048, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::K2Node_DynamicCast_AsAnim_BP_Security_Camera' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000054, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_BreakRotator_Roll) == 0x000058, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_BreakRotator_Pitch) == 0x00005C, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_BreakRotator_Yaw) == 0x000060, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000064, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_FMax_ReturnValue) == 0x000068, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_TryStartAlertTimer_Result) == 0x00006C, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_TryStartAlertTimer_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetPlayerPawn_ReturnValue) == 0x000070, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000078, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000084, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000090, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_GetSocketLocation_ReturnValue) == 0x00009C, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A8, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeCameraState, CallFunc_MakeRotator_ReturnValue) == 0x0000B4, "Member 'INTERACT_SecurityCamera_C_InitializeCameraState::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.InitializeSensingComponent
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_SecurityCamera_C_InitializeSensingComponent final
{
public:
	int32                                         SightRange;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CombatDifficultySettings       CallFunc_GetCombatDifficultySettings_Settings;     // 0x001C(0x0034)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityCamera_C_InitializeSensingComponent) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_InitializeSensingComponent");
static_assert(sizeof(INTERACT_SecurityCamera_C_InitializeSensingComponent) == 0x000050, "Wrong size on INTERACT_SecurityCamera_C_InitializeSensingComponent");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, SightRange) == 0x000000, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::SightRange' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeSensingComponent, CallFunc_GetCombatDifficultySettings_Settings) == 0x00001C, "Member 'INTERACT_SecurityCamera_C_InitializeSensingComponent::CallFunc_GetCombatDifficultySettings_Settings' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.InitializeRotationPreview
// 0x009C (0x009C - 0x0000)
struct INTERACT_SecurityCamera_C_InitializeRotationPreview final
{
public:
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SecurityCamera_C_InitializeRotationPreview) == 0x000004, "Wrong alignment on INTERACT_SecurityCamera_C_InitializeRotationPreview");
static_assert(sizeof(INTERACT_SecurityCamera_C_InitializeRotationPreview) == 0x00009C, "Wrong size on INTERACT_SecurityCamera_C_InitializeRotationPreview");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeRotationPreview, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000000, "Member 'INTERACT_SecurityCamera_C_InitializeRotationPreview::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeRotationPreview, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'INTERACT_SecurityCamera_C_InitializeRotationPreview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeRotationPreview, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'INTERACT_SecurityCamera_C_InitializeRotationPreview::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeRotationPreview, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'INTERACT_SecurityCamera_C_InitializeRotationPreview::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_InitializeRotationPreview, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'INTERACT_SecurityCamera_C_InitializeRotationPreview::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.OnDetectionStateChanged
// 0x00E8 (0x00E8 - 0x0000)
struct INTERACT_SecurityCamera_C_OnDetectionStateChanged final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventLocation;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           DetectionState;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentObjectEventHandle               K2Node_MakeStruct_LatentObjectEventHandle;         // 0x0038(0x0010)(ContainsInstancedReference)
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0068(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_TrySetActorTickEnabled_Result;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TrySetActorTickEnabled_Result_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartAlertTimer_Result;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_2;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityCamera_C_OnDetectionStateChanged) == 0x000008, "Wrong alignment on INTERACT_SecurityCamera_C_OnDetectionStateChanged");
static_assert(sizeof(INTERACT_SecurityCamera_C_OnDetectionStateChanged) == 0x0000E8, "Wrong size on INTERACT_SecurityCamera_C_OnDetectionStateChanged");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, Character) == 0x000000, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, EventLocation) == 0x000008, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, DetectionState) == 0x000014, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::DetectionState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_MakeStruct_LatentObjectEventHandle) == 0x000038, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_MakeStruct_LatentObjectEventHandle' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_MakeArray_Array) == 0x000048, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_MakeArray_Array_1) == 0x000058, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000068, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_TrySetActorTickEnabled_Result) == 0x000098, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_TrySetActorTickEnabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_TrySetActorTickEnabled_Result_1) == 0x000099, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_TrySetActorTickEnabled_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_TryStartAlertTimer_Result) == 0x00009A, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_TryStartAlertTimer_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000A0, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x0000A8, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_GetSocketLocation_ReturnValue) == 0x0000B4, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000C0, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, CallFunc_GetGameInstance_ReturnValue_2) == 0x0000D0, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_AsGI_Single_Player_2) == 0x0000D8, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_AsGI_Single_Player_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityCamera_C_OnDetectionStateChanged, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'INTERACT_SecurityCamera_C_OnDetectionStateChanged::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function INTERACT_SecurityCamera.INTERACT_SecurityCamera_C.UpdateLookDirection
// 0x0140 (0x0140 - 0x0000)
struct INTERACT_SecurityCamera_C_UpdateLookDirection final
{
public:
	float                                         DistanceToPlayerCollision;                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetScanLocation;                                // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetRotateLocation;                              // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APAWN_Hacker_Simple_C*                  PlayerHacker;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEventLocation_EventLocation;           // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLookTargetLocation_LookTargetLocation; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEventWithHighestRating_DetectionEvent; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomScanLocation_Result;             // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_SecurityCamera_C*               K2Node_DynamicCast_AsAnim_BP_Security_Camera;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
