#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Lever

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_UpDown_structs.hpp"
#include "INTERACT_Button_Base_classes.hpp"
#include "ENUM_ButtonColorType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_Lever.INTERACT_Lever_C
// 0x0130 (0x0538 - 0x0408)
class AINTERACT_Lever_C : public AINTERACT_Button_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_Lever_C;                   // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox;                                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ENUM_UpDown                                   State;                                             // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_UpDown                                   StartPosition;                                     // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DurationScale;                                     // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            MoveUpMontage;                                     // 0x0440(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            MoveDownMontage;                                   // 0x0468(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               LeverUpCue;                                        // 0x0490(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               LeverDownCue;                                      // 0x04B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               LeverErrorCue;                                     // 0x04E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   LeverBusyMessage;                                  // 0x0508(0x0018)(Edit, BlueprintVisible)
	class FText                                   DeactivatedMessage;                                // 0x0520(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_INTERACT_Lever(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void UserConstructionScript();
	void InitializeButtonState();
	void UpdateLockLightColor();
	void OnBrokenInteraction(bool* Result);
	void GetSuccessMessage(class FText* Result);
	void UpdateLeverVisibility(bool VisibilityState);
	void OnInteractSuccess(class AActor* SourceActor);
	void UpdateButtonEmissiveStrength(float Scale, float* Strength);
	void GetLeverState(ENUM_UpDown* Result);
	void OnTargetLockStateChanged();
	void GetInteractBusy(bool* Result, class FText* BusyMessage);
	void OnButtonBecameDysfunctional();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_Lever_C">();
	}
	static class AINTERACT_Lever_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_Lever_C>();
	}
};
static_assert(alignof(AINTERACT_Lever_C) == 0x000008, "Wrong alignment on AINTERACT_Lever_C");
static_assert(sizeof(AINTERACT_Lever_C) == 0x000538, "Wrong size on AINTERACT_Lever_C");
static_assert(offsetof(AINTERACT_Lever_C, UberGraphFrame_INTERACT_Lever_C) == 0x000408, "Member 'AINTERACT_Lever_C::UberGraphFrame_INTERACT_Lever_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, COMP_VoxelCullable) == 0x000410, "Member 'AINTERACT_Lever_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, SpotLight) == 0x000418, "Member 'AINTERACT_Lever_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, SkeletalMesh) == 0x000420, "Member 'AINTERACT_Lever_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, ScanBox) == 0x000428, "Member 'AINTERACT_Lever_C::ScanBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, TargetBox) == 0x000430, "Member 'AINTERACT_Lever_C::TargetBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, State) == 0x000438, "Member 'AINTERACT_Lever_C::State' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, StartPosition) == 0x000439, "Member 'AINTERACT_Lever_C::StartPosition' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, DurationScale) == 0x00043C, "Member 'AINTERACT_Lever_C::DurationScale' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, MoveUpMontage) == 0x000440, "Member 'AINTERACT_Lever_C::MoveUpMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, MoveDownMontage) == 0x000468, "Member 'AINTERACT_Lever_C::MoveDownMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, LeverUpCue) == 0x000490, "Member 'AINTERACT_Lever_C::LeverUpCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, LeverDownCue) == 0x0004B8, "Member 'AINTERACT_Lever_C::LeverDownCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, LeverErrorCue) == 0x0004E0, "Member 'AINTERACT_Lever_C::LeverErrorCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, LeverBusyMessage) == 0x000508, "Member 'AINTERACT_Lever_C::LeverBusyMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Lever_C, DeactivatedMessage) == 0x000520, "Member 'AINTERACT_Lever_C::DeactivatedMessage' has a wrong offset!");

}

