#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ScreenCamera

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_DoorState_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.ExecuteUbergraph_INTERACT_ScreenCamera
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera) == 0x000004, "Wrong alignment on INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera");
static_assert(sizeof(INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera) == 0x000008, "Wrong size on INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera");
static_assert(offsetof(INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera, EntryPoint) == 0x000000, "Member 'INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera, K2Node_Event_EndPlayReason) == 0x000004, "Member 'INTERACT_ScreenCamera_C_ExecuteUbergraph_INTERACT_ScreenCamera::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ScreenCamera_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ScreenCamera_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_ReceiveEndPlay");
static_assert(sizeof(INTERACT_ScreenCamera_C_ReceiveEndPlay) == 0x000001, "Wrong size on INTERACT_ScreenCamera_C_ReceiveEndPlay");
static_assert(offsetof(INTERACT_ScreenCamera_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'INTERACT_ScreenCamera_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.InitializeScreenCamera
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_ScreenCamera_C_InitializeScreenCamera final
{
public:
	struct FRandomStream                          RandomStream;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_HashString_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ScreenCamera_C_InitializeScreenCamera) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_InitializeScreenCamera");
static_assert(sizeof(INTERACT_ScreenCamera_C_InitializeScreenCamera) == 0x000028, "Wrong size on INTERACT_ScreenCamera_C_InitializeScreenCamera");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, RandomStream) == 0x000000, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::RandomStream' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_IsAlive_Result) == 0x000008, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_GetDoorState_Result) == 0x000009, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x00000C, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_InitializeScreenCamera, CallFunc_HashString_ReturnValue) == 0x000024, "Member 'INTERACT_ScreenCamera_C_InitializeScreenCamera::CallFunc_HashString_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.RegisterDisplayScreen
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_ScreenCamera_C_RegisterDisplayScreen final
{
public:
	class AINTERACT_Base_C*                       ScreenActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_RegisterDisplayScreen) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_RegisterDisplayScreen");
static_assert(sizeof(INTERACT_ScreenCamera_C_RegisterDisplayScreen) == 0x000018, "Wrong size on INTERACT_ScreenCamera_C_RegisterDisplayScreen");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, ScreenActor) == 0x000000, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::ScreenActor' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, State) == 0x000008, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::State' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_GetDoorState_Result) == 0x00000A, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000B, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_Set_Length_ReturnValue) == 0x00000C, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_RegisterDisplayScreen, CallFunc_Set_Remove_ReturnValue) == 0x000011, "Member 'INTERACT_ScreenCamera_C_RegisterDisplayScreen::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.GetOrCreateRenderTarget
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_ScreenCamera_C_GetOrCreateRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_GetOrCreateRenderTarget) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_GetOrCreateRenderTarget");
static_assert(sizeof(INTERACT_ScreenCamera_C_GetOrCreateRenderTarget) == 0x000018, "Wrong size on INTERACT_ScreenCamera_C_GetOrCreateRenderTarget");
static_assert(offsetof(INTERACT_ScreenCamera_C_GetOrCreateRenderTarget, RenderTarget_0) == 0x000000, "Member 'INTERACT_ScreenCamera_C_GetOrCreateRenderTarget::RenderTarget_0' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_GetOrCreateRenderTarget, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000008, "Member 'INTERACT_ScreenCamera_C_GetOrCreateRenderTarget::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_GetOrCreateRenderTarget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'INTERACT_ScreenCamera_C_GetOrCreateRenderTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.TryDestroyRenderTarget
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ScreenCamera_C_TryDestroyRenderTarget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_TryDestroyRenderTarget) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_TryDestroyRenderTarget");
static_assert(sizeof(INTERACT_ScreenCamera_C_TryDestroyRenderTarget) == 0x000001, "Wrong size on INTERACT_ScreenCamera_C_TryDestroyRenderTarget");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryDestroyRenderTarget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'INTERACT_ScreenCamera_C_TryDestroyRenderTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.UpdateSwivelYaw
// 0x007C (0x007C - 0x0000)
struct INTERACT_ScreenCamera_C_UpdateSwivelYaw final
{
public:
	bool                                          PlaySounds;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasReachedDestination;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTransitionTime;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredYaw;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PatrolCountCompleted;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolRouteElapsedTime;                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolRouteTotalSeconds;                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PatrolRouteOneWaySeconds;                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSentryTurretRelativeYaw_Result;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyByPi_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ScreenCamera_C_UpdateSwivelYaw) == 0x000004, "Wrong alignment on INTERACT_ScreenCamera_C_UpdateSwivelYaw");
static_assert(sizeof(INTERACT_ScreenCamera_C_UpdateSwivelYaw) == 0x00007C, "Wrong size on INTERACT_ScreenCamera_C_UpdateSwivelYaw");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, PlaySounds) == 0x000000, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::PlaySounds' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, HasReachedDestination) == 0x000001, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::HasReachedDestination' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, ElapsedTransitionTime) == 0x000004, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::ElapsedTransitionTime' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, DesiredYaw) == 0x000008, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::DesiredYaw' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, PatrolCountCompleted) == 0x00000C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::PatrolCountCompleted' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, PatrolRouteElapsedTime) == 0x000010, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::PatrolRouteElapsedTime' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, PatrolRouteTotalSeconds) == 0x000014, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::PatrolRouteTotalSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, PatrolRouteOneWaySeconds) == 0x000018, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::PatrolRouteOneWaySeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_GetSentryTurretRelativeYaw_Result) == 0x00001C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_GetSentryTurretRelativeYaw_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000020, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Lerp_ReturnValue) == 0x00002C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000031, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000038, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_MultiplyByPi_ReturnValue) == 0x000048, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_MultiplyByPi_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Cos_ReturnValue) == 0x00004C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000050, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000058, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x000060, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000064, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000068, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_FMax_ReturnValue) == 0x000070, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_FMod_Remainder) == 0x000074, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_UpdateSwivelYaw, CallFunc_FMod_ReturnValue) == 0x000078, "Member 'INTERACT_ScreenCamera_C_UpdateSwivelYaw::CallFunc_FMod_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.HasTickBehaviorWhilePerceptible
// 0x0006 (0x0006 - 0x0000)
struct INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTickBehaviorWhilePerceptible_Result;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible");
static_assert(sizeof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible) == 0x000006, "Wrong size on INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, Result) == 0x000000, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, CallFunc_GetDoorState_Result) == 0x000001, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, CallFunc_HasTickBehaviorWhilePerceptible_Result) == 0x000002, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::CallFunc_HasTickBehaviorWhilePerceptible_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'INTERACT_ScreenCamera_C_HasTickBehaviorWhilePerceptible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.ShouldSaveActor
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_ScreenCamera_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDead_Result;                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          CallFunc_ShouldSaveActor_Params;                   // 0x0028(0x0018)()
	bool                                          CallFunc_ShouldSaveActor_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_ShouldSaveActor) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_ShouldSaveActor");
static_assert(sizeof(INTERACT_ScreenCamera_C_ShouldSaveActor) == 0x000048, "Wrong size on INTERACT_ScreenCamera_C_ShouldSaveActor");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_IsDead_Result) == 0x000019, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_IsDead_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_GetAttribValue_ReturnValue) == 0x00001C, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_GetDoorState_Result) == 0x000020, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_ShouldSaveActor_Params) == 0x000028, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_ShouldSaveActor_Params' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_ShouldSaveActor_ReturnValue) == 0x000040, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_ShouldSaveActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_BooleanOR_ReturnValue) == 0x000041, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_BooleanOR_ReturnValue_1) == 0x000042, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_ShouldSaveActor, CallFunc_BooleanAND_ReturnValue) == 0x000043, "Member 'INTERACT_ScreenCamera_C_ShouldSaveActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.OnTakeDamage
// 0x0040 (0x0040 - 0x0000)
struct INTERACT_ScreenCamera_C_OnTakeDamage final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                UserParams;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnTakeDamage_Result;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryConcealSentryTurret_Result;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_OnTakeDamage) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_OnTakeDamage");
static_assert(sizeof(INTERACT_ScreenCamera_C_OnTakeDamage) == 0x000040, "Wrong size on INTERACT_ScreenCamera_C_OnTakeDamage");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, OtherActor) == 0x000000, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, DamageInstance) == 0x000008, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::DamageInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, UserParams) == 0x000030, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::UserParams' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, Result) == 0x000038, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, CallFunc_OnTakeDamage_Result) == 0x000039, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::CallFunc_OnTakeDamage_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, CallFunc_TryConcealSentryTurret_Result) == 0x00003A, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::CallFunc_TryConcealSentryTurret_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, CallFunc_GetDoorState_Result) == 0x00003B, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTakeDamage, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'INTERACT_ScreenCamera_C_OnTakeDamage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.TickSentryTurret
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_ScreenCamera_C_TickSentryTurret final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ScreenCamera_C_TickSentryTurret) == 0x000004, "Wrong alignment on INTERACT_ScreenCamera_C_TickSentryTurret");
static_assert(sizeof(INTERACT_ScreenCamera_C_TickSentryTurret) == 0x000004, "Wrong size on INTERACT_ScreenCamera_C_TickSentryTurret");
static_assert(offsetof(INTERACT_ScreenCamera_C_TickSentryTurret, DeltaSeconds) == 0x000000, "Member 'INTERACT_ScreenCamera_C_TickSentryTurret::DeltaSeconds' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.OnSentryTurretStartedConcealing
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0018(0x0010)(NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing");
static_assert(sizeof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing) == 0x000028, "Wrong size on INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000008, "Member 'INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000010, "Member 'INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000018, "Member 'INTERACT_ScreenCamera_C_OnSentryTurretStartedConcealing::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.OnSentryTurretFinishedConcealing
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing final
{
public:
	bool                                          CallFunc_IsAlive_Result;                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing");
static_assert(sizeof(INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing) == 0x000001, "Wrong size on INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing, CallFunc_IsAlive_Result) == 0x000000, "Member 'INTERACT_ScreenCamera_C_OnSentryTurretFinishedConcealing::CallFunc_IsAlive_Result' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.TryStartCaptureTimer
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_ScreenCamera_C_TryStartCaptureTimer final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartTickingCaptureComponent_Result;   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_TryStartCaptureTimer) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_TryStartCaptureTimer");
static_assert(sizeof(INTERACT_ScreenCamera_C_TryStartCaptureTimer) == 0x000018, "Wrong size on INTERACT_ScreenCamera_C_TryStartCaptureTimer");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartCaptureTimer, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'INTERACT_ScreenCamera_C_TryStartCaptureTimer::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartCaptureTimer, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'INTERACT_ScreenCamera_C_TryStartCaptureTimer::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartCaptureTimer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_ScreenCamera_C_TryStartCaptureTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartCaptureTimer, CallFunc_TryStartTickingCaptureComponent_Result) == 0x000011, "Member 'INTERACT_ScreenCamera_C_TryStartCaptureTimer::CallFunc_TryStartTickingCaptureComponent_Result' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.TryStopCaptureTimer
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_ScreenCamera_C_TryStopCaptureTimer final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStopTickingCaptureComponent_Result;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_TryStopCaptureTimer) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_TryStopCaptureTimer");
static_assert(sizeof(INTERACT_ScreenCamera_C_TryStopCaptureTimer) == 0x000018, "Wrong size on INTERACT_ScreenCamera_C_TryStopCaptureTimer");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStopCaptureTimer, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'INTERACT_ScreenCamera_C_TryStopCaptureTimer::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStopCaptureTimer, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'INTERACT_ScreenCamera_C_TryStopCaptureTimer::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStopCaptureTimer, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_ScreenCamera_C_TryStopCaptureTimer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStopCaptureTimer, CallFunc_TryStopTickingCaptureComponent_Result) == 0x000011, "Member 'INTERACT_ScreenCamera_C_TryStopCaptureTimer::CallFunc_TryStopTickingCaptureComponent_Result' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.TryStartDeployTimer
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_ScreenCamera_C_TryStartDeployTimer final
{
public:
	bool                                          CallFunc_IsSentryTurretEnabled_Result;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_TryStartDeployTimer) == 0x000008, "Wrong alignment on INTERACT_ScreenCamera_C_TryStartDeployTimer");
static_assert(sizeof(INTERACT_ScreenCamera_C_TryStartDeployTimer) == 0x000028, "Wrong size on INTERACT_ScreenCamera_C_TryStartDeployTimer");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartDeployTimer, CallFunc_IsSentryTurretEnabled_Result) == 0x000000, "Member 'INTERACT_ScreenCamera_C_TryStartDeployTimer::CallFunc_IsSentryTurretEnabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartDeployTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'INTERACT_ScreenCamera_C_TryStartDeployTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartDeployTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'INTERACT_ScreenCamera_C_TryStartDeployTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartDeployTimer, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000020, "Member 'INTERACT_ScreenCamera_C_TryStartDeployTimer::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_TryStartDeployTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'INTERACT_ScreenCamera_C_TryStartDeployTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.EVENT_OnTryDeployScreenCamera
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera final
{
public:
	bool                                          CallFunc_TryDeploySentryTurret_Result;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera");
static_assert(sizeof(INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera) == 0x000002, "Wrong size on INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera");
static_assert(offsetof(INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera, CallFunc_TryDeploySentryTurret_Result) == 0x000000, "Member 'INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera::CallFunc_TryDeploySentryTurret_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'INTERACT_ScreenCamera_C_EVENT_OnTryDeployScreenCamera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.OnMagneticDisableStateChanged
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged final
{
public:
	bool                                          DisableState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSentryTurretRelativeYaw_Result;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged) == 0x000004, "Wrong alignment on INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged");
static_assert(sizeof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged) == 0x000010, "Wrong size on INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged, DisableState) == 0x000000, "Member 'INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged::DisableState' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged, CallFunc_GetSentryTurretRelativeYaw_Result) == 0x000008, "Member 'INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged::CallFunc_GetSentryTurretRelativeYaw_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'INTERACT_ScreenCamera_C_OnMagneticDisableStateChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_ScreenCamera.INTERACT_ScreenCamera_C.OnTickStateChanged
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_ScreenCamera_C_OnTickStateChanged final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ScreenCamera_C_OnTickStateChanged) == 0x000001, "Wrong alignment on INTERACT_ScreenCamera_C_OnTickStateChanged");
static_assert(sizeof(INTERACT_ScreenCamera_C_OnTickStateChanged) == 0x000002, "Wrong size on INTERACT_ScreenCamera_C_OnTickStateChanged");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTickStateChanged, State) == 0x000000, "Member 'INTERACT_ScreenCamera_C_OnTickStateChanged::State' has a wrong offset!");
static_assert(offsetof(INTERACT_ScreenCamera_C_OnTickStateChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'INTERACT_ScreenCamera_C_OnTickStateChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

