#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SecretDoor_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SecretDoor_Base.INTERACT_SecretDoor_Base_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_SecretDoor_Base_C_UserConstructionScript final
{
public:
	bool                                          IsStandardDoor;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecretDoor_Base_C_UserConstructionScript) == 0x000004, "Wrong alignment on INTERACT_SecretDoor_Base_C_UserConstructionScript");
static_assert(sizeof(INTERACT_SecretDoor_Base_C_UserConstructionScript) == 0x000028, "Wrong size on INTERACT_SecretDoor_Base_C_UserConstructionScript");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, IsStandardDoor) == 0x000000, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::IsStandardDoor' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, CallFunc_Vector_Up_ReturnValue) == 0x000004, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, CallFunc_GetForwardVector_ReturnValue) == 0x000010, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, CallFunc_Dot_VectorVector_ReturnValue) == 0x00001C, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x000020, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue) == 0x000024, "Member 'INTERACT_SecretDoor_Base_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_SecretDoor_Base.INTERACT_SecretDoor_Base_C.InteractOnOpening
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_SecretDoor_Base_C_InteractOnOpening final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteBinaryAchievement_Result;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecretDoor_Base_C_InteractOnOpening) == 0x000008, "Wrong alignment on INTERACT_SecretDoor_Base_C_InteractOnOpening");
static_assert(sizeof(INTERACT_SecretDoor_Base_C_InteractOnOpening) == 0x000038, "Wrong size on INTERACT_SecretDoor_Base_C_InteractOnOpening");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, SourceActor) == 0x000000, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000010, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, CallFunc_IsPlayerControlled_ReturnValue) == 0x000019, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecretDoor_Base_C_InteractOnOpening, CallFunc_TryCompleteBinaryAchievement_Result) == 0x000031, "Member 'INTERACT_SecretDoor_Base_C_InteractOnOpening::CallFunc_TryCompleteBinaryAchievement_Result' has a wrong offset!");

}

