#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Cryobed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "INTERACT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_Cryobed.INTERACT_Cryobed_C
// 0x0080 (0x0388 - 0x0308)
class AINTERACT_Cryobed_C : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_Cryobed_C;                 // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointOfInterestComponent_C*            PointOfInterestComponent;                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                CryobedState;                                      // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FullyOpenedDistance;                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnterStateTimestamp;                               // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateChangeDuration;                               // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               StartSoundCue;                                     // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               StopSoundCue;                                      // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_Cryobed(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeCryobed();
	void SetState(ENUM_DoorState NewState);
	void UpdateState();
	void UpdateBedPosition(ENUM_DoorState TargetState, float Progress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_Cryobed_C">();
	}
	static class AINTERACT_Cryobed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_Cryobed_C>();
	}
};
static_assert(alignof(AINTERACT_Cryobed_C) == 0x000008, "Wrong alignment on AINTERACT_Cryobed_C");
static_assert(sizeof(AINTERACT_Cryobed_C) == 0x000388, "Wrong size on AINTERACT_Cryobed_C");
static_assert(offsetof(AINTERACT_Cryobed_C, UberGraphFrame_INTERACT_Cryobed_C) == 0x000308, "Member 'AINTERACT_Cryobed_C::UberGraphFrame_INTERACT_Cryobed_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, PointOfInterestComponent) == 0x000310, "Member 'AINTERACT_Cryobed_C::PointOfInterestComponent' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, COMP_VoxelCullable) == 0x000318, "Member 'AINTERACT_Cryobed_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, StaticMesh) == 0x000320, "Member 'AINTERACT_Cryobed_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, CryobedState) == 0x000328, "Member 'AINTERACT_Cryobed_C::CryobedState' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, FullyOpenedDistance) == 0x00032C, "Member 'AINTERACT_Cryobed_C::FullyOpenedDistance' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, EnterStateTimestamp) == 0x000330, "Member 'AINTERACT_Cryobed_C::EnterStateTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, StateChangeDuration) == 0x000334, "Member 'AINTERACT_Cryobed_C::StateChangeDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, StartSoundCue) == 0x000338, "Member 'AINTERACT_Cryobed_C::StartSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Cryobed_C, StopSoundCue) == 0x000360, "Member 'AINTERACT_Cryobed_C::StopSoundCue' has a wrong offset!");

}

