#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ElevatorDoors_Base

#include "Basic.hpp"

#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.ExecuteUbergraph_INTERACT_ElevatorDoors_Base
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base) == 0x000008, "Wrong size on INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base, EntryPoint) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_ElevatorDoors_Base_C_ExecuteUbergraph_INTERACT_ElevatorDoors_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_BndEvt__INTERACT_ElevatorDoors_Base_COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_UserConstructionScript final
{
public:
	float                                         CallFunc_UpdateEmissiveStrength_Result;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_UserConstructionScript) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_UserConstructionScript");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_UserConstructionScript) == 0x000004, "Wrong size on INTERACT_ElevatorDoors_Base_C_UserConstructionScript");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UserConstructionScript, CallFunc_UpdateEmissiveStrength_Result) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_UserConstructionScript::CallFunc_UpdateEmissiveStrength_Result' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.IsDoorwayFunctional
// 0x000C (0x000C - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional) == 0x00000C, "Wrong size on INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional, Result) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_IsDoorwayFunctional::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.GetElevatorSymbol
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol final
{
public:
	class FName                                   Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol) == 0x000010, "Wrong size on INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol, Result) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol, CallFunc_Array_Get_Item) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_GetElevatorSymbol::CallFunc_Array_Get_Item' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.GetTargetElevator
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_GetTargetElevator final
{
public:
	class AELEVATOR_Base_C*                       Elevator;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_GetTargetElevator) == 0x000008, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_GetTargetElevator");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_GetTargetElevator) == 0x000008, "Wrong size on INTERACT_ElevatorDoors_Base_C_GetTargetElevator");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_GetTargetElevator, Elevator) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_GetTargetElevator::Elevator' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.InitializeElevatorDoor
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor) == 0x000014, "Wrong size on INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_ElevatorDoors_Base_C_InitializeElevatorDoor::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.SetActiveElevator
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_SetActiveElevator final
{
public:
	class AELEVATOR_Base_C*                       Elevator;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_SetActiveElevator) == 0x000008, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_SetActiveElevator");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_SetActiveElevator) == 0x000008, "Wrong size on INTERACT_ElevatorDoors_Base_C_SetActiveElevator");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetActiveElevator, Elevator) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_SetActiveElevator::Elevator' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.SetElevatorDoorsVisible
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible) == 0x000001, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible) == 0x000001, "Wrong size on INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible, VisibilityState) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_SetElevatorDoorsVisible::VisibilityState' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.SetTileCollisionEnabled
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled) == 0x000001, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled) == 0x000002, "Wrong size on INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled, Enable) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled::Enable' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled, Result) == 0x000001, "Member 'INTERACT_ElevatorDoors_Base_C_SetTileCollisionEnabled::Result' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.EVENT_OnDisableAttribChanged
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveScale;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateEmissiveStrength_Result;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged) == 0x000014, "Wrong size on INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged, CurrValue) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged, LastValue) == 0x000004, "Member 'INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged, EmissiveScale) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged::EmissiveScale' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged, CallFunc_UpdateEmissiveStrength_Result) == 0x000010, "Member 'INTERACT_ElevatorDoors_Base_C_EVENT_OnDisableAttribChanged::CallFunc_UpdateEmissiveStrength_Result' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.UpdateEmissiveStrength
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength) == 0x000014, "Wrong size on INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength, Result) == 0x000004, "Member 'INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength, EmissiveStrength) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'INTERACT_ElevatorDoors_Base_C_UpdateEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.TryInteract
// 0x0108 (0x0108 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsDoorwayFunctional_Result;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0040(0x0020)(HasGetValueTypeHash)
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AELEVATOR_Base_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0098(0x0010)(ReferenceParm)
	class AELEVATOR_Base_C*                       CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x00B0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput_1;             // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults_1;            // 0x00E8(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_TryInteract");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_TryInteract) == 0x000108, "Wrong size on INTERACT_ElevatorDoors_Base_C_TryInteract");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_IsDoorwayFunctional_Result) == 0x000038, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_IsDoorwayFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000040, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_TryInteract_self_CastInput) == 0x000060, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000070, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000090, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000091, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_GetAllActorsOfClass_OutActors) == 0x000098, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x0000B0, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_TryInteract_self_CastInput_1) == 0x0000D8, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_TryInteract_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_TryInteract, CallFunc_TryInteract_InteractResults_1) == 0x0000E8, "Member 'INTERACT_ElevatorDoors_Base_C_TryInteract::CallFunc_TryInteract_InteractResults_1' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.ShouldSaveActor
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          CallFunc_ShouldSaveActor_Params;                   // 0x0020(0x0018)()
	bool                                          CallFunc_ShouldSaveActor_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor) == 0x000008, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_ShouldSaveActor");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor) == 0x000048, "Wrong size on INTERACT_ElevatorDoors_Base_C_ShouldSaveActor");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, CallFunc_ShouldSaveActor_Params) == 0x000020, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::CallFunc_ShouldSaveActor_Params' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, CallFunc_ShouldSaveActor_ReturnValue) == 0x000038, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::CallFunc_ShouldSaveActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, CallFunc_GetAttribValue_ReturnValue) == 0x00003C, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_ShouldSaveActor, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'INTERACT_ElevatorDoors_Base_C_ShouldSaveActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.SetInteractPowered
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_SetInteractPowered final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateEmissiveStrength_Result;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered) == 0x000004, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_SetInteractPowered");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered) == 0x000014, "Wrong size on INTERACT_ElevatorDoors_Base_C_SetInteractPowered");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, State) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::State' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, Result) == 0x000001, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, CallFunc_UpdateEmissiveStrength_Result) == 0x00000C, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::CallFunc_UpdateEmissiveStrength_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_SetInteractPowered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'INTERACT_ElevatorDoors_Base_C_SetInteractPowered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function INTERACT_ElevatorDoors_Base.INTERACT_ElevatorDoors_Base_C.CanModifyInteractPower
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower) == 0x000001, "Wrong alignment on INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower");
static_assert(sizeof(INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower) == 0x000001, "Wrong size on INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower");
static_assert(offsetof(INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower, Result) == 0x000000, "Member 'INTERACT_ElevatorDoors_Base_C_CanModifyInteractPower::Result' has a wrong offset!");

}

