#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_RestStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_RestStation.INTERACT_RestStation_C.ExecuteUbergraph_INTERACT_RestStation
// 0x00D8 (0x00D8 - 0x0000)
struct INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryOpenDoorWhileClosing_Result;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation");
static_assert(sizeof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation) == 0x0000D8, "Wrong size on INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, EntryPoint) == 0x000000, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B0, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B8, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C0, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000C8, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, K2Node_Event_DeltaSeconds) == 0x0000CC, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation, CallFunc_TryOpenDoorWhileClosing_Result) == 0x0000D0, "Member 'INTERACT_RestStation_C_ExecuteUbergraph_INTERACT_RestStation::CallFunc_TryOpenDoorWhileClosing_Result' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_RestStation_C_BndEvt__Interact_RestStation_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_RestStation_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RestStation_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_RestStation_C_ReceiveTick");
static_assert(sizeof(INTERACT_RestStation_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_RestStation_C_ReceiveTick");
static_assert(offsetof(INTERACT_RestStation_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_RestStation_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'INTERACT_RestStation_C_BndEvt__MotionSensor_Door_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_RestStation_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RestStation_C_UserConstructionScript) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_UserConstructionScript");
static_assert(sizeof(INTERACT_RestStation_C_UserConstructionScript) == 0x000018, "Wrong size on INTERACT_RestStation_C_UserConstructionScript");
static_assert(offsetof(INTERACT_RestStation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'INTERACT_RestStation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'INTERACT_RestStation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000010, "Member 'INTERACT_RestStation_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.GetTargetShape
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_RestStation_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_GetTargetShape");
static_assert(sizeof(INTERACT_RestStation_C_GetTargetShape) == 0x000018, "Wrong size on INTERACT_RestStation_C_GetTargetShape");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_RestStation_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_RestStation_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'INTERACT_RestStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'INTERACT_RestStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000012, "Member 'INTERACT_RestStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000013, "Member 'INTERACT_RestStation_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.TryInteract
// 0x01A8 (0x01A8 - 0x0000)
struct INTERACT_RestStation_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0038(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0058(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsRestStationFunctional_Result;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0080(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00A0(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00C0(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x00E0(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0100(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_6;        // 0x0120(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_7;        // 0x0140(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_8;        // 0x0168(0x0020)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue_1;        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_TryInteract");
static_assert(sizeof(INTERACT_RestStation_C_TryInteract) == 0x0001A8, "Wrong size on INTERACT_RestStation_C_TryInteract");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_RestStation_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_RestStation_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_RestStation_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_RestStation_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000038, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000058, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_IsRestStationFunctional_Result) == 0x000078, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_IsRestStationFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000079, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000080, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000A0, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000C0, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x0000E0, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000100, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_6) == 0x000120, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_6' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_7) == 0x000140, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_7' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000160, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000161, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_8) == 0x000168, "Member 'INTERACT_RestStation_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_8' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_GetAnimInstance_ReturnValue) == 0x000188, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x000190, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000191, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x000192, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000198, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_IsAnyMontagePlaying_ReturnValue_1) == 0x0001A0, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_IsAnyMontagePlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x0001A1, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001A2, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x0001A3, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryInteract, CallFunc_BooleanOR_ReturnValue) == 0x0001A4, "Member 'INTERACT_RestStation_C_TryInteract::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.InitializeRestStation
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_RestStation_C_InitializeRestStation final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelNavModifierState                        Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelNavModifierState                        Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelNavModifierState                        K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RestStation_C_InitializeRestStation) == 0x000004, "Wrong alignment on INTERACT_RestStation_C_InitializeRestStation");
static_assert(sizeof(INTERACT_RestStation_C_InitializeRestStation) == 0x000010, "Wrong size on INTERACT_RestStation_C_InitializeRestStation");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'INTERACT_RestStation_C_InitializeRestStation::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, Temp_byte_Variable) == 0x000001, "Member 'INTERACT_RestStation_C_InitializeRestStation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'INTERACT_RestStation_C_InitializeRestStation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, Temp_byte_Variable_1) == 0x000003, "Member 'INTERACT_RestStation_C_InitializeRestStation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'INTERACT_RestStation_C_InitializeRestStation::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_RestStation_C_InitializeRestStation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_RestStation_C_InitializeRestStation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, Temp_bool_Variable) == 0x00000D, "Member 'INTERACT_RestStation_C_InitializeRestStation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeRestStation, K2Node_Select_Default) == 0x00000E, "Member 'INTERACT_RestStation_C_InitializeRestStation::K2Node_Select_Default' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_RestStation_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RestStation_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_RestStation_C_InitializeAttributes");
static_assert(sizeof(INTERACT_RestStation_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_RestStation_C_InitializeAttributes");
static_assert(offsetof(INTERACT_RestStation_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_RestStation_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_RestStation_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.InitializeOpenState
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_RestStation_C_InitializeOpenState final
{
public:
	bool                                          OpenState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door_1;           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CloseDoor_Result;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenDoor_Result;                          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_InitializeOpenState) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_InitializeOpenState");
static_assert(sizeof(INTERACT_RestStation_C_InitializeOpenState) == 0x000048, "Wrong size on INTERACT_RestStation_C_InitializeOpenState");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, OpenState) == 0x000000, "Member 'INTERACT_RestStation_C_InitializeOpenState::OpenState' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'INTERACT_RestStation_C_InitializeOpenState::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'INTERACT_RestStation_C_InitializeOpenState::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, K2Node_DynamicCast_AsINTERF_ANIM_Door) == 0x000018, "Member 'INTERACT_RestStation_C_InitializeOpenState::K2Node_DynamicCast_AsINTERF_ANIM_Door' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_RestStation_C_InitializeOpenState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, K2Node_DynamicCast_AsINTERF_ANIM_Door_1) == 0x000030, "Member 'INTERACT_RestStation_C_InitializeOpenState::K2Node_DynamicCast_AsINTERF_ANIM_Door_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'INTERACT_RestStation_C_InitializeOpenState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, CallFunc_CloseDoor_Result) == 0x000041, "Member 'INTERACT_RestStation_C_InitializeOpenState::CallFunc_CloseDoor_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeOpenState, CallFunc_OpenDoor_Result) == 0x000042, "Member 'INTERACT_RestStation_C_InitializeOpenState::CallFunc_OpenDoor_Result' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.InitializeLockedState
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_RestStation_C_InitializeLockedState final
{
public:
	bool                                          LockedState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLocked_Result;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_InitializeLockedState) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_InitializeLockedState");
static_assert(sizeof(INTERACT_RestStation_C_InitializeLockedState) == 0x000028, "Wrong size on INTERACT_RestStation_C_InitializeLockedState");
static_assert(offsetof(INTERACT_RestStation_C_InitializeLockedState, LockedState) == 0x000000, "Member 'INTERACT_RestStation_C_InitializeLockedState::LockedState' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeLockedState, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'INTERACT_RestStation_C_InitializeLockedState::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeLockedState, K2Node_DynamicCast_AsINTERF_ANIM_Door) == 0x000010, "Member 'INTERACT_RestStation_C_InitializeLockedState::K2Node_DynamicCast_AsINTERF_ANIM_Door' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeLockedState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'INTERACT_RestStation_C_InitializeLockedState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeLockedState, CallFunc_SetLocked_Result) == 0x000021, "Member 'INTERACT_RestStation_C_InitializeLockedState::CallFunc_SetLocked_Result' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.InitializeSeatCoverState
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_RestStation_C_InitializeSeatCoverState final
{
public:
	bool                                          SeatCoverState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_RestStation_ToiletSeat_C*       K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_InitializeSeatCoverState) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_InitializeSeatCoverState");
static_assert(sizeof(INTERACT_RestStation_C_InitializeSeatCoverState) == 0x000020, "Wrong size on INTERACT_RestStation_C_InitializeSeatCoverState");
static_assert(offsetof(INTERACT_RestStation_C_InitializeSeatCoverState, SeatCoverState) == 0x000000, "Member 'INTERACT_RestStation_C_InitializeSeatCoverState::SeatCoverState' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeSeatCoverState, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'INTERACT_RestStation_C_InitializeSeatCoverState::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeSeatCoverState, K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat) == 0x000010, "Member 'INTERACT_RestStation_C_InitializeSeatCoverState::K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_InitializeSeatCoverState, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_RestStation_C_InitializeSeatCoverState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.ToggleDoor
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_RestStation_C_ToggleDoor final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_ToggleDoor) == 0x000001, "Wrong alignment on INTERACT_RestStation_C_ToggleDoor");
static_assert(sizeof(INTERACT_RestStation_C_ToggleDoor) == 0x000001, "Wrong size on INTERACT_RestStation_C_ToggleDoor");
static_assert(offsetof(INTERACT_RestStation_C_ToggleDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'INTERACT_RestStation_C_ToggleDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.ToggleSeatCover
// 0x0070 (0x0070 - 0x0000)
struct INTERACT_RestStation_C_ToggleSeatCover final
{
public:
	class UAnimBP_RestStation_ToiletSeat_C*       AnimInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            K2Node_Select_Default;                             // 0x0010(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_RestStation_ToiletSeat_C*       K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_ToggleSeatCover) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_ToggleSeatCover");
static_assert(sizeof(INTERACT_RestStation_C_ToggleSeatCover) == 0x000070, "Wrong size on INTERACT_RestStation_C_ToggleSeatCover");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, AnimInstance) == 0x000000, "Member 'INTERACT_RestStation_C_ToggleSeatCover::AnimInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, Temp_bool_Variable) == 0x000008, "Member 'INTERACT_RestStation_C_ToggleSeatCover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, K2Node_Select_Default) == 0x000010, "Member 'INTERACT_RestStation_C_ToggleSeatCover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000038, "Member 'INTERACT_RestStation_C_ToggleSeatCover::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, K2Node_DynamicCast_AsAnim_Montage) == 0x000040, "Member 'INTERACT_RestStation_C_ToggleSeatCover::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'INTERACT_RestStation_C_ToggleSeatCover::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, CallFunc_Montage_Play_ReturnValue) == 0x00004C, "Member 'INTERACT_RestStation_C_ToggleSeatCover::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'INTERACT_RestStation_C_ToggleSeatCover::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, CallFunc_GetAnimInstance_ReturnValue) == 0x000058, "Member 'INTERACT_RestStation_C_ToggleSeatCover::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat) == 0x000060, "Member 'INTERACT_RestStation_C_ToggleSeatCover::K2Node_DynamicCast_AsAnim_BP_Rest_Station_Toilet_Seat' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_ToggleSeatCover, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'INTERACT_RestStation_C_ToggleSeatCover::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function INTERACT_RestStation.INTERACT_RestStation_C.TryStartAutoCloseTimer
// 0x0058 (0x0058 - 0x0000)
struct INTERACT_RestStation_C_TryStartAutoCloseTimer final
{
public:
	bool                                          CallFunc_IsRestStationFunctional_Result;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RestStation_C_TryStartAutoCloseTimer) == 0x000008, "Wrong alignment on INTERACT_RestStation_C_TryStartAutoCloseTimer");
static_assert(sizeof(INTERACT_RestStation_C_TryStartAutoCloseTimer) == 0x000058, "Wrong size on INTERACT_RestStation_C_TryStartAutoCloseTimer");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_IsRestStationFunctional_Result) == 0x000000, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_IsRestStationFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, Temp_object_Variable) == 0x000008, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_ComponentOverlapActors_OutActors) == 0x000020, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_ComponentOverlapActors_ReturnValue) == 0x000030, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_ComponentOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_RestStation_C_TryStartAutoCloseTimer, CallFunc_Not_PreBool_ReturnValue_1) == 0x000044, "Member 'INTERACT_RestStation_C_TryStartAutoCloseTimer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
