#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_CoffeeMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_CoffeeMachine.INTERACT_CoffeeMachine_C
// 0x0028 (0x0330 - 0x0308)
class AINTERACT_CoffeeMachine_C final : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_CoffeeMachine_C;           // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointOfInterestComponent_C*            PointOfInterestComponent;                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGoldVersion;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_INTERACT_CoffeeMachine(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeCoffeeMachine();
	void UpdateEmissiveStrength(float Scale);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_CoffeeMachine_C">();
	}
	static class AINTERACT_CoffeeMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_CoffeeMachine_C>();
	}
};
static_assert(alignof(AINTERACT_CoffeeMachine_C) == 0x000008, "Wrong alignment on AINTERACT_CoffeeMachine_C");
static_assert(sizeof(AINTERACT_CoffeeMachine_C) == 0x000330, "Wrong size on AINTERACT_CoffeeMachine_C");
static_assert(offsetof(AINTERACT_CoffeeMachine_C, UberGraphFrame_INTERACT_CoffeeMachine_C) == 0x000308, "Member 'AINTERACT_CoffeeMachine_C::UberGraphFrame_INTERACT_CoffeeMachine_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_CoffeeMachine_C, COMP_AttribManager) == 0x000310, "Member 'AINTERACT_CoffeeMachine_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_CoffeeMachine_C, PointOfInterestComponent) == 0x000318, "Member 'AINTERACT_CoffeeMachine_C::PointOfInterestComponent' has a wrong offset!");
static_assert(offsetof(AINTERACT_CoffeeMachine_C, StaticMesh) == 0x000320, "Member 'AINTERACT_CoffeeMachine_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_CoffeeMachine_C, IsGoldVersion) == 0x000328, "Member 'AINTERACT_CoffeeMachine_C::IsGoldVersion' has a wrong offset!");

}

