#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_GroveTram

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_InnerOuter_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "STRUC_ElevatorInfo_structs.hpp"
#include "STRUCT_LevelInfo_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.UpdateEmissiveStrength
// 0x000C (0x000C - 0x0000)
struct INTERACT_GroveTram_C_UpdateEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_GroveTram_C_UpdateEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_GroveTram_C_UpdateEmissiveStrength");
static_assert(sizeof(INTERACT_GroveTram_C_UpdateEmissiveStrength) == 0x00000C, "Wrong size on INTERACT_GroveTram_C_UpdateEmissiveStrength");
static_assert(offsetof(INTERACT_GroveTram_C_UpdateEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_GroveTram_C_UpdateEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_UpdateEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'INTERACT_GroveTram_C_UpdateEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_UpdateEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'INTERACT_GroveTram_C_UpdateEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.GetMoveDirectionVector
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_GroveTram_C_GetMoveDirectionVector final
{
public:
	class FName                                   TargetLevel_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDeckSymbolByLevelName_DeckSymbol;      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue_1;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_GroveTram_C_GetMoveDirectionVector) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_GetMoveDirectionVector");
static_assert(sizeof(INTERACT_GroveTram_C_GetMoveDirectionVector) == 0x000088, "Wrong size on INTERACT_GroveTram_C_GetMoveDirectionVector");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, TargetLevel_0) == 0x000000, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::TargetLevel_0' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, Direction) == 0x000008, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::Direction' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, Temp_bool_Variable) == 0x000014, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, Temp_int_Variable) == 0x000018, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, Temp_int_Variable_1) == 0x00001C, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, Temp_bool_Variable_1) == 0x000020, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_GetActorRightVector_ReturnValue) == 0x000024, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_GetDeckSymbolByLevelName_DeckSymbol) == 0x000030, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_GetDeckSymbolByLevelName_DeckSymbol' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Multiply_VectorInt_ReturnValue) == 0x000040, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Len_ReturnValue) == 0x00004C, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Dot_VectorVector_ReturnValue) == 0x000060, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, K2Node_Select_Default) == 0x000068, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, K2Node_Select_Default_1) == 0x00006C, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetMoveDirectionVector, CallFunc_Multiply_VectorInt_ReturnValue_1) == 0x000078, "Member 'INTERACT_GroveTram_C_GetMoveDirectionVector::CallFunc_Multiply_VectorInt_ReturnValue_1' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.TryOpenElevatorDoors
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_GroveTram_C_TryOpenElevatorDoors final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryOpenElevatorDoors_Result;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_GroveTram_DoorExterior_C*     K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_GroveTram_C_TryOpenElevatorDoors) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_TryOpenElevatorDoors");
static_assert(sizeof(INTERACT_GroveTram_C_TryOpenElevatorDoors) == 0x000020, "Wrong size on INTERACT_GroveTram_C_TryOpenElevatorDoors");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, Force) == 0x000000, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::Force' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, Result) == 0x000001, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, CallFunc_TryOpenElevatorDoors_Result) == 0x000002, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::CallFunc_TryOpenElevatorDoors_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior) == 0x000010, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_TryOpenElevatorDoors, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_GroveTram_C_TryOpenElevatorDoors::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.SetDoorState
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_GroveTram_C_SetDoorState final
{
public:
	ENUM_InnerOuter                               Target;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_GroveTram_DoorExterior_C*     GroveExteriorActor;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                CallFunc_GetTargetDoorState_State;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_GroveTram_DoorExterior_C*     K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetTargetDoorState_State_1;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_GroveTram_C_SetDoorState) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_SetDoorState");
static_assert(sizeof(INTERACT_GroveTram_C_SetDoorState) == 0x000038, "Wrong size on INTERACT_GroveTram_C_SetDoorState");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, Target) == 0x000000, "Member 'INTERACT_GroveTram_C_SetDoorState::Target' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, NewState) == 0x000001, "Member 'INTERACT_GroveTram_C_SetDoorState::NewState' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, GroveExteriorActor) == 0x000008, "Member 'INTERACT_GroveTram_C_SetDoorState::GroveExteriorActor' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, CallFunc_GetTargetDoorState_State) == 0x000010, "Member 'INTERACT_GroveTram_C_SetDoorState::CallFunc_GetTargetDoorState_State' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'INTERACT_GroveTram_C_SetDoorState::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'INTERACT_GroveTram_C_SetDoorState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior) == 0x000028, "Member 'INTERACT_GroveTram_C_SetDoorState::K2Node_DynamicCast_AsINTERACT_Grove_Tram_Door_Exterior' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'INTERACT_GroveTram_C_SetDoorState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, CallFunc_GetTargetDoorState_State_1) == 0x000031, "Member 'INTERACT_GroveTram_C_SetDoorState::CallFunc_GetTargetDoorState_State_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, K2Node_SwitchEnum_CmpSuccess) == 0x000032, "Member 'INTERACT_GroveTram_C_SetDoorState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_SetDoorState, K2Node_SwitchEnum_CmpSuccess_1) == 0x000033, "Member 'INTERACT_GroveTram_C_SetDoorState::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.GetControlsMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_GroveTram_C_GetControlsMeshComponent final
{
public:
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_GroveTram_C_GetControlsMeshComponent) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_GetControlsMeshComponent");
static_assert(sizeof(INTERACT_GroveTram_C_GetControlsMeshComponent) == 0x000008, "Wrong size on INTERACT_GroveTram_C_GetControlsMeshComponent");
static_assert(offsetof(INTERACT_GroveTram_C_GetControlsMeshComponent, MeshComponent) == 0x000000, "Member 'INTERACT_GroveTram_C_GetControlsMeshComponent::MeshComponent' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.GetGroveLevelIndexByDeckSymbol
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol final
{
public:
	class FString                                 DeckSymbol;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol");
static_assert(sizeof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol) == 0x000018, "Wrong size on INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol");
static_assert(offsetof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol, DeckSymbol) == 0x000000, "Member 'INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol::DeckSymbol' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol, Result) == 0x000010, "Member 'INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000014, "Member 'INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000015, "Member 'INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000016, "Member 'INTERACT_GroveTram_C_GetGroveLevelIndexByDeckSymbol::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");

// Function INTERACT_GroveTram.INTERACT_GroveTram_C.InitializeElevatorControls
// 0x01A8 (0x01A8 - 0x0000)
struct INTERACT_GroveTram_C_InitializeElevatorControls final
{
public:
	class FString                                 DeckSymbol;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUC_ElevatorInfo                    ElevatorInfo;                                      // 0x0018(0x0038)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLevelNameByDeckSymbol_LevelName;       // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGroveLevelIndexByDeckSymbol_Result;    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LevelInfo                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x00C8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_1;                               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSTRUC_ElevatorInfo                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0168(0x0038)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_GroveTram_C_InitializeElevatorControls) == 0x000008, "Wrong alignment on INTERACT_GroveTram_C_InitializeElevatorControls");
static_assert(sizeof(INTERACT_GroveTram_C_InitializeElevatorControls) == 0x0001A8, "Wrong size on INTERACT_GroveTram_C_InitializeElevatorControls");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, DeckSymbol) == 0x000000, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::DeckSymbol' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, ButtonIndex) == 0x000010, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::ButtonIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, ElevatorInfo) == 0x000018, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::ElevatorInfo' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, Temp_int_Variable) == 0x000050, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetLevelNameByDeckSymbol_LevelName) == 0x00005C, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetLevelNameByDeckSymbol_LevelName' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetGroveLevelIndexByDeckSymbol_Result) == 0x000064, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetGroveLevelIndexByDeckSymbol_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000130, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000134, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_Add_IntInt_ReturnValue_1) == 0x000138, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, K2Node_MakeArray_Array) == 0x000140, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, Temp_int_Variable_1) == 0x000150, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, K2Node_Select_Default) == 0x000158, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000168, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(INTERACT_GroveTram_C_InitializeElevatorControls, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001A0, "Member 'INTERACT_GroveTram_C_InitializeElevatorControls::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

}

