#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_CapsuleDoor

#include "Basic.hpp"

#include "INTERACT_DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_CapsuleDoor.INTERACT_CapsuleDoor_C
// 0x0030 (0x0688 - 0x0658)
class AINTERACT_CapsuleDoor_C final : public AINTERACT_DoorBase_C
{
public:
	class UBoxComponent*                          TileCollision_Right;                               // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCollision_Left;                                // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCollision_Upper;                               // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCollision_Lower;                               // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Back;                                    // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Front;                                   // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_CapsuleDoor_C">();
	}
	static class AINTERACT_CapsuleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_CapsuleDoor_C>();
	}
};
static_assert(alignof(AINTERACT_CapsuleDoor_C) == 0x000008, "Wrong alignment on AINTERACT_CapsuleDoor_C");
static_assert(sizeof(AINTERACT_CapsuleDoor_C) == 0x000688, "Wrong size on AINTERACT_CapsuleDoor_C");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TileCollision_Right) == 0x000658, "Member 'AINTERACT_CapsuleDoor_C::TileCollision_Right' has a wrong offset!");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TileCollision_Left) == 0x000660, "Member 'AINTERACT_CapsuleDoor_C::TileCollision_Left' has a wrong offset!");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TileCollision_Upper) == 0x000668, "Member 'AINTERACT_CapsuleDoor_C::TileCollision_Upper' has a wrong offset!");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TileCollision_Lower) == 0x000670, "Member 'AINTERACT_CapsuleDoor_C::TileCollision_Lower' has a wrong offset!");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TargetBox_Back) == 0x000678, "Member 'AINTERACT_CapsuleDoor_C::TargetBox_Back' has a wrong offset!");
static_assert(offsetof(AINTERACT_CapsuleDoor_C, TargetBox_Front) == 0x000680, "Member 'AINTERACT_CapsuleDoor_C::TargetBox_Front' has a wrong offset!");

}

