#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_DisplayItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERF_DisplayItem.INTERF_DisplayItem_C.GetDisplayProperties
// 0x0018 (0x0018 - 0x0000)
struct INTERF_DisplayItem_C_GetDisplayProperties final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimInstanceClass;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_DisplayItem_C_GetDisplayProperties) == 0x000008, "Wrong alignment on INTERF_DisplayItem_C_GetDisplayProperties");
static_assert(sizeof(INTERF_DisplayItem_C_GetDisplayProperties) == 0x000018, "Wrong size on INTERF_DisplayItem_C_GetDisplayProperties");
static_assert(offsetof(INTERF_DisplayItem_C_GetDisplayProperties, SkeletalMesh) == 0x000000, "Member 'INTERF_DisplayItem_C_GetDisplayProperties::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(INTERF_DisplayItem_C_GetDisplayProperties, AnimInstanceClass) == 0x000008, "Member 'INTERF_DisplayItem_C_GetDisplayProperties::AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(INTERF_DisplayItem_C_GetDisplayProperties, OverrideMaterial) == 0x000010, "Member 'INTERF_DisplayItem_C_GetDisplayProperties::OverrideMaterial' has a wrong offset!");

// Function INTERF_DisplayItem.INTERF_DisplayItem_C.ReceiveAnimationMessage
// 0x0018 (0x0018 - 0x0000)
struct INTERF_DisplayItem_C_ReceiveAnimationMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_DisplayItem_C_ReceiveAnimationMessage) == 0x000008, "Wrong alignment on INTERF_DisplayItem_C_ReceiveAnimationMessage");
static_assert(sizeof(INTERF_DisplayItem_C_ReceiveAnimationMessage) == 0x000018, "Wrong size on INTERF_DisplayItem_C_ReceiveAnimationMessage");
static_assert(offsetof(INTERF_DisplayItem_C_ReceiveAnimationMessage, Message) == 0x000000, "Member 'INTERF_DisplayItem_C_ReceiveAnimationMessage::Message' has a wrong offset!");
static_assert(offsetof(INTERF_DisplayItem_C_ReceiveAnimationMessage, Result) == 0x000010, "Member 'INTERF_DisplayItem_C_ReceiveAnimationMessage::Result' has a wrong offset!");

}

