#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Button_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.ExecuteUbergraph_INTERACT_Button_Base
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base) == 0x000004, "Wrong alignment on INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base");
static_assert(sizeof(INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base) == 0x000004, "Wrong size on INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base");
static_assert(offsetof(INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base, EntryPoint) == 0x000000, "Member 'INTERACT_Button_Base_C_ExecuteUbergraph_INTERACT_Button_Base::EntryPoint' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Button_Base_C_UserConstructionScript final
{
public:
	float                                         CallFunc_UpdateButtonEmissiveStrength_Strength;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_Base_C_UserConstructionScript) == 0x000004, "Wrong alignment on INTERACT_Button_Base_C_UserConstructionScript");
static_assert(sizeof(INTERACT_Button_Base_C_UserConstructionScript) == 0x000004, "Wrong size on INTERACT_Button_Base_C_UserConstructionScript");
static_assert(offsetof(INTERACT_Button_Base_C_UserConstructionScript, CallFunc_UpdateButtonEmissiveStrength_Strength) == 0x000000, "Member 'INTERACT_Button_Base_C_UserConstructionScript::CallFunc_UpdateButtonEmissiveStrength_Strength' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.OnInteractSuccess
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Button_Base_C_OnInteractSuccess final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnlockSpecifiedInteracts_Result;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_OnInteractSuccess) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_OnInteractSuccess");
static_assert(sizeof(INTERACT_Button_Base_C_OnInteractSuccess) == 0x000010, "Wrong size on INTERACT_Button_Base_C_OnInteractSuccess");
static_assert(offsetof(INTERACT_Button_Base_C_OnInteractSuccess, SourceActor) == 0x000000, "Member 'INTERACT_Button_Base_C_OnInteractSuccess::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnInteractSuccess, CallFunc_UnlockSpecifiedInteracts_Result) == 0x000008, "Member 'INTERACT_Button_Base_C_OnInteractSuccess::CallFunc_UnlockSpecifiedInteracts_Result' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.OnBrokenInteraction
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Button_Base_C_OnBrokenInteraction final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_OnBrokenInteraction) == 0x000001, "Wrong alignment on INTERACT_Button_Base_C_OnBrokenInteraction");
static_assert(sizeof(INTERACT_Button_Base_C_OnBrokenInteraction) == 0x000001, "Wrong size on INTERACT_Button_Base_C_OnBrokenInteraction");
static_assert(offsetof(INTERACT_Button_Base_C_OnBrokenInteraction, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_OnBrokenInteraction::Result' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.InitializeButtonState
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Button_Base_C_InitializeButtonState final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithTargetInteractables_Result; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanInteractWithTargetInteractables_FailMessage; // 0x0010(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsButtonFunctional_Result;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_InitializeButtonState) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_InitializeButtonState");
static_assert(sizeof(INTERACT_Button_Base_C_InitializeButtonState) == 0x000048, "Wrong size on INTERACT_Button_Base_C_InitializeButtonState");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, Temp_int_Array_Index_Variable) == 0x000000, "Member 'INTERACT_Button_Base_C_InitializeButtonState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'INTERACT_Button_Base_C_InitializeButtonState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_CanInteractWithTargetInteractables_Result) == 0x00000C, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_CanInteractWithTargetInteractables_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_CanInteractWithTargetInteractables_FailMessage) == 0x000010, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_CanInteractWithTargetInteractables_FailMessage' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_IsButtonFunctional_Result) == 0x000029, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_IsButtonFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_Array_Get_Item) == 0x000030, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeButtonState, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'INTERACT_Button_Base_C_InitializeButtonState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.IsButtonFunctional
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Button_Base_C_IsButtonFunctional final
{
public:
	bool                                          CheckPower;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonPoweredOn_Result;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractableFunctional_Result;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractableFunctional_Result_1;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractableFunctional_Result_2;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_IsButtonFunctional) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_IsButtonFunctional");
static_assert(sizeof(INTERACT_Button_Base_C_IsButtonFunctional) == 0x000050, "Wrong size on INTERACT_Button_Base_C_IsButtonFunctional");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CheckPower) == 0x000000, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CheckPower' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, Result) == 0x000001, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_IsButtonPoweredOn_Result) == 0x000014, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_IsButtonPoweredOn_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Array_Get_Item) == 0x000020, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_IsInteractableFunctional_Result) == 0x00002C, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_IsInteractableFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_IsInteractableFunctional_Result_1) == 0x000044, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_IsInteractableFunctional_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Less_IntInt_ReturnValue_1) == 0x000045, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_IsInteractableFunctional_Result_2) == 0x000046, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_IsInteractableFunctional_Result_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonFunctional, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'INTERACT_Button_Base_C_IsButtonFunctional::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.IsButtonPoweredOn
// 0x000C (0x000C - 0x0000)
struct INTERACT_Button_Base_C_IsButtonPoweredOn final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_IsButtonPoweredOn) == 0x000004, "Wrong alignment on INTERACT_Button_Base_C_IsButtonPoweredOn");
static_assert(sizeof(INTERACT_Button_Base_C_IsButtonPoweredOn) == 0x00000C, "Wrong size on INTERACT_Button_Base_C_IsButtonPoweredOn");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonPoweredOn, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_IsButtonPoweredOn::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonPoweredOn, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_Button_Base_C_IsButtonPoweredOn::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsButtonPoweredOn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Button_Base_C_IsButtonPoweredOn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.HasButtonBeenActivated
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Button_Base_C_HasButtonBeenActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_HasButtonBeenActivated) == 0x000001, "Wrong alignment on INTERACT_Button_Base_C_HasButtonBeenActivated");
static_assert(sizeof(INTERACT_Button_Base_C_HasButtonBeenActivated) == 0x000001, "Wrong size on INTERACT_Button_Base_C_HasButtonBeenActivated");
static_assert(offsetof(INTERACT_Button_Base_C_HasButtonBeenActivated, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_HasButtonBeenActivated::Result' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.IsEveryTargetInteractUnlocked
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked) == 0x000001, "Wrong alignment on INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked");
static_assert(sizeof(INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked) == 0x000001, "Wrong size on INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked");
static_assert(offsetof(INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_IsEveryTargetInteractUnlocked::Result' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.GetSuccessMessage
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Button_Base_C_GetSuccessMessage final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERACT_Button_Base_C_GetSuccessMessage) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_GetSuccessMessage");
static_assert(sizeof(INTERACT_Button_Base_C_GetSuccessMessage) == 0x000018, "Wrong size on INTERACT_Button_Base_C_GetSuccessMessage");
static_assert(offsetof(INTERACT_Button_Base_C_GetSuccessMessage, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_GetSuccessMessage::Result' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.OnLockedInteraction
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_Button_Base_C_OnLockedInteraction final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0030(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_Base_C_OnLockedInteraction) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_OnLockedInteraction");
static_assert(sizeof(INTERACT_Button_Base_C_OnLockedInteraction) == 0x000060, "Wrong size on INTERACT_Button_Base_C_OnLockedInteraction");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, CallFunc_TryInteract_self_CastInput) == 0x000020, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, CallFunc_TryInteract_InteractResults) == 0x000030, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_OnLockedInteraction, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000054, "Member 'INTERACT_Button_Base_C_OnLockedInteraction::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_Button_Base_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_Base_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_Button_Base_C_InitializeAttributes");
static_assert(sizeof(INTERACT_Button_Base_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_Button_Base_C_InitializeAttributes");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Button_Base_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_Button_Base_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.UnlockSpecifiedInteracts
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Button_Base_C_UnlockSpecifiedInteracts final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Unlocked;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_SetInteractLocked_self_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInteractLocked_Result;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_UnlockSpecifiedInteracts");
static_assert(sizeof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts) == 0x000038, "Wrong size on INTERACT_Button_Base_C_UnlockSpecifiedInteracts");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, Unlocked) == 0x000001, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::Unlocked' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, Temp_int_Array_Index_Variable) == 0x000004, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_Array_Get_Item) == 0x000010, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_SetInteractLocked_self_CastInput) == 0x000020, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_SetInteractLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_SetInteractLocked_Result) == 0x000030, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_SetInteractLocked_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UnlockSpecifiedInteracts, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'INTERACT_Button_Base_C_UnlockSpecifiedInteracts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.UpdateButtonEmissiveStrength
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Button_Base_C_UpdateButtonEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 MeshComponents;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	float                                         EmissiveStrength;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_UpdateButtonEmissiveStrength");
static_assert(sizeof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength) == 0x000050, "Wrong size on INTERACT_Button_Base_C_UpdateButtonEmissiveStrength");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, Strength) == 0x000004, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::Strength' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, MeshComponents) == 0x000008, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::MeshComponents' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, EmissiveStrength) == 0x000018, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Array_Get_Item) == 0x000028, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000048, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateButtonEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'INTERACT_Button_Base_C_UpdateButtonEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.UpdateTargetGameEventStates
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_Button_Base_C_UpdateTargetGameEventStates final
{
public:
	bool                                          NewQuestState;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    GameEventHandle;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_UpdateTargetGameEventStates) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_UpdateTargetGameEventStates");
static_assert(sizeof(INTERACT_Button_Base_C_UpdateTargetGameEventStates) == 0x000060, "Wrong size on INTERACT_Button_Base_C_UpdateTargetGameEventStates");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, NewQuestState) == 0x000000, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::NewQuestState' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, GameEventHandle) == 0x000008, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::GameEventHandle' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, GameInstance) == 0x000018, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, Temp_int_Array_Index_Variable) == 0x000020, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, CallFunc_GetGameInstance_ReturnValue) == 0x000030, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, K2Node_DynamicCast_AsGI_Single_Player) == 0x000038, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, CallFunc_Array_Get_Item) == 0x000048, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_UpdateTargetGameEventStates, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'INTERACT_Button_Base_C_UpdateTargetGameEventStates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.EVENT_OnTargetLockStateChanged
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged final
{
public:
	class AINTERACT_Base_C*                       Interact;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithTargetInteractables_Result; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanInteractWithTargetInteractables_FailMessage; // 0x0010(0x0018)()
};
static_assert(alignof(INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged");
static_assert(sizeof(INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged) == 0x000028, "Wrong size on INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged");
static_assert(offsetof(INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged, Interact) == 0x000000, "Member 'INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged::Interact' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged, CallFunc_CanInteractWithTargetInteractables_Result) == 0x000008, "Member 'INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged::CallFunc_CanInteractWithTargetInteractables_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged, CallFunc_CanInteractWithTargetInteractables_FailMessage) == 0x000010, "Member 'INTERACT_Button_Base_C_EVENT_OnTargetLockStateChanged::CallFunc_CanInteractWithTargetInteractables_FailMessage' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.GetAlreadyActivatedMessage
// 0x0040 (0x0040 - 0x0000)
struct INTERACT_Button_Base_C_GetAlreadyActivatedMessage final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	ENUM_InteractionType                          BestInteractType;                                  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0020(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_GetAlreadyActivatedMessage");
static_assert(sizeof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage) == 0x000040, "Wrong size on INTERACT_Button_Base_C_GetAlreadyActivatedMessage");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, Result) == 0x000000, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, BestInteractType) == 0x000018, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::BestInteractType' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, Temp_byte_Variable) == 0x000019, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, K2Node_Select_Default) == 0x000020, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_GetAlreadyActivatedMessage, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'INTERACT_Button_Base_C_GetAlreadyActivatedMessage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.IsInteractableFunctional
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Button_Base_C_IsInteractableFunctional final
{
public:
	class AINTERACT_Base_C*                       Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_GetInteractDestroyed_self_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInteractDestroyed_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_IsInteractableFunctional) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_IsInteractableFunctional");
static_assert(sizeof(INTERACT_Button_Base_C_IsInteractableFunctional) == 0x000028, "Wrong size on INTERACT_Button_Base_C_IsInteractableFunctional");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, Interactable) == 0x000000, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::Interactable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, Result) == 0x000008, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, CallFunc_GetInteractDestroyed_self_CastInput) == 0x000010, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::CallFunc_GetInteractDestroyed_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, CallFunc_GetInteractDestroyed_Result) == 0x000020, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::CallFunc_GetInteractDestroyed_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_IsInteractableFunctional, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'INTERACT_Button_Base_C_IsInteractableFunctional::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_Button_Base.INTERACT_Button_Base_C.CanInteractWithTargetInteractables
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_Button_Base_C_CanInteractWithTargetInteractables final
{
public:
	bool                                          CheckBusy;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FailMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithInteractable_Result;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanInteractWithInteractable_FailMessage;  // 0x0030(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteractWithInteractable_Result_1;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanInteractWithInteractable_FailMessage_1; // 0x0060(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables) == 0x000008, "Wrong alignment on INTERACT_Button_Base_C_CanInteractWithTargetInteractables");
static_assert(sizeof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables) == 0x000088, "Wrong size on INTERACT_Button_Base_C_CanInteractWithTargetInteractables");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, CheckBusy) == 0x000000, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::CheckBusy' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, Result) == 0x000001, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, FailMessage) == 0x000008, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::FailMessage' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, Temp_int_Array_Index_Variable) == 0x000020, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, CallFunc_CanInteractWithInteractable_Result) == 0x000028, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::CallFunc_CanInteractWithInteractable_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, CallFunc_CanInteractWithInteractable_FailMessage) == 0x000030, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::CallFunc_CanInteractWithInteractable_FailMessage' has a wrong offset!");
static_assert(offsetof(INTERACT_Button_Base_C_CanInteractWithTargetInteractables, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'INTERACT_Button_Base_C_CanInteractWithTargetInteractables::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
