#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Keypad

#include "Basic.hpp"

#include "STRUCT_MissionDifficultySettings_structs.hpp"
#include "Engine_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "STRUCT_KeycodeSettings_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Keypad.INTERACT_Keypad_C.ExecuteUbergraph_INTERACT_Keypad
// 0x000C (0x000C - 0x0000)
struct INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad");
static_assert(sizeof(INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad) == 0x00000C, "Wrong size on INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad");
static_assert(offsetof(INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad, EntryPoint) == 0x000000, "Member 'INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad, K2Node_ComponentBoundEvent_bVisibleState) == 0x000008, "Member 'INTERACT_Keypad_C_ExecuteUbergraph_INTERACT_Keypad::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_Keypad_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Keypad_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_ReceiveTick");
static_assert(sizeof(INTERACT_Keypad_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_Keypad_C_ReceiveTick");
static_assert(offsetof(INTERACT_Keypad_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_Keypad_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.IsKeypadFunctional
// 0x000C (0x000C - 0x0000)
struct INTERACT_Keypad_C_IsKeypadFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_IsKeypadFunctional) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_IsKeypadFunctional");
static_assert(sizeof(INTERACT_Keypad_C_IsKeypadFunctional) == 0x00000C, "Wrong size on INTERACT_Keypad_C_IsKeypadFunctional");
static_assert(offsetof(INTERACT_Keypad_C_IsKeypadFunctional, Result) == 0x000000, "Member 'INTERACT_Keypad_C_IsKeypadFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_IsKeypadFunctional, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_Keypad_C_IsKeypadFunctional::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_IsKeypadFunctional, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Keypad_C_IsKeypadFunctional::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.GetScreenMesh
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Keypad_C_GetScreenMesh final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_GetScreenMesh) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_GetScreenMesh");
static_assert(sizeof(INTERACT_Keypad_C_GetScreenMesh) == 0x000008, "Wrong size on INTERACT_Keypad_C_GetScreenMesh");
static_assert(offsetof(INTERACT_Keypad_C_GetScreenMesh, MeshComponent) == 0x000000, "Member 'INTERACT_Keypad_C_GetScreenMesh::MeshComponent' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.GetTargetDigitCount
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Keypad_C_GetTargetDigitCount final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Log_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_GetTargetDigitCount) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_GetTargetDigitCount");
static_assert(sizeof(INTERACT_Keypad_C_GetTargetDigitCount) == 0x000018, "Wrong size on INTERACT_Keypad_C_GetTargetDigitCount");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, Result) == 0x000000, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, CallFunc_Log_ReturnValue) == 0x000008, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::CallFunc_Log_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetTargetDigitCount, CallFunc_Max_ReturnValue) == 0x000014, "Member 'INTERACT_Keypad_C_GetTargetDigitCount::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.GetKeyFromBoxComponent
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Keypad_C_GetKeyFromBoxComponent final
{
public:
	class UBoxComponent*                          BoxCollision;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_GetKeyFromBoxComponent) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_GetKeyFromBoxComponent");
static_assert(sizeof(INTERACT_Keypad_C_GetKeyFromBoxComponent) == 0x000028, "Wrong size on INTERACT_Keypad_C_GetKeyFromBoxComponent");
static_assert(offsetof(INTERACT_Keypad_C_GetKeyFromBoxComponent, BoxCollision) == 0x000000, "Member 'INTERACT_Keypad_C_GetKeyFromBoxComponent::BoxCollision' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetKeyFromBoxComponent, Result) == 0x000008, "Member 'INTERACT_Keypad_C_GetKeyFromBoxComponent::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetKeyFromBoxComponent, K2Node_MakeArray_Array) == 0x000010, "Member 'INTERACT_Keypad_C_GetKeyFromBoxComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_GetKeyFromBoxComponent, CallFunc_Array_Find_ReturnValue) == 0x000020, "Member 'INTERACT_Keypad_C_GetKeyFromBoxComponent::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.InitializeKeypad
// 0x0058 (0x0058 - 0x0000)
struct INTERACT_Keypad_C_InitializeKeypad final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUniqueRandomKeycode_Keycode;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MissionDifficultySettings      CallFunc_GetMissionDifficultySettings_Settings;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_KeycodeSettings                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_InitializeKeypad) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_InitializeKeypad");
static_assert(sizeof(INTERACT_Keypad_C_InitializeKeypad) == 0x000058, "Wrong size on INTERACT_Keypad_C_InitializeKeypad");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, GameInstance) == 0x000000, "Member 'INTERACT_Keypad_C_InitializeKeypad::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_NotEqual_NameName_ReturnValue) == 0x00000A, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_GetUniqueRandomKeycode_Keycode) == 0x00000C, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_GetUniqueRandomKeycode_Keycode' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_GetMissionDifficultySettings_Settings) == 0x000010, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_GetMissionDifficultySettings_Settings' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'INTERACT_Keypad_C_InitializeKeypad::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'INTERACT_Keypad_C_InitializeKeypad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'INTERACT_Keypad_C_InitializeKeypad::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00004C, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_HasCompletedStoryQuest_Completed) == 0x00004D, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x00004E, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_Not_PreBool_ReturnValue) == 0x00004F, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeKeypad, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'INTERACT_Keypad_C_InitializeKeypad::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_Keypad_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_InitializeAttributes");
static_assert(sizeof(INTERACT_Keypad_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_Keypad_C_InitializeAttributes");
static_assert(offsetof(INTERACT_Keypad_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Keypad_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.UpdateKeypad
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Keypad_C_UpdateKeypad final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateMaterialStrength_Finished;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateMaterialStrength_Finished_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateMaterialStrength_Finished_2;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_UpdateKeypad) == 0x000004, "Wrong alignment on INTERACT_Keypad_C_UpdateKeypad");
static_assert(sizeof(INTERACT_Keypad_C_UpdateKeypad) == 0x000018, "Wrong size on INTERACT_Keypad_C_UpdateKeypad");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, DeltaTime) == 0x000000, "Member 'INTERACT_Keypad_C_UpdateKeypad::DeltaTime' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, CallFunc_UpdateMaterialStrength_Finished) == 0x000004, "Member 'INTERACT_Keypad_C_UpdateKeypad::CallFunc_UpdateMaterialStrength_Finished' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, CallFunc_UpdateMaterialStrength_Finished_1) == 0x000005, "Member 'INTERACT_Keypad_C_UpdateKeypad::CallFunc_UpdateMaterialStrength_Finished_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000008, "Member 'INTERACT_Keypad_C_UpdateKeypad::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, CallFunc_UpdateMaterialStrength_Finished_2) == 0x00000C, "Member 'INTERACT_Keypad_C_UpdateKeypad::CallFunc_UpdateMaterialStrength_Finished_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x000010, "Member 'INTERACT_Keypad_C_UpdateKeypad::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateKeypad, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'INTERACT_Keypad_C_UpdateKeypad::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.EraseLastKeypadEntry
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Keypad_C_EraseLastKeypadEntry final
{
public:
	TArray<class FString>                         KeycodeCharArray;                                  // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_EraseLastKeypadEntry) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_EraseLastKeypadEntry");
static_assert(sizeof(INTERACT_Keypad_C_EraseLastKeypadEntry) == 0x000038, "Wrong size on INTERACT_Keypad_C_EraseLastKeypadEntry");
static_assert(offsetof(INTERACT_Keypad_C_EraseLastKeypadEntry, KeycodeCharArray) == 0x000000, "Member 'INTERACT_Keypad_C_EraseLastKeypadEntry::KeycodeCharArray' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_EraseLastKeypadEntry, CallFunc_JoinStringArray_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_EraseLastKeypadEntry::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_EraseLastKeypadEntry, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000020, "Member 'INTERACT_Keypad_C_EraseLastKeypadEntry::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_EraseLastKeypadEntry, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'INTERACT_Keypad_C_EraseLastKeypadEntry::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.RecordKeypadEntry
// 0x0108 (0x0108 - 0x0000)
struct INTERACT_Keypad_C_RecordKeypadEntry final
{
public:
	int32                                         EntryValue;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0008(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class FText                                   ResultText;                                        // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_CanInteractWithTargetInteractable_Result; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanInteractWithTargetInteractable_FailMessage; // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTargetDigitCount_Result;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0078(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0098(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00B8(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_RecordKeypadEntry) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_RecordKeypadEntry");
static_assert(sizeof(INTERACT_Keypad_C_RecordKeypadEntry) == 0x000108, "Wrong size on INTERACT_Keypad_C_RecordKeypadEntry");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, EntryValue) == 0x000000, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::EntryValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, InteractResults) == 0x000008, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, ResultText) == 0x000028, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::ResultText' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_CanInteractWithTargetInteractable_Result) == 0x000040, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_CanInteractWithTargetInteractable_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_CanInteractWithTargetInteractable_FailMessage) == 0x000048, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_CanInteractWithTargetInteractable_FailMessage' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_GetTargetDigitCount_Result) == 0x000070, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_GetTargetDigitCount_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000078, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000098, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000B8, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_Len_ReturnValue) == 0x0000D8, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_Not_PreBool_ReturnValue) == 0x0000DD, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x0000E0, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x0000E4, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000E8, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_RecordKeypadEntry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000100, "Member 'INTERACT_Keypad_C_RecordKeypadEntry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.UpdateErrorState
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_Keypad_C_UpdateErrorState final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PulseValue;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Progress;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakePulsatingValue_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Keypad_C_UpdateErrorState) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_UpdateErrorState");
static_assert(sizeof(INTERACT_Keypad_C_UpdateErrorState) == 0x000060, "Wrong size on INTERACT_Keypad_C_UpdateErrorState");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, ElapsedTime) == 0x000000, "Member 'INTERACT_Keypad_C_UpdateErrorState::ElapsedTime' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, PulseValue) == 0x000004, "Member 'INTERACT_Keypad_C_UpdateErrorState::PulseValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, Progress) == 0x000008, "Member 'INTERACT_Keypad_C_UpdateErrorState::Progress' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'INTERACT_Keypad_C_UpdateErrorState::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'INTERACT_Keypad_C_UpdateErrorState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000040, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_MakePulsatingValue_ReturnValue) == 0x000044, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_MakePulsatingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x00004C, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000054, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000058, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateErrorState, CallFunc_FMax_ReturnValue) == 0x00005C, "Member 'INTERACT_Keypad_C_UpdateErrorState::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.UpdateValidState
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_Keypad_C_UpdateValidState final
{
public:
	class APAWN_Hacker_Simple_C*                  PlayerPawn;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeterProgress;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_UpdateValidState) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_UpdateValidState");
static_assert(sizeof(INTERACT_Keypad_C_UpdateValidState) == 0x000088, "Wrong size on INTERACT_Keypad_C_UpdateValidState");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, PlayerPawn) == 0x000000, "Member 'INTERACT_Keypad_C_UpdateValidState::PlayerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, MeterProgress) == 0x000008, "Member 'INTERACT_Keypad_C_UpdateValidState::MeterProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000018, "Member 'INTERACT_Keypad_C_UpdateValidState::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'INTERACT_Keypad_C_UpdateValidState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'INTERACT_Keypad_C_UpdateValidState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, K2Node_DynamicCast_AsGI_Single_Player) == 0x000058, "Member 'INTERACT_Keypad_C_UpdateValidState::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'INTERACT_Keypad_C_UpdateValidState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000062, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000064, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x00006C, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000070, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000074, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000078, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_FClamp_ReturnValue) == 0x00007C, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateValidState, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000080, "Member 'INTERACT_Keypad_C_UpdateValidState::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.UpdateMeshEmissiveStrength
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_Keypad_C_UpdateMeshEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetChildComponentsByClass_ReturnValue;    // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength) == 0x000008, "Wrong alignment on INTERACT_Keypad_C_UpdateMeshEmissiveStrength");
static_assert(sizeof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength) == 0x000048, "Wrong size on INTERACT_Keypad_C_UpdateMeshEmissiveStrength");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, EmissiveStrength) == 0x000004, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, Temp_int_Array_Index_Variable) == 0x000008, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_GetChildComponentsByClass_ReturnValue) == 0x000018, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_GetChildComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Array_Get_Item) == 0x000030, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Keypad_C_UpdateMeshEmissiveStrength, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'INTERACT_Keypad_C_UpdateMeshEmissiveStrength::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Keypad.INTERACT_Keypad_C.UpdateKeyParameters
// 0x00A0 (0x00A0 - 0x0000)
struct INTERACT_Keypad_C_UpdateKeyParameters final
{
public:
	bool                                          ReceivedKeyEntry;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DigitStrength;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DigitValue;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutputDigitIndex;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
