#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_DoorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_DoorIcons_structs.hpp"
#include "ENUM_ButtonColorType_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "ENUM_DoorState_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.OnDoorStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature final
{
public:
	class AINTERACT_DoorBase_C*                   Door;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature");
static_assert(sizeof(INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature) == 0x000010, "Wrong size on INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature");
static_assert(offsetof(INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature, Door) == 0x000000, "Member 'INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature::Door' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature, State) == 0x000008, "Member 'INTERACT_DoorBase_C_OnDoorStateChanged__DelegateSignature::State' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.ExecuteUbergraph_INTERACT_DoorBase
// 0x00D8 (0x00D8 - 0x0000)
struct INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnDoorwayUnblocked_Result;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActorBlockDoorway_Result;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSafeToClose_Result;                     // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_OnDoorwayBlocked_Result;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActorBlockDoorway_Result_1;            // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase");
static_assert(sizeof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase) == 0x0000D8, "Wrong size on INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, EntryPoint) == 0x000000, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, CallFunc_OnDoorwayUnblocked_Result) == 0x000024, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::CallFunc_OnDoorwayUnblocked_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, CallFunc_CanActorBlockDoorway_Result) == 0x000025, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::CallFunc_CanActorBlockDoorway_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_bVisibleState) == 0x000026, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, CallFunc_IsSafeToClose_Result) == 0x000027, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::CallFunc_IsSafeToClose_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000028, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000030, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000038, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000040, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, CallFunc_OnDoorwayBlocked_Result) == 0x0000D0, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::CallFunc_OnDoorwayBlocked_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase, CallFunc_CanActorBlockDoorway_Result_1) == 0x0000D1, "Member 'INTERACT_DoorBase_C_ExecuteUbergraph_INTERACT_DoorBase::CallFunc_CanActorBlockDoorway_Result_1' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_DoorBase_C_BndEvt__COMP_VoxelOccluder_K2Node_ComponentBoundEvent_1_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'INTERACT_DoorBase_C_BndEvt__SafetySensor_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.UserConstructionScript
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_DoorBase_C_UserConstructionScript final
{
public:
	float                                         CallFunc_UpdateDoorEmissiveStrength_Strength;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_UserConstructionScript) == 0x000004, "Wrong alignment on INTERACT_DoorBase_C_UserConstructionScript");
static_assert(sizeof(INTERACT_DoorBase_C_UserConstructionScript) == 0x000014, "Wrong size on INTERACT_DoorBase_C_UserConstructionScript");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_UpdateDoorEmissiveStrength_Strength) == 0x000000, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_UpdateDoorEmissiveStrength_Strength' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_BooleanNOR_ReturnValue) == 0x000004, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_BooleanNOR_ReturnValue_1) == 0x000005, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_BooleanNOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_IsValidClass_ReturnValue) == 0x00000D, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_IsValidClass_ReturnValue_1) == 0x00000E, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_1) == 0x000010, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue_2) == 0x000011, "Member 'INTERACT_DoorBase_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.InitializeDoor
// 0x0078 (0x0078 - 0x0000)
struct INTERACT_DoorBase_C_InitializeDoor final
{
public:
	bool                                          HasInitialLock;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldBeLocked;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLocked_Result;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door_1;           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HideBackButton_Result;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door_2;           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HideFrontButton_Result;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_InitializeDoor) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_InitializeDoor");
static_assert(sizeof(INTERACT_DoorBase_C_InitializeDoor) == 0x000078, "Wrong size on INTERACT_DoorBase_C_InitializeDoor");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, HasInitialLock) == 0x000000, "Member 'INTERACT_DoorBase_C_InitializeDoor::HasInitialLock' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, ShouldBeLocked) == 0x000001, "Member 'INTERACT_DoorBase_C_InitializeDoor::ShouldBeLocked' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_IsValidClass_ReturnValue) == 0x000002, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_BooleanNOR_ReturnValue) == 0x00000A, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_AsINTERF_ANIM_Door) == 0x000018, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_AsINTERF_ANIM_Door' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000030, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_SetLocked_Result) == 0x000038, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_SetLocked_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_AsINTERF_ANIM_Door_1) == 0x000040, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_AsINTERF_ANIM_Door_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_HideBackButton_Result) == 0x000051, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_HideBackButton_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000058, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_AsINTERF_ANIM_Door_2) == 0x000060, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_AsINTERF_ANIM_Door_2' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'INTERACT_DoorBase_C_InitializeDoor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoor, CallFunc_HideFrontButton_Result) == 0x000071, "Member 'INTERACT_DoorBase_C_InitializeDoor::CallFunc_HideFrontButton_Result' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.InitializeDoorState
// 0x0080 (0x0080 - 0x0000)
struct INTERACT_DoorBase_C_InitializeDoorState final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSafeToClose_Result;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ResumeDoorMontage_ElapsedTime;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ResumeDoorMontage_MontageDuration;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ResumeDoorMontage_ElapsedTime_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ResumeDoorMontage_MontageDuration_1;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door;             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Door_C>   K2Node_DynamicCast_AsINTERF_ANIM_Door_1;           // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenDoor_Result;                          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenDoor_Result_1;                        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_InitializeDoorState) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_InitializeDoorState");
static_assert(sizeof(INTERACT_DoorBase_C_InitializeDoorState) == 0x000080, "Wrong size on INTERACT_DoorBase_C_InitializeDoorState");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, AnimInstance) == 0x000000, "Member 'INTERACT_DoorBase_C_InitializeDoorState::AnimInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_IsSafeToClose_Result) == 0x000008, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_IsSafeToClose_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_ResumeDoorMontage_ElapsedTime) == 0x000028, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_ResumeDoorMontage_ElapsedTime' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_ResumeDoorMontage_MontageDuration) == 0x00002C, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_ResumeDoorMontage_MontageDuration' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_ResumeDoorMontage_ElapsedTime_1) == 0x000030, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_ResumeDoorMontage_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_ResumeDoorMontage_MontageDuration_1) == 0x000034, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_ResumeDoorMontage_MontageDuration_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_DynamicCast_AsINTERF_ANIM_Door) == 0x000040, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_DynamicCast_AsINTERF_ANIM_Door' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_DynamicCast_AsINTERF_ANIM_Door_1) == 0x000058, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_DynamicCast_AsINTERF_ANIM_Door_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_OpenDoor_Result) == 0x000069, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_OpenDoor_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_OpenDoor_Result_1) == 0x00006A, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_OpenDoor_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_GetAnimInstance_ReturnValue) == 0x000070, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'INTERACT_DoorBase_C_InitializeDoorState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000079, "Member 'INTERACT_DoorBase_C_InitializeDoorState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.InitializeDoorLockState
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_DoorBase_C_InitializeDoorLockState final
{
public:
	bool                                          ShouldBeLocked;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasCompletedRequiredQuests_Result;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSecurityForCurrentLevel_Result;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewSecurityLevel)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_InitializeDoorLockState) == 0x000008, "Wrong alignment on INTERACT_DoorBase_C_InitializeDoorLockState");
static_assert(sizeof(INTERACT_DoorBase_C_InitializeDoorLockState) == 0x000060, "Wrong size on INTERACT_DoorBase_C_InitializeDoorLockState");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, ShouldBeLocked) == 0x000000, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::ShouldBeLocked' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, GameInstance) == 0x000008, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_HasCompletedRequiredQuests_Result) == 0x000020, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_HasCompletedRequiredQuests_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000021, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_IsValidClass_ReturnValue) == 0x000039, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_GetSecurityForCurrentLevel_Result) == 0x00003C, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_GetSecurityForCurrentLevel_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000058, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeDoorLockState, CallFunc_BooleanOR_ReturnValue_1) == 0x00005A, "Member 'INTERACT_DoorBase_C_InitializeDoorLockState::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_DoorBase_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_DoorBase_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_DoorBase_C_InitializeAttributes");
static_assert(sizeof(INTERACT_DoorBase_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_DoorBase_C_InitializeAttributes");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_DoorBase_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_DoorBase_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.ValidateLockStates
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_DoorBase_C_ValidateLockStates final
{
public:
	int32                                         LockRequirementCount;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_ValidateLockStates) == 0x000004, "Wrong alignment on INTERACT_DoorBase_C_ValidateLockStates");
static_assert(sizeof(INTERACT_DoorBase_C_ValidateLockStates) == 0x000038, "Wrong size on INTERACT_DoorBase_C_ValidateLockStates");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, LockRequirementCount) == 0x000000, "Member 'INTERACT_DoorBase_C_ValidateLockStates::LockRequirementCount' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, Temp_int_Variable) == 0x000004, "Member 'INTERACT_DoorBase_C_ValidateLockStates::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, Temp_int_Variable_1) == 0x00000C, "Member 'INTERACT_DoorBase_C_ValidateLockStates::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Add_IntInt_ReturnValue_3) == 0x00001C, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_IsValidClass_ReturnValue) == 0x000020, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000028, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, Temp_int_Variable_2) == 0x00002C, "Member 'INTERACT_DoorBase_C_ValidateLockStates::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, Temp_int_Variable_3) == 0x000030, "Member 'INTERACT_DoorBase_C_ValidateLockStates::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000034, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_ValidateLockStates, CallFunc_Not_PreBool_ReturnValue) == 0x000035, "Member 'INTERACT_DoorBase_C_ValidateLockStates::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.TryAutoCloseDoor
// 0x0005 (0x0005 - 0x0000)
struct INTERACT_DoorBase_C_TryAutoCloseDoor final
{
public:
	bool                                          CallFunc_IsDoorFunctional_Result;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyHostileEnemyNearDoor_Result;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSafeToClose_Result;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_DoorBase_C_TryAutoCloseDoor) == 0x000001, "Wrong alignment on INTERACT_DoorBase_C_TryAutoCloseDoor");
static_assert(sizeof(INTERACT_DoorBase_C_TryAutoCloseDoor) == 0x000005, "Wrong size on INTERACT_DoorBase_C_TryAutoCloseDoor");
static_assert(offsetof(INTERACT_DoorBase_C_TryAutoCloseDoor, CallFunc_IsDoorFunctional_Result) == 0x000000, "Member 'INTERACT_DoorBase_C_TryAutoCloseDoor::CallFunc_IsDoorFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_TryAutoCloseDoor, CallFunc_IsAnyHostileEnemyNearDoor_Result) == 0x000001, "Member 'INTERACT_DoorBase_C_TryAutoCloseDoor::CallFunc_IsAnyHostileEnemyNearDoor_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_TryAutoCloseDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'INTERACT_DoorBase_C_TryAutoCloseDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_TryAutoCloseDoor, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'INTERACT_DoorBase_C_TryAutoCloseDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_DoorBase_C_TryAutoCloseDoor, CallFunc_IsSafeToClose_Result) == 0x000004, "Member 'INTERACT_DoorBase_C_TryAutoCloseDoor::CallFunc_IsSafeToClose_Result' has a wrong offset!");

// Function INTERACT_DoorBase.INTERACT_DoorBase_C.IsSafeToClose
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_DoorBase_C_IsSafeToClose final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         OverlappingActors;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
