#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_ANIM_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERF_ANIM_Button.INTERF_ANIM_Button_C.IsButtonPressed
// 0x0001 (0x0001 - 0x0000)
struct INTERF_ANIM_Button_C_IsButtonPressed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_ANIM_Button_C_IsButtonPressed) == 0x000001, "Wrong alignment on INTERF_ANIM_Button_C_IsButtonPressed");
static_assert(sizeof(INTERF_ANIM_Button_C_IsButtonPressed) == 0x000001, "Wrong size on INTERF_ANIM_Button_C_IsButtonPressed");
static_assert(offsetof(INTERF_ANIM_Button_C_IsButtonPressed, Result) == 0x000000, "Member 'INTERF_ANIM_Button_C_IsButtonPressed::Result' has a wrong offset!");

// Function INTERF_ANIM_Button.INTERF_ANIM_Button_C.ToggleButton
// 0x0001 (0x0001 - 0x0000)
struct INTERF_ANIM_Button_C_ToggleButton final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_ANIM_Button_C_ToggleButton) == 0x000001, "Wrong alignment on INTERF_ANIM_Button_C_ToggleButton");
static_assert(sizeof(INTERF_ANIM_Button_C_ToggleButton) == 0x000001, "Wrong size on INTERF_ANIM_Button_C_ToggleButton");
static_assert(offsetof(INTERF_ANIM_Button_C_ToggleButton, Result) == 0x000000, "Member 'INTERF_ANIM_Button_C_ToggleButton::Result' has a wrong offset!");

}

