#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_EnergyGrateDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_EnergyGrateDoor.INTERACT_EnergyGrateDoor_C
// 0x00A8 (0x0700 - 0x0658)
class AINTERACT_EnergyGrateDoor_C final : public AINTERACT_DoorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_EnergyGrateDoor_C;         // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     IdleAudio;                                         // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameFloor;                                    // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameLeft;                                     // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameCeiling;                                  // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorFrameRight;                                    // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmRightLockCollision;                             // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmBotLeftCollision;                               // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmBotRightCollision;                              // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmTopLeftCollision;                               // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmTopRightCollision;                              // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmBotCollision;                                   // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmTopCollision;                                   // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmLeftCollision;                                  // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ArmRightCollision;                                 // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Target_Back;                                       // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Target_Front;                                      // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Blocker_Right;                                     // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Blocker_Left;                                      // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Blocker_EnergyField;                               // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrateMesh;                                         // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_EnergyGrateDoor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void EVENT_OnStateFinished();
	void InitializeEnergyGrateDoor();
	void InteractOnClosing();
	void InteractOnOpening(class AActor* SourceActor);
	void IsDoorCollisionPrimitive(class UPrimitiveComponent* PrimitiveComponent, bool* Result);
	void UpdateDoorEmissiveStrength(float Scale, float* Strength);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_EnergyGrateDoor_C">();
	}
	static class AINTERACT_EnergyGrateDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_EnergyGrateDoor_C>();
	}
};
static_assert(alignof(AINTERACT_EnergyGrateDoor_C) == 0x000008, "Wrong alignment on AINTERACT_EnergyGrateDoor_C");
static_assert(sizeof(AINTERACT_EnergyGrateDoor_C) == 0x000700, "Wrong size on AINTERACT_EnergyGrateDoor_C");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, UberGraphFrame_INTERACT_EnergyGrateDoor_C) == 0x000658, "Member 'AINTERACT_EnergyGrateDoor_C::UberGraphFrame_INTERACT_EnergyGrateDoor_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, IdleAudio) == 0x000660, "Member 'AINTERACT_EnergyGrateDoor_C::IdleAudio' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, DoorFrameFloor) == 0x000668, "Member 'AINTERACT_EnergyGrateDoor_C::DoorFrameFloor' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, DoorFrameLeft) == 0x000670, "Member 'AINTERACT_EnergyGrateDoor_C::DoorFrameLeft' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, DoorFrameCeiling) == 0x000678, "Member 'AINTERACT_EnergyGrateDoor_C::DoorFrameCeiling' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, DoorFrameRight) == 0x000680, "Member 'AINTERACT_EnergyGrateDoor_C::DoorFrameRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmRightLockCollision) == 0x000688, "Member 'AINTERACT_EnergyGrateDoor_C::ArmRightLockCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmBotLeftCollision) == 0x000690, "Member 'AINTERACT_EnergyGrateDoor_C::ArmBotLeftCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmBotRightCollision) == 0x000698, "Member 'AINTERACT_EnergyGrateDoor_C::ArmBotRightCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmTopLeftCollision) == 0x0006A0, "Member 'AINTERACT_EnergyGrateDoor_C::ArmTopLeftCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmTopRightCollision) == 0x0006A8, "Member 'AINTERACT_EnergyGrateDoor_C::ArmTopRightCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmBotCollision) == 0x0006B0, "Member 'AINTERACT_EnergyGrateDoor_C::ArmBotCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmTopCollision) == 0x0006B8, "Member 'AINTERACT_EnergyGrateDoor_C::ArmTopCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmLeftCollision) == 0x0006C0, "Member 'AINTERACT_EnergyGrateDoor_C::ArmLeftCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, ArmRightCollision) == 0x0006C8, "Member 'AINTERACT_EnergyGrateDoor_C::ArmRightCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, Target_Back) == 0x0006D0, "Member 'AINTERACT_EnergyGrateDoor_C::Target_Back' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, Target_Front) == 0x0006D8, "Member 'AINTERACT_EnergyGrateDoor_C::Target_Front' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, Blocker_Right) == 0x0006E0, "Member 'AINTERACT_EnergyGrateDoor_C::Blocker_Right' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, Blocker_Left) == 0x0006E8, "Member 'AINTERACT_EnergyGrateDoor_C::Blocker_Left' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, Blocker_EnergyField) == 0x0006F0, "Member 'AINTERACT_EnergyGrateDoor_C::Blocker_EnergyField' has a wrong offset!");
static_assert(offsetof(AINTERACT_EnergyGrateDoor_C, GrateMesh) == 0x0006F8, "Member 'AINTERACT_EnergyGrateDoor_C::GrateMesh' has a wrong offset!");

}

