#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SurgeryMachine

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "ENUM_SurgeryMachineState_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_LeftRight_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.ExecuteUbergraph_INTERACT_SurgeryMachine
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeIntoBlink;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine");
static_assert(sizeof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine) == 0x000030, "Wrong size on INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, EntryPoint) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, K2Node_CustomEvent_TimeIntoBlink) == 0x000018, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::K2Node_CustomEvent_TimeIntoBlink' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine, K2Node_ComponentBoundEvent_bVisibleState) == 0x000028, "Member 'INTERACT_SurgeryMachine_C_ExecuteUbergraph_INTERACT_SurgeryMachine::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.ButtonBlink
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SurgeryMachine_C_ButtonBlink final
{
public:
	float                                         TimeIntoBlink;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_ButtonBlink) == 0x000004, "Wrong alignment on INTERACT_SurgeryMachine_C_ButtonBlink");
static_assert(sizeof(INTERACT_SurgeryMachine_C_ButtonBlink) == 0x000004, "Wrong size on INTERACT_SurgeryMachine_C_ButtonBlink");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ButtonBlink, TimeIntoBlink) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_ButtonBlink::TimeIntoBlink' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_SurgeryMachine_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_SurgeryMachine_C_ReceiveTick");
static_assert(sizeof(INTERACT_SurgeryMachine_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_SurgeryMachine_C_ReceiveTick");
static_assert(offsetof(INTERACT_SurgeryMachine_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.GetTargetShape
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SurgeryMachine_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_GetTargetShape");
static_assert(sizeof(INTERACT_SurgeryMachine_C_GetTargetShape) == 0x000018, "Wrong size on INTERACT_SurgeryMachine_C_GetTargetShape");
static_assert(offsetof(INTERACT_SurgeryMachine_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_SurgeryMachine_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'INTERACT_SurgeryMachine_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.TryInteract
// 0x01F0 (0x01F0 - 0x0000)
struct INTERACT_SurgeryMachine_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0048(0x0020)(HasGetValueTypeHash)
	ENUM_LeftRight                                Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_LeftRight                                Temp_byte_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0098(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00B8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsSurgeryMachineDisabled_Result;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00E0(0x0020)(HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPerformChannelingSequence_Result;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AngleBetweenVectors_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x0140(0x0020)(HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0170(0x0020)(HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurgeryMachineDestroyed_Result;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSafeToInteract_Result;                  // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_6;        // 0x01A0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_LeftRight                                K2Node_Select_Default;                             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_7;        // 0x01C8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_TryInteract");
static_assert(sizeof(INTERACT_SurgeryMachine_C_TryInteract) == 0x0001F0, "Wrong size on INTERACT_SurgeryMachine_C_TryInteract");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_SurgeryMachine_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, HackerPawn) == 0x000038, "Member 'INTERACT_SurgeryMachine_C_TryInteract::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, Temp_bool_Variable) == 0x000040, "Member 'INTERACT_SurgeryMachine_C_TryInteract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000048, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, Temp_byte_Variable) == 0x000068, "Member 'INTERACT_SurgeryMachine_C_TryInteract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000070, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, Temp_byte_Variable_1) == 0x000091, "Member 'INTERACT_SurgeryMachine_C_TryInteract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000098, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000B8, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_IsSurgeryMachineDisabled_Result) == 0x0000D8, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_IsSurgeryMachineDisabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000E0, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_GetForwardVector_ReturnValue) == 0x000100, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000124, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_CanPerformChannelingSequence_Result) == 0x000130, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_CanPerformChannelingSequence_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_AngleBetweenVectors_ReturnValue) == 0x000134, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_AngleBetweenVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_Less_FloatFloat_ReturnValue) == 0x000138, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x000140, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000160, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000170, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_GetInventoryComponent_Inventory) == 0x000190, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_IsSurgeryMachineDestroyed_Result) == 0x000198, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_IsSurgeryMachineDestroyed_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x000199, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_IsSafeToInteract_Result) == 0x00019A, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_IsSafeToInteract_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_6) == 0x0001A0, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_6' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001C0, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_Select_Default) == 0x0001C1, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_7) == 0x0001C8, "Member 'INTERACT_SurgeryMachine_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_7' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001E8, "Member 'INTERACT_SurgeryMachine_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.InitializeSurgeryMachine
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_SurgeryMachine_C_InitializeSurgeryMachine final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChannelingWithInteractable_Result;      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSurgeryMachineDestroyed_Result;         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAttribHandler_ReturnValue;             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateDeathSettings_Result;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_InitializeSurgeryMachine");
static_assert(sizeof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine) == 0x000060, "Wrong size on INTERACT_SurgeryMachine_C_InitializeSurgeryMachine");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000008, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_IsChannelingWithInteractable_Result) == 0x000012, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_IsChannelingWithInteractable_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_Not_PreBool_ReturnValue_1) == 0x000014, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_IsVisible_ReturnValue) == 0x000015, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_IsSurgeryMachineDestroyed_Result) == 0x000016, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_IsSurgeryMachineDestroyed_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_HasAttribHandler_ReturnValue) == 0x000017, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_HasAttribHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_UpdateDeathSettings_Result) == 0x000018, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_UpdateDeathSettings_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_Not_PreBool_ReturnValue_2) == 0x000019, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, K2Node_MakeArray_Array) == 0x000020, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, K2Node_MakeArray_Array_1) == 0x000030, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000048, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000050, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_InitializeSurgeryMachine, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000058, "Member 'INTERACT_SurgeryMachine_C_InitializeSurgeryMachine::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.BindAttributeEvents
// 0x0024 (0x0024 - 0x0000)
struct INTERACT_SurgeryMachine_C_BindAttributeEvents final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_BindAttributeEvents) == 0x000004, "Wrong alignment on INTERACT_SurgeryMachine_C_BindAttributeEvents");
static_assert(sizeof(INTERACT_SurgeryMachine_C_BindAttributeEvents) == 0x000024, "Wrong size on INTERACT_SurgeryMachine_C_BindAttributeEvents");
static_assert(offsetof(INTERACT_SurgeryMachine_C_BindAttributeEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_BindAttributeEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_BindAttributeEvents, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_BindAttributeEvents::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_BindAttributeEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'INTERACT_SurgeryMachine_C_BindAttributeEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.UpdateMeshEmissiveStrength
// 0x000C (0x000C - 0x0000)
struct INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength");
static_assert(sizeof(INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength) == 0x00000C, "Wrong size on INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength, Value) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength::Value' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'INTERACT_SurgeryMachine_C_UpdateMeshEmissiveStrength::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.OnSurgeryMachineDestroyed
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed final
{
public:
	TArray<class UAttributeDef*>                  Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_UpdateDeathSettings_Result;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed");
static_assert(sizeof(INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed) == 0x000028, "Wrong size on INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed");
static_assert(offsetof(INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed, Temp_object_Variable) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed, CallFunc_UpdateDeathSettings_Result) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed::CallFunc_UpdateDeathSettings_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'INTERACT_SurgeryMachine_C_OnSurgeryMachineDestroyed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.UpdateDeathSettings
// 0x0070 (0x0070 - 0x0000)
struct INTERACT_SurgeryMachine_C_UpdateDeathSettings final
{
public:
	bool                                          DuringBeginPlay;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};
static_assert(alignof(INTERACT_SurgeryMachine_C_UpdateDeathSettings) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_UpdateDeathSettings");
static_assert(sizeof(INTERACT_SurgeryMachine_C_UpdateDeathSettings) == 0x000070, "Wrong size on INTERACT_SurgeryMachine_C_UpdateDeathSettings");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateDeathSettings, DuringBeginPlay) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_UpdateDeathSettings::DuringBeginPlay' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateDeathSettings, Result) == 0x000001, "Member 'INTERACT_SurgeryMachine_C_UpdateDeathSettings::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateDeathSettings, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'INTERACT_SurgeryMachine_C_UpdateDeathSettings::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateDeathSettings, K2Node_MakeArray_Array) == 0x000048, "Member 'INTERACT_SurgeryMachine_C_UpdateDeathSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateDeathSettings, CallFunc_Format_ReturnValue) == 0x000058, "Member 'INTERACT_SurgeryMachine_C_UpdateDeathSettings::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function INTERACT_SurgeryMachine.INTERACT_SurgeryMachine_C.UpdateMaterial
// 0x00C0 (0x00C0 - 0x0000)
struct INTERACT_SurgeryMachine_C_UpdateMaterial final
{
public:
	float                                         ScanLength;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ScanMontage;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LaserProgress;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RampProgress;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_4;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_3;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_5;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_4;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_10;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_11;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_12;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_13;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_6;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_6;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_5;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SurgeryMachine_C_UpdateMaterial) == 0x000008, "Wrong alignment on INTERACT_SurgeryMachine_C_UpdateMaterial");
static_assert(sizeof(INTERACT_SurgeryMachine_C_UpdateMaterial) == 0x0000C0, "Wrong size on INTERACT_SurgeryMachine_C_UpdateMaterial");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, ScanLength) == 0x000000, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::ScanLength' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, ScanMontage) == 0x000008, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::ScanMontage' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, LaserProgress) == 0x000010, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::LaserProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, RampProgress) == 0x000014, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::RampProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000024, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000030, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_FClamp_ReturnValue_1) == 0x000034, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_1) == 0x00003C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_2) == 0x000040, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_3) == 0x000044, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_4) == 0x000048, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x00004C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000050, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x000054, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000058, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_5) == 0x000060, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_FClamp_ReturnValue_2) == 0x000064, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_4) == 0x000068, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x00006C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000070, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_6) == 0x000074, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_FClamp_ReturnValue_3) == 0x000078, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_7) == 0x00007C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_5) == 0x000080, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x000084, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000088, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_FClamp_ReturnValue_4) == 0x00008C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_8) == 0x000090, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_9) == 0x000094, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_10) == 0x000098, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_11) == 0x00009C, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_12) == 0x0000A0, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_Lerp_ReturnValue_13) == 0x0000A4, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_Lerp_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(INTERACT_SurgeryMachine_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue_6) == 0x0000A8, "Member 'INTERACT_SurgeryMachine_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue_6' has a wrong offset!");
