#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_StationMonitor

#include "Basic.hpp"

#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreGame_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.ExecuteUbergraph_INTERACT_StationMonitor
// 0x000C (0x000C - 0x0000)
struct INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor) == 0x000004, "Wrong alignment on INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor");
static_assert(sizeof(INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor) == 0x00000C, "Wrong size on INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor");
static_assert(offsetof(INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor, EntryPoint) == 0x000000, "Member 'INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor, K2Node_ComponentBoundEvent_bVisibleState) == 0x000008, "Member 'INTERACT_StationMonitor_C_ExecuteUbergraph_INTERACT_StationMonitor::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_StationMonitor_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_StationMonitor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_StationMonitor_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_StationMonitor_C_ReceiveTick");
static_assert(sizeof(INTERACT_StationMonitor_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_StationMonitor_C_ReceiveTick");
static_assert(offsetof(INTERACT_StationMonitor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_StationMonitor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.InitializeStationMonitor
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_StationMonitor_C_InitializeStationMonitor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_InitializeStationMonitor) == 0x000001, "Wrong alignment on INTERACT_StationMonitor_C_InitializeStationMonitor");
static_assert(sizeof(INTERACT_StationMonitor_C_InitializeStationMonitor) == 0x000002, "Wrong size on INTERACT_StationMonitor_C_InitializeStationMonitor");
static_assert(offsetof(INTERACT_StationMonitor_C_InitializeStationMonitor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'INTERACT_StationMonitor_C_InitializeStationMonitor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_InitializeStationMonitor, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'INTERACT_StationMonitor_C_InitializeStationMonitor::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.UpdateMonitorRotation
// 0x0068 (0x0068 - 0x0000)
struct INTERACT_StationMonitor_C_UpdateMonitorRotation final
{
public:
	struct FVector                                DirectionToPlayer;                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_StationMonitor_Large_C*         K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Large; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimBP_StationMonitor_Small_C*         K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Small; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_StationMonitor_C_UpdateMonitorRotation) == 0x000008, "Wrong alignment on INTERACT_StationMonitor_C_UpdateMonitorRotation");
static_assert(sizeof(INTERACT_StationMonitor_C_UpdateMonitorRotation) == 0x000068, "Wrong size on INTERACT_StationMonitor_C_UpdateMonitorRotation");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, DirectionToPlayer) == 0x000000, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::DirectionToPlayer' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000018, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Large) == 0x000020, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Large' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Small) == 0x000030, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::K2Node_DynamicCast_AsAnim_BP_Station_Monitor_Small' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_GetPlayerPawn_ReturnValue) == 0x000048, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateMonitorRotation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'INTERACT_StationMonitor_C_UpdateMonitorRotation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.UpdateDeathSettings
// 0x00A0 (0x00A0 - 0x0000)
struct INTERACT_StationMonitor_C_UpdateDeathSettings final
{
public:
	bool                                          DuringBeginPlay;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   BaseMeshComponent;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateDeathSettings_Result;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0xE];                                       // 0x0012(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             K2Node_Select_Default;                             // 0x0060(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_UpdateDeathSettings) == 0x000010, "Wrong alignment on INTERACT_StationMonitor_C_UpdateDeathSettings");
static_assert(sizeof(INTERACT_StationMonitor_C_UpdateDeathSettings) == 0x0000A0, "Wrong size on INTERACT_StationMonitor_C_UpdateDeathSettings");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, DuringBeginPlay) == 0x000000, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::DuringBeginPlay' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, Result) == 0x000001, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, BaseMeshComponent) == 0x000008, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::BaseMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, Temp_bool_Variable) == 0x000010, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, CallFunc_UpdateDeathSettings_Result) == 0x000011, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::CallFunc_UpdateDeathSettings_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, Temp_struct_Variable) == 0x000020, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, K2Node_Select_Default) == 0x000060, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000088, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, K2Node_DynamicCast_AsStatic_Mesh) == 0x000090, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateDeathSettings, CallFunc_SetStaticMesh_ReturnValue) == 0x000099, "Member 'INTERACT_StationMonitor_C_UpdateDeathSettings::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.OnDeath
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_StationMonitor_C_OnDeath final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDeath_Result;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_OnDeath) == 0x000008, "Wrong alignment on INTERACT_StationMonitor_C_OnDeath");
static_assert(sizeof(INTERACT_StationMonitor_C_OnDeath) == 0x000010, "Wrong size on INTERACT_StationMonitor_C_OnDeath");
static_assert(offsetof(INTERACT_StationMonitor_C_OnDeath, SourceActor) == 0x000000, "Member 'INTERACT_StationMonitor_C_OnDeath::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_OnDeath, Result) == 0x000008, "Member 'INTERACT_StationMonitor_C_OnDeath::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_OnDeath, CallFunc_OnDeath_Result) == 0x000009, "Member 'INTERACT_StationMonitor_C_OnDeath::CallFunc_OnDeath_Result' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.SpawnDebris
// 0x0180 (0x0180 - 0x0000)
struct INTERACT_StationMonitor_C_SpawnDebris final
{
public:
	class UStaticMeshComponent*                   DebrisMeshComponent;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADEBRIS_Base_C*                         DebrisActor;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetDebrisMeshComponent_Result;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLatentObjectEventHandle               K2Node_MakeStruct_LatentObjectEventHandle;         // 0x0020(0x0010)(ContainsInstancedReference)
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0058(0x0030)(HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* HitActor, const struct FAttribDamageInstance& ImpactDamageInstance, float ImpactSpeed)> K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   K2Node_Select_Default_1;                           // 0x0100(0x0028)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsDEBRIS_Base;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADEBRIS_Base_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_StationMonitor_C_SpawnDebris) == 0x000010, "Wrong alignment on INTERACT_StationMonitor_C_SpawnDebris");
static_assert(sizeof(INTERACT_StationMonitor_C_SpawnDebris) == 0x000180, "Wrong size on INTERACT_StationMonitor_C_SpawnDebris");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, DebrisMeshComponent) == 0x000000, "Member 'INTERACT_StationMonitor_C_SpawnDebris::DebrisMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, DebrisActor) == 0x000008, "Member 'INTERACT_StationMonitor_C_SpawnDebris::DebrisActor' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, Temp_bool_Variable) == 0x000010, "Member 'INTERACT_StationMonitor_C_SpawnDebris::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_GetDebrisMeshComponent_Result) == 0x000018, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_GetDebrisMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_MakeStruct_LatentObjectEventHandle) == 0x000020, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_MakeStruct_LatentObjectEventHandle' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_MakeArray_Array) == 0x000030, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_MakeArray_Array_1) == 0x000040, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000058, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_DynamicCast_AsGI_Single_Player) == 0x000088, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, Temp_int_Variable) == 0x000094, "Member 'INTERACT_StationMonitor_C_SpawnDebris::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, Temp_int_Variable_1) == 0x000098, "Member 'INTERACT_StationMonitor_C_SpawnDebris::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000B0, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, Temp_bool_Variable_1) == 0x0000B8, "Member 'INTERACT_StationMonitor_C_SpawnDebris::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x0000C0, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_Select_Default) == 0x0000CC, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000DC, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_RandomUnitVector_ReturnValue) == 0x0000E8, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F4, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_Select_Default_1) == 0x000100, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000128, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_ClassDynamicCast_AsDEBRIS_Base) == 0x000130, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_ClassDynamicCast_AsDEBRIS_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, K2Node_ClassDynamicCast_bSuccess) == 0x000138, "Member 'INTERACT_StationMonitor_C_SpawnDebris::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_GetSocketTransform_ReturnValue) == 0x000140, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000170, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_SpawnDebris, CallFunc_FinishSpawningActor_ReturnValue) == 0x000178, "Member 'INTERACT_StationMonitor_C_SpawnDebris::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.UpdateVisibilityState
// 0x000C (0x000C - 0x0000)
struct INTERACT_StationMonitor_C_UpdateVisibilityState final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_UpdateVisibilityState) == 0x000004, "Wrong alignment on INTERACT_StationMonitor_C_UpdateVisibilityState");
static_assert(sizeof(INTERACT_StationMonitor_C_UpdateVisibilityState) == 0x00000C, "Wrong size on INTERACT_StationMonitor_C_UpdateVisibilityState");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateVisibilityState, VisibilityState) == 0x000000, "Member 'INTERACT_StationMonitor_C_UpdateVisibilityState::VisibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateVisibilityState, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'INTERACT_StationMonitor_C_UpdateVisibilityState::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_UpdateVisibilityState, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'INTERACT_StationMonitor_C_UpdateVisibilityState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_StationMonitor.INTERACT_StationMonitor_C.EVENT_OnImpactWithDamage
// 0x0070 (0x0070 - 0x0000)
struct INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  ImpactDamageInstance;                              // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         ImpactSpeed;                                       // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    MonitorKillAchievementHandle;                      // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteBinaryAchievement_Result;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage) == 0x000008, "Wrong alignment on INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage");
static_assert(sizeof(INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage) == 0x000070, "Wrong size on INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage");
static_assert(offsetof(INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage, HitActor) == 0x000000, "Member 'INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage::HitActor' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage, ImpactDamageInstance) == 0x000008, "Member 'INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage::ImpactDamageInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage, ImpactSpeed) == 0x000030, "Member 'INTERACT_StationMonitor_C_EVENT_OnImpactWithDamage::ImpactSpeed' has a wrong offset!");
