#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ServiceLift

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Lift_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_ServiceLift.INTERACT_ServiceLift_C
// 0x00A8 (0x0480 - 0x03D8)
class AINTERACT_ServiceLift_C final : public AINTERACT_Lift_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_ServiceLift_C;             // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     LoopAudio;                                         // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleLeftCollision;                              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleRightCollision;                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BottomCollision;                                   // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HatchOpen_SteamBurst3;                          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HatchOpen_SteamBurst2;                          // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HatchOpen_SteamBurst1;                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HatchOpen_SteamBurst;                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               StopCue;                                           // 0x0428(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         DefaultLockLightIntensity;                         // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          SteamBurstFX;                                      // 0x0458(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_ServiceLift(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void UpdateLiftLights(bool State);
	void InitializeLift();
	void SetInteractLocked(bool Locked, bool* Result);
	void PlayStartFX();
	void PlayStopFX();
	void UpdateEmissiveStrength(float Scale);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_ServiceLift_C">();
	}
	static class AINTERACT_ServiceLift_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_ServiceLift_C>();
	}
};
static_assert(alignof(AINTERACT_ServiceLift_C) == 0x000008, "Wrong alignment on AINTERACT_ServiceLift_C");
static_assert(sizeof(AINTERACT_ServiceLift_C) == 0x000480, "Wrong size on AINTERACT_ServiceLift_C");
static_assert(offsetof(AINTERACT_ServiceLift_C, UberGraphFrame_INTERACT_ServiceLift_C) == 0x0003D8, "Member 'AINTERACT_ServiceLift_C::UberGraphFrame_INTERACT_ServiceLift_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, LoopAudio) == 0x0003E0, "Member 'AINTERACT_ServiceLift_C::LoopAudio' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, RectLight) == 0x0003E8, "Member 'AINTERACT_ServiceLift_C::RectLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, CapsuleLeftCollision) == 0x0003F0, "Member 'AINTERACT_ServiceLift_C::CapsuleLeftCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, CapsuleRightCollision) == 0x0003F8, "Member 'AINTERACT_ServiceLift_C::CapsuleRightCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, BottomCollision) == 0x000400, "Member 'AINTERACT_ServiceLift_C::BottomCollision' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, NS_HatchOpen_SteamBurst3) == 0x000408, "Member 'AINTERACT_ServiceLift_C::NS_HatchOpen_SteamBurst3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, NS_HatchOpen_SteamBurst2) == 0x000410, "Member 'AINTERACT_ServiceLift_C::NS_HatchOpen_SteamBurst2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, NS_HatchOpen_SteamBurst1) == 0x000418, "Member 'AINTERACT_ServiceLift_C::NS_HatchOpen_SteamBurst1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, NS_HatchOpen_SteamBurst) == 0x000420, "Member 'AINTERACT_ServiceLift_C::NS_HatchOpen_SteamBurst' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, StopCue) == 0x000428, "Member 'AINTERACT_ServiceLift_C::StopCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, DefaultLockLightIntensity) == 0x000450, "Member 'AINTERACT_ServiceLift_C::DefaultLockLightIntensity' has a wrong offset!");
static_assert(offsetof(AINTERACT_ServiceLift_C, SteamBurstFX) == 0x000458, "Member 'AINTERACT_ServiceLift_C::SteamBurstFX' has a wrong offset!");

}

