#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SecurityMonitor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.ExecuteUbergraph_INTERACT_SecurityMonitor
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetOrCreateRenderTarget_RenderTarget;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleToFrustum;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor) == 0x000008, "Wrong alignment on INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor");
static_assert(sizeof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor) == 0x000030, "Wrong size on INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, EntryPoint) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_IsAlive_Result) == 0x000004, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_GetOrCreateRenderTarget_RenderTarget) == 0x000008, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_GetOrCreateRenderTarget_RenderTarget' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, K2Node_ComponentBoundEvent_bVisibleToFrustum) == 0x000018, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::K2Node_ComponentBoundEvent_bVisibleToFrustum' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, K2Node_ComponentBoundEvent_bVisibleState) == 0x00001A, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, CallFunc_IsValid_ReturnValue_1) == 0x00001B, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'INTERACT_SecurityMonitor_C_ExecuteUbergraph_INTERACT_SecurityMonitor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_BndEvt__INTERACT_ScreenDisplay_COMP_VoxelObserver_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature final
{
public:
	bool                                          bVisibleToFrustum;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature");
static_assert(sizeof(INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature");
static_assert(offsetof(INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature, bVisibleToFrustum) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_BndEvt__COMP_VoxelObserver_K2Node_ComponentBoundEvent_1_ObserverFrustumStateSignature__DelegateSignature::bVisibleToFrustum' has a wrong offset!");

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.HasActiveBroadcastFeed
// 0x0003 (0x0003 - 0x0000)
struct INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed) == 0x000001, "Wrong alignment on INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed");
static_assert(sizeof(INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed) == 0x000003, "Wrong size on INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed");
static_assert(offsetof(INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed, Result) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed, CallFunc_IsAlive_Result) == 0x000001, "Member 'INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'INTERACT_SecurityMonitor_C_HasActiveBroadcastFeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.SetupSecurityMonitor
// 0x0040 (0x0040 - 0x0000)
struct INTERACT_SecurityMonitor_C_SetupSecurityMonitor final
{
public:
	bool                                          HasValidFeed;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasActiveBroadcastFeed_Result;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor) == 0x000010, "Wrong alignment on INTERACT_SecurityMonitor_C_SetupSecurityMonitor");
static_assert(sizeof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor) == 0x000040, "Wrong size on INTERACT_SecurityMonitor_C_SetupSecurityMonitor");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, HasValidFeed) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::HasValidFeed' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, Temp_bool_Variable) == 0x000001, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, CallFunc_HasActiveBroadcastFeed_Result) == 0x000002, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::CallFunc_HasActiveBroadcastFeed_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000014, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, K2Node_Select_Default) == 0x000018, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_SetupSecurityMonitor, K2Node_MakeStruct_Vector4) == 0x000030, "Member 'INTERACT_SecurityMonitor_C_SetupSecurityMonitor::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function INTERACT_SecurityMonitor.INTERACT_SecurityMonitor_C.UpdateSecurityMonitorVisibility
// 0x0003 (0x0003 - 0x0000)
struct INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasActiveBroadcastFeed_Result;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility) == 0x000001, "Wrong alignment on INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility");
static_assert(sizeof(INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility) == 0x000003, "Wrong size on INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility");
static_assert(offsetof(INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility, VisibilityState) == 0x000000, "Member 'INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility, CallFunc_HasActiveBroadcastFeed_Result) == 0x000001, "Member 'INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility::CallFunc_HasActiveBroadcastFeed_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'INTERACT_SecurityMonitor_C_UpdateSecurityMonitorVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

