#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_MeshWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERF_MeshWidget.INTERF_MeshWidget_C.GetMeshWidget
// 0x0008 (0x0008 - 0x0000)
struct INTERF_MeshWidget_C_GetMeshWidget final
{
public:
	class UGridMeshWidget*                        Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_MeshWidget_C_GetMeshWidget) == 0x000008, "Wrong alignment on INTERF_MeshWidget_C_GetMeshWidget");
static_assert(sizeof(INTERF_MeshWidget_C_GetMeshWidget) == 0x000008, "Wrong size on INTERF_MeshWidget_C_GetMeshWidget");
static_assert(offsetof(INTERF_MeshWidget_C_GetMeshWidget, Result) == 0x000000, "Member 'INTERF_MeshWidget_C_GetMeshWidget::Result' has a wrong offset!");

// Function INTERF_MeshWidget.INTERF_MeshWidget_C.OnMouseOver
// 0x0001 (0x0001 - 0x0000)
struct INTERF_MeshWidget_C_OnMouseOver final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_MeshWidget_C_OnMouseOver) == 0x000001, "Wrong alignment on INTERF_MeshWidget_C_OnMouseOver");
static_assert(sizeof(INTERF_MeshWidget_C_OnMouseOver) == 0x000001, "Wrong size on INTERF_MeshWidget_C_OnMouseOver");
static_assert(offsetof(INTERF_MeshWidget_C_OnMouseOver, Result) == 0x000000, "Member 'INTERF_MeshWidget_C_OnMouseOver::Result' has a wrong offset!");

// Function INTERF_MeshWidget.INTERF_MeshWidget_C.OnMouseExit
// 0x0001 (0x0001 - 0x0000)
struct INTERF_MeshWidget_C_OnMouseExit final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_MeshWidget_C_OnMouseExit) == 0x000001, "Wrong alignment on INTERF_MeshWidget_C_OnMouseExit");
static_assert(sizeof(INTERF_MeshWidget_C_OnMouseExit) == 0x000001, "Wrong size on INTERF_MeshWidget_C_OnMouseExit");
static_assert(offsetof(INTERF_MeshWidget_C_OnMouseExit, Result) == 0x000000, "Member 'INTERF_MeshWidget_C_OnMouseExit::Result' has a wrong offset!");

// Function INTERF_MeshWidget.INTERF_MeshWidget_C.EnableFlickerEffect
// 0x0001 (0x0001 - 0x0000)
struct INTERF_MeshWidget_C_EnableFlickerEffect final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_MeshWidget_C_EnableFlickerEffect) == 0x000001, "Wrong alignment on INTERF_MeshWidget_C_EnableFlickerEffect");
static_assert(sizeof(INTERF_MeshWidget_C_EnableFlickerEffect) == 0x000001, "Wrong size on INTERF_MeshWidget_C_EnableFlickerEffect");
static_assert(offsetof(INTERF_MeshWidget_C_EnableFlickerEffect, Result) == 0x000000, "Member 'INTERF_MeshWidget_C_EnableFlickerEffect::Result' has a wrong offset!");

// Function INTERF_MeshWidget.INTERF_MeshWidget_C.DisableFlickerEffect
// 0x0001 (0x0001 - 0x0000)
struct INTERF_MeshWidget_C_DisableFlickerEffect final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_MeshWidget_C_DisableFlickerEffect) == 0x000001, "Wrong alignment on INTERF_MeshWidget_C_DisableFlickerEffect");
static_assert(sizeof(INTERF_MeshWidget_C_DisableFlickerEffect) == 0x000001, "Wrong size on INTERF_MeshWidget_C_DisableFlickerEffect");
static_assert(offsetof(INTERF_MeshWidget_C_DisableFlickerEffect, Result) == 0x000000, "Member 'INTERF_MeshWidget_C_DisableFlickerEffect::Result' has a wrong offset!");

}

