#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SentryTurret_HostileBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_VisionTraceType_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "ENUM_DetectionState_structs.hpp"
#include "ENUM_DoorState_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.ExecuteUbergraph_INTERACT_SentryTurret_HostileBase
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Pawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Location;               // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Loudness;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Character;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_EventLocation;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           K2Node_ComponentBoundEvent_NewState;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           K2Node_ComponentBoundEvent_OldState;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_ComponentBoundEvent_Pawn_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Location_1;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase) == 0x000050, "Wrong size on INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, EntryPoint) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Pawn) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Location) == 0x000010, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Loudness) == 0x00001C, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Loudness' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Character) == 0x000020, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_EventLocation) == 0x000028, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_NewState) == 0x000034, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_NewState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_OldState) == 0x000035, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_OldState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Pawn_1) == 0x000038, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Pawn_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase, K2Node_ComponentBoundEvent_Location_1) == 0x000040, "Member 'INTERACT_SentryTurret_HostileBase_C_ExecuteUbergraph_INTERACT_SentryTurret_HostileBase::K2Node_ComponentBoundEvent_Location_1' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EventLocation;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           NewState;                                          // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           OldState;                                          // 0x0015(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, Character) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, EventLocation) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, NewState) == 0x000014, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::NewState' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature, OldState) == 0x000015, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemyDetection_K2Node_ComponentBoundEvent_2_OnDetectionStateChanged__DelegateSignature::OldState' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Pawn) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Location) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature, Loudness) == 0x000014, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_1_OnHearPawn__DelegateSignature::Loudness' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature) == 0x000018, "Wrong size on INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature, Pawn) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature::Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature, Location) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_BndEvt__INTERACT_SentryTurret_HostileBase_COMP_EnemySensingComponent_K2Node_ComponentBoundEvent_0_OnSeePawn__DelegateSignature::Location' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.TickSentryTurret
// 0x0160 (0x0160 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_TickSentryTurret final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DeltaRotationToTarget;                             // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TargetPitch;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetYaw;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasRotated;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTargetVisible;                                   // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetLocation;                                    // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           TargetCharacter;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentDetectionRating_DetectionRating; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetHeadTransform_Transform;               // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_Result;                           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAttackTarget_Result;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocationInTurretRange_Result;           // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HadVisionToTargetLastTick_Visible;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_VisionTraceType                          CallFunc_HadVisionToTargetLastTick_SightingType;   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTurretPitchAngleToLocation_Result;     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetEventLocation_EventLocation;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTurretYawAngleToLocation_Result;       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DetectionState                           CallFunc_GetDetectionState_Result;                 // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetTurretRelativeRotation_Result;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryDeploySentryTurret_Result;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocationInTurretRange_Result_1;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryConcealSentryTurret_Result;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEventWithHighestRating_DetectionEvent; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedStateTime_Result;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RotateTurretToTargetYaw_Changed;          // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RotateTurretToTargetPitch_Changed;        // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RotateTurretToTargetYaw_Changed_1;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RotateTurretToTargetPitch_Changed_1;      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result_1;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetEventLocation_EventLocation_1;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEventWithHighestRating_DetectionEvent_1; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                CallFunc_GetDoorState_Result_2;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret) == 0x000010, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_TickSentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret) == 0x000160, "Wrong size on INTERACT_SentryTurret_HostileBase_C_TickSentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, DeltaSeconds) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, DeltaRotationToTarget) == 0x000004, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::DeltaRotationToTarget' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, TargetPitch) == 0x000010, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::TargetPitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, TargetYaw) == 0x000014, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::TargetYaw' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, HasRotated) == 0x000018, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::HasRotated' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, IsTargetVisible) == 0x000019, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::IsTargetVisible' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, TargetLocation) == 0x00001C, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::TargetLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, TargetCharacter) == 0x000028, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::TargetCharacter' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, DetectionEvent) == 0x000030, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::DetectionEvent' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDoorState_Result) == 0x000038, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetCurrentDetectionRating_DetectionRating) == 0x00003C, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetCurrentDetectionRating_DetectionRating' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000041, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetVelocity_ReturnValue) == 0x000044, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000054, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetHeadTransform_Transform) == 0x000070, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetHeadTransform_Transform' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDetectedPawn_Pawn) == 0x0000A0, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakTransform_Rotation) == 0x0000B4, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsAlive_Result) == 0x0000CC, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_CanAttackTarget_Result) == 0x0000CD, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_CanAttackTarget_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsValid_ReturnValue_1) == 0x0000CE, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsLocationInTurretRange_Result) == 0x0000CF, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsLocationInTurretRange_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_HadVisionToTargetLastTick_Visible) == 0x0000D0, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_HadVisionToTargetLastTick_Visible' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_HadVisionToTargetLastTick_SightingType) == 0x0000D1, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_HadVisionToTargetLastTick_SightingType' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetTurretPitchAngleToLocation_Result) == 0x0000D4, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetTurretPitchAngleToLocation_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D8, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetEventLocation_EventLocation) == 0x0000DC, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetEventLocation_EventLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetTurretYawAngleToLocation_Result) == 0x0000E8, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetTurretYawAngleToLocation_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsValid_ReturnValue_2) == 0x0000EC, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDetectionState_Result) == 0x0000ED, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDetectionState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000EE, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetTurretRelativeRotation_Result) == 0x0000F0, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetTurretRelativeRotation_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_TryDeploySentryTurret_Result) == 0x0000FC, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_TryDeploySentryTurret_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_MakeRotator_ReturnValue) == 0x000100, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x00010C, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_IsLocationInTurretRange_Result_1) == 0x000118, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_IsLocationInTurretRange_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_TryConcealSentryTurret_Result) == 0x000119, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_TryConcealSentryTurret_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDetectionEventWithHighestRating_DetectionEvent) == 0x000120, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDetectionEventWithHighestRating_DetectionEvent' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakRotator_Roll) == 0x000128, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakRotator_Pitch) == 0x00012C, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BreakRotator_Yaw) == 0x000130, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_Abs_ReturnValue) == 0x000134, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetElapsedStateTime_Result) == 0x000138, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetElapsedStateTime_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00013C, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00013D, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_RotateTurretToTargetYaw_Changed) == 0x00013E, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_RotateTurretToTargetYaw_Changed' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_RotateTurretToTargetPitch_Changed) == 0x00013F, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_RotateTurretToTargetPitch_Changed' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_RotateTurretToTargetYaw_Changed_1) == 0x000140, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_RotateTurretToTargetYaw_Changed_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_RotateTurretToTargetPitch_Changed_1) == 0x000141, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_RotateTurretToTargetPitch_Changed_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDoorState_Result_1) == 0x000142, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDoorState_Result_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000143, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetEventLocation_EventLocation_1) == 0x000144, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetEventLocation_EventLocation_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDetectionEventWithHighestRating_DetectionEvent_1) == 0x000150, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDetectionEventWithHighestRating_DetectionEvent_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_BooleanAND_ReturnValue_1) == 0x000158, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, CallFunc_GetDoorState_Result_2) == 0x000159, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::CallFunc_GetDoorState_Result_2' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TickSentryTurret, K2Node_SwitchEnum_CmpSuccess) == 0x00015A, "Member 'INTERACT_SentryTurret_HostileBase_C_TickSentryTurret::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.UpdateSentryTurretTransition
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition final
{
public:
	float                                         StateProgress;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DoorState                                CallFunc_GetDoorState_Result;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition) == 0x000014, "Wrong size on INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, StateProgress) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::StateProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, Temp_bool_Variable) == 0x000004, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, CallFunc_GetDoorState_Result) == 0x00000C, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::CallFunc_GetDoorState_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition, K2Node_Select_Default) == 0x000010, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateSentryTurretTransition::K2Node_Select_Default' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.UpdateBodyMeshLocation
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation final
{
public:
	float                                         DeployProgress;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation) == 0x000004, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation) == 0x0000A8, "Wrong size on INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, DeployProgress) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::DeployProgress' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_FMin_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_BreakVector2D_X) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_Ease_ReturnValue) == 0x000010, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000020, "Member 'INTERACT_SentryTurret_HostileBase_C_UpdateBodyMeshLocation::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.TrySetSentryTurretIsAware
// 0x0006 (0x0006 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_Result;                           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware) == 0x000001, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware) == 0x000006, "Wrong size on INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, State) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::State' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, Result) == 0x000001, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, CallFunc_IsAlive_Result) == 0x000002, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::CallFunc_IsAlive_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'INTERACT_SentryTurret_HostileBase_C_TrySetSentryTurretIsAware::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.EVENT_OnTryMakeUnawareTick
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick final
{
public:
	bool                                          CallFunc_TrySetSentryTurretIsAware_Result;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyEvents_Result;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick) == 0x000028, "Wrong size on INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick, CallFunc_TrySetSentryTurretIsAware_Result) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick::CallFunc_TrySetSentryTurretIsAware_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick, CallFunc_HasAnyEvents_Result) == 0x000020, "Member 'INTERACT_SentryTurret_HostileBase_C_EVENT_OnTryMakeUnawareTick::CallFunc_HasAnyEvents_Result' has a wrong offset!");

// Function INTERACT_SentryTurret_HostileBase.INTERACT_SentryTurret_HostileBase_C.CanDeploySentryTurret
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  DetectionEvent;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentDetectionRating_DetectionRating; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEventWithHighestRating_DetectionEvent; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDeploySentryTurret_Result;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret) == 0x000008, "Wrong alignment on INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret");
static_assert(sizeof(INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret) == 0x000028, "Wrong size on INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret, Result) == 0x000000, "Member 'INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret, DetectionEvent) == 0x000008, "Member 'INTERACT_SentryTurret_HostileBase_C_CanDeploySentryTurret::DetectionEvent' has a wrong offset!");
