#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_HotbarSlottable

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.ActivateHotbarSlot
// 0x0001 (0x0001 - 0x0000)
struct INTERF_HotbarSlottable_C_ActivateHotbarSlot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_HotbarSlottable_C_ActivateHotbarSlot) == 0x000001, "Wrong alignment on INTERF_HotbarSlottable_C_ActivateHotbarSlot");
static_assert(sizeof(INTERF_HotbarSlottable_C_ActivateHotbarSlot) == 0x000001, "Wrong size on INTERF_HotbarSlottable_C_ActivateHotbarSlot");
static_assert(offsetof(INTERF_HotbarSlottable_C_ActivateHotbarSlot, Result) == 0x000000, "Member 'INTERF_HotbarSlottable_C_ActivateHotbarSlot::Result' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.DeactivateHotbarSlot
// 0x0001 (0x0001 - 0x0000)
struct INTERF_HotbarSlottable_C_DeactivateHotbarSlot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_HotbarSlottable_C_DeactivateHotbarSlot) == 0x000001, "Wrong alignment on INTERF_HotbarSlottable_C_DeactivateHotbarSlot");
static_assert(sizeof(INTERF_HotbarSlottable_C_DeactivateHotbarSlot) == 0x000001, "Wrong size on INTERF_HotbarSlottable_C_DeactivateHotbarSlot");
static_assert(offsetof(INTERF_HotbarSlottable_C_DeactivateHotbarSlot, Result) == 0x000000, "Member 'INTERF_HotbarSlottable_C_DeactivateHotbarSlot::Result' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.GetHotbarIcon
// 0x0008 (0x0008 - 0x0000)
struct INTERF_HotbarSlottable_C_GetHotbarIcon final
{
public:
	class UTexture*                               ResultIcon;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_HotbarSlottable_C_GetHotbarIcon) == 0x000008, "Wrong alignment on INTERF_HotbarSlottable_C_GetHotbarIcon");
static_assert(sizeof(INTERF_HotbarSlottable_C_GetHotbarIcon) == 0x000008, "Wrong size on INTERF_HotbarSlottable_C_GetHotbarIcon");
static_assert(offsetof(INTERF_HotbarSlottable_C_GetHotbarIcon, ResultIcon) == 0x000000, "Member 'INTERF_HotbarSlottable_C_GetHotbarIcon::ResultIcon' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.GetHotbarCount
// 0x0004 (0x0004 - 0x0000)
struct INTERF_HotbarSlottable_C_GetHotbarCount final
{
public:
	int32                                         ResultCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_HotbarSlottable_C_GetHotbarCount) == 0x000004, "Wrong alignment on INTERF_HotbarSlottable_C_GetHotbarCount");
static_assert(sizeof(INTERF_HotbarSlottable_C_GetHotbarCount) == 0x000004, "Wrong size on INTERF_HotbarSlottable_C_GetHotbarCount");
static_assert(offsetof(INTERF_HotbarSlottable_C_GetHotbarCount, ResultCount) == 0x000000, "Member 'INTERF_HotbarSlottable_C_GetHotbarCount::ResultCount' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.GetHotbarDisplayName
// 0x0018 (0x0018 - 0x0000)
struct INTERF_HotbarSlottable_C_GetHotbarDisplayName final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_HotbarSlottable_C_GetHotbarDisplayName) == 0x000008, "Wrong alignment on INTERF_HotbarSlottable_C_GetHotbarDisplayName");
static_assert(sizeof(INTERF_HotbarSlottable_C_GetHotbarDisplayName) == 0x000018, "Wrong size on INTERF_HotbarSlottable_C_GetHotbarDisplayName");
static_assert(offsetof(INTERF_HotbarSlottable_C_GetHotbarDisplayName, Result) == 0x000000, "Member 'INTERF_HotbarSlottable_C_GetHotbarDisplayName::Result' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.GetEquipState
// 0x0001 (0x0001 - 0x0000)
struct INTERF_HotbarSlottable_C_GetEquipState final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_HotbarSlottable_C_GetEquipState) == 0x000001, "Wrong alignment on INTERF_HotbarSlottable_C_GetEquipState");
static_assert(sizeof(INTERF_HotbarSlottable_C_GetEquipState) == 0x000001, "Wrong size on INTERF_HotbarSlottable_C_GetEquipState");
static_assert(offsetof(INTERF_HotbarSlottable_C_GetEquipState, Result) == 0x000000, "Member 'INTERF_HotbarSlottable_C_GetEquipState::Result' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.GetOwner
// 0x0008 (0x0008 - 0x0000)
struct INTERF_HotbarSlottable_C_GetOwner final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_HotbarSlottable_C_GetOwner) == 0x000008, "Wrong alignment on INTERF_HotbarSlottable_C_GetOwner");
static_assert(sizeof(INTERF_HotbarSlottable_C_GetOwner) == 0x000008, "Wrong size on INTERF_HotbarSlottable_C_GetOwner");
static_assert(offsetof(INTERF_HotbarSlottable_C_GetOwner, Owner) == 0x000000, "Member 'INTERF_HotbarSlottable_C_GetOwner::Owner' has a wrong offset!");

// Function INTERF_HotbarSlottable.INTERF_HotbarSlottable_C.TryUseConsumable
// 0x0001 (0x0001 - 0x0000)
struct INTERF_HotbarSlottable_C_TryUseConsumable final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_HotbarSlottable_C_TryUseConsumable) == 0x000001, "Wrong alignment on INTERF_HotbarSlottable_C_TryUseConsumable");
static_assert(sizeof(INTERF_HotbarSlottable_C_TryUseConsumable) == 0x000001, "Wrong size on INTERF_HotbarSlottable_C_TryUseConsumable");
static_assert(offsetof(INTERF_HotbarSlottable_C_TryUseConsumable, Result) == 0x000000, "Member 'INTERF_HotbarSlottable_C_TryUseConsumable::Result' has a wrong offset!");

}

