#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_RepulsorLift

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_RepulsorTargets_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.ExecuteUbergraph_INTERACT_RepulsorLift
// 0x00D0 (0x00D0 - 0x0000)
struct INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift");
static_assert(sizeof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift) == 0x0000D0, "Wrong size on INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, EntryPoint) == 0x000000, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000B0, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B8, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherComp) == 0x0000C0, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000C8, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, K2Node_ComponentBoundEvent_bVisibleState) == 0x0000CC, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, CallFunc_IsOverlappingActor_ReturnValue) == 0x0000CD, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift, CallFunc_Not_PreBool_ReturnValue) == 0x0000CE, "Member 'INTERACT_RepulsorLift_C_ExecuteUbergraph_INTERACT_RepulsorLift::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_RepulsorLift_C_BndEvt__COMP_CullableNavModifier_K2Node_ComponentBoundEvent_3_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'INTERACT_RepulsorLift_C_BndEvt__RepulsorField_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_RepulsorLift_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RepulsorLift_C_ReceiveTick) == 0x000004, "Wrong alignment on INTERACT_RepulsorLift_C_ReceiveTick");
static_assert(sizeof(INTERACT_RepulsorLift_C_ReceiveTick) == 0x000004, "Wrong size on INTERACT_RepulsorLift_C_ReceiveTick");
static_assert(offsetof(INTERACT_RepulsorLift_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'INTERACT_RepulsorLift_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.UserConstructionScript
// 0x0160 (0x0160 - 0x0000)
struct INTERACT_RepulsorLift_C_UserConstructionScript final
{
public:
	float                                         RepulsorFieldHalfHeight;                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RepulsorLift_C_UserConstructionScript) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_UserConstructionScript");
static_assert(sizeof(INTERACT_RepulsorLift_C_UserConstructionScript) == 0x000160, "Wrong size on INTERACT_RepulsorLift_C_UserConstructionScript");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, RepulsorFieldHalfHeight) == 0x000000, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::RepulsorFieldHalfHeight' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000098, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x0000A4, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x0000B0, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000BC, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_GridSnap_Float_ReturnValue) == 0x0000C0, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000C4, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00014C, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000150, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000158, "Member 'INTERACT_RepulsorLift_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.InitializeRepulsorLift
// 0x0040 (0x0040 - 0x0000)
struct INTERACT_RepulsorLift_C_InitializeRepulsorLift final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRepulsorLiftEnabledAndPowered_Result;   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewSecurityLevel)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSecurityForCurrentLevel_Result;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RepulsorLift_C_InitializeRepulsorLift) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_InitializeRepulsorLift");
static_assert(sizeof(INTERACT_RepulsorLift_C_InitializeRepulsorLift) == 0x000040, "Wrong size on INTERACT_RepulsorLift_C_InitializeRepulsorLift");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, GameInstance) == 0x000000, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_IsRepulsorLiftEnabledAndPowered_Result) == 0x00000A, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_IsRepulsorLiftEnabledAndPowered_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_GetSecurityForCurrentLevel_Result) == 0x000034, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_GetSecurityForCurrentLevel_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeRepulsorLift, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'INTERACT_RepulsorLift_C_InitializeRepulsorLift::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_RepulsorLift_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_RepulsorLift_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_RepulsorLift_C_InitializeAttributes");
static_assert(sizeof(INTERACT_RepulsorLift_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_RepulsorLift_C_InitializeAttributes");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_RepulsorLift_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_RepulsorLift_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_RepulsorLift.INTERACT_RepulsorLift_C.UpdateRepulsorField
// 0x02E8 (0x02E8 - 0x0000)
struct INTERACT_RepulsorLift_C_UpdateRepulsorField final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SelfDistance;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_RepulsorLift_C*               OverlappingRepulsor;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyVelocity;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ActorVelocity;                                     // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorLocation;                                     // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DampingImpulse;                                    // 0x0048(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentActor;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x0060(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0080(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosiveProjectile_Base_C*            K2Node_DynamicCast_AsExplosive_Projectile_Base;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADEBRIS_Base_C*                         K2Node_DynamicCast_AsDEBRIS_Base;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetDebrisMeshComponent_Result;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADismembermentLimb_Base_C*              K2Node_DynamicCast_AsDismemberment_Limb_Base;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRepulsorImpulseAtLocation_Impulse;     // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHorizontalDampingImpulse_DampingImpulse; // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHorizontalDampingImpulse_DampingImpulse_1; // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRepulsorImpulseAtLocation_Impulse_1;   // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACORPSE_SkeletalBase_C*                 K2Node_DynamicCast_AsCORPSE_Skeletal_Base;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_3;                          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue_1;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0258(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_RepulsorLift_C*               K2Node_DynamicCast_AsINTERACT_Repulsor_Lift;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Base_C*                         K2Node_DynamicCast_AsPICKUP_Base;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetPhysicsPrimitive_Primitive;            // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x02C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_RepulsorLift_C_UpdateRepulsorField) == 0x000008, "Wrong alignment on INTERACT_RepulsorLift_C_UpdateRepulsorField");
static_assert(sizeof(INTERACT_RepulsorLift_C_UpdateRepulsorField) == 0x0002E8, "Wrong size on INTERACT_RepulsorLift_C_UpdateRepulsorField");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, SkeletalMeshComponent) == 0x000000, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, SelfDistance) == 0x000008, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::SelfDistance' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, OverlappingRepulsor) == 0x000010, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::OverlappingRepulsor' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, ApplyVelocity) == 0x000018, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::ApplyVelocity' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, ActorVelocity) == 0x00001C, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::ActorVelocity' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, ActorLocation) == 0x000028, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::ActorLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, PrimitiveComponent) == 0x000038, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, Character) == 0x000040, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, DampingImpulse) == 0x000048, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::DampingImpulse' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CurrentActor) == 0x000058, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CurrentActor' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, Impulse) == 0x000060, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::Impulse' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, Temp_int_Loop_Counter_Variable) == 0x000070, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, Temp_int_Array_Index_Variable_1) == 0x000078, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_TryInteract_InteractResults) == 0x000080, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0000A0, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x0000A4, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_VSizeSquared_ReturnValue) == 0x0000B0, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000B4, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetComponentVelocity_ReturnValue) == 0x0000B8, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C4, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_AsExplosive_Projectile_Base) == 0x0000D0, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_AsExplosive_Projectile_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent) == 0x0000E0, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_AsDEBRIS_Base) == 0x0000E8, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_AsDEBRIS_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetDebrisMeshComponent_Result) == 0x0000F8, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetDebrisMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_AsDismemberment_Limb_Base) == 0x000100, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_AsDismemberment_Limb_Base' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetRepulsorImpulseAtLocation_Impulse) == 0x00010C, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetRepulsorImpulseAtLocation_Impulse' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetVelocity_ReturnValue) == 0x000118, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000124, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetHorizontalDampingImpulse_DampingImpulse) == 0x000130, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetHorizontalDampingImpulse_DampingImpulse' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetHorizontalDampingImpulse_DampingImpulse_1) == 0x00013C, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetHorizontalDampingImpulse_DampingImpulse_1' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000148, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_Add_VectorVector_ReturnValue) == 0x000154, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_RepulsorLift_C_UpdateRepulsorField, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000160, "Member 'INTERACT_RepulsorLift_C_UpdateRepulsorField::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
