#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Base

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Base.INTERACT_Base_C.OnInteractLockStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature final
{
public:
	class AINTERACT_Base_C*                       Interact;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature");
static_assert(sizeof(INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature) == 0x000008, "Wrong size on INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature");
static_assert(offsetof(INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature, Interact) == 0x000000, "Member 'INTERACT_Base_C_OnInteractLockStateChanged__DelegateSignature::Interact' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.OnInteractDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Base_C_OnInteractDestroyed__DelegateSignature final
{
public:
	class AINTERACT_Base_C*                       Interact;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_OnInteractDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_Base_C_OnInteractDestroyed__DelegateSignature");
static_assert(sizeof(INTERACT_Base_C_OnInteractDestroyed__DelegateSignature) == 0x000008, "Wrong size on INTERACT_Base_C_OnInteractDestroyed__DelegateSignature");
static_assert(offsetof(INTERACT_Base_C_OnInteractDestroyed__DelegateSignature, Interact) == 0x000000, "Member 'INTERACT_Base_C_OnInteractDestroyed__DelegateSignature::Interact' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.ExecuteUbergraph_INTERACT_Base
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive_1;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base) == 0x000008, "Wrong alignment on INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base");
static_assert(sizeof(INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base) == 0x000018, "Wrong size on INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base");
static_assert(offsetof(INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base, EntryPoint) == 0x000000, "Member 'INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base, K2Node_Event_Cursor_Primitive) == 0x000008, "Member 'INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base::K2Node_Event_Cursor_Primitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base, K2Node_Event_Cursor_Primitive_1) == 0x000010, "Member 'INTERACT_Base_C_ExecuteUbergraph_INTERACT_Base::K2Node_Event_Cursor_Primitive_1' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.OnCursorLeave
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Base_C_OnCursorLeave final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_OnCursorLeave) == 0x000008, "Wrong alignment on INTERACT_Base_C_OnCursorLeave");
static_assert(sizeof(INTERACT_Base_C_OnCursorLeave) == 0x000008, "Wrong size on INTERACT_Base_C_OnCursorLeave");
static_assert(offsetof(INTERACT_Base_C_OnCursorLeave, Cursor_Primitive) == 0x000000, "Member 'INTERACT_Base_C_OnCursorLeave::Cursor_Primitive' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.OnCursorEnter
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_Base_C_OnCursorEnter final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_OnCursorEnter) == 0x000008, "Wrong alignment on INTERACT_Base_C_OnCursorEnter");
static_assert(sizeof(INTERACT_Base_C_OnCursorEnter) == 0x000008, "Wrong size on INTERACT_Base_C_OnCursorEnter");
static_assert(offsetof(INTERACT_Base_C_OnCursorEnter, Cursor_Primitive) == 0x000000, "Member 'INTERACT_Base_C_OnCursorEnter::Cursor_Primitive' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetSecurityLockText
// 0x0090 (0x0090 - 0x0000)
struct INTERACT_Base_C_GetSecurityLockText final
{
public:
	int32                                         RequiredSecurityLevel;                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(INTERACT_Base_C_GetSecurityLockText) == 0x000008, "Wrong alignment on INTERACT_Base_C_GetSecurityLockText");
static_assert(sizeof(INTERACT_Base_C_GetSecurityLockText) == 0x000090, "Wrong size on INTERACT_Base_C_GetSecurityLockText");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, RequiredSecurityLevel) == 0x000000, "Member 'INTERACT_Base_C_GetSecurityLockText::RequiredSecurityLevel' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, Result) == 0x000008, "Member 'INTERACT_Base_C_GetSecurityLockText::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'INTERACT_Base_C_GetSecurityLockText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'INTERACT_Base_C_GetSecurityLockText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, K2Node_MakeArray_Array) == 0x000068, "Member 'INTERACT_Base_C_GetSecurityLockText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetSecurityLockText, CallFunc_Format_ReturnValue) == 0x000078, "Member 'INTERACT_Base_C_GetSecurityLockText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.HasHighPriorityTargetShape
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_HasHighPriorityTargetShape final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_HasHighPriorityTargetShape) == 0x000001, "Wrong alignment on INTERACT_Base_C_HasHighPriorityTargetShape");
static_assert(sizeof(INTERACT_Base_C_HasHighPriorityTargetShape) == 0x000001, "Wrong size on INTERACT_Base_C_HasHighPriorityTargetShape");
static_assert(offsetof(INTERACT_Base_C_HasHighPriorityTargetShape, Result) == 0x000000, "Member 'INTERACT_Base_C_HasHighPriorityTargetShape::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetTargetShape
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_Base_C_GetTargetShape");
static_assert(sizeof(INTERACT_Base_C_GetTargetShape) == 0x000010, "Wrong size on INTERACT_Base_C_GetTargetShape");
static_assert(offsetof(INTERACT_Base_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_Base_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_Base_C_GetTargetShape::ShapeComponent' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.TryInteract
// 0x0058 (0x0058 - 0x0000)
struct INTERACT_Base_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0038(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_Base_C_TryInteract");
static_assert(sizeof(INTERACT_Base_C_TryInteract) == 0x000058, "Wrong size on INTERACT_Base_C_TryInteract");
static_assert(offsetof(INTERACT_Base_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_Base_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_Base_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_Base_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_Base_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000038, "Member 'INTERACT_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.StopChanneling
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_StopChanneling final
{
public:
	class AActor*                                 NewChannelingInteract;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_StopChanneling) == 0x000008, "Wrong alignment on INTERACT_Base_C_StopChanneling");
static_assert(sizeof(INTERACT_Base_C_StopChanneling) == 0x000010, "Wrong size on INTERACT_Base_C_StopChanneling");
static_assert(offsetof(INTERACT_Base_C_StopChanneling, NewChannelingInteract) == 0x000000, "Member 'INTERACT_Base_C_StopChanneling::NewChannelingInteract' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_StopChanneling, Result) == 0x000008, "Member 'INTERACT_Base_C_StopChanneling::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.SetInteractLocked
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Base_C_SetInteractLocked final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_SetInteractLocked) == 0x000001, "Wrong alignment on INTERACT_Base_C_SetInteractLocked");
static_assert(sizeof(INTERACT_Base_C_SetInteractLocked) == 0x000002, "Wrong size on INTERACT_Base_C_SetInteractLocked");
static_assert(offsetof(INTERACT_Base_C_SetInteractLocked, Locked) == 0x000000, "Member 'INTERACT_Base_C_SetInteractLocked::Locked' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_SetInteractLocked, Result) == 0x000001, "Member 'INTERACT_Base_C_SetInteractLocked::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetInteractBusy
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Base_C_GetInteractBusy final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BusyMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERACT_Base_C_GetInteractBusy) == 0x000008, "Wrong alignment on INTERACT_Base_C_GetInteractBusy");
static_assert(sizeof(INTERACT_Base_C_GetInteractBusy) == 0x000020, "Wrong size on INTERACT_Base_C_GetInteractBusy");
static_assert(offsetof(INTERACT_Base_C_GetInteractBusy, Result) == 0x000000, "Member 'INTERACT_Base_C_GetInteractBusy::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetInteractBusy, BusyMessage) == 0x000008, "Member 'INTERACT_Base_C_GetInteractBusy::BusyMessage' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetInteractLocked
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Base_C_GetInteractLocked final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LockMessage;                                       // 0x0010(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERACT_Base_C_GetInteractLocked) == 0x000008, "Wrong alignment on INTERACT_Base_C_GetInteractLocked");
static_assert(sizeof(INTERACT_Base_C_GetInteractLocked) == 0x000028, "Wrong size on INTERACT_Base_C_GetInteractLocked");
static_assert(offsetof(INTERACT_Base_C_GetInteractLocked, SourceActor) == 0x000000, "Member 'INTERACT_Base_C_GetInteractLocked::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetInteractLocked, Result) == 0x000008, "Member 'INTERACT_Base_C_GetInteractLocked::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetInteractLocked, LockMessage) == 0x000010, "Member 'INTERACT_Base_C_GetInteractLocked::LockMessage' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetInteractBroken
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Base_C_GetInteractBroken final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BrokenMessage;                                     // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERACT_Base_C_GetInteractBroken) == 0x000008, "Wrong alignment on INTERACT_Base_C_GetInteractBroken");
static_assert(sizeof(INTERACT_Base_C_GetInteractBroken) == 0x000020, "Wrong size on INTERACT_Base_C_GetInteractBroken");
static_assert(offsetof(INTERACT_Base_C_GetInteractBroken, Result) == 0x000000, "Member 'INTERACT_Base_C_GetInteractBroken::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_GetInteractBroken, BrokenMessage) == 0x000008, "Member 'INTERACT_Base_C_GetInteractBroken::BrokenMessage' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.TryReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_TryReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_TryReceiveItem) == 0x000008, "Wrong alignment on INTERACT_Base_C_TryReceiveItem");
static_assert(sizeof(INTERACT_Base_C_TryReceiveItem) == 0x000010, "Wrong size on INTERACT_Base_C_TryReceiveItem");
static_assert(offsetof(INTERACT_Base_C_TryReceiveItem, Item) == 0x000000, "Member 'INTERACT_Base_C_TryReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryReceiveItem, Result) == 0x000008, "Member 'INTERACT_Base_C_TryReceiveItem::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.IsHiddenInteractablePrimitive
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_Base_C_IsHiddenInteractablePrimitive final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_IsHiddenInteractablePrimitive) == 0x000008, "Wrong alignment on INTERACT_Base_C_IsHiddenInteractablePrimitive");
static_assert(sizeof(INTERACT_Base_C_IsHiddenInteractablePrimitive) == 0x000018, "Wrong size on INTERACT_Base_C_IsHiddenInteractablePrimitive");
static_assert(offsetof(INTERACT_Base_C_IsHiddenInteractablePrimitive, Character) == 0x000000, "Member 'INTERACT_Base_C_IsHiddenInteractablePrimitive::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_IsHiddenInteractablePrimitive, CursorPrimitive) == 0x000008, "Member 'INTERACT_Base_C_IsHiddenInteractablePrimitive::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_IsHiddenInteractablePrimitive, Result) == 0x000010, "Member 'INTERACT_Base_C_IsHiddenInteractablePrimitive::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.ShouldIgnoreInteractRange
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_ShouldIgnoreInteractRange final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong alignment on INTERACT_Base_C_ShouldIgnoreInteractRange");
static_assert(sizeof(INTERACT_Base_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong size on INTERACT_Base_C_ShouldIgnoreInteractRange");
static_assert(offsetof(INTERACT_Base_C_ShouldIgnoreInteractRange, Result) == 0x000000, "Member 'INTERACT_Base_C_ShouldIgnoreInteractRange::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.CanReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_CanReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_CanReceiveItem) == 0x000008, "Wrong alignment on INTERACT_Base_C_CanReceiveItem");
static_assert(sizeof(INTERACT_Base_C_CanReceiveItem) == 0x000010, "Wrong size on INTERACT_Base_C_CanReceiveItem");
static_assert(offsetof(INTERACT_Base_C_CanReceiveItem, Item) == 0x000000, "Member 'INTERACT_Base_C_CanReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_CanReceiveItem, Result) == 0x000008, "Member 'INTERACT_Base_C_CanReceiveItem::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.IsInteractActivated
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_IsInteractActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_IsInteractActivated) == 0x000001, "Wrong alignment on INTERACT_Base_C_IsInteractActivated");
static_assert(sizeof(INTERACT_Base_C_IsInteractActivated) == 0x000001, "Wrong size on INTERACT_Base_C_IsInteractActivated");
static_assert(offsetof(INTERACT_Base_C_IsInteractActivated, Result) == 0x000000, "Member 'INTERACT_Base_C_IsInteractActivated::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetInteractDestroyed
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_GetInteractDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_GetInteractDestroyed) == 0x000001, "Wrong alignment on INTERACT_Base_C_GetInteractDestroyed");
static_assert(sizeof(INTERACT_Base_C_GetInteractDestroyed) == 0x000001, "Wrong size on INTERACT_Base_C_GetInteractDestroyed");
static_assert(offsetof(INTERACT_Base_C_GetInteractDestroyed, Result) == 0x000000, "Member 'INTERACT_Base_C_GetInteractDestroyed::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.CanInteractBeDestroyed
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_CanInteractBeDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_CanInteractBeDestroyed) == 0x000001, "Wrong alignment on INTERACT_Base_C_CanInteractBeDestroyed");
static_assert(sizeof(INTERACT_Base_C_CanInteractBeDestroyed) == 0x000001, "Wrong size on INTERACT_Base_C_CanInteractBeDestroyed");
static_assert(offsetof(INTERACT_Base_C_CanInteractBeDestroyed, Result) == 0x000000, "Member 'INTERACT_Base_C_CanInteractBeDestroyed::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.SetInteractPowered
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Base_C_SetInteractPowered final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_SetInteractPowered) == 0x000001, "Wrong alignment on INTERACT_Base_C_SetInteractPowered");
static_assert(sizeof(INTERACT_Base_C_SetInteractPowered) == 0x000002, "Wrong size on INTERACT_Base_C_SetInteractPowered");
static_assert(offsetof(INTERACT_Base_C_SetInteractPowered, State) == 0x000000, "Member 'INTERACT_Base_C_SetInteractPowered::State' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_SetInteractPowered, Result) == 0x000001, "Member 'INTERACT_Base_C_SetInteractPowered::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.CanModifyInteractPower
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Base_C_CanModifyInteractPower final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_CanModifyInteractPower) == 0x000001, "Wrong alignment on INTERACT_Base_C_CanModifyInteractPower");
static_assert(sizeof(INTERACT_Base_C_CanModifyInteractPower) == 0x000001, "Wrong size on INTERACT_Base_C_CanModifyInteractPower");
static_assert(offsetof(INTERACT_Base_C_CanModifyInteractPower, Result) == 0x000000, "Member 'INTERACT_Base_C_CanModifyInteractPower::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.TryDetachInteract
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Base_C_TryDetachInteract final
{
public:
	bool                                          SimulatePhysics;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_TryDetachInteract) == 0x000001, "Wrong alignment on INTERACT_Base_C_TryDetachInteract");
static_assert(sizeof(INTERACT_Base_C_TryDetachInteract) == 0x000002, "Wrong size on INTERACT_Base_C_TryDetachInteract");
static_assert(offsetof(INTERACT_Base_C_TryDetachInteract, SimulatePhysics) == 0x000000, "Member 'INTERACT_Base_C_TryDetachInteract::SimulatePhysics' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_TryDetachInteract, Result) == 0x000001, "Member 'INTERACT_Base_C_TryDetachInteract::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.GetChannelingHoldDuration
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_Base_C_GetChannelingHoldDuration final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Base_C_GetChannelingHoldDuration) == 0x000004, "Wrong alignment on INTERACT_Base_C_GetChannelingHoldDuration");
static_assert(sizeof(INTERACT_Base_C_GetChannelingHoldDuration) == 0x000004, "Wrong size on INTERACT_Base_C_GetChannelingHoldDuration");
static_assert(offsetof(INTERACT_Base_C_GetChannelingHoldDuration, Result) == 0x000000, "Member 'INTERACT_Base_C_GetChannelingHoldDuration::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.FinishedChannelingHoldInteraction
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_FinishedChannelingHoldInteraction final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_FinishedChannelingHoldInteraction) == 0x000008, "Wrong alignment on INTERACT_Base_C_FinishedChannelingHoldInteraction");
static_assert(sizeof(INTERACT_Base_C_FinishedChannelingHoldInteraction) == 0x000010, "Wrong size on INTERACT_Base_C_FinishedChannelingHoldInteraction");
static_assert(offsetof(INTERACT_Base_C_FinishedChannelingHoldInteraction, Character) == 0x000000, "Member 'INTERACT_Base_C_FinishedChannelingHoldInteraction::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_FinishedChannelingHoldInteraction, Result) == 0x000008, "Member 'INTERACT_Base_C_FinishedChannelingHoldInteraction::Result' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.ShouldSaveActor
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Base_C_ShouldSaveActor final
{
public:
	struct FStreamingSaveGameActorParams          Params_0;                                          // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingSaveGameActorParams          K2Node_MakeStruct_StreamingSaveGameActorParams;    // 0x0020(0x0018)()
};
static_assert(alignof(INTERACT_Base_C_ShouldSaveActor) == 0x000008, "Wrong alignment on INTERACT_Base_C_ShouldSaveActor");
static_assert(sizeof(INTERACT_Base_C_ShouldSaveActor) == 0x000038, "Wrong size on INTERACT_Base_C_ShouldSaveActor");
static_assert(offsetof(INTERACT_Base_C_ShouldSaveActor, Params_0) == 0x000000, "Member 'INTERACT_Base_C_ShouldSaveActor::Params_0' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ShouldSaveActor, ReturnValue) == 0x000018, "Member 'INTERACT_Base_C_ShouldSaveActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ShouldSaveActor, K2Node_MakeStruct_StreamingSaveGameActorParams) == 0x000020, "Member 'INTERACT_Base_C_ShouldSaveActor::K2Node_MakeStruct_StreamingSaveGameActorParams' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.ReceivePendingBodyTransforms
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_Base_C_ReceivePendingBodyTransforms final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     BodyTransforms;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_ReceivePendingBodyTransforms) == 0x000008, "Wrong alignment on INTERACT_Base_C_ReceivePendingBodyTransforms");
static_assert(sizeof(INTERACT_Base_C_ReceivePendingBodyTransforms) == 0x000020, "Wrong size on INTERACT_Base_C_ReceivePendingBodyTransforms");
static_assert(offsetof(INTERACT_Base_C_ReceivePendingBodyTransforms, SkeletalMeshComponent) == 0x000000, "Member 'INTERACT_Base_C_ReceivePendingBodyTransforms::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ReceivePendingBodyTransforms, BodyTransforms) == 0x000008, "Member 'INTERACT_Base_C_ReceivePendingBodyTransforms::BodyTransforms' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ReceivePendingBodyTransforms, ReturnValue) == 0x000018, "Member 'INTERACT_Base_C_ReceivePendingBodyTransforms::ReturnValue' has a wrong offset!");

// Function INTERACT_Base.INTERACT_Base_C.ReceivePendingCharacterVelocity
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Base_C_ReceivePendingCharacterVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Base_C_ReceivePendingCharacterVelocity) == 0x000004, "Wrong alignment on INTERACT_Base_C_ReceivePendingCharacterVelocity");
static_assert(sizeof(INTERACT_Base_C_ReceivePendingCharacterVelocity) == 0x000010, "Wrong size on INTERACT_Base_C_ReceivePendingCharacterVelocity");
static_assert(offsetof(INTERACT_Base_C_ReceivePendingCharacterVelocity, Velocity) == 0x000000, "Member 'INTERACT_Base_C_ReceivePendingCharacterVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(INTERACT_Base_C_ReceivePendingCharacterVelocity, ReturnValue) == 0x00000C, "Member 'INTERACT_Base_C_ReceivePendingCharacterVelocity::ReturnValue' has a wrong offset!");

}

