#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_CyberspaceTerminal

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "Engine_structs.hpp"
#include "NamedInteger_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.ExecuteUbergraph_INTERACT_CyberspaceTerminal
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal) == 0x000004, "Wrong alignment on INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal) == 0x000004, "Wrong size on INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal, EntryPoint) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_ExecuteUbergraph_INTERACT_CyberspaceTerminal::EntryPoint' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.InitializeCyberTerminal
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal) == 0x000004, "Wrong alignment on INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal) == 0x000014, "Wrong size on INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_InitializeCyberTerminal::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.TryCompleteTutorial
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_TryCompleteTutorial final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteTutorial_Result;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_TryCompleteTutorial");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial) == 0x000020, "Wrong size on INTERACT_CyberspaceTerminal_C_TryCompleteTutorial");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial, GameInstance) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_TryCompleteTutorial::GameInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_TryCompleteTutorial::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_TryCompleteTutorial::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'INTERACT_CyberspaceTerminal_C_TryCompleteTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryCompleteTutorial, CallFunc_TryCompleteTutorial_Result) == 0x000019, "Member 'INTERACT_CyberspaceTerminal_C_TryCompleteTutorial::CallFunc_TryCompleteTutorial_Result' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.TryAutoSave
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_TryAutoSave final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_TryAutoSave) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_TryAutoSave");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_TryAutoSave) == 0x000018, "Wrong size on INTERACT_CyberspaceTerminal_C_TryAutoSave");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryAutoSave, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_TryAutoSave::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryAutoSave, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_TryAutoSave::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_TryAutoSave, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_TryAutoSave::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.BeginDismount
// 0x0198 (0x0198 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_BeginDismount final
{
public:
	class APAWN_Hacker_Implant_C*                 HackerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NetLinkBroken;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HealthToRemove;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentHealth;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        HealthAttribInstance;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribModApplyData                    FatigueMod;                                        // 0x0020(0x00A0)(Edit, BlueprintVisible)
	class UAttributeDef*                          CallFunc_GetHealthAttrib_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyByType_Difficulty;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_WorldMove_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttributeDef*                          CallFunc_GetHealthAttrib_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue_1;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseValue_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribModResult                       CallFunc_SetBaseValue_ReturnValue;                 // 0x015C(0x0005)(NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAttribModResult                       CallFunc_SetBaseValue_ReturnValue_1;               // 0x0179(0x0005)(NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_BeginDismount) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_BeginDismount");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_BeginDismount) == 0x000198, "Wrong size on INTERACT_CyberspaceTerminal_C_BeginDismount");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, HackerPawn) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, NetLinkBroken) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::NetLinkBroken' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, HealthToRemove) == 0x00000C, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::HealthToRemove' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CurrentHealth) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CurrentHealth' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, HealthAttribInstance) == 0x000018, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::HealthAttribInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, FatigueMod) == 0x000020, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::FatigueMod' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetHealthAttrib_ReturnValue) == 0x0000C0, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetHealthAttrib_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetAttribInstance_ReturnValue) == 0x0000C8, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetGameInstance_ReturnValue) == 0x0000D8, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_DynamicCast_AsGI_Single_Player) == 0x0000E0, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetDifficultyByType_Difficulty) == 0x0000E9, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetDifficultyByType_Difficulty' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_SwitchEnum_CmpSuccess) == 0x0000EA, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_SpawnObject_ReturnValue) == 0x0000F0, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetHealthAttrib_ReturnValue_1) == 0x0000F8, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetHealthAttrib_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetAttribInstance_ReturnValue_1) == 0x000100, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetAttribInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetNeuralHUD_Result) == 0x000108, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetNeuralHUD_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_PlayAnimation_ReturnValue) == 0x000110, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000118, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_RegisterMoveControl_Result) == 0x000124, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_RegisterMoveControl_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000128, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x000134, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_ApplyMod_ReturnValue) == 0x000138, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000140, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000144, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000148, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Round_ReturnValue) == 0x00014C, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_FFloor_ReturnValue) == 0x000150, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000154, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_GetBaseValue_ReturnValue) == 0x000158, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_GetBaseValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_SetBaseValue_ReturnValue) == 0x00015C, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_SetBaseValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000168, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_DynamicCast_AsAnim_Montage) == 0x000170, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_SetBaseValue_ReturnValue_1) == 0x000179, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_SetBaseValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, CallFunc_ForceBeginAction_Action) == 0x000180, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginDismount, K2Node_CreateDelegate_OutputDelegate) == 0x000188, "Member 'INTERACT_CyberspaceTerminal_C_BeginDismount::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.EVENT_OnEnteredCyberWormhole
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole final
{
public:
	class USceneCaptureComponent2D*               SceneCapComp;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExpireMoveControl_Result;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole) == 0x000010, "Wrong size on INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole, SceneCapComp) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole::SceneCapComp' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole, CallFunc_ExpireMoveControl_Result) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnEnteredCyberWormhole::CallFunc_ExpireMoveControl_Result' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.EVENT_OnFinishedDismountingAction
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction final
{
public:
	class APAWN_Hacker_Implant_C*                 HackerPawn;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExpireMoveControl_Result;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction) == 0x000030, "Wrong size on INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, HackerPawn) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, CallFunc_GetInventoryComponent_Inventory) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, CallFunc_GetNeuralHUD_Result) == 0x000018, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::CallFunc_GetNeuralHUD_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000020, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction, CallFunc_ExpireMoveControl_Result) == 0x000029, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnFinishedDismountingAction::CallFunc_ExpireMoveControl_Result' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.ReceiveAnimationMessage
// 0x0018 (0x0018 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveAnimationMessage_Result;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage) == 0x000018, "Wrong size on INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage, Message) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage::Message' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage, Result) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage, CallFunc_ReceiveAnimationMessage_Result) == 0x000011, "Member 'INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage::CallFunc_ReceiveAnimationMessage_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000012, "Member 'INTERACT_CyberspaceTerminal_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.CreateChannelingMoveControl
// 0x00F0 (0x00F0 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl final
{
public:
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMOVECONTROL_Base_C*                    Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_CyberspaceTerminal_C*      CallFunc_SpawnObject_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl) == 0x000010, "Wrong alignment on INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl) == 0x0000F0, "Wrong size on INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, HackerPawn) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, Result) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_GetRelativeTransform_ReturnValue) == 0x000040, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakTransform_Location) == 0x000070, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Roll_1) == 0x000094, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Pitch_1) == 0x000098, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Yaw_1) == 0x00009C, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_MakeRotator_ReturnValue) == 0x0000A0, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_RegisterMoveControl_Result) == 0x0000AC, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_RegisterMoveControl_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_SpawnObject_ReturnValue) == 0x0000C0, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000C8, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Roll_2) == 0x0000D4, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Pitch_2) == 0x0000D8, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_BreakRotator_Yaw_2) == 0x0000DC, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E0, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl, CallFunc_MakeRotator_ReturnValue_1) == 0x0000E4, "Member 'INTERACT_CyberspaceTerminal_C_CreateChannelingMoveControl::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.BeginRiftTransition
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_BeginRiftTransition final
{
public:
	class APAWN_Hacker_Implant_C*                 HackerPawn;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker_1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_HUD_C>         CallFunc_GetSubtitleWidget_self_CastInput;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWIDGET_Subtitles_C*                    CallFunc_GetSubtitleWidget_Result;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryOpenCyberRiftFromTerminal_Result;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition) == 0x000008, "Wrong alignment on INTERACT_CyberspaceTerminal_C_BeginRiftTransition");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition) == 0x000088, "Wrong size on INTERACT_CyberspaceTerminal_C_BeginRiftTransition");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, HackerPawn) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::HackerPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_AsCON_Hacker) == 0x000020, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_ApplyMod_ReturnValue) == 0x000030, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_GetController_ReturnValue_1) == 0x000038, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_GetNeuralHUD_Result) == 0x000040, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_GetNeuralHUD_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_AsCON_Hacker_1) == 0x000048, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_AsCON_Hacker_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_GetSubtitleWidget_self_CastInput) == 0x000058, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_GetSubtitleWidget_self_CastInput' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_GetSubtitleWidget_Result) == 0x000068, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_GetSubtitleWidget_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000078, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_BeginRiftTransition, CallFunc_TryOpenCyberRiftFromTerminal_Result) == 0x000081, "Member 'INTERACT_CyberspaceTerminal_C_BeginRiftTransition::CallFunc_TryOpenCyberRiftFromTerminal_Result' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.UpdateTerminalEffectsState
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue_1;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState) == 0x000001, "Wrong alignment on INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState) == 0x000004, "Wrong size on INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState, State) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState::State' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState, CallFunc_IsActive_ReturnValue) == 0x000001, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState, CallFunc_IsActive_ReturnValue_1) == 0x000002, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState::CallFunc_IsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEffectsState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.UpdateTerminalEmissiveStrength
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength) == 0x000014, "Wrong size on INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength, EmissiveStrength) == 0x000004, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'INTERACT_CyberspaceTerminal_C_UpdateTerminalEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.IsTerminalFunctional
// 0x000C (0x000C - 0x0000)
struct INTERACT_CyberspaceTerminal_C_IsTerminalFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_IsTerminalFunctional) == 0x000004, "Wrong alignment on INTERACT_CyberspaceTerminal_C_IsTerminalFunctional");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_IsTerminalFunctional) == 0x00000C, "Wrong size on INTERACT_CyberspaceTerminal_C_IsTerminalFunctional");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_IsTerminalFunctional, Result) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_IsTerminalFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_IsTerminalFunctional, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_CyberspaceTerminal_C_IsTerminalFunctional::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_IsTerminalFunctional, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_IsTerminalFunctional::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_CyberspaceTerminal.INTERACT_CyberspaceTerminal_C.EVENT_OnDisableAttribChanged
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveScale;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged) == 0x000004, "Wrong alignment on INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged");
static_assert(sizeof(INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged) == 0x000014, "Wrong size on INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged, CurrValue) == 0x000000, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged, LastValue) == 0x000004, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged, EmissiveScale) == 0x000008, "Member 'INTERACT_CyberspaceTerminal_C_EVENT_OnDisableAttribChanged::EmissiveScale' has a wrong offset!");
