#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ComputerNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_DestructibleBase_classes.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_ComputerNode.INTERACT_ComputerNode_C
// 0x0378 (0x06C0 - 0x0348)
class AINTERACT_ComputerNode_C final : public AINTERACT_DestructibleBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_ComputerNode_C;            // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio;                                   // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_CullableNavModifier_C*            COMP_CullableNavModifier;                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FirePS;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Steam3;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Steam2;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Steam1;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim5;                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim4;                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim3;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim2;                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim1;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopPanel;                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_SmallScreen3;                         // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_SmallScreen2;                         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_SmallScreen1;                         // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_ScreenPanel3;                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_ScreenPanel2;                         // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_ScreenPanel1;                         // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_MediumScreen2;                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_MediumScreen1;                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe6;                          // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe5;                          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe4;                          // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe3;                          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe2;                          // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_CopperPipe1;                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_BottomPanel3;                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_BottomPanel2;                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_BottomPanel1;                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNode_TopRim6;                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_ScannableObject;                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EffectsNode;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerNodeMesh;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SecurityValuePerPylon;                             // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LowHealthDamagedState;                             // 0x045C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          HighHealthDamagedState;                            // 0x045D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          DestroyedAllDebris;                                // 0x045E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45F[0x1];                                      // 0x045F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowHealthRatio;                                    // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighHealthRatio;                                   // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomEjectDeviationAngle;                         // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CollisionDelayDuration;                            // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CollisionProfileName;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          SparkBurstFX;                                      // 0x0478(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          LargeExplosionFX;                                  // 0x04A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          FireFX;                                            // 0x04C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UFXSystemAsset>>  SmallExplosionFX;                                  // 0x04F0(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMeshComponent*>           EjectedLowHealthMeshComponents;                    // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           EjectedHighHealthMeshComponents;                   // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           EjectedMeshComponents;                             // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, float>      EjectPitchAngleMap;                                // 0x0530(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class UStaticMeshComponent*>             MeshComponentsToDestroy;                           // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FAttribModApplyData                    ExplosionDamageMod;                                // 0x05D0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class USoundCue>               SmallExplosionCue;                                 // 0x0670(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               MainExplosionCue;                                  // 0x0698(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_ComputerNode(int32 EntryPoint);
	void BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void UserConstructionScript();
	void InitializeAttributeEvents();
	void ApplyImpulseToChildMesh(class UStaticMeshComponent* Mesh);
	void EjectAllDebris();
	void EjectDebrisInAngleFromImpact(class UOBJ_ImpactData_C* ImpactData, float Angle, TArray<class UStaticMeshComponent*>& MeshComponents);
	void EnableLowHealthMeshCollision();
	void EnableHighHealthMeshCollision();
	void EnableAllCollision();
	void AssignMeshEjectPitchAngles();
	void AddMeshEjectPitchAngle(TArray<class UStaticMeshComponent*>& MeshComponent, float PitchDegrees);
	void AssignMeshesToDestroy();
	void DisableSmokeParticleSystem();
	void UpdateMaterialParameters();
	void UpdateComputerNodeVisibility(bool VisibleState);
	void UpdateNavigationModifier();
	void TryDestroyAllDebris(bool DuringBeginPlay);
	void CreateExplosionEffects();
	void PlayEffectsFromComponent(TSoftObjectPtr<class UFXSystemAsset> EffectsSystem, class USceneComponent* SceneComponent, const struct FVector& RelativeOffset);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);
	void UpdateComputerNodeEmissive(float EmissiveStrength);
	void InitializeDestructible();
	void OnDeath(class AActor* SourceActor, bool* Result);
	void OnTakeDamage(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams, bool* Result);
	void UpdateDeathSettings(bool DuringBeginPlay, bool* Result);
	void GetArmorAugmentationPercentage(class UOBJ_ImpactData_C* ImpactData, float* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_ComputerNode_C">();
	}
	static class AINTERACT_ComputerNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_ComputerNode_C>();
	}
};
static_assert(alignof(AINTERACT_ComputerNode_C) == 0x000008, "Wrong alignment on AINTERACT_ComputerNode_C");
static_assert(sizeof(AINTERACT_ComputerNode_C) == 0x0006C0, "Wrong size on AINTERACT_ComputerNode_C");
static_assert(offsetof(AINTERACT_ComputerNode_C, UberGraphFrame_INTERACT_ComputerNode_C) == 0x000348, "Member 'AINTERACT_ComputerNode_C::UberGraphFrame_INTERACT_ComputerNode_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, COMP_VoxelAudio) == 0x000350, "Member 'AINTERACT_ComputerNode_C::COMP_VoxelAudio' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, COMP_CullableNavModifier) == 0x000358, "Member 'AINTERACT_ComputerNode_C::COMP_CullableNavModifier' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, FirePS) == 0x000360, "Member 'AINTERACT_ComputerNode_C::FirePS' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, Steam3) == 0x000368, "Member 'AINTERACT_ComputerNode_C::Steam3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, Steam2) == 0x000370, "Member 'AINTERACT_ComputerNode_C::Steam2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, Steam1) == 0x000378, "Member 'AINTERACT_ComputerNode_C::Steam1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim5) == 0x000380, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim5' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim4) == 0x000388, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim4' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim3) == 0x000390, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim2) == 0x000398, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim1) == 0x0003A0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopPanel) == 0x0003A8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopPanel' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_SmallScreen3) == 0x0003B0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_SmallScreen3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_SmallScreen2) == 0x0003B8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_SmallScreen2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_SmallScreen1) == 0x0003C0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_SmallScreen1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_ScreenPanel3) == 0x0003C8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_ScreenPanel3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_ScreenPanel2) == 0x0003D0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_ScreenPanel2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_ScreenPanel1) == 0x0003D8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_ScreenPanel1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_MediumScreen2) == 0x0003E0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_MediumScreen2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_MediumScreen1) == 0x0003E8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_MediumScreen1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe6) == 0x0003F0, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe6' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe5) == 0x0003F8, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe5' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe4) == 0x000400, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe4' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe3) == 0x000408, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe2) == 0x000410, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_CopperPipe1) == 0x000418, "Member 'AINTERACT_ComputerNode_C::ComputerNode_CopperPipe1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_BottomPanel3) == 0x000420, "Member 'AINTERACT_ComputerNode_C::ComputerNode_BottomPanel3' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_BottomPanel2) == 0x000428, "Member 'AINTERACT_ComputerNode_C::ComputerNode_BottomPanel2' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_BottomPanel1) == 0x000430, "Member 'AINTERACT_ComputerNode_C::ComputerNode_BottomPanel1' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNode_TopRim6) == 0x000438, "Member 'AINTERACT_ComputerNode_C::ComputerNode_TopRim6' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, COMP_ScannableObject) == 0x000440, "Member 'AINTERACT_ComputerNode_C::COMP_ScannableObject' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, EffectsNode) == 0x000448, "Member 'AINTERACT_ComputerNode_C::EffectsNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ComputerNodeMesh) == 0x000450, "Member 'AINTERACT_ComputerNode_C::ComputerNodeMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, SecurityValuePerPylon) == 0x000458, "Member 'AINTERACT_ComputerNode_C::SecurityValuePerPylon' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, LowHealthDamagedState) == 0x00045C, "Member 'AINTERACT_ComputerNode_C::LowHealthDamagedState' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, HighHealthDamagedState) == 0x00045D, "Member 'AINTERACT_ComputerNode_C::HighHealthDamagedState' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, DestroyedAllDebris) == 0x00045E, "Member 'AINTERACT_ComputerNode_C::DestroyedAllDebris' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, LowHealthRatio) == 0x000460, "Member 'AINTERACT_ComputerNode_C::LowHealthRatio' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, HighHealthRatio) == 0x000464, "Member 'AINTERACT_ComputerNode_C::HighHealthRatio' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, RandomEjectDeviationAngle) == 0x000468, "Member 'AINTERACT_ComputerNode_C::RandomEjectDeviationAngle' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, CollisionDelayDuration) == 0x00046C, "Member 'AINTERACT_ComputerNode_C::CollisionDelayDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, CollisionProfileName) == 0x000470, "Member 'AINTERACT_ComputerNode_C::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, SparkBurstFX) == 0x000478, "Member 'AINTERACT_ComputerNode_C::SparkBurstFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, LargeExplosionFX) == 0x0004A0, "Member 'AINTERACT_ComputerNode_C::LargeExplosionFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, FireFX) == 0x0004C8, "Member 'AINTERACT_ComputerNode_C::FireFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, SmallExplosionFX) == 0x0004F0, "Member 'AINTERACT_ComputerNode_C::SmallExplosionFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, EjectedLowHealthMeshComponents) == 0x000500, "Member 'AINTERACT_ComputerNode_C::EjectedLowHealthMeshComponents' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, EjectedHighHealthMeshComponents) == 0x000510, "Member 'AINTERACT_ComputerNode_C::EjectedHighHealthMeshComponents' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, EjectedMeshComponents) == 0x000520, "Member 'AINTERACT_ComputerNode_C::EjectedMeshComponents' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, EjectPitchAngleMap) == 0x000530, "Member 'AINTERACT_ComputerNode_C::EjectPitchAngleMap' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, MeshComponentsToDestroy) == 0x000580, "Member 'AINTERACT_ComputerNode_C::MeshComponentsToDestroy' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, ExplosionDamageMod) == 0x0005D0, "Member 'AINTERACT_ComputerNode_C::ExplosionDamageMod' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, SmallExplosionCue) == 0x000670, "Member 'AINTERACT_ComputerNode_C::SmallExplosionCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_ComputerNode_C, MainExplosionCue) == 0x000698, "Member 'AINTERACT_ComputerNode_C::MainExplosionCue' has a wrong offset!");

}

