#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_TransdermalDispenser

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.ExecuteUbergraph_INTERACT_TransdermalDispenser
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser) == 0x000004, "Wrong alignment on INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser) == 0x000008, "Wrong size on INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser, EntryPoint) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_TransdermalDispenser_C_ExecuteUbergraph_INTERACT_TransdermalDispenser::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_BndEvt__INTERACT_TransdermalDispenser_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.GetTargetShape
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_TransdermalDispenser_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        CursorShapeComponent;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        K2Node_DynamicCast_AsShape_Component;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldFocusOnInteract_Result;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_GetTargetShape");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_GetTargetShape) == 0x000038, "Wrong size on INTERACT_TransdermalDispenser_C_GetTargetShape");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CursorShapeComponent) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CursorShapeComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, K2Node_DynamicCast_AsShape_Component) == 0x000018, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::K2Node_DynamicCast_AsShape_Component' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_Array_Contains_ReturnValue) == 0x000021, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_Array_Contains_ReturnValue_1) == 0x000022, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000023, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GetTargetShape, CallFunc_ShouldFocusOnInteract_Result) == 0x000030, "Member 'INTERACT_TransdermalDispenser_C_GetTargetShape::CallFunc_ShouldFocusOnInteract_Result' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.TryInteract
// 0x0298 (0x0298 - 0x0000)
struct INTERACT_TransdermalDispenser_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RequiredCost;                                      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0048(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0068(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0088(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDispenserFunctional_Result;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00B0(0x0020)(HasGetValueTypeHash)
	uint8                                         CallFunc_GetMinCostIncrement_Result;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BMax_ReturnValue;                         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetBestCostIncrement_Result;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryPurchasePatch_Result;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryPurchasePatch_FailedText;              // 0x0100(0x0018)()
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x0118(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyPatchesInStock_Result;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x0140(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0160(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_6;        // 0x0180(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0018)()
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_7;        // 0x0210(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_8;        // 0x0230(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_TryRefundPayment_Result;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryMakePayment_Result;                    // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryBeginFocusInteraction_Result;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldFocusOnInteract_Result;             // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_9;        // 0x0278(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_TryInteract) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_TryInteract");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_TryInteract) == 0x000298, "Wrong size on INTERACT_TransdermalDispenser_C_TryInteract");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, Character) == 0x000038, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, RequiredCost) == 0x000040, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::RequiredCost' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000048, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000068, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000088, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_IsDispenserFunctional_Result) == 0x0000A9, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_IsDispenserFunctional_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000B0, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_GetMinCostIncrement_Result) == 0x0000D0, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_GetMinCostIncrement_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_GetInventoryComponent_Inventory) == 0x0000D8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_GetItemCount_Result) == 0x0000E0, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_Min_ReturnValue) == 0x0000E4, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000E8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_BMax_ReturnValue) == 0x0000E9, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_BMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0000F0, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_GetBestCostIncrement_Result) == 0x0000F9, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_GetBestCostIncrement_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryPurchasePatch_Result) == 0x0000FA, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryPurchasePatch_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryPurchasePatch_FailedText) == 0x000100, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryPurchasePatch_FailedText' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x000118, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_HasAnyPatchesInStock_Result) == 0x000138, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_HasAnyPatchesInStock_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x000140, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000160, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_6) == 0x000180, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_6' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001A0, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_Greater_ByteByte_ReturnValue) == 0x0001A4, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_FormatArgumentData) == 0x0001A8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeArray_Array) == 0x0001E8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_7) == 0x000210, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_7' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_8) == 0x000230, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_8' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryRefundPayment_Result) == 0x000250, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryRefundPayment_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000251, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryMakePayment_Result) == 0x000252, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryMakePayment_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000253, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000258, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x000260, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_GetController_ReturnValue) == 0x000268, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_TryBeginFocusInteraction_Result) == 0x000270, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_TryBeginFocusInteraction_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, CallFunc_ShouldFocusOnInteract_Result) == 0x000271, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::CallFunc_ShouldFocusOnInteract_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_9) == 0x000278, "Member 'INTERACT_TransdermalDispenser_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_9' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.InitializeTransdermalDispenser
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser) == 0x000020, "Wrong size on INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'INTERACT_TransdermalDispenser_C_InitializeTransdermalDispenser::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.InitializeKeypadComponents
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_TransdermalDispenser_C_InitializeKeypadComponents final
{
public:
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_InitializeKeypadComponents) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_InitializeKeypadComponents");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_InitializeKeypadComponents) == 0x000010, "Wrong size on INTERACT_TransdermalDispenser_C_InitializeKeypadComponents");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeKeypadComponents, K2Node_MakeArray_Array) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_InitializeKeypadComponents::K2Node_MakeArray_Array' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_TransdermalDispenser_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_TransdermalDispenser_C_InitializeAttributes");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_TransdermalDispenser_C_InitializeAttributes");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.UpdateEmissiveStrength
// 0x0004 (0x0004 - 0x0000)
struct INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength) == 0x000004, "Wrong alignment on INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength) == 0x000004, "Wrong size on INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength, Scale) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_UpdateEmissiveStrength::Scale' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.GenerateInitialStock
// 0x0088 (0x0088 - 0x0000)
struct INTERACT_TransdermalDispenser_C_GenerateInitialStock final
{
public:
	TSoftClassPtr<class UClass>                   PatchClass;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         PatchIndex;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PatchCount;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Map_Find_Value;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetPatchClassAtIndex_Result;              // 0x0050(0x0028)(HasGetValueTypeHash)
	uint8                                         CallFunc_ModifyPatchStock_NewCount;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_GenerateInitialStock) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_GenerateInitialStock");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_GenerateInitialStock) == 0x000088, "Wrong size on INTERACT_TransdermalDispenser_C_GenerateInitialStock");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, PatchClass) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::PatchClass' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, PatchIndex) == 0x000028, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::PatchIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, PatchCount) == 0x00002C, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::PatchCount' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000030, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, Temp_int_Variable) == 0x000038, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Map_Find_Value) == 0x000044, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Map_Find_ReturnValue) == 0x000045, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000048, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_GetPatchClassAtIndex_Result) == 0x000050, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_GetPatchClassAtIndex_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_ModifyPatchStock_NewCount) == 0x000078, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_ModifyPatchStock_NewCount' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Map_Length_ReturnValue) == 0x00007C, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_GenerateInitialStock, CallFunc_Min_ReturnValue) == 0x000080, "Member 'INTERACT_TransdermalDispenser_C_GenerateInitialStock::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.OnPaidCost
// 0x0068 (0x0068 - 0x0000)
struct INTERACT_TransdermalDispenser_C_OnPaidCost final
{
public:
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0020(0x0030)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_OnPaidCost) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_OnPaidCost");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_OnPaidCost) == 0x000068, "Wrong size on INTERACT_TransdermalDispenser_C_OnPaidCost");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, K2Node_MakeArray_Array) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, K2Node_MakeArray_Array_1) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000020, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, K2Node_DynamicCast_AsGI_Single_Player) == 0x000058, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_OnPaidCost, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'INTERACT_TransdermalDispenser_C_OnPaidCost::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.TryMakePayment
// 0x0048 (0x0048 - 0x0000)
struct INTERACT_TransdermalDispenser_C_TryMakePayment final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CostToPay;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CoinCount;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        JunkBag;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveItemCountByClass_RemovedCount;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_TryMakePayment) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_TryMakePayment");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_TryMakePayment) == 0x000048, "Wrong size on INTERACT_TransdermalDispenser_C_TryMakePayment");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, Character) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CostToPay) == 0x000008, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CostToPay' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, Result) == 0x000009, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CoinCount) == 0x00000C, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CoinCount' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, JunkBag) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::JunkBag' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000020, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000024, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_GetInventoryComponent_Inventory) == 0x000028, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_GetBagByType_Bag) == 0x000030, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_Add_ByteByte_ReturnValue) == 0x000038, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_RemoveItemCountByClass_RemovedCount) == 0x00003C, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_RemoveItemCountByClass_RemovedCount' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_GetItemCount_Result) == 0x000040, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryMakePayment, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'INTERACT_TransdermalDispenser_C_TryMakePayment::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.TryRefundPayment
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_TransdermalDispenser_C_TryRefundPayment final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamedFloat>                    K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0038(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrantItem_Result;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_TryRefundPayment) == 0x000008, "Wrong alignment on INTERACT_TransdermalDispenser_C_TryRefundPayment");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_TryRefundPayment) == 0x0000A8, "Wrong size on INTERACT_TransdermalDispenser_C_TryRefundPayment");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, Character) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::Character' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, Result) == 0x000008, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_MakeArray_Array) == 0x000010, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_MakeArray_Array_1) == 0x000028, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000038, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000068, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, CallFunc_GetInventoryComponent_Inventory) == 0x000070, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000078, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, CallFunc_GrantItem_Result) == 0x000088, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::CallFunc_GrantItem_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, CallFunc_GetGameInstance_ReturnValue) == 0x000090, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_DynamicCast_AsGI_Single_Player) == 0x000098, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_TryRefundPayment, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'INTERACT_TransdermalDispenser_C_TryRefundPayment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function INTERACT_TransdermalDispenser.INTERACT_TransdermalDispenser_C.IsDispenserFunctional
// 0x000C (0x000C - 0x0000)
struct INTERACT_TransdermalDispenser_C_IsDispenserFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_TransdermalDispenser_C_IsDispenserFunctional) == 0x000004, "Wrong alignment on INTERACT_TransdermalDispenser_C_IsDispenserFunctional");
static_assert(sizeof(INTERACT_TransdermalDispenser_C_IsDispenserFunctional) == 0x00000C, "Wrong size on INTERACT_TransdermalDispenser_C_IsDispenserFunctional");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_IsDispenserFunctional, Result) == 0x000000, "Member 'INTERACT_TransdermalDispenser_C_IsDispenserFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_TransdermalDispenser_C_IsDispenserFunctional, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_TransdermalDispenser_C_IsDispenserFunctional::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
