#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Antenna

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Channeling_Base_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_Antenna.INTERACT_Antenna_C
// 0x0270 (0x05C0 - 0x0350)
class AINTERACT_Antenna_C final : public AINTERACT_Channeling_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_Antenna_C;                 // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorwayNode;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MountNode;                                         // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bottom_Panel_2;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bottom_Panel_1;                                 // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bottom_Panel_4;                                 // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Front_Panel;                                    // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Front_Screen_1;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Front_Screen_2;                                 // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Back_Screen;                                    // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Side_Panel;                                     // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Side_Screen;                                    // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Top_Panel_1;                                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Top_Panel_2;                                    // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Top_Side_Panel;                                 // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bottom_Panel_3;                                 // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AntennaPanelSceneNode;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Tower4;                                 // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Tower3;                                 // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Tower2;                                 // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Tower1;                                 // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Tower;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Antenna_Base;                                   // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlastiqueMesh;                                     // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_Base_C*                       TargetInteract;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlastiqueSecureText;                               // 0x0430(0x0018)(Edit, BlueprintVisible)
	class FText                                   NeedPlastiqueText;                                 // 0x0448(0x0018)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   RequiredItem;                                      // 0x0460(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CompleteQuestOnDestroy;                            // 0x0488(0x0010)(Edit, BlueprintVisible, NoDestructor)
	int32                                         DetonationTimerSeconds;                            // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlastRadius;                                       // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlastImpulse;                                      // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplosionDamage;                                   // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DetonateTimestamp;                                 // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x04AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          ExplosionSystem;                                   // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ExplosionCue;                                      // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               TimerBeepCue;                                      // 0x0500(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   AntennaDestroyedText;                              // 0x0528(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UFXSystemAsset>          DoorwayExplosionSystem;                            // 0x0540(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UITEM_Story_Base_C*                     RequiredItemInstance;                              // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       SpawnedPlastiqueActor;                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DrawPlastiqueAnimMessage;                          // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PlacePlastiqueAnimMessage;                         // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ArmPlastiqueAnimMessage;                           // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnAntennaDestroyedEvent;                           // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           DetonateTickTimerHandle;                           // 0x05B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnAntennaDestroyedEvent__DelegateSignature();
	void ExecuteUbergraph_INTERACT_Antenna(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BndEvt__INTERACT_PlastiqueTarget_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void InitializeAntenna();
	void InitializeAttributes();
	void SetAntennaState(bool Active);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void FindAndCacheRequiredItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void TryDrawPlastique();
	void TryPlacePlastique();
	void TryArmPlastique();
	void UpdateDetonationTimer();
	void EVENT_OnTickDetonationTimer();
	void TryClearDetonationTimer();
	void DealExplosionDamage();
	void SpawnAntennaDebris();
	void UpdateAntennaVisibility(bool VisibilityState);
	void DisableAntennaCollision();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void TryToggleTargetInteractable();
	void IsAntennaDestroyed(bool* Result);
	void OnAntennaDestroyed();
	void TryCompleteDestroyQuest();
	void UpdateAntennaMeshEmissive(float Scale);
	void UpdateAntennaDestroyedState();
	void CanInteractBeDestroyed(bool* Result);
	void GetInteractDestroyed(bool* Result);
	void ResumeChannelingSequence(class APAWN_Hacker_Simple_C* HackerPawn, bool* IsWaitingToHolster);
	void CreateChannelingMoveControl(class APAWN_Hacker_Simple_C* HackerPawn, class UMOVECONTROL_Base_C** Result);
	void OnChannelingMontageFinished();
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);
	void EVENT_OnAttribInstanceCreated(class UAttribInstance* AttribInstance);
	void EVENT_OnStartedUnloadingLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_Antenna_C">();
	}
	static class AINTERACT_Antenna_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_Antenna_C>();
	}
};
static_assert(alignof(AINTERACT_Antenna_C) == 0x000008, "Wrong alignment on AINTERACT_Antenna_C");
static_assert(sizeof(AINTERACT_Antenna_C) == 0x0005C0, "Wrong size on AINTERACT_Antenna_C");
static_assert(offsetof(AINTERACT_Antenna_C, UberGraphFrame_INTERACT_Antenna_C) == 0x000350, "Member 'AINTERACT_Antenna_C::UberGraphFrame_INTERACT_Antenna_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, COMP_AttribManager) == 0x000358, "Member 'AINTERACT_Antenna_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DoorwayNode) == 0x000360, "Member 'AINTERACT_Antenna_C::DoorwayNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, MountNode) == 0x000368, "Member 'AINTERACT_Antenna_C::MountNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, COMP_VoxelCullable) == 0x000370, "Member 'AINTERACT_Antenna_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, ScanBox) == 0x000378, "Member 'AINTERACT_Antenna_C::ScanBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Bottom_Panel_2) == 0x000380, "Member 'AINTERACT_Antenna_C::SM_Bottom_Panel_2' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Bottom_Panel_1) == 0x000388, "Member 'AINTERACT_Antenna_C::SM_Bottom_Panel_1' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Bottom_Panel_4) == 0x000390, "Member 'AINTERACT_Antenna_C::SM_Bottom_Panel_4' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Front_Panel) == 0x000398, "Member 'AINTERACT_Antenna_C::SM_Front_Panel' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Front_Screen_1) == 0x0003A0, "Member 'AINTERACT_Antenna_C::SM_Front_Screen_1' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Front_Screen_2) == 0x0003A8, "Member 'AINTERACT_Antenna_C::SM_Front_Screen_2' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Back_Screen) == 0x0003B0, "Member 'AINTERACT_Antenna_C::SM_Back_Screen' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Side_Panel) == 0x0003B8, "Member 'AINTERACT_Antenna_C::SM_Side_Panel' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Side_Screen) == 0x0003C0, "Member 'AINTERACT_Antenna_C::SM_Side_Screen' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Top_Panel_1) == 0x0003C8, "Member 'AINTERACT_Antenna_C::SM_Top_Panel_1' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Top_Panel_2) == 0x0003D0, "Member 'AINTERACT_Antenna_C::SM_Top_Panel_2' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Top_Side_Panel) == 0x0003D8, "Member 'AINTERACT_Antenna_C::SM_Top_Side_Panel' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Bottom_Panel_3) == 0x0003E0, "Member 'AINTERACT_Antenna_C::SM_Bottom_Panel_3' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, AntennaPanelSceneNode) == 0x0003E8, "Member 'AINTERACT_Antenna_C::AntennaPanelSceneNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Tower4) == 0x0003F0, "Member 'AINTERACT_Antenna_C::SM_Antenna_Tower4' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Tower3) == 0x0003F8, "Member 'AINTERACT_Antenna_C::SM_Antenna_Tower3' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Tower2) == 0x000400, "Member 'AINTERACT_Antenna_C::SM_Antenna_Tower2' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Tower1) == 0x000408, "Member 'AINTERACT_Antenna_C::SM_Antenna_Tower1' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Tower) == 0x000410, "Member 'AINTERACT_Antenna_C::SM_Antenna_Tower' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SM_Antenna_Base) == 0x000418, "Member 'AINTERACT_Antenna_C::SM_Antenna_Base' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, PlastiqueMesh) == 0x000420, "Member 'AINTERACT_Antenna_C::PlastiqueMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, TargetInteract) == 0x000428, "Member 'AINTERACT_Antenna_C::TargetInteract' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, PlastiqueSecureText) == 0x000430, "Member 'AINTERACT_Antenna_C::PlastiqueSecureText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, NeedPlastiqueText) == 0x000448, "Member 'AINTERACT_Antenna_C::NeedPlastiqueText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, RequiredItem) == 0x000460, "Member 'AINTERACT_Antenna_C::RequiredItem' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, CompleteQuestOnDestroy) == 0x000488, "Member 'AINTERACT_Antenna_C::CompleteQuestOnDestroy' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DetonationTimerSeconds) == 0x000498, "Member 'AINTERACT_Antenna_C::DetonationTimerSeconds' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, BlastRadius) == 0x00049C, "Member 'AINTERACT_Antenna_C::BlastRadius' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, BlastImpulse) == 0x0004A0, "Member 'AINTERACT_Antenna_C::BlastImpulse' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, ExplosionDamage) == 0x0004A4, "Member 'AINTERACT_Antenna_C::ExplosionDamage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DetonateTimestamp) == 0x0004A8, "Member 'AINTERACT_Antenna_C::DetonateTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, IsDestroyed) == 0x0004AC, "Member 'AINTERACT_Antenna_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, ExplosionSystem) == 0x0004B0, "Member 'AINTERACT_Antenna_C::ExplosionSystem' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, ExplosionCue) == 0x0004D8, "Member 'AINTERACT_Antenna_C::ExplosionCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, TimerBeepCue) == 0x000500, "Member 'AINTERACT_Antenna_C::TimerBeepCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, AntennaDestroyedText) == 0x000528, "Member 'AINTERACT_Antenna_C::AntennaDestroyedText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DoorwayExplosionSystem) == 0x000540, "Member 'AINTERACT_Antenna_C::DoorwayExplosionSystem' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, RequiredItemInstance) == 0x000568, "Member 'AINTERACT_Antenna_C::RequiredItemInstance' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, SpawnedPlastiqueActor) == 0x000570, "Member 'AINTERACT_Antenna_C::SpawnedPlastiqueActor' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DrawPlastiqueAnimMessage) == 0x000578, "Member 'AINTERACT_Antenna_C::DrawPlastiqueAnimMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, PlacePlastiqueAnimMessage) == 0x000588, "Member 'AINTERACT_Antenna_C::PlacePlastiqueAnimMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, ArmPlastiqueAnimMessage) == 0x000598, "Member 'AINTERACT_Antenna_C::ArmPlastiqueAnimMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, OnAntennaDestroyedEvent) == 0x0005A8, "Member 'AINTERACT_Antenna_C::OnAntennaDestroyedEvent' has a wrong offset!");
static_assert(offsetof(AINTERACT_Antenna_C, DetonateTickTimerHandle) == 0x0005B8, "Member 'AINTERACT_Antenna_C::DetonateTickTimerHandle' has a wrong offset!");

}

