#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_GroveTram_DoorExterior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_ElevatorDoors_Base_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_GroveTram_DoorExterior.INTERACT_GroveTram_DoorExterior_C
// 0x0168 (0x04A8 - 0x0340)
class AINTERACT_GroveTram_DoorExterior_C final : public AINTERACT_ElevatorDoors_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_GroveTram_DoorExterior_C;  // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          TileFloorFrame;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCeilingFrame;                                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileWallRight;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileWallRightB;                                    // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileWallLeftB;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileCeiling;                                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileWallLeft;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileWallBack;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TileFloor;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TilePillarRight;                                   // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TilePillarLeft;                                    // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CollisionScene;                                    // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontLegR;                                    // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontLegL;                                    // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackRTS;                                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackRB;                                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackRT;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackRM;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackLB;                                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackLM;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackLT;                                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackTLS;                                      // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackTL;                                       // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontRB;                                      // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontTR1;                                     // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontRT;                                      // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontLB;                                      // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontTR;                                      // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontTL;                                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontTLS;                                     // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_FrontLT;                                      // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lights_Exterior;                                   // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_BackTR;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lights_Interior;                                   // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GroveTram_DoorExteriorBase;                        // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATRIGGER_PublicAddressSystem_C*         WarningPublicAddressSystem;                        // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenInitialized;                                // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsLocked;                                          // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsDisabledByQuest;                                 // 0x046A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    LockUntilQuestCompleted;                           // 0x0470(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableRowHandle                    DisableWhenQuestCompleted;                         // 0x0480(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   QuestLockMessage;                                  // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	void UpdateEmissiveStrength(float Scale, float* Result);
	void GetInteractLocked(class AActor* SourceActor, bool* Result, class FText* LockMessage);
	void SetInteractLocked(bool Locked, bool* Result);
	void TryTargetWarningPublicAddressSystem();
	void SetTileCollisionEnabled(bool Enable, bool* Result);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void EVENT_OnStoryQuestCompleted(class FName StoryQuestName, bool Value);
	void SetElevatorDoorsDisabledByQuest();
	void SetElevatorDoorsVisible(bool VisibilityState);
	void OnDoorsStartedOpening();
	void InitializeDoorLockState();
	void InitializeGroveTramExteriorDoors();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_INTERACT_GroveTram_DoorExterior(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_GroveTram_DoorExterior_C">();
	}
	static class AINTERACT_GroveTram_DoorExterior_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_GroveTram_DoorExterior_C>();
	}
};
static_assert(alignof(AINTERACT_GroveTram_DoorExterior_C) == 0x000008, "Wrong alignment on AINTERACT_GroveTram_DoorExterior_C");
static_assert(sizeof(AINTERACT_GroveTram_DoorExterior_C) == 0x0004A8, "Wrong size on AINTERACT_GroveTram_DoorExterior_C");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, UberGraphFrame_INTERACT_GroveTram_DoorExterior_C) == 0x000340, "Member 'AINTERACT_GroveTram_DoorExterior_C::UberGraphFrame_INTERACT_GroveTram_DoorExterior_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileFloorFrame) == 0x000348, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileFloorFrame' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileCeilingFrame) == 0x000350, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileCeilingFrame' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileWallRight) == 0x000358, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileWallRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileWallRightB) == 0x000360, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileWallRightB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileWallLeftB) == 0x000368, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileWallLeftB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileCeiling) == 0x000370, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileCeiling' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileWallLeft) == 0x000378, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileWallLeft' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileWallBack) == 0x000380, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileWallBack' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TileFloor) == 0x000388, "Member 'AINTERACT_GroveTram_DoorExterior_C::TileFloor' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TilePillarRight) == 0x000390, "Member 'AINTERACT_GroveTram_DoorExterior_C::TilePillarRight' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, TilePillarLeft) == 0x000398, "Member 'AINTERACT_GroveTram_DoorExterior_C::TilePillarLeft' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, CollisionScene) == 0x0003A0, "Member 'AINTERACT_GroveTram_DoorExterior_C::CollisionScene' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontLegR) == 0x0003A8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontLegR' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontLegL) == 0x0003B0, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontLegL' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackRTS) == 0x0003B8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackRTS' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackRB) == 0x0003C0, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackRB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackRT) == 0x0003C8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackRT' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackRM) == 0x0003D0, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackRM' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackLB) == 0x0003D8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackLB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackLM) == 0x0003E0, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackLM' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackLT) == 0x0003E8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackLT' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackTLS) == 0x0003F0, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackTLS' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackTL) == 0x0003F8, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackTL' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontRB) == 0x000400, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontRB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontTR1) == 0x000408, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontTR1' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontRT) == 0x000410, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontRT' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontLB) == 0x000418, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontLB' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontTR) == 0x000420, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontTR' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontTL) == 0x000428, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontTL' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontTLS) == 0x000430, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontTLS' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_FrontLT) == 0x000438, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_FrontLT' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Lights_Exterior) == 0x000440, "Member 'AINTERACT_GroveTram_DoorExterior_C::Lights_Exterior' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Spot_BackTR) == 0x000448, "Member 'AINTERACT_GroveTram_DoorExterior_C::Spot_BackTR' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, Lights_Interior) == 0x000450, "Member 'AINTERACT_GroveTram_DoorExterior_C::Lights_Interior' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, GroveTram_DoorExteriorBase) == 0x000458, "Member 'AINTERACT_GroveTram_DoorExterior_C::GroveTram_DoorExteriorBase' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, WarningPublicAddressSystem) == 0x000460, "Member 'AINTERACT_GroveTram_DoorExterior_C::WarningPublicAddressSystem' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, HasBeenInitialized) == 0x000468, "Member 'AINTERACT_GroveTram_DoorExterior_C::HasBeenInitialized' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, IsLocked) == 0x000469, "Member 'AINTERACT_GroveTram_DoorExterior_C::IsLocked' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, IsDisabledByQuest) == 0x00046A, "Member 'AINTERACT_GroveTram_DoorExterior_C::IsDisabledByQuest' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, LockUntilQuestCompleted) == 0x000470, "Member 'AINTERACT_GroveTram_DoorExterior_C::LockUntilQuestCompleted' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, DisableWhenQuestCompleted) == 0x000480, "Member 'AINTERACT_GroveTram_DoorExterior_C::DisableWhenQuestCompleted' has a wrong offset!");
static_assert(offsetof(AINTERACT_GroveTram_DoorExterior_C, QuestLockMessage) == 0x000490, "Member 'AINTERACT_GroveTram_DoorExterior_C::QuestLockMessage' has a wrong offset!");

}

