#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_RespawnChamber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Channeling_Base_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_RespawnChamber.INTERACT_RespawnChamber_C
// 0x01C8 (0x0518 - 0x0350)
class AINTERACT_RespawnChamber_C final : public AINTERACT_Channeling_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_RespawnChamber_C;          // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        RespawnNode;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_ScannableObject;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Steam_L;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Steam_R;                                           // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MESH_RespawnChamber;                               // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MESH_Window;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_DoorBase_C*                   TargetDoorInteract;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RespawnActivated;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ActivatedDescriptionText;                          // 0x03A8(0x0018)(Edit, BlueprintVisible)
	class FText                                   DeactivatedDescriptionText;                        // 0x03C0(0x0018)(Edit, BlueprintVisible)
	class FString                                 OpenWindowAnimMessage;                             // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMOVECONTROL_WorldMove_C*               WorldMoveControl;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material_Hall;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConversionStartTimestamp;                          // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConversionDuration;                                // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material_Chamber;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlickerTimestamp_R;                                // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flicker_UP_R;                                      // 0x040C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlickerTimestamp_G;                                // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flicker_UP_G;                                      // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Flicker_R;                                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Flicker_G;                                         // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            OpenMontage;                                       // 0x0420(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CloseMontage;                                      // 0x0448(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataTableRowHandle                    EnabledMediaHandle;                                // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    DisabledMediaHandle;                               // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CompleteGameEventOnRespawn;                        // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TSoftObjectPtr<class USoundCue>               ActivatedCue;                                      // 0x04A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            RespawnMontage;                                    // 0x04C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ActivatedFlavorHandle;                             // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    DeactivatedFlavorHandle;                           // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           WindowTimerHandle;                                 // 0x0510(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_RespawnChamber(int32 EntryPoint);
	void BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void InitializeRespawnChamber();
	void OnHackerRespawned(class APAWN_Hacker_Simple_C* HackerPawn);
	void UpdateConversion();
	void PlayWindowMontage(bool ShouldOpen);
	void UpdateFlicker();
	void UpdateMaterials(float Progress);
	void PlayRespawnChamberSFX();
	void TryCompleteRespawnGameEvent();
	void IsRespawnChamberActivated(bool* Result);
	void UpdateVisibility(bool VisibilityState);
	void BeginRespawnSequence(class APAWN_Hacker_Simple_C* HackerPawn);
	void EVENT_OnWindowMontageFinished();
	void EVENT_OnRespawnMontageFinished();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void ResumeChannelingInteraction(class APAWN_Hacker_Simple_C* HackerPawn);
	void TryChangeTargetDoorState(bool Open);
	void CreateRespawnMoveControl(class APAWN_Hacker_Simple_C* HackerPawn);
	void UpdateDescriptionText();
	void TryTeleportNearbyEnemies(class APAWN_Hacker_Simple_C* HackerPawn);
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void GetInteractBusy(bool* Result, class FText* BusyMessage);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_RespawnChamber_C">();
	}
	static class AINTERACT_RespawnChamber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_RespawnChamber_C>();
	}
};
static_assert(alignof(AINTERACT_RespawnChamber_C) == 0x000008, "Wrong alignment on AINTERACT_RespawnChamber_C");
static_assert(sizeof(AINTERACT_RespawnChamber_C) == 0x000518, "Wrong size on AINTERACT_RespawnChamber_C");
static_assert(offsetof(AINTERACT_RespawnChamber_C, UberGraphFrame_INTERACT_RespawnChamber_C) == 0x000350, "Member 'AINTERACT_RespawnChamber_C::UberGraphFrame_INTERACT_RespawnChamber_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, RespawnNode) == 0x000358, "Member 'AINTERACT_RespawnChamber_C::RespawnNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, COMP_VoxelCullable) == 0x000360, "Member 'AINTERACT_RespawnChamber_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, COMP_ScannableObject) == 0x000368, "Member 'AINTERACT_RespawnChamber_C::COMP_ScannableObject' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Steam_L) == 0x000370, "Member 'AINTERACT_RespawnChamber_C::Steam_L' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Steam_R) == 0x000378, "Member 'AINTERACT_RespawnChamber_C::Steam_R' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, SpotLight) == 0x000380, "Member 'AINTERACT_RespawnChamber_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, MESH_RespawnChamber) == 0x000388, "Member 'AINTERACT_RespawnChamber_C::MESH_RespawnChamber' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, MESH_Window) == 0x000390, "Member 'AINTERACT_RespawnChamber_C::MESH_Window' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, TargetDoorInteract) == 0x000398, "Member 'AINTERACT_RespawnChamber_C::TargetDoorInteract' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, RespawnActivated) == 0x0003A0, "Member 'AINTERACT_RespawnChamber_C::RespawnActivated' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, ActivatedDescriptionText) == 0x0003A8, "Member 'AINTERACT_RespawnChamber_C::ActivatedDescriptionText' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, DeactivatedDescriptionText) == 0x0003C0, "Member 'AINTERACT_RespawnChamber_C::DeactivatedDescriptionText' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, OpenWindowAnimMessage) == 0x0003D8, "Member 'AINTERACT_RespawnChamber_C::OpenWindowAnimMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, WorldMoveControl) == 0x0003E8, "Member 'AINTERACT_RespawnChamber_C::WorldMoveControl' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Material_Hall) == 0x0003F0, "Member 'AINTERACT_RespawnChamber_C::Material_Hall' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, ConversionStartTimestamp) == 0x0003F8, "Member 'AINTERACT_RespawnChamber_C::ConversionStartTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, ConversionDuration) == 0x0003FC, "Member 'AINTERACT_RespawnChamber_C::ConversionDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Material_Chamber) == 0x000400, "Member 'AINTERACT_RespawnChamber_C::Material_Chamber' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, FlickerTimestamp_R) == 0x000408, "Member 'AINTERACT_RespawnChamber_C::FlickerTimestamp_R' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Flicker_UP_R) == 0x00040C, "Member 'AINTERACT_RespawnChamber_C::Flicker_UP_R' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, FlickerTimestamp_G) == 0x000410, "Member 'AINTERACT_RespawnChamber_C::FlickerTimestamp_G' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Flicker_UP_G) == 0x000414, "Member 'AINTERACT_RespawnChamber_C::Flicker_UP_G' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Flicker_R) == 0x000418, "Member 'AINTERACT_RespawnChamber_C::Flicker_R' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, Flicker_G) == 0x00041C, "Member 'AINTERACT_RespawnChamber_C::Flicker_G' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, OpenMontage) == 0x000420, "Member 'AINTERACT_RespawnChamber_C::OpenMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, CloseMontage) == 0x000448, "Member 'AINTERACT_RespawnChamber_C::CloseMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, EnabledMediaHandle) == 0x000470, "Member 'AINTERACT_RespawnChamber_C::EnabledMediaHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, DisabledMediaHandle) == 0x000480, "Member 'AINTERACT_RespawnChamber_C::DisabledMediaHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, CompleteGameEventOnRespawn) == 0x000490, "Member 'AINTERACT_RespawnChamber_C::CompleteGameEventOnRespawn' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, ActivatedCue) == 0x0004A0, "Member 'AINTERACT_RespawnChamber_C::ActivatedCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, RespawnMontage) == 0x0004C8, "Member 'AINTERACT_RespawnChamber_C::RespawnMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, ActivatedFlavorHandle) == 0x0004F0, "Member 'AINTERACT_RespawnChamber_C::ActivatedFlavorHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, DeactivatedFlavorHandle) == 0x000500, "Member 'AINTERACT_RespawnChamber_C::DeactivatedFlavorHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_RespawnChamber_C, WindowTimerHandle) == 0x000510, "Member 'AINTERACT_RespawnChamber_C::WindowTimerHandle' has a wrong offset!");

}

