#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_Interactable

#include "Basic.hpp"

#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"


namespace SDK::Params
{

// Function INTERF_Interactable.INTERF_Interactable_C.TryInteract
// 0x0038 (0x0038 - 0x0000)
struct INTERF_Interactable_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_Interactable_C_TryInteract) == 0x000008, "Wrong alignment on INTERF_Interactable_C_TryInteract");
static_assert(sizeof(INTERF_Interactable_C_TryInteract) == 0x000038, "Wrong size on INTERF_Interactable_C_TryInteract");
static_assert(offsetof(INTERF_Interactable_C_TryInteract, SourceActor) == 0x000000, "Member 'INTERF_Interactable_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'INTERF_Interactable_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_TryInteract, InteractionType) == 0x000010, "Member 'INTERF_Interactable_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_TryInteract, InteractResults) == 0x000018, "Member 'INTERF_Interactable_C_TryInteract::InteractResults' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.TryReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct INTERF_Interactable_C_TryReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_TryReceiveItem) == 0x000008, "Wrong alignment on INTERF_Interactable_C_TryReceiveItem");
static_assert(sizeof(INTERF_Interactable_C_TryReceiveItem) == 0x000010, "Wrong size on INTERF_Interactable_C_TryReceiveItem");
static_assert(offsetof(INTERF_Interactable_C_TryReceiveItem, Item) == 0x000000, "Member 'INTERF_Interactable_C_TryReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_TryReceiveItem, Result) == 0x000008, "Member 'INTERF_Interactable_C_TryReceiveItem::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.TryDetachInteract
// 0x0002 (0x0002 - 0x0000)
struct INTERF_Interactable_C_TryDetachInteract final
{
public:
	bool                                          SimulatePhysics;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_TryDetachInteract) == 0x000001, "Wrong alignment on INTERF_Interactable_C_TryDetachInteract");
static_assert(sizeof(INTERF_Interactable_C_TryDetachInteract) == 0x000002, "Wrong size on INTERF_Interactable_C_TryDetachInteract");
static_assert(offsetof(INTERF_Interactable_C_TryDetachInteract, SimulatePhysics) == 0x000000, "Member 'INTERF_Interactable_C_TryDetachInteract::SimulatePhysics' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_TryDetachInteract, Result) == 0x000001, "Member 'INTERF_Interactable_C_TryDetachInteract::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.OnCursorEnter
// 0x0008 (0x0008 - 0x0000)
struct INTERF_Interactable_C_OnCursorEnter final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_Interactable_C_OnCursorEnter) == 0x000008, "Wrong alignment on INTERF_Interactable_C_OnCursorEnter");
static_assert(sizeof(INTERF_Interactable_C_OnCursorEnter) == 0x000008, "Wrong size on INTERF_Interactable_C_OnCursorEnter");
static_assert(offsetof(INTERF_Interactable_C_OnCursorEnter, Cursor_Primitive) == 0x000000, "Member 'INTERF_Interactable_C_OnCursorEnter::Cursor_Primitive' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.OnCursorLeave
// 0x0008 (0x0008 - 0x0000)
struct INTERF_Interactable_C_OnCursorLeave final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_Interactable_C_OnCursorLeave) == 0x000008, "Wrong alignment on INTERF_Interactable_C_OnCursorLeave");
static_assert(sizeof(INTERF_Interactable_C_OnCursorLeave) == 0x000008, "Wrong size on INTERF_Interactable_C_OnCursorLeave");
static_assert(offsetof(INTERF_Interactable_C_OnCursorLeave, Cursor_Primitive) == 0x000000, "Member 'INTERF_Interactable_C_OnCursorLeave::Cursor_Primitive' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetTargetShape
// 0x0010 (0x0010 - 0x0000)
struct INTERF_Interactable_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_Interactable_C_GetTargetShape) == 0x000008, "Wrong alignment on INTERF_Interactable_C_GetTargetShape");
static_assert(sizeof(INTERF_Interactable_C_GetTargetShape) == 0x000010, "Wrong size on INTERF_Interactable_C_GetTargetShape");
static_assert(offsetof(INTERF_Interactable_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'INTERF_Interactable_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'INTERF_Interactable_C_GetTargetShape::ShapeComponent' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.StopChanneling
// 0x0010 (0x0010 - 0x0000)
struct INTERF_Interactable_C_StopChanneling final
{
public:
	class AActor*                                 NewChannelingInteract;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_StopChanneling) == 0x000008, "Wrong alignment on INTERF_Interactable_C_StopChanneling");
static_assert(sizeof(INTERF_Interactable_C_StopChanneling) == 0x000010, "Wrong size on INTERF_Interactable_C_StopChanneling");
static_assert(offsetof(INTERF_Interactable_C_StopChanneling, NewChannelingInteract) == 0x000000, "Member 'INTERF_Interactable_C_StopChanneling::NewChannelingInteract' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_StopChanneling, Result) == 0x000008, "Member 'INTERF_Interactable_C_StopChanneling::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.SetInteractLocked
// 0x0002 (0x0002 - 0x0000)
struct INTERF_Interactable_C_SetInteractLocked final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_SetInteractLocked) == 0x000001, "Wrong alignment on INTERF_Interactable_C_SetInteractLocked");
static_assert(sizeof(INTERF_Interactable_C_SetInteractLocked) == 0x000002, "Wrong size on INTERF_Interactable_C_SetInteractLocked");
static_assert(offsetof(INTERF_Interactable_C_SetInteractLocked, Locked) == 0x000000, "Member 'INTERF_Interactable_C_SetInteractLocked::Locked' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_SetInteractLocked, Result) == 0x000001, "Member 'INTERF_Interactable_C_SetInteractLocked::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.SetInteractPowered
// 0x0002 (0x0002 - 0x0000)
struct INTERF_Interactable_C_SetInteractPowered final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_SetInteractPowered) == 0x000001, "Wrong alignment on INTERF_Interactable_C_SetInteractPowered");
static_assert(sizeof(INTERF_Interactable_C_SetInteractPowered) == 0x000002, "Wrong size on INTERF_Interactable_C_SetInteractPowered");
static_assert(offsetof(INTERF_Interactable_C_SetInteractPowered, State) == 0x000000, "Member 'INTERF_Interactable_C_SetInteractPowered::State' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_SetInteractPowered, Result) == 0x000001, "Member 'INTERF_Interactable_C_SetInteractPowered::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetInteractBusy
// 0x0020 (0x0020 - 0x0000)
struct INTERF_Interactable_C_GetInteractBusy final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BusyMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_Interactable_C_GetInteractBusy) == 0x000008, "Wrong alignment on INTERF_Interactable_C_GetInteractBusy");
static_assert(sizeof(INTERF_Interactable_C_GetInteractBusy) == 0x000020, "Wrong size on INTERF_Interactable_C_GetInteractBusy");
static_assert(offsetof(INTERF_Interactable_C_GetInteractBusy, Result) == 0x000000, "Member 'INTERF_Interactable_C_GetInteractBusy::Result' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_GetInteractBusy, BusyMessage) == 0x000008, "Member 'INTERF_Interactable_C_GetInteractBusy::BusyMessage' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetInteractLocked
// 0x0028 (0x0028 - 0x0000)
struct INTERF_Interactable_C_GetInteractLocked final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LockMessage;                                       // 0x0010(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_Interactable_C_GetInteractLocked) == 0x000008, "Wrong alignment on INTERF_Interactable_C_GetInteractLocked");
static_assert(sizeof(INTERF_Interactable_C_GetInteractLocked) == 0x000028, "Wrong size on INTERF_Interactable_C_GetInteractLocked");
static_assert(offsetof(INTERF_Interactable_C_GetInteractLocked, SourceActor) == 0x000000, "Member 'INTERF_Interactable_C_GetInteractLocked::SourceActor' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_GetInteractLocked, Result) == 0x000008, "Member 'INTERF_Interactable_C_GetInteractLocked::Result' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_GetInteractLocked, LockMessage) == 0x000010, "Member 'INTERF_Interactable_C_GetInteractLocked::LockMessage' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetInteractBroken
// 0x0020 (0x0020 - 0x0000)
struct INTERF_Interactable_C_GetInteractBroken final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BrokenMessage;                                     // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_Interactable_C_GetInteractBroken) == 0x000008, "Wrong alignment on INTERF_Interactable_C_GetInteractBroken");
static_assert(sizeof(INTERF_Interactable_C_GetInteractBroken) == 0x000020, "Wrong size on INTERF_Interactable_C_GetInteractBroken");
static_assert(offsetof(INTERF_Interactable_C_GetInteractBroken, Result) == 0x000000, "Member 'INTERF_Interactable_C_GetInteractBroken::Result' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_GetInteractBroken, BrokenMessage) == 0x000008, "Member 'INTERF_Interactable_C_GetInteractBroken::BrokenMessage' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetInteractDestroyed
// 0x0001 (0x0001 - 0x0000)
struct INTERF_Interactable_C_GetInteractDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_GetInteractDestroyed) == 0x000001, "Wrong alignment on INTERF_Interactable_C_GetInteractDestroyed");
static_assert(sizeof(INTERF_Interactable_C_GetInteractDestroyed) == 0x000001, "Wrong size on INTERF_Interactable_C_GetInteractDestroyed");
static_assert(offsetof(INTERF_Interactable_C_GetInteractDestroyed, Result) == 0x000000, "Member 'INTERF_Interactable_C_GetInteractDestroyed::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.CanInteractBeDestroyed
// 0x0001 (0x0001 - 0x0000)
struct INTERF_Interactable_C_CanInteractBeDestroyed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_CanInteractBeDestroyed) == 0x000001, "Wrong alignment on INTERF_Interactable_C_CanInteractBeDestroyed");
static_assert(sizeof(INTERF_Interactable_C_CanInteractBeDestroyed) == 0x000001, "Wrong size on INTERF_Interactable_C_CanInteractBeDestroyed");
static_assert(offsetof(INTERF_Interactable_C_CanInteractBeDestroyed, Result) == 0x000000, "Member 'INTERF_Interactable_C_CanInteractBeDestroyed::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.CanModifyInteractPower
// 0x0001 (0x0001 - 0x0000)
struct INTERF_Interactable_C_CanModifyInteractPower final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_CanModifyInteractPower) == 0x000001, "Wrong alignment on INTERF_Interactable_C_CanModifyInteractPower");
static_assert(sizeof(INTERF_Interactable_C_CanModifyInteractPower) == 0x000001, "Wrong size on INTERF_Interactable_C_CanModifyInteractPower");
static_assert(offsetof(INTERF_Interactable_C_CanModifyInteractPower, Result) == 0x000000, "Member 'INTERF_Interactable_C_CanModifyInteractPower::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.IsInteractActivated
// 0x0001 (0x0001 - 0x0000)
struct INTERF_Interactable_C_IsInteractActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_IsInteractActivated) == 0x000001, "Wrong alignment on INTERF_Interactable_C_IsInteractActivated");
static_assert(sizeof(INTERF_Interactable_C_IsInteractActivated) == 0x000001, "Wrong size on INTERF_Interactable_C_IsInteractActivated");
static_assert(offsetof(INTERF_Interactable_C_IsInteractActivated, Result) == 0x000000, "Member 'INTERF_Interactable_C_IsInteractActivated::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.IsHiddenInteractablePrimitive
// 0x0018 (0x0018 - 0x0000)
struct INTERF_Interactable_C_IsHiddenInteractablePrimitive final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_IsHiddenInteractablePrimitive) == 0x000008, "Wrong alignment on INTERF_Interactable_C_IsHiddenInteractablePrimitive");
static_assert(sizeof(INTERF_Interactable_C_IsHiddenInteractablePrimitive) == 0x000018, "Wrong size on INTERF_Interactable_C_IsHiddenInteractablePrimitive");
static_assert(offsetof(INTERF_Interactable_C_IsHiddenInteractablePrimitive, Character) == 0x000000, "Member 'INTERF_Interactable_C_IsHiddenInteractablePrimitive::Character' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_IsHiddenInteractablePrimitive, CursorPrimitive) == 0x000008, "Member 'INTERF_Interactable_C_IsHiddenInteractablePrimitive::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_IsHiddenInteractablePrimitive, Result) == 0x000010, "Member 'INTERF_Interactable_C_IsHiddenInteractablePrimitive::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.ShouldIgnoreInteractRange
// 0x0001 (0x0001 - 0x0000)
struct INTERF_Interactable_C_ShouldIgnoreInteractRange final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong alignment on INTERF_Interactable_C_ShouldIgnoreInteractRange");
static_assert(sizeof(INTERF_Interactable_C_ShouldIgnoreInteractRange) == 0x000001, "Wrong size on INTERF_Interactable_C_ShouldIgnoreInteractRange");
static_assert(offsetof(INTERF_Interactable_C_ShouldIgnoreInteractRange, Result) == 0x000000, "Member 'INTERF_Interactable_C_ShouldIgnoreInteractRange::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.CanReceiveItem
// 0x0010 (0x0010 - 0x0000)
struct INTERF_Interactable_C_CanReceiveItem final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_CanReceiveItem) == 0x000008, "Wrong alignment on INTERF_Interactable_C_CanReceiveItem");
static_assert(sizeof(INTERF_Interactable_C_CanReceiveItem) == 0x000010, "Wrong size on INTERF_Interactable_C_CanReceiveItem");
static_assert(offsetof(INTERF_Interactable_C_CanReceiveItem, Item) == 0x000000, "Member 'INTERF_Interactable_C_CanReceiveItem::Item' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_CanReceiveItem, Result) == 0x000008, "Member 'INTERF_Interactable_C_CanReceiveItem::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.GetChannelingHoldDuration
// 0x0004 (0x0004 - 0x0000)
struct INTERF_Interactable_C_GetChannelingHoldDuration final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERF_Interactable_C_GetChannelingHoldDuration) == 0x000004, "Wrong alignment on INTERF_Interactable_C_GetChannelingHoldDuration");
static_assert(sizeof(INTERF_Interactable_C_GetChannelingHoldDuration) == 0x000004, "Wrong size on INTERF_Interactable_C_GetChannelingHoldDuration");
static_assert(offsetof(INTERF_Interactable_C_GetChannelingHoldDuration, Result) == 0x000000, "Member 'INTERF_Interactable_C_GetChannelingHoldDuration::Result' has a wrong offset!");

// Function INTERF_Interactable.INTERF_Interactable_C.FinishedChannelingHoldInteraction
// 0x0010 (0x0010 - 0x0000)
struct INTERF_Interactable_C_FinishedChannelingHoldInteraction final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERF_Interactable_C_FinishedChannelingHoldInteraction) == 0x000008, "Wrong alignment on INTERF_Interactable_C_FinishedChannelingHoldInteraction");
static_assert(sizeof(INTERF_Interactable_C_FinishedChannelingHoldInteraction) == 0x000010, "Wrong size on INTERF_Interactable_C_FinishedChannelingHoldInteraction");
static_assert(offsetof(INTERF_Interactable_C_FinishedChannelingHoldInteraction, Character) == 0x000000, "Member 'INTERF_Interactable_C_FinishedChannelingHoldInteraction::Character' has a wrong offset!");
static_assert(offsetof(INTERF_Interactable_C_FinishedChannelingHoldInteraction, Result) == 0x000008, "Member 'INTERF_Interactable_C_FinishedChannelingHoldInteraction::Result' has a wrong offset!");

}

