#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_ComputerNode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.ExecuteUbergraph_INTERACT_ComputerNode
// 0x0008 (0x0008 - 0x0000)
struct INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode) == 0x000004, "Wrong alignment on INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode");
static_assert(sizeof(INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode) == 0x000008, "Wrong size on INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode");
static_assert(offsetof(INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode, EntryPoint) == 0x000000, "Member 'INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_ComputerNode_C_ExecuteUbergraph_INTERACT_ComputerNode::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_ComputerNode_C_BndEvt__INTERACT_ComputerNode_Single_COMP_CullableNavModifier_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.InitializeAttributeEvents
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_ComputerNode_C_InitializeAttributeEvents final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ComputerNode_C_InitializeAttributeEvents) == 0x000004, "Wrong alignment on INTERACT_ComputerNode_C_InitializeAttributeEvents");
static_assert(sizeof(INTERACT_ComputerNode_C_InitializeAttributeEvents) == 0x000014, "Wrong size on INTERACT_ComputerNode_C_InitializeAttributeEvents");
static_assert(offsetof(INTERACT_ComputerNode_C_InitializeAttributeEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_ComputerNode_C_InitializeAttributeEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_InitializeAttributeEvents, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_ComputerNode_C_InitializeAttributeEvents::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.ApplyImpulseToChildMesh
// 0x00E8 (0x00E8 - 0x0000)
struct INTERACT_ComputerNode_C_ApplyImpulseToChildMesh final
{
public:
	class UStaticMeshComponent*                   Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EjectRotation;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                EjectDirection;                                    // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue; // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_ApplyImpulseToChildMesh");
static_assert(sizeof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh) == 0x0000E8, "Wrong size on INTERACT_ComputerNode_C_ApplyImpulseToChildMesh");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, Mesh) == 0x000000, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::Mesh' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, EjectRotation) == 0x000008, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::EjectRotation' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, EjectDirection) == 0x000014, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::EjectDirection' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Map_Find_Value) == 0x000020, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Map_Find_ReturnValue) == 0x000024, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_MakeRotFromX_ReturnValue) == 0x000028, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_MakeRotator_ReturnValue) == 0x000034, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_ComposeRotators_ReturnValue) == 0x000040, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_RandomUnitVector_ReturnValue) == 0x00004C, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000058, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_RandomFloatInRange_ReturnValue) == 0x000064, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue) == 0x000074, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000080, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000084, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_GetComponentBounds_Origin) == 0x000090, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_GetComponentBounds_BoxExtent) == 0x00009C, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_GetComponentBounds_SphereRadius) == 0x0000A8, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B8, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000C4, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0000CC, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_ApplyImpulseToChildMesh, CallFunc_Normal_ReturnValue) == 0x0000D8, "Member 'INTERACT_ComputerNode_C_ApplyImpulseToChildMesh::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.EjectAllDebris
// 0x0060 (0x0060 - 0x0000)
struct INTERACT_ComputerNode_C_EjectAllDebris final
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                ChildComponents;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_ComputerNode_C_EjectAllDebris) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_EjectAllDebris");
static_assert(sizeof(INTERACT_ComputerNode_C_EjectAllDebris) == 0x000060, "Wrong size on INTERACT_ComputerNode_C_EjectAllDebris");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, StaticMeshComponent) == 0x000000, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, ChildComponents) == 0x000008, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::ChildComponents' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, Temp_int_Array_Index_Variable) == 0x000018, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Array_Get_Item) == 0x000028, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000030, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Set_Contains_ReturnValue) == 0x000041, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000043, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectAllDebris, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'INTERACT_ComputerNode_C_EjectAllDebris::CallFunc_GetChildrenComponents_Children' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.EjectDebrisInAngleFromImpact
// 0x01E0 (0x01E0 - 0x0000)
struct INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact final
{
public:
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           MeshComponents;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionToMesh;                                   // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MeshLocation;                                      // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceLocation;                                    // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionToImpact;                                 // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                ChildComponents;                                   // 0x0058(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AngleBetweenNormals_ReturnValue;          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_3;      // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact) == 0x000010, "Wrong alignment on INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact");
static_assert(sizeof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact) == 0x0001E0, "Wrong size on INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, ImpactData) == 0x000000, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::ImpactData' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, Angle) == 0x000008, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::Angle' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, MeshComponents) == 0x000010, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::MeshComponents' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, StaticMeshComponent) == 0x000020, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, DirectionToMesh) == 0x000028, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::DirectionToMesh' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, MeshLocation) == 0x000034, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::MeshLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, SourceLocation) == 0x000040, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::SourceLocation' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, DirectionToImpact) == 0x00004C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::DirectionToImpact' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, ChildComponents) == 0x000058, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::ChildComponents' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, K2Node_DynamicCast_AsGI_Single_Player) == 0x000080, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, Temp_int_Array_Index_Variable) == 0x000090, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Array_Get_Item) == 0x000098, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000A0, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000AC, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000C0, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_RandomInteger_ReturnValue) == 0x0000F4, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Set_Contains_ReturnValue) == 0x000120, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Not_PreBool_ReturnValue) == 0x000121, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Array_Add_ReturnValue) == 0x000124, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_Origin) == 0x000128, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_BoxExtent) == 0x000134, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_SphereRadius) == 0x000140, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_AngleBetweenNormals_ReturnValue) == 0x000144, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_AngleBetweenNormals_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000148, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000150, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x000154, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00015C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_VectorToVector2D_ReturnValue_3) == 0x000164, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_VectorToVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x00016C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000178, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Normal_ReturnValue) == 0x000180, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Conv_Vector2DToVector_ReturnValue_1) == 0x00018C, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Conv_Vector2DToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_Normal_ReturnValue_1) == 0x000198, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetChildrenComponents_Children) == 0x0001A8, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_Origin_1) == 0x0001B8, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_BoxExtent_1) == 0x0001C4, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact, CallFunc_GetComponentBounds_SphereRadius_1) == 0x0001D0, "Member 'INTERACT_ComputerNode_C_EjectDebrisInAngleFromImpact::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.EnableLowHealthMeshCollision
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_ComputerNode_C_EnableLowHealthMeshCollision final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_EnableLowHealthMeshCollision");
static_assert(sizeof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision) == 0x000020, "Wrong size on INTERACT_ComputerNode_C_EnableLowHealthMeshCollision");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, Temp_int_Array_Index_Variable) == 0x000000, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, CallFunc_Array_Get_Item) == 0x000010, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableLowHealthMeshCollision, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'INTERACT_ComputerNode_C_EnableLowHealthMeshCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.EnableHighHealthMeshCollision
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_ComputerNode_C_EnableHighHealthMeshCollision final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_EnableHighHealthMeshCollision");
static_assert(sizeof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision) == 0x000020, "Wrong size on INTERACT_ComputerNode_C_EnableHighHealthMeshCollision");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, Temp_int_Array_Index_Variable) == 0x000000, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, CallFunc_Array_Get_Item) == 0x000010, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableHighHealthMeshCollision, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'INTERACT_ComputerNode_C_EnableHighHealthMeshCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.EnableAllCollision
// 0x0020 (0x0020 - 0x0000)
struct INTERACT_ComputerNode_C_EnableAllCollision final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_ComputerNode_C_EnableAllCollision) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_EnableAllCollision");
static_assert(sizeof(INTERACT_ComputerNode_C_EnableAllCollision) == 0x000020, "Wrong size on INTERACT_ComputerNode_C_EnableAllCollision");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, Temp_int_Array_Index_Variable) == 0x000000, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, CallFunc_Array_Get_Item) == 0x000010, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_EnableAllCollision, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'INTERACT_ComputerNode_C_EnableAllCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.AssignMeshEjectPitchAngles
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_2;                          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles");
static_assert(sizeof(INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles) == 0x000030, "Wrong size on INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles");
static_assert(offsetof(INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles, K2Node_MakeArray_Array) == 0x000000, "Member 'INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles, K2Node_MakeArray_Array_1) == 0x000010, "Member 'INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles, K2Node_MakeArray_Array_2) == 0x000020, "Member 'INTERACT_ComputerNode_C_AssignMeshEjectPitchAngles::K2Node_MakeArray_Array_2' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.AddMeshEjectPitchAngle
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_ComputerNode_C_AddMeshEjectPitchAngle final
{
public:
	TArray<class UStaticMeshComponent*>           MeshComponent;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         PitchDegrees;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle) == 0x000008, "Wrong alignment on INTERACT_ComputerNode_C_AddMeshEjectPitchAngle");
static_assert(sizeof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle) == 0x000030, "Wrong size on INTERACT_ComputerNode_C_AddMeshEjectPitchAngle");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, MeshComponent) == 0x000000, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::MeshComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, PitchDegrees) == 0x000010, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::PitchDegrees' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, Temp_int_Array_Index_Variable) == 0x000018, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, CallFunc_Array_Get_Item) == 0x000020, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_ComputerNode_C_AddMeshEjectPitchAngle, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'INTERACT_ComputerNode_C_AddMeshEjectPitchAngle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_ComputerNode.INTERACT_ComputerNode_C.AssignMeshesToDestroy
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_ComputerNode_C_AssignMeshesToDestroy final
{
public:
