#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERF_Descriptor

#include "Basic.hpp"


namespace SDK::Params
{

// Function INTERF_Descriptor.INTERF_Descriptor_C.GetDescriptionMessage
// 0x0020 (0x0020 - 0x0000)
struct INTERF_Descriptor_C_GetDescriptionMessage final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_Descriptor_C_GetDescriptionMessage) == 0x000008, "Wrong alignment on INTERF_Descriptor_C_GetDescriptionMessage");
static_assert(sizeof(INTERF_Descriptor_C_GetDescriptionMessage) == 0x000020, "Wrong size on INTERF_Descriptor_C_GetDescriptionMessage");
static_assert(offsetof(INTERF_Descriptor_C_GetDescriptionMessage, Primitive) == 0x000000, "Member 'INTERF_Descriptor_C_GetDescriptionMessage::Primitive' has a wrong offset!");
static_assert(offsetof(INTERF_Descriptor_C_GetDescriptionMessage, Message) == 0x000008, "Member 'INTERF_Descriptor_C_GetDescriptionMessage::Message' has a wrong offset!");

// Function INTERF_Descriptor.INTERF_Descriptor_C.GetInteractFlavorMessage
// 0x0018 (0x0018 - 0x0000)
struct INTERF_Descriptor_C_GetInteractFlavorMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(INTERF_Descriptor_C_GetInteractFlavorMessage) == 0x000008, "Wrong alignment on INTERF_Descriptor_C_GetInteractFlavorMessage");
static_assert(sizeof(INTERF_Descriptor_C_GetInteractFlavorMessage) == 0x000018, "Wrong size on INTERF_Descriptor_C_GetInteractFlavorMessage");
static_assert(offsetof(INTERF_Descriptor_C_GetInteractFlavorMessage, Message) == 0x000000, "Member 'INTERF_Descriptor_C_GetInteractFlavorMessage::Message' has a wrong offset!");

}

