#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_SalvageStation

#include "Basic.hpp"

#include "INTERACT_LootableBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_SalvageStation.INTERACT_SalvageStation_C
// 0x02C8 (0x0670 - 0x03A8)
class AINTERACT_SalvageStation_C final : public AINTERACT_LootableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_SalvageStation_C;          // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CompartmentVolume;                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_Scannable_Icon;                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointOfInterestComponent_C*            PointOfInterestComponent;                          // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ReturnScreenBox;                                   // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightSteamBurstFX;                                 // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LeftSteamBurstFX;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CoinReturnLight;                                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CoinSpawnNode;                                     // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnBox;                                          // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Screen;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Drum;                                    // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    InteriorLight;                                     // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BarrelLight;                                       // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DrumDoorMesh;                                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RecycleStationBase;                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RecycleProcessDuration;                            // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessStartTimestamp;                             // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CoinsToDispense;                                   // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DrumDoorTimerHandle;                               // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DispenseCoinTimerHandle;                           // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ProcessScrapTimerHandle;                           // 0x0458(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ThankYouTimerHandle;                               // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StandardScreenColor;                               // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InteractScreenColor;                               // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ErrorScreenColor;                                  // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DrumReadyColor;                                    // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DrumBusyColor;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CompleteGameEventOnInteract;                       // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    RecycleAchievementHandle;                          // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TSoftObjectPtr<class UAnimMontage>            OpenMontage;                                       // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CloseMontage;                                      // 0x0500(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   ReadyToProcessMessage;                             // 0x0528(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   InsertScrapMessage;                                // 0x0540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PressToStartMessage;                               // 0x0558(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ThankYouMessage;                                   // 0x0570(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StartedProcessingMessage;                          // 0x0588(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class USoundCue>               ProcessScrapSoundCue;                              // 0x05A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ProcessingFinishedSoundCue;                        // 0x05C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ProcessingFinishedBeepSoundCue;                    // 0x05F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               DispenseCoinSoundCue;                              // 0x0618(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   NoReturnValueMessage;                              // 0x0640(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CurrentReturnValueMessage;                         // 0x0658(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_INTERACT_SalvageStation(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__INTERACT_SalvageStation_COMP_LootableInventory_K2Node_ComponentBoundEvent_1_OnBagChanged__DelegateSignature(class UInventoryBag_C* Bag, int32 SlotIndex);
	void BndEvt__INTERACT_SalvageStation_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void IsProcessingScrap(bool* Result);
	void InitializeRecycleStation();
	void InitializeAttributes();
	void ToggleDrumDoor();
	void StopChanneling(class AActor* NewChannelingInteract, bool* Result);
	void UpdateEmissiveStrength(float Scale);
	void UpdateRecycleMaterialStates();
	void TryCompleteGameEventOnInteract();
	void TryStartProcessingScrap(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void TryStartRecycleProcessTimer(bool* Result);
	void EVENT_OnDrumDoorClosed();
	void EVENT_OnFinishedProcessingScrap();
	void IsDispensingCoins(bool* Result);
	void TryStartCoinDispenseTimer(bool* Result);
	void TryStartThankYouTimer(bool* Result);
	void DestroyRecycleItems();
	void IsRecyclerFunctional(bool* Result);
	void GetRecycleCoinValue(uint8* Value);
	void EVENT_OnDispenseCoin();
	void EVENT_OnThankYouFinished();
	void SetStatusScreenMessage(const class FText& NewMessage);
	void UpdateReturnScreenValue(uint8 Value);
	void UpdateRecycleStationVisibility(bool VisibilityState);
	void TickScrapProcessing(float DeltaTime);
	void SetDrumLightColor(const struct FLinearColor& Color);
	void SetDrumShakeOffset(const struct FVector& Offset);
	void FadeOutDrumSounds();
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_SalvageStation_C">();
	}
	static class AINTERACT_SalvageStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_SalvageStation_C>();
	}
};
static_assert(alignof(AINTERACT_SalvageStation_C) == 0x000008, "Wrong alignment on AINTERACT_SalvageStation_C");
static_assert(sizeof(AINTERACT_SalvageStation_C) == 0x000670, "Wrong size on AINTERACT_SalvageStation_C");
static_assert(offsetof(AINTERACT_SalvageStation_C, UberGraphFrame_INTERACT_SalvageStation_C) == 0x0003A8, "Member 'AINTERACT_SalvageStation_C::UberGraphFrame_INTERACT_SalvageStation_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, COMP_AttribManager) == 0x0003B0, "Member 'AINTERACT_SalvageStation_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CompartmentVolume) == 0x0003B8, "Member 'AINTERACT_SalvageStation_C::CompartmentVolume' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, COMP_Scannable_Icon) == 0x0003C0, "Member 'AINTERACT_SalvageStation_C::COMP_Scannable_Icon' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, PointOfInterestComponent) == 0x0003C8, "Member 'AINTERACT_SalvageStation_C::PointOfInterestComponent' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ReturnScreenBox) == 0x0003D0, "Member 'AINTERACT_SalvageStation_C::ReturnScreenBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, RightSteamBurstFX) == 0x0003D8, "Member 'AINTERACT_SalvageStation_C::RightSteamBurstFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, LeftSteamBurstFX) == 0x0003E0, "Member 'AINTERACT_SalvageStation_C::LeftSteamBurstFX' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, COMP_VoxelCullable) == 0x0003E8, "Member 'AINTERACT_SalvageStation_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CoinReturnLight) == 0x0003F0, "Member 'AINTERACT_SalvageStation_C::CoinReturnLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CoinSpawnNode) == 0x0003F8, "Member 'AINTERACT_SalvageStation_C::CoinSpawnNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, SpawnBox) == 0x000400, "Member 'AINTERACT_SalvageStation_C::SpawnBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, TargetBox_Screen) == 0x000408, "Member 'AINTERACT_SalvageStation_C::TargetBox_Screen' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, TargetBox_Drum) == 0x000410, "Member 'AINTERACT_SalvageStation_C::TargetBox_Drum' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, InteriorLight) == 0x000418, "Member 'AINTERACT_SalvageStation_C::InteriorLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, BarrelLight) == 0x000420, "Member 'AINTERACT_SalvageStation_C::BarrelLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DrumDoorMesh) == 0x000428, "Member 'AINTERACT_SalvageStation_C::DrumDoorMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, RecycleStationBase) == 0x000430, "Member 'AINTERACT_SalvageStation_C::RecycleStationBase' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, RecycleProcessDuration) == 0x000438, "Member 'AINTERACT_SalvageStation_C::RecycleProcessDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ProcessStartTimestamp) == 0x00043C, "Member 'AINTERACT_SalvageStation_C::ProcessStartTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CoinsToDispense) == 0x000440, "Member 'AINTERACT_SalvageStation_C::CoinsToDispense' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DrumDoorTimerHandle) == 0x000448, "Member 'AINTERACT_SalvageStation_C::DrumDoorTimerHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DispenseCoinTimerHandle) == 0x000450, "Member 'AINTERACT_SalvageStation_C::DispenseCoinTimerHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ProcessScrapTimerHandle) == 0x000458, "Member 'AINTERACT_SalvageStation_C::ProcessScrapTimerHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ThankYouTimerHandle) == 0x000460, "Member 'AINTERACT_SalvageStation_C::ThankYouTimerHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, StandardScreenColor) == 0x000468, "Member 'AINTERACT_SalvageStation_C::StandardScreenColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, InteractScreenColor) == 0x000478, "Member 'AINTERACT_SalvageStation_C::InteractScreenColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ErrorScreenColor) == 0x000488, "Member 'AINTERACT_SalvageStation_C::ErrorScreenColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DrumReadyColor) == 0x000498, "Member 'AINTERACT_SalvageStation_C::DrumReadyColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DrumBusyColor) == 0x0004A8, "Member 'AINTERACT_SalvageStation_C::DrumBusyColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CompleteGameEventOnInteract) == 0x0004B8, "Member 'AINTERACT_SalvageStation_C::CompleteGameEventOnInteract' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, RecycleAchievementHandle) == 0x0004C8, "Member 'AINTERACT_SalvageStation_C::RecycleAchievementHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, OpenMontage) == 0x0004D8, "Member 'AINTERACT_SalvageStation_C::OpenMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CloseMontage) == 0x000500, "Member 'AINTERACT_SalvageStation_C::CloseMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ReadyToProcessMessage) == 0x000528, "Member 'AINTERACT_SalvageStation_C::ReadyToProcessMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, InsertScrapMessage) == 0x000540, "Member 'AINTERACT_SalvageStation_C::InsertScrapMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, PressToStartMessage) == 0x000558, "Member 'AINTERACT_SalvageStation_C::PressToStartMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ThankYouMessage) == 0x000570, "Member 'AINTERACT_SalvageStation_C::ThankYouMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, StartedProcessingMessage) == 0x000588, "Member 'AINTERACT_SalvageStation_C::StartedProcessingMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ProcessScrapSoundCue) == 0x0005A0, "Member 'AINTERACT_SalvageStation_C::ProcessScrapSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ProcessingFinishedSoundCue) == 0x0005C8, "Member 'AINTERACT_SalvageStation_C::ProcessingFinishedSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, ProcessingFinishedBeepSoundCue) == 0x0005F0, "Member 'AINTERACT_SalvageStation_C::ProcessingFinishedBeepSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, DispenseCoinSoundCue) == 0x000618, "Member 'AINTERACT_SalvageStation_C::DispenseCoinSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, NoReturnValueMessage) == 0x000640, "Member 'AINTERACT_SalvageStation_C::NoReturnValueMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_SalvageStation_C, CurrentReturnValueMessage) == 0x000658, "Member 'AINTERACT_SalvageStation_C::CurrentReturnValueMessage' has a wrong offset!");

}

