#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Snacktron

#include "Basic.hpp"

#include "ENUM_FailSucceedIgnore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.ExecuteUbergraph_INTERACT_Snacktron
// 0x0138 (0x0138 - 0x0000)
struct INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  K2Node_ComponentBoundEvent_DamageInstance;         // 0x0010(0x0028)()
	class UObject*                                K2Node_ComponentBoundEvent_UserParams;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      K2Node_DynamicCast_AsOBJ_Impact_Data;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0070(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron");
static_assert(sizeof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron) == 0x000138, "Wrong size on INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, EntryPoint) == 0x000000, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::EntryPoint' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000008, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_DamageInstance) == 0x000010, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_DamageInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_UserParams) == 0x000038, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_UserParams' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_DynamicCast_AsOBJ_Impact_Data) == 0x000040, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_DynamicCast_AsOBJ_Impact_Data' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000050, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_OtherActor) == 0x000058, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_OtherComp) == 0x000060, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000068, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_bFromSweep) == 0x00006C, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_ComponentBoundEvent_SweepResult) == 0x000070, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_DynamicCast_AsPawn) == 0x0000F8, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000104, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000108, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, K2Node_CreateDelegate_OutputDelegate) == 0x00010C, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00011C, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_RandomFloatInRange_ReturnValue) == 0x000120, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000124, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_Less_FloatFloat_ReturnValue) == 0x000130, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron, CallFunc_BooleanOR_ReturnValue) == 0x000131, "Member 'INTERACT_Snacktron_C_ExecuteUbergraph_INTERACT_Snacktron::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'INTERACT_Snacktron_C_BndEvt__ProximityDetector_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                UserParams;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature");
static_assert(sizeof(INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature) == 0x000038, "Wrong size on INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature, OtherActor) == 0x000000, "Member 'INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature, DamageInstance) == 0x000008, "Member 'INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature::DamageInstance' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature, UserParams) == 0x000030, "Member 'INTERACT_Snacktron_C_BndEvt__COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature::UserParams' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'INTERACT_Snacktron_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct INTERACT_Snacktron_C_UserConstructionScript final
{
public:
	bool                                          IsFunctional;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGenerateOverlapEvents_ReturnValue;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_UserConstructionScript) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_UserConstructionScript");
static_assert(sizeof(INTERACT_Snacktron_C_UserConstructionScript) == 0x000050, "Wrong size on INTERACT_Snacktron_C_UserConstructionScript");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, IsFunctional) == 0x000000, "Member 'INTERACT_Snacktron_C_UserConstructionScript::IsFunctional' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_bool_Variable) == 0x000001, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000018, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_object_Variable_2) == 0x000020, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, Temp_object_Variable_3) == 0x000028, "Member 'INTERACT_Snacktron_C_UserConstructionScript::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, CallFunc_GetGenerateOverlapEvents_ReturnValue) == 0x000030, "Member 'INTERACT_Snacktron_C_UserConstructionScript::CallFunc_GetGenerateOverlapEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'INTERACT_Snacktron_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, K2Node_Select_Default) == 0x000038, "Member 'INTERACT_Snacktron_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000040, "Member 'INTERACT_Snacktron_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000048, "Member 'INTERACT_Snacktron_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.InitializeVendingMachine
// 0x0038 (0x0038 - 0x0000)
struct INTERACT_Snacktron_C_InitializeVendingMachine final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomizeBits_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_InitializeVendingMachine) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_InitializeVendingMachine");
static_assert(sizeof(INTERACT_Snacktron_C_InitializeVendingMachine) == 0x000038, "Wrong size on INTERACT_Snacktron_C_InitializeVendingMachine");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, Temp_bool_Variable) == 0x000000, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, Temp_int_Variable) == 0x000004, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_IsValidClass_ReturnValue) == 0x000028, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, K2Node_Select_Default) == 0x00002C, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeVendingMachine, CallFunc_RandomizeBits_ReturnValue) == 0x000030, "Member 'INTERACT_Snacktron_C_InitializeVendingMachine::CallFunc_RandomizeBits_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.InitializeKeypadComponents
// 0x0010 (0x0010 - 0x0000)
struct INTERACT_Snacktron_C_InitializeKeypadComponents final
{
public:
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(INTERACT_Snacktron_C_InitializeKeypadComponents) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_InitializeKeypadComponents");
static_assert(sizeof(INTERACT_Snacktron_C_InitializeKeypadComponents) == 0x000010, "Wrong size on INTERACT_Snacktron_C_InitializeKeypadComponents");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeKeypadComponents, K2Node_MakeArray_Array) == 0x000000, "Member 'INTERACT_Snacktron_C_InitializeKeypadComponents::K2Node_MakeArray_Array' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_Snacktron_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_InitializeAttributes) == 0x000004, "Wrong alignment on INTERACT_Snacktron_C_InitializeAttributes");
static_assert(sizeof(INTERACT_Snacktron_C_InitializeAttributes) == 0x000014, "Wrong size on INTERACT_Snacktron_C_InitializeAttributes");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'INTERACT_Snacktron_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'INTERACT_Snacktron_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.UpdateSmallScreen
// 0x0028 (0x0028 - 0x0000)
struct INTERACT_Snacktron_C_UpdateSmallScreen final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_UpdateSmallScreen) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_UpdateSmallScreen");
static_assert(sizeof(INTERACT_Snacktron_C_UpdateSmallScreen) == 0x000028, "Wrong size on INTERACT_Snacktron_C_UpdateSmallScreen");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, State) == 0x000000, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::State' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, Temp_bool_Variable) == 0x000001, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, Temp_object_Variable) == 0x000008, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, Temp_object_Variable_1) == 0x000010, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, K2Node_Select_Default) == 0x000018, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSmallScreen, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000020, "Member 'INTERACT_Snacktron_C_UpdateSmallScreen::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.UpdateStockScreen
// 0x0100 (0x0100 - 0x0000)
struct INTERACT_Snacktron_C_UpdateStockScreen final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               SnackIndices;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BitIndex;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetStockItemClassByIndex_StockClass;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_GetItemHotbarRenderTargetForItemClass_Result; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_X;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Y;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_Z;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector4_W;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSetBitIndices_ReturnValue;             // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_UpdateStockScreen) == 0x000010, "Wrong alignment on INTERACT_Snacktron_C_UpdateStockScreen");
static_assert(sizeof(INTERACT_Snacktron_C_UpdateStockScreen) == 0x000100, "Wrong size on INTERACT_Snacktron_C_UpdateStockScreen");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, State) == 0x000000, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::State' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, SnackIndices) == 0x000010, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::SnackIndices' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, SlotIndex) == 0x000020, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::SlotIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, BitIndex) == 0x000024, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::BitIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, DynamicMaterial) == 0x000028, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, Temp_bool_Variable) == 0x000030, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, Temp_object_Variable) == 0x000038, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, Temp_object_Variable_1) == 0x000040, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, Temp_int_Array_Index_Variable) == 0x000048, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, K2Node_DynamicCast_AsGI_Single_Player) == 0x000068, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Conv_StringToName_ReturnValue) == 0x000088, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_GetStockItemClassByIndex_StockClass) == 0x000090, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_GetStockItemClassByIndex_StockClass' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_GetItemHotbarRenderTargetForItemClass_Result) == 0x000098, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_GetItemHotbarRenderTargetForItemClass_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_BreakVector4_X) == 0x0000A0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_BreakVector4_X' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_BreakVector4_Y) == 0x0000A4, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_BreakVector4_Y' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_BreakVector4_Z) == 0x0000A8, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_BreakVector4_Z' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_BreakVector4_W) == 0x0000AC, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_BreakVector4_W' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_MakeColor_ReturnValue) == 0x0000B0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C8, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_GetSetBitIndices_ReturnValue) == 0x0000D0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_GetSetBitIndices_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, K2Node_Select_Default) == 0x0000E8, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000F0, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, Temp_int_Loop_Counter_Variable) == 0x0000F4, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateStockScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'INTERACT_Snacktron_C_UpdateStockScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.UpdateSnacktronScreen
// 0x0030 (0x0030 - 0x0000)
struct INTERACT_Snacktron_C_UpdateSnacktronScreen final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(INTERACT_Snacktron_C_UpdateSnacktronScreen) == 0x000008, "Wrong alignment on INTERACT_Snacktron_C_UpdateSnacktronScreen");
static_assert(sizeof(INTERACT_Snacktron_C_UpdateSnacktronScreen) == 0x000030, "Wrong size on INTERACT_Snacktron_C_UpdateSnacktronScreen");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, State) == 0x000000, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::State' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, Temp_bool_Variable) == 0x000001, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, Temp_object_Variable) == 0x000008, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, Temp_object_Variable_1) == 0x000010, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, K2Node_Select_Default) == 0x000020, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_UpdateSnacktronScreen, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'INTERACT_Snacktron_C_UpdateSnacktronScreen::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.IsSnacktronFunctional
// 0x0003 (0x0003 - 0x0000)
struct INTERACT_Snacktron_C_IsSnacktronFunctional final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSnacktronDisabled_Result;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_IsSnacktronFunctional) == 0x000001, "Wrong alignment on INTERACT_Snacktron_C_IsSnacktronFunctional");
static_assert(sizeof(INTERACT_Snacktron_C_IsSnacktronFunctional) == 0x000003, "Wrong size on INTERACT_Snacktron_C_IsSnacktronFunctional");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronFunctional, Result) == 0x000000, "Member 'INTERACT_Snacktron_C_IsSnacktronFunctional::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronFunctional, CallFunc_IsSnacktronDisabled_Result) == 0x000001, "Member 'INTERACT_Snacktron_C_IsSnacktronFunctional::CallFunc_IsSnacktronDisabled_Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronFunctional, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'INTERACT_Snacktron_C_IsSnacktronFunctional::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.IsSnacktronDisabled
// 0x000C (0x000C - 0x0000)
struct INTERACT_Snacktron_C_IsSnacktronDisabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_IsSnacktronDisabled) == 0x000004, "Wrong alignment on INTERACT_Snacktron_C_IsSnacktronDisabled");
static_assert(sizeof(INTERACT_Snacktron_C_IsSnacktronDisabled) == 0x00000C, "Wrong size on INTERACT_Snacktron_C_IsSnacktronDisabled");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronDisabled, Result) == 0x000000, "Member 'INTERACT_Snacktron_C_IsSnacktronDisabled::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronDisabled, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'INTERACT_Snacktron_C_IsSnacktronDisabled::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnacktronDisabled, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'INTERACT_Snacktron_C_IsSnacktronDisabled::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.IsSnackInStockByIndex
// 0x0014 (0x0014 - 0x0000)
struct INTERACT_Snacktron_C_IsSnackInStockByIndex final
{
public:
	int32                                         SnackIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BitShiftLeft_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(INTERACT_Snacktron_C_IsSnackInStockByIndex) == 0x000004, "Wrong alignment on INTERACT_Snacktron_C_IsSnackInStockByIndex");
static_assert(sizeof(INTERACT_Snacktron_C_IsSnackInStockByIndex) == 0x000014, "Wrong size on INTERACT_Snacktron_C_IsSnackInStockByIndex");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnackInStockByIndex, SnackIndex) == 0x000000, "Member 'INTERACT_Snacktron_C_IsSnackInStockByIndex::SnackIndex' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnackInStockByIndex, Result) == 0x000004, "Member 'INTERACT_Snacktron_C_IsSnackInStockByIndex::Result' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnackInStockByIndex, CallFunc_BitShiftLeft_ReturnValue) == 0x000008, "Member 'INTERACT_Snacktron_C_IsSnackInStockByIndex::CallFunc_BitShiftLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnackInStockByIndex, CallFunc_And_IntInt_ReturnValue) == 0x00000C, "Member 'INTERACT_Snacktron_C_IsSnackInStockByIndex::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(INTERACT_Snacktron_C_IsSnackInStockByIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'INTERACT_Snacktron_C_IsSnackInStockByIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function INTERACT_Snacktron.INTERACT_Snacktron_C.HasAnyAvailableSnacks
// 0x0002 (0x0002 - 0x0000)
struct INTERACT_Snacktron_C_HasAnyAvailableSnacks final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
