#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_CargoLift

#include "Basic.hpp"

#include "INTERACT_LootableBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_CargoLift.INTERACT_CargoLift_C
// 0x01A0 (0x0548 - 0x03A8)
class AINTERACT_CargoLift_C final : public AINTERACT_LootableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_CargoLift_C;               // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_ScannableObject;                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CompartmentBox;                                    // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     LiftAudio;                                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_Doors;                                   // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CargoLiftDoorsMesh;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox_CallButton;                              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnBox;                                          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CargoLiftMesh;                                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         StartMoveTimestamp;                                // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ArriveMoveDuration;                                // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloorMoveDuration;                                 // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultButtonColor;                                // 0x0414(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BusyButtonColor;                                   // 0x0424(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CompleteTutorial;                                  // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           MontageTimerHandle;                                // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            OpenMontage;                                       // 0x0450(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CloseMontage;                                      // 0x0478(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   CargoLiftCalledMessage;                            // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NeedToCallCargoLiftMessage;                        // 0x04B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class USoundCue>               LiftCallButtonSoundCue;                            // 0x04D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               LiftMoveLoopSoundCue;                              // 0x04F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               LiftMoveArriveSoundCue;                            // 0x0520(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_CargoLift(int32 EntryPoint);
	void BndEvt__INTERACT_CargoLift_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeCargoLift();
	void InitializeAttributes();
	void SyncFromGameInstance();
	void EVENT_OnLootInventoryInitialized();
	void EVENT_OnLootBagChanged(int32 SlotIndex);
	void SyncToGameInstance();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void TryCompleteTutorial();
	void UpdateButtonColor(bool NeedsToCall);
	void UpdateStatusDirection(int32 LevelDelta);
	void UpdateStatusLevel(int32 LevelIndex);
	void UpdateEmissiveStrength(float Scale);
	void UpdateSideLightProgress(float SignedProgress);
	void UpdateCargoLiftLight(bool Visible);
	void UpdateCargoLiftVisibility(bool VisibilityState);
	void ResumeCargoLiftMovement(bool ShouldFadeIn);
	void UpdateCargoLiftMovement();
	void CallCargoLift(int32 LevelDelta);
	void OnCargoLiftArrived();
	void IsCargoLiftFunctional(bool* Result);
	void GetCargoLiftLevelData(int32* PlayerLevel, int32* CargoLevel);
	void StopChanneling(class AActor* NewChannelingInteract, bool* Result);
	void OpenDoors();
	void CloseDoors();
	void EVENT_OnMontageFinished();
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_CargoLift_C">();
	}
	static class AINTERACT_CargoLift_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_CargoLift_C>();
	}
};
static_assert(alignof(AINTERACT_CargoLift_C) == 0x000008, "Wrong alignment on AINTERACT_CargoLift_C");
static_assert(sizeof(AINTERACT_CargoLift_C) == 0x000548, "Wrong size on AINTERACT_CargoLift_C");
static_assert(offsetof(AINTERACT_CargoLift_C, UberGraphFrame_INTERACT_CargoLift_C) == 0x0003A8, "Member 'AINTERACT_CargoLift_C::UberGraphFrame_INTERACT_CargoLift_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, COMP_AttribManager) == 0x0003B0, "Member 'AINTERACT_CargoLift_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, COMP_ScannableObject) == 0x0003B8, "Member 'AINTERACT_CargoLift_C::COMP_ScannableObject' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CompartmentBox) == 0x0003C0, "Member 'AINTERACT_CargoLift_C::CompartmentBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, LiftAudio) == 0x0003C8, "Member 'AINTERACT_CargoLift_C::LiftAudio' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, COMP_VoxelCullable) == 0x0003D0, "Member 'AINTERACT_CargoLift_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, SpotLight) == 0x0003D8, "Member 'AINTERACT_CargoLift_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, TargetBox_Doors) == 0x0003E0, "Member 'AINTERACT_CargoLift_C::TargetBox_Doors' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CargoLiftDoorsMesh) == 0x0003E8, "Member 'AINTERACT_CargoLift_C::CargoLiftDoorsMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, TargetBox_CallButton) == 0x0003F0, "Member 'AINTERACT_CargoLift_C::TargetBox_CallButton' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, SpawnBox) == 0x0003F8, "Member 'AINTERACT_CargoLift_C::SpawnBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CargoLiftMesh) == 0x000400, "Member 'AINTERACT_CargoLift_C::CargoLiftMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, StartMoveTimestamp) == 0x000408, "Member 'AINTERACT_CargoLift_C::StartMoveTimestamp' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, ArriveMoveDuration) == 0x00040C, "Member 'AINTERACT_CargoLift_C::ArriveMoveDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, FloorMoveDuration) == 0x000410, "Member 'AINTERACT_CargoLift_C::FloorMoveDuration' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, DefaultButtonColor) == 0x000414, "Member 'AINTERACT_CargoLift_C::DefaultButtonColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, BusyButtonColor) == 0x000424, "Member 'AINTERACT_CargoLift_C::BusyButtonColor' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CompleteTutorial) == 0x000438, "Member 'AINTERACT_CargoLift_C::CompleteTutorial' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, MontageTimerHandle) == 0x000448, "Member 'AINTERACT_CargoLift_C::MontageTimerHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, OpenMontage) == 0x000450, "Member 'AINTERACT_CargoLift_C::OpenMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CloseMontage) == 0x000478, "Member 'AINTERACT_CargoLift_C::CloseMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, CargoLiftCalledMessage) == 0x0004A0, "Member 'AINTERACT_CargoLift_C::CargoLiftCalledMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, NeedToCallCargoLiftMessage) == 0x0004B8, "Member 'AINTERACT_CargoLift_C::NeedToCallCargoLiftMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, LiftCallButtonSoundCue) == 0x0004D0, "Member 'AINTERACT_CargoLift_C::LiftCallButtonSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, LiftMoveLoopSoundCue) == 0x0004F8, "Member 'AINTERACT_CargoLift_C::LiftMoveLoopSoundCue' has a wrong offset!");
static_assert(offsetof(AINTERACT_CargoLift_C, LiftMoveArriveSoundCue) == 0x000520, "Member 'AINTERACT_CargoLift_C::LiftMoveArriveSoundCue' has a wrong offset!");

}

