#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTERACT_Isotope_XMinus22_Receptacle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Channeling_Base_classes.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass INTERACT_Isotope_X-22_Receptacle.INTERACT_Isotope_X-22_Receptacle_C
// 0x0188 (0x04D8 - 0x0350)
class AINTERACT_Isotope_XMinus22_Receptacle_C final : public AINTERACT_Channeling_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_INTERACT_Isotope_XMinus22_Receptacle_C; // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BackplateCollisionBox;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CoverCollisionBox;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MountNode;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ReceptacleMesh;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_Base_C*                       TargetInteractable;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   RequiredItem;                                      // 0x03A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UITEM_Story_Base_C*                     RequiredItemInstance;                              // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 IsotopeMesh;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        IsotopeLightComponent;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     IsotopeAudioComponent;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          IsActivated;                                       // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RequiresIsotopeText;                               // 0x03F0(0x0018)(Edit, BlueprintVisible)
	class FText                                   IsotopeSecureText;                                 // 0x0408(0x0018)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    RequiresIsotopeMediaHandle;                        // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    IsotopePlacedMediaHandle;                          // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   CompartmentOpenedText;                             // 0x0440(0x0018)(Edit, BlueprintVisible)
	class FString                                 DrawIsotopeMessage;                                // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 InsertIsotopeMessage;                              // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CloseCompartmentMessage;                           // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            OpenCompartmentMontage;                            // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CloseCompartmentMontage;                           // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_INTERACT_Isotope_XMinus22_Receptacle(int32 EntryPoint);
	void BndEvt__INTERACT_Isotope_XMinus22_Receptacle_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void InitializeIsotopeReceptacle();
	void InitializeAttributes();
	void SetReceptacleActivated(bool State);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void TryInteractWhileHoldingIsotope(class APAWN_Hacker_Simple_C* Hacker, struct FSTRUCT_InteractResults* InteractResults);
	void TryDrawIsotope(class APAWN_Hacker_Simple_C* Hacker, bool* Result);
	void TryInsertIsotope(class APAWN_Hacker_Simple_C* Hacker, bool* Result);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);
	void EVENT_OnOpenMontageFinished();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void TryOpenCompartment(bool* Result);
	void TryCloseCompartment(bool CloseImmediately, bool* Result);
	void TryDestroyIsotopeComponents();
	void AttachIsotopeToReceptacle();
	void FindAndCacheRequiredItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void TryRemoveRequiredItem(class APAWN_Hacker_Simple_C* HackerPawn);
	void FadeIsotopeAudio();
	void UpdateMeshEmissiveStrength(float Scale);
	void UpdateIsotopeLightIntensity(float DeltaTime);
	void IsReceptacleActivated(bool* Result);
	void UpdateVisibility(bool VisibilityState);
	void ResumeChannelingSequence(class APAWN_Hacker_Simple_C* HackerPawn, bool* IsWaitingToHolster);
	void CreateChannelingMoveControl(class APAWN_Hacker_Simple_C* HackerPawn, class UMOVECONTROL_Base_C** Result);
	void OnChannelingMontageFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTERACT_Isotope_X-22_Receptacle_C">();
	}
	static class AINTERACT_Isotope_XMinus22_Receptacle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTERACT_Isotope_XMinus22_Receptacle_C>();
	}
};
static_assert(alignof(AINTERACT_Isotope_XMinus22_Receptacle_C) == 0x000008, "Wrong alignment on AINTERACT_Isotope_XMinus22_Receptacle_C");
static_assert(sizeof(AINTERACT_Isotope_XMinus22_Receptacle_C) == 0x0004D8, "Wrong size on AINTERACT_Isotope_XMinus22_Receptacle_C");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, UberGraphFrame_INTERACT_Isotope_XMinus22_Receptacle_C) == 0x000350, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::UberGraphFrame_INTERACT_Isotope_XMinus22_Receptacle_C' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, COMP_AttribManager) == 0x000358, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, COMP_VoxelCullable) == 0x000360, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, BackplateCollisionBox) == 0x000368, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::BackplateCollisionBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, CoverCollisionBox) == 0x000370, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::CoverCollisionBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, ScanBox) == 0x000378, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::ScanBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, TargetBox) == 0x000380, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::TargetBox' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, MountNode) == 0x000388, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::MountNode' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, ReceptacleMesh) == 0x000390, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::ReceptacleMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, TargetInteractable) == 0x000398, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::TargetInteractable' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, RequiredItem) == 0x0003A0, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::RequiredItem' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, RequiredItemInstance) == 0x0003C8, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::RequiredItemInstance' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsotopeMesh) == 0x0003D0, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsotopeMesh' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsotopeLightComponent) == 0x0003D8, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsotopeLightComponent' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsotopeAudioComponent) == 0x0003E0, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsotopeAudioComponent' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, Opened) == 0x0003E8, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::Opened' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsActivated) == 0x0003E9, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsActivated' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, RequiresIsotopeText) == 0x0003F0, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::RequiresIsotopeText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsotopeSecureText) == 0x000408, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsotopeSecureText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, RequiresIsotopeMediaHandle) == 0x000420, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::RequiresIsotopeMediaHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, IsotopePlacedMediaHandle) == 0x000430, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::IsotopePlacedMediaHandle' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, CompartmentOpenedText) == 0x000440, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::CompartmentOpenedText' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, DrawIsotopeMessage) == 0x000458, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::DrawIsotopeMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, InsertIsotopeMessage) == 0x000468, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::InsertIsotopeMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, CloseCompartmentMessage) == 0x000478, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::CloseCompartmentMessage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, OpenCompartmentMontage) == 0x000488, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::OpenCompartmentMontage' has a wrong offset!");
static_assert(offsetof(AINTERACT_Isotope_XMinus22_Receptacle_C, CloseCompartmentMontage) == 0x0004B0, "Member 'AINTERACT_Isotope_XMinus22_Receptacle_C::CloseCompartmentMontage' has a wrong offset!");

}

