#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryBag

#include "Basic.hpp"

#include "STRUCT_SoftItemParams_structs.hpp"
#include "ENUM_CardinalDirection_structs.hpp"
#include "STRUCT_InventoryBagParams_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "ENUM_UpgradeResult_structs.hpp"
#include "STRUCT_ItemInsertionRules_structs.hpp"
#include "ENUM_InventorySlotType_structs.hpp"
#include "ENUM_ItemType_structs.hpp"


namespace SDK::Params
{

// Function InventoryBag.InventoryBag_C.OnBagChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct InventoryBag_C_OnBagChanged__DelegateSignature final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBag_C_OnBagChanged__DelegateSignature) == 0x000004, "Wrong alignment on InventoryBag_C_OnBagChanged__DelegateSignature");
static_assert(sizeof(InventoryBag_C_OnBagChanged__DelegateSignature) == 0x000004, "Wrong size on InventoryBag_C_OnBagChanged__DelegateSignature");
static_assert(offsetof(InventoryBag_C_OnBagChanged__DelegateSignature, SlotIndex) == 0x000000, "Member 'InventoryBag_C_OnBagChanged__DelegateSignature::SlotIndex' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.InitializeBag
// 0x00C8 (0x00C8 - 0x0000)
struct InventoryBag_C_InitializeBag final
{
public:
	class UITEM_Base_C*                           CurrentItem;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotCount;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_Base_C*>                   ItemsInSet;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSlotIndicesForItemInstance_Slot_Indices; // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotCountRequiredForItem_Result;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_Base_C*>                   CallFunc_Set_ToArray_Result;                       // 0x0098(0x0010)(ReferenceParm)
	class UITEM_Base_C*                           CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryBag_C_InitializeBag) == 0x000008, "Wrong alignment on InventoryBag_C_InitializeBag");
static_assert(sizeof(InventoryBag_C_InitializeBag) == 0x0000C8, "Wrong size on InventoryBag_C_InitializeBag");
static_assert(offsetof(InventoryBag_C_InitializeBag, CurrentItem) == 0x000000, "Member 'InventoryBag_C_InitializeBag::CurrentItem' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, SlotCount) == 0x000008, "Member 'InventoryBag_C_InitializeBag::SlotCount' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, ItemsInSet) == 0x000010, "Member 'InventoryBag_C_InitializeBag::ItemsInSet' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'InventoryBag_C_InitializeBag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'InventoryBag_C_InitializeBag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Array_Index_Variable) == 0x000028, "Member 'InventoryBag_C_InitializeBag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'InventoryBag_C_InitializeBag::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'InventoryBag_C_InitializeBag::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Loop_Counter_Variable_2) == 0x000034, "Member 'InventoryBag_C_InitializeBag::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'InventoryBag_C_InitializeBag::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'InventoryBag_C_InitializeBag::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Loop_Counter_Variable_3) == 0x000040, "Member 'InventoryBag_C_InitializeBag::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Add_IntInt_ReturnValue_3) == 0x000044, "Member 'InventoryBag_C_InitializeBag::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Array_Index_Variable_2) == 0x000048, "Member 'InventoryBag_C_InitializeBag::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, Temp_int_Array_Index_Variable_3) == 0x00004C, "Member 'InventoryBag_C_InitializeBag::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Get_Item) == 0x000058, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'InventoryBag_C_InitializeBag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_GetSlotIndicesForItemInstance_Slot_Indices) == 0x000068, "Member 'InventoryBag_C_InitializeBag::CallFunc_GetSlotIndicesForItemInstance_Slot_Indices' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_GetSlotIndex_Result) == 0x00007C, "Member 'InventoryBag_C_InitializeBag::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_GetObjectClass_ReturnValue) == 0x000080, "Member 'InventoryBag_C_InitializeBag::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_GetSlotCountRequiredForItem_Result) == 0x00008C, "Member 'InventoryBag_C_InitializeBag::CallFunc_GetSlotCountRequiredForItem_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'InventoryBag_C_InitializeBag::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000091, "Member 'InventoryBag_C_InitializeBag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Set_ToArray_Result) == 0x000098, "Member 'InventoryBag_C_InitializeBag::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Length_ReturnValue_2) == 0x0000B8, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Array_Length_ReturnValue_3) == 0x0000BC, "Member 'InventoryBag_C_InitializeBag::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C0, "Member 'InventoryBag_C_InitializeBag::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000C1, "Member 'InventoryBag_C_InitializeBag::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C2, "Member 'InventoryBag_C_InitializeBag::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_InitializeBag, CallFunc_Max_ReturnValue) == 0x0000C4, "Member 'InventoryBag_C_InitializeBag::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.TryFixupBag
// 0x00C0 (0x00C0 - 0x0000)
struct InventoryBag_C_TryFixupBag final
{
public:
	struct FSTRUCT_InventoryBagParams             DefaultParams;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              ItemGridCoords;                                    // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CurrentItem;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultMaxSlotCount;                               // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultGridWidth;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_Base_C*>                   CallFunc_GetItemArray_Items;                       // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxSlots_Count;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGridWidth_Result;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryBag_C_TryFixupBag) == 0x000008, "Wrong alignment on InventoryBag_C_TryFixupBag");
static_assert(sizeof(InventoryBag_C_TryFixupBag) == 0x0000C0, "Wrong size on InventoryBag_C_TryFixupBag");
static_assert(offsetof(InventoryBag_C_TryFixupBag, DefaultParams) == 0x000000, "Member 'InventoryBag_C_TryFixupBag::DefaultParams' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, Result) == 0x000030, "Member 'InventoryBag_C_TryFixupBag::Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, ItemGridCoords) == 0x000034, "Member 'InventoryBag_C_TryFixupBag::ItemGridCoords' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CurrentItem) == 0x000040, "Member 'InventoryBag_C_TryFixupBag::CurrentItem' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, DefaultMaxSlotCount) == 0x000048, "Member 'InventoryBag_C_TryFixupBag::DefaultMaxSlotCount' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, DefaultGridWidth) == 0x00004C, "Member 'InventoryBag_C_TryFixupBag::DefaultGridWidth' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, Temp_int_Array_Index_Variable) == 0x000050, "Member 'InventoryBag_C_TryFixupBag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'InventoryBag_C_TryFixupBag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'InventoryBag_C_TryFixupBag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetItemArray_Items) == 0x000060, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetItemArray_Items' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetSlotIndex_Result) == 0x000070, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Array_Get_Item) == 0x000078, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords) == 0x000080, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Multiply_IntInt_ReturnValue) == 0x000090, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'InventoryBag_C_TryFixupBag::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'InventoryBag_C_TryFixupBag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetMaxSlots_Count) == 0x0000A0, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetMaxSlots_Count' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetInventory_Inventory) == 0x0000A8, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'InventoryBag_C_TryFixupBag::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_GetGridWidth_Result) == 0x0000B4, "Member 'InventoryBag_C_TryFixupBag::CallFunc_GetGridWidth_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000B8, "Member 'InventoryBag_C_TryFixupBag::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_TryFixupBag, CallFunc_BooleanOR_ReturnValue) == 0x0000B9, "Member 'InventoryBag_C_TryFixupBag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.GetInventory
// 0x0020 (0x0020 - 0x0000)
struct InventoryBag_C_GetInventory final
{
public:
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      K2Node_DynamicCast_AsCOMP_Inventory;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryBag_C_GetInventory) == 0x000008, "Wrong alignment on InventoryBag_C_GetInventory");
static_assert(sizeof(InventoryBag_C_GetInventory) == 0x000020, "Wrong size on InventoryBag_C_GetInventory");
static_assert(offsetof(InventoryBag_C_GetInventory, Inventory) == 0x000000, "Member 'InventoryBag_C_GetInventory::Inventory' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_GetInventory, CallFunc_GetOuterObject_ReturnValue) == 0x000008, "Member 'InventoryBag_C_GetInventory::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_GetInventory, K2Node_DynamicCast_AsCOMP_Inventory) == 0x000010, "Member 'InventoryBag_C_GetInventory::K2Node_DynamicCast_AsCOMP_Inventory' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_GetInventory, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'InventoryBag_C_GetInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.IsOverflowBag
// 0x0001 (0x0001 - 0x0000)
struct InventoryBag_C_IsOverflowBag final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryBag_C_IsOverflowBag) == 0x000001, "Wrong alignment on InventoryBag_C_IsOverflowBag");
static_assert(sizeof(InventoryBag_C_IsOverflowBag) == 0x000001, "Wrong size on InventoryBag_C_IsOverflowBag");
static_assert(offsetof(InventoryBag_C_IsOverflowBag, Result) == 0x000000, "Member 'InventoryBag_C_IsOverflowBag::Result' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.AddItemInternal
// 0x00E0 (0x00E0 - 0x0000)
struct InventoryBag_C_AddItemInternal final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_ItemInsertionRules             InsertionRules;                                    // 0x0010(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Modify;                                            // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InOutCount;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CandidateSlotIndex;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSlotCountForLoop;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsItemRotated;                                     // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CandidateItem;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemRotated_Result;                     // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetItemGridSize_Result;                   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemRotated_Result_1;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxSlots_Count;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddItemToSlotInternal_Result;             // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetItemRotatedGridSize_Result;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSlotSpaceForItemWithSize_Result;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItemToSlotInternal_Result_1;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetItemRotatedGridSize_Result_1;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSlotSpaceForItemWithSize_Result_1;     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddItemToSlotInternal_Result_2;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_Base_C*>                   CallFunc_Set_ToArray_Result;                       // 0x00B8(0x0010)(ReferenceParm)
	class UITEM_Base_C*                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryBag_C_AddItemInternal) == 0x000008, "Wrong alignment on InventoryBag_C_AddItemInternal");
static_assert(sizeof(InventoryBag_C_AddItemInternal) == 0x0000E0, "Wrong size on InventoryBag_C_AddItemInternal");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Item) == 0x000000, "Member 'InventoryBag_C_AddItemInternal::Item' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, ItemClass) == 0x000008, "Member 'InventoryBag_C_AddItemInternal::ItemClass' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, InsertionRules) == 0x000010, "Member 'InventoryBag_C_AddItemInternal::InsertionRules' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Modify) == 0x000012, "Member 'InventoryBag_C_AddItemInternal::Modify' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, InOutCount) == 0x000014, "Member 'InventoryBag_C_AddItemInternal::InOutCount' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Result) == 0x000018, "Member 'InventoryBag_C_AddItemInternal::Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CandidateSlotIndex) == 0x00001C, "Member 'InventoryBag_C_AddItemInternal::CandidateSlotIndex' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, MaxSlotCountForLoop) == 0x000020, "Member 'InventoryBag_C_AddItemInternal::MaxSlotCountForLoop' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, IsItemRotated) == 0x000024, "Member 'InventoryBag_C_AddItemInternal::IsItemRotated' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CandidateItem) == 0x000028, "Member 'InventoryBag_C_AddItemInternal::CandidateItem' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'InventoryBag_C_AddItemInternal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Temp_int_Array_Index_Variable) == 0x000038, "Member 'InventoryBag_C_AddItemInternal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_IsItemRotated_Result) == 0x00003C, "Member 'InventoryBag_C_AddItemInternal::CallFunc_IsItemRotated_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetSlotIndex_Result) == 0x000040, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetItemGridSize_Result) == 0x000044, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetItemGridSize_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00004C, "Member 'InventoryBag_C_AddItemInternal::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_IsItemRotated_Result_1) == 0x00004D, "Member 'InventoryBag_C_AddItemInternal::CallFunc_IsItemRotated_Result_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetObjectClass_ReturnValue) == 0x000050, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'InventoryBag_C_AddItemInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetSlotItem_Item) == 0x000060, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'InventoryBag_C_AddItemInternal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'InventoryBag_C_AddItemInternal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetMaxSlots_Count) == 0x000080, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetMaxSlots_Count' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Not_PreBool_ReturnValue_1) == 0x000084, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_AddItemToSlotInternal_Result) == 0x000085, "Member 'InventoryBag_C_AddItemInternal::CallFunc_AddItemToSlotInternal_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Not_PreBool_ReturnValue_2) == 0x000086, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetItemRotatedGridSize_Result) == 0x000088, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetItemRotatedGridSize_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_HasSlotSpaceForItemWithSize_Result) == 0x000090, "Member 'InventoryBag_C_AddItemInternal::CallFunc_HasSlotSpaceForItemWithSize_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Temp_bool_Variable) == 0x000091, "Member 'InventoryBag_C_AddItemInternal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, Temp_int_Variable) == 0x000094, "Member 'InventoryBag_C_AddItemInternal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, K2Node_Select_Default) == 0x000098, "Member 'InventoryBag_C_AddItemInternal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009C, "Member 'InventoryBag_C_AddItemInternal::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A0, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_AddItemToSlotInternal_Result_1) == 0x0000A4, "Member 'InventoryBag_C_AddItemInternal::CallFunc_AddItemToSlotInternal_Result_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_GetItemRotatedGridSize_Result_1) == 0x0000A8, "Member 'InventoryBag_C_AddItemInternal::CallFunc_GetItemRotatedGridSize_Result_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_HasSlotSpaceForItemWithSize_Result_1) == 0x0000B0, "Member 'InventoryBag_C_AddItemInternal::CallFunc_HasSlotSpaceForItemWithSize_Result_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_AddItemToSlotInternal_Result_2) == 0x0000B1, "Member 'InventoryBag_C_AddItemInternal::CallFunc_AddItemToSlotInternal_Result_2' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000B2, "Member 'InventoryBag_C_AddItemInternal::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Set_ToArray_Result) == 0x0000B8, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000D0, "Member 'InventoryBag_C_AddItemInternal::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryBag_C_AddItemInternal, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'InventoryBag_C_AddItemInternal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function InventoryBag.InventoryBag_C.AddItemToSlotInternal
// 0x00F8 (0x00F8 - 0x0000)
struct InventoryBag_C_AddItemToSlotInternal final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotated;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Modify;                                            // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InOutCount;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_Base_C*>                   SlotItems;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 SlotIndices;                                       // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         CountOnSlot;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CountToAddToSlot;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           SlotItem;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotTypeSingle_Result;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_Base_C*>                   CallFunc_GetItemsInSlots_Items;                    // 0x0060(0x0010)(ReferenceParm)
	struct FIntPoint                              CallFunc_GetItemGridSize_Result;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_Result;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetItemRotatedGridSize_Result;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetSlotIndicesForItemWithSize_SlotIndices; // 0x00B0(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddCount_ResultCount;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_CreateItemInSlot_ItemCreated;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_Result_1;                        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryBag_C_AddItemToSlotInternal) == 0x000008, "Wrong alignment on InventoryBag_C_AddItemToSlotInternal");
static_assert(sizeof(InventoryBag_C_AddItemToSlotInternal) == 0x0000F8, "Wrong size on InventoryBag_C_AddItemToSlotInternal");
static_assert(offsetof(InventoryBag_C_AddItemToSlotInternal, SlotIndex) == 0x000000, "Member 'InventoryBag_C_AddItemToSlotInternal::SlotIndex' has a wrong offset!");
