#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryFunctionLibrary

#include "Basic.hpp"

#include "ENUM_WeaponProperty_structs.hpp"
#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_Axis_structs.hpp"
#include "STRUCT_ItemDetailsIconParams_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "STRUCT_WeaponPropertyValue_structs.hpp"
#include "ENUM_UpgradeResult_structs.hpp"
#include "ENUM_ItemType_structs.hpp"
#include "STRUCT_SoftItemParams_structs.hpp"


namespace SDK::Params
{

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.CreateInventoryItem
// 0x0048 (0x0048 - 0x0000)
struct InventoryFunctionLibrary_C_CreateInventoryItem final
{
public:
	struct FSTRUCT_HardItemParams                 ItemParams;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           Item;                                              // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           ItemCreated;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnInventoryChanged_Result;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      K2Node_DynamicCast_AsCOMP_Inventory;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_CreateInventoryItem) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_CreateInventoryItem");
static_assert(sizeof(InventoryFunctionLibrary_C_CreateInventoryItem) == 0x000048, "Wrong size on InventoryFunctionLibrary_C_CreateInventoryItem");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, ItemParams) == 0x000000, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::ItemParams' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, Item) == 0x000018, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::Item' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, ItemCreated) == 0x000020, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::ItemCreated' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, CallFunc_OnInventoryChanged_Result) == 0x000030, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::CallFunc_OnInventoryChanged_Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, K2Node_DynamicCast_AsCOMP_Inventory) == 0x000038, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::K2Node_DynamicCast_AsCOMP_Inventory' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryItem, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'InventoryFunctionLibrary_C_CreateInventoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.CreateHardItemParams
// 0x0070 (0x0070 - 0x0000)
struct InventoryFunctionLibrary_C_CreateHardItemParams final
{
public:
	struct FSTRUCT_SoftItemParams                 SoftParams;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_HardItemParams                 Result;                                            // 0x0038(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0060(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_CreateHardItemParams) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_CreateHardItemParams");
static_assert(sizeof(InventoryFunctionLibrary_C_CreateHardItemParams) == 0x000070, "Wrong size on InventoryFunctionLibrary_C_CreateHardItemParams");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, SoftParams) == 0x000000, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::SoftParams' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, __WorldContext) == 0x000030, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, Result) == 0x000038, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000048, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, K2Node_ClassDynamicCast_AsITEM_Base) == 0x000050, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::K2Node_ClassDynamicCast_AsITEM_Base' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, K2Node_ClassDynamicCast_bSuccess) == 0x000058, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateHardItemParams, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000060, "Member 'InventoryFunctionLibrary_C_CreateHardItemParams::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.UpdateItemWidgetPosition
// 0x0040 (0x0040 - 0x0000)
struct InventoryFunctionLibrary_C_UpdateItemWidgetPosition final
{
public:
	class UInventoryBag_C*                        InventoryBag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridMeshWidget*                        BagMeshWidget;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SlottedItem_C*                  ItemMeshWidget;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetItemWidgetPositionFromCoords_ResultPosition; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_UpdateItemWidgetPosition");
static_assert(sizeof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition) == 0x000040, "Wrong size on InventoryFunctionLibrary_C_UpdateItemWidgetPosition");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, InventoryBag) == 0x000000, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::InventoryBag' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, SlotIndex) == 0x000008, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::SlotIndex' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, BagMeshWidget) == 0x000010, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::BagMeshWidget' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, ItemMeshWidget) == 0x000018, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::ItemMeshWidget' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, __WorldContext) == 0x000020, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords) == 0x000030, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::CallFunc_GetGridCoordinatesFromSlotIndex_GridCoords' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPosition, CallFunc_GetItemWidgetPositionFromCoords_ResultPosition) == 0x000038, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPosition::CallFunc_GetItemWidgetPositionFromCoords_ResultPosition' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetItemTypePriority
// 0x0018 (0x0018 - 0x0000)
struct InventoryFunctionLibrary_C_GetItemTypePriority final
{
public:
	ENUM_ItemType                                 ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_GetItemTypePriority) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetItemTypePriority");
static_assert(sizeof(InventoryFunctionLibrary_C_GetItemTypePriority) == 0x000018, "Wrong size on InventoryFunctionLibrary_C_GetItemTypePriority");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemTypePriority, ItemType) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetItemTypePriority::ItemType' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemTypePriority, __WorldContext) == 0x000008, "Member 'InventoryFunctionLibrary_C_GetItemTypePriority::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemTypePriority, Result) == 0x000010, "Member 'InventoryFunctionLibrary_C_GetItemTypePriority::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemTypePriority, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'InventoryFunctionLibrary_C_GetItemTypePriority::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetItemWidgetPositionFromCoords
// 0x0040 (0x0040 - 0x0000)
struct InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords final
{
public:
	struct FIntPoint                              GridCoords;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        BagMeshWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ResultPosition;                                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetWidgetOffsetFromGridCoordinates_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords");
static_assert(sizeof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords) == 0x000040, "Wrong size on InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, GridCoords) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::GridCoords' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, BagMeshWidget) == 0x000008, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::BagMeshWidget' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, ResultPosition) == 0x000018, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::ResultPosition' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, CallFunc_GetPosition_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, CallFunc_GetWidgetOffsetFromGridCoordinates_ReturnValue) == 0x000030, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::CallFunc_GetWidgetOffsetFromGridCoordinates_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'InventoryFunctionLibrary_C_GetItemWidgetPositionFromCoords::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.IsUpgradeRecurse
// 0x0088 (0x0088 - 0x0000)
struct InventoryFunctionLibrary_C_IsUpgradeRecurse final
{
public:
	class UClass*                                 UpgradeClass;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DowngradeClass;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Upgrade_Base;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUpgradeRecurse_Result;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_SoftClassReference_ReturnValue;  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_IsUpgradeRecurse) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_IsUpgradeRecurse");
static_assert(sizeof(InventoryFunctionLibrary_C_IsUpgradeRecurse) == 0x000088, "Wrong size on InventoryFunctionLibrary_C_IsUpgradeRecurse");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, UpgradeClass) == 0x000000, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::UpgradeClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, DowngradeClass) == 0x000008, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::DowngradeClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, Result) == 0x000018, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000019, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000020, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000048, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1) == 0x000050, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, K2Node_ClassDynamicCast_AsITEM_Upgrade_Base) == 0x000078, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::K2Node_ClassDynamicCast_AsITEM_Upgrade_Base' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, K2Node_ClassDynamicCast_bSuccess) == 0x000080, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_IsUpgradeRecurse_Result) == 0x000081, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_IsUpgradeRecurse_Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_NotEqual_SoftClassReference_ReturnValue) == 0x000082, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_NotEqual_SoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_IsUpgradeRecurse, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x000083, "Member 'InventoryFunctionLibrary_C_IsUpgradeRecurse::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetUpgradeMessageFromResult
// 0x0110 (0x0110 - 0x0000)
struct InventoryFunctionLibrary_C_GetUpgradeMessageFromResult final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_UpgradeResult                            UpgradeResult;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   UpgradeMessage;                                    // 0x0030(0x0018)(Edit, BlueprintVisible)
	class UClass*                                 UpgradeItemClass;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Upgrade_Base;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetUpgradeMessageFromResult");
static_assert(sizeof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult) == 0x000110, "Wrong size on InventoryFunctionLibrary_C_GetUpgradeMessageFromResult");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, ItemClass) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::ItemClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, UpgradeResult) == 0x000008, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::UpgradeResult' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, Result) == 0x000018, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, UpgradeMessage) == 0x000030, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::UpgradeMessage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, UpgradeItemClass) == 0x000048, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::UpgradeItemClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_SwitchEnum_CmpSuccess) == 0x0000D0, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_MakeArray_Array) == 0x0000D8, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_ClassDynamicCast_AsITEM_Upgrade_Base) == 0x000100, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_ClassDynamicCast_AsITEM_Upgrade_Base' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeMessageFromResult, K2Node_ClassDynamicCast_bSuccess) == 0x000108, "Member 'InventoryFunctionLibrary_C_GetUpgradeMessageFromResult::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetUpgradeVersionNumber
// 0x0048 (0x0048 - 0x0000)
struct InventoryFunctionLibrary_C_GetUpgradeVersionNumber final
{
public:
	class UClass*                                 UpgradeClass;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Version;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UpgradeVersion;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CurrentClass;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Upgrade_Base;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetUpgradeVersionNumber");
static_assert(sizeof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber) == 0x000048, "Wrong size on InventoryFunctionLibrary_C_GetUpgradeVersionNumber");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, UpgradeClass) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::UpgradeClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, __WorldContext) == 0x000008, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, Version) == 0x000010, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::Version' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, UpgradeVersion) == 0x000014, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::UpgradeVersion' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, CurrentClass) == 0x000018, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::CurrentClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, Temp_int_Variable) == 0x000020, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, CallFunc_IsValidClass_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000030, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, K2Node_ClassDynamicCast_AsITEM_Upgrade_Base) == 0x000038, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::K2Node_ClassDynamicCast_AsITEM_Upgrade_Base' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetUpgradeVersionNumber, K2Node_ClassDynamicCast_bSuccess) == 0x000040, "Member 'InventoryFunctionLibrary_C_GetUpgradeVersionNumber::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetPickupMessageForItemClass
// 0x00E8 (0x00E8 - 0x0000)
struct InventoryFunctionLibrary_C_GetPickupMessageForItemClass final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0010(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsPICKUP_Base;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
};
static_assert(alignof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetPickupMessageForItemClass");
static_assert(sizeof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass) == 0x0000E8, "Wrong size on InventoryFunctionLibrary_C_GetPickupMessageForItemClass");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, ItemClass) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::ItemClass' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, __WorldContext) == 0x000008, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, Result) == 0x000010, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000068, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, K2Node_ClassDynamicCast_AsPICKUP_Base) == 0x000070, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::K2Node_ClassDynamicCast_AsPICKUP_Base' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, K2Node_MakeArray_Array) == 0x0000C0, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetPickupMessageForItemClass, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'InventoryFunctionLibrary_C_GetPickupMessageForItemClass::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.UpdateItemWidgetPositionFromCoords
// 0x0030 (0x0030 - 0x0000)
struct InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords final
{
public:
	struct FIntPoint                              GridCoords;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        BagMeshWidget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SlottedItem_C*                  ItemMeshWidget;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetItemWidgetPositionFromCoords_ResultPosition; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords");
static_assert(sizeof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords) == 0x000030, "Wrong size on InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, GridCoords) == 0x000000, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::GridCoords' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, BagMeshWidget) == 0x000008, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::BagMeshWidget' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, ItemMeshWidget) == 0x000010, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::ItemMeshWidget' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, __WorldContext) == 0x000018, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, CallFunc_GetItemWidgetPositionFromCoords_ResultPosition) == 0x000020, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::CallFunc_GetItemWidgetPositionFromCoords_ResultPosition' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_UpdateItemWidgetPositionFromCoords::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetInventoryDescriptionText
// 0x00A8 (0x00A8 - 0x0000)
struct InventoryFunctionLibrary_C_GetInventoryDescriptionText final
{
public:
	class FText                                   BaseMessage;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsInventoryEmpty;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ResultMessage;                                     // 0x0028(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(InventoryFunctionLibrary_C_GetInventoryDescriptionText) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetInventoryDescriptionText");
static_assert(sizeof(InventoryFunctionLibrary_C_GetInventoryDescriptionText) == 0x0000A8, "Wrong size on InventoryFunctionLibrary_C_GetInventoryDescriptionText");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, BaseMessage) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::BaseMessage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, IsInventoryEmpty) == 0x000018, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::IsInventoryEmpty' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, __WorldContext) == 0x000020, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, ResultMessage) == 0x000028, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::ResultMessage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, K2Node_MakeArray_Array) == 0x000080, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetInventoryDescriptionText, CallFunc_Format_ReturnValue) == 0x000090, "Member 'InventoryFunctionLibrary_C_GetInventoryDescriptionText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetFormattedWeaponDamageText
// 0x0340 (0x0340 - 0x0000)
struct InventoryFunctionLibrary_C_GetFormattedWeaponDamageText final
{
public:
	struct FSTRUCT_WeaponMode                     WeaponMode;                                        // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          IsMaintain;                                        // 0x0100(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowSecondaryDamage;                               // 0x0101(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CombineDamageValues;                               // 0x0102(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Result;                                            // 0x0110(0x0018)(Parm, OutParm)
	class UAttribDamageType*                      SecondaryDamageType;                               // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecondaryDamage;                                   // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrimaryDamage;                                     // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0140(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0258(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0298(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02A8(0x0018)()
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0310(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0320(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_GetFormattedWeaponDamageText");
static_assert(sizeof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText) == 0x000340, "Wrong size on InventoryFunctionLibrary_C_GetFormattedWeaponDamageText");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, WeaponMode) == 0x000000, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::WeaponMode' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, IsMaintain) == 0x000100, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::IsMaintain' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, ShowSecondaryDamage) == 0x000101, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::ShowSecondaryDamage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CombineDamageValues) == 0x000102, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CombineDamageValues' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, __WorldContext) == 0x000108, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, Result) == 0x000110, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, SecondaryDamageType) == 0x000128, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::SecondaryDamageType' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, SecondaryDamage) == 0x000130, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::SecondaryDamage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, PrimaryDamage) == 0x000134, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::PrimaryDamage' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Conv_IntToText_ReturnValue) == 0x000140, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000158, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B0, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001F0, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeArray_Array) == 0x000230, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Format_ReturnValue) == 0x000240, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000258, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeArray_Array_1) == 0x000298, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Format_ReturnValue_1) == 0x0002A8, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_GetWeaponPropertyValueByType_Value) == 0x0002C0, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002C8, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_IsValid_ReturnValue) == 0x000308, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, K2Node_MakeArray_Array_2) == 0x000310, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Format_ReturnValue_2) == 0x000320, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_GetFormattedWeaponDamageText, CallFunc_Greater_IntInt_ReturnValue) == 0x000338, "Member 'InventoryFunctionLibrary_C_GetFormattedWeaponDamageText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.GetWeaponModeDamageTypeText
// 0x0248 (0x0248 - 0x0000)
struct InventoryFunctionLibrary_C_GetWeaponModeDamageTypeText final
{
public:
	struct FSTRUCT_WeaponMode                     Mode;                                              // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
