#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_WeaponBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreGame_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "STRUCT_WeaponRecoilTemplate_structs.hpp"


namespace SDK::Params
{

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnModeChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ITEM_WeaponBase_C_OnModeChanged__DelegateSignature final
{
public:
	class UITEM_WeaponBase_C*                     Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldMode;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewMode;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnModeChanged__DelegateSignature) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnModeChanged__DelegateSignature");
static_assert(sizeof(ITEM_WeaponBase_C_OnModeChanged__DelegateSignature) == 0x000010, "Wrong size on ITEM_WeaponBase_C_OnModeChanged__DelegateSignature");
static_assert(offsetof(ITEM_WeaponBase_C_OnModeChanged__DelegateSignature, Weapon) == 0x000000, "Member 'ITEM_WeaponBase_C_OnModeChanged__DelegateSignature::Weapon' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_OnModeChanged__DelegateSignature, OldMode) == 0x000008, "Member 'ITEM_WeaponBase_C_OnModeChanged__DelegateSignature::OldMode' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_OnModeChanged__DelegateSignature, NewMode) == 0x00000C, "Member 'ITEM_WeaponBase_C_OnModeChanged__DelegateSignature::NewMode' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnModkitInstalled__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature final
{
public:
	class UITEM_WeaponBase_C*                     Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponModKit_Base_C*              ModKit;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature");
static_assert(sizeof(ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature) == 0x000010, "Wrong size on ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature");
static_assert(offsetof(ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature, Weapon) == 0x000000, "Member 'ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature::Weapon' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature, ModKit) == 0x000008, "Member 'ITEM_WeaponBase_C_OnModkitInstalled__DelegateSignature::ModKit' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.ExecuteUbergraph_ITEM_WeaponBase
// 0x02D8 (0x02D8 - 0x0000)
struct ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0078(0x0100)(HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_4; // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_4;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_5;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_5; // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B[0x5];                                      // 0x024B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryCompleteBinaryAchievement_Result;      // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryIncrementUnorderedAchievement_Result;  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxCountForAchievement_Result;         // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase");
static_assert(sizeof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase) == 0x0002D8, "Wrong size on ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, EntryPoint) == 0x000000, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded_2) == 0x000008, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable) == 0x000010, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage) == 0x000018, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded_1) == 0x000028, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable_1) == 0x000030, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000038, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable_2) == 0x000050, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsForce_Feedback_Effect) == 0x000058, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsForce_Feedback_Effect' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_GetCurrentMode_Mode) == 0x000078, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable_3) == 0x000178, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsSound_Cue) == 0x000180, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_3) == 0x000188, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000189, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x00018A, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x00018B, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x00018C, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000190, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded_3) == 0x0001A0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable_4) == 0x0001A8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsNiagara_System) == 0x0001C0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_4) == 0x0001C8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue) == 0x0001C9, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001CC, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0001E0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue_1) == 0x0001E8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage_2) == 0x0001F0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_5) == 0x0001F8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_Not_PreBool_ReturnValue) == 0x0001F9, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue_2) == 0x0001FA, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000200, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x000208, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage_3) == 0x000210, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_6) == 0x000218, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue_4) == 0x000219, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x000220, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage_4) == 0x000228, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_7) == 0x000230, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x000238, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsAnim_Montage_5) == 0x000240, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsAnim_Montage_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_8) == 0x000248, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValidSoftObjectReference_ReturnValue_5) == 0x000249, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValidSoftObjectReference_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue_3) == 0x00024A, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded_4) == 0x000250, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x000258, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_GetOwnerCharacter_Character) == 0x000268, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_GetGameInstance_ReturnValue) == 0x000270, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue_4) == 0x000278, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsGI_Single_Player) == 0x000280, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_9) == 0x000288, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_TryCompleteBinaryAchievement_Result) == 0x000289, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_TryCompleteBinaryAchievement_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_GetObjectClass_ReturnValue) == 0x000290, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, Temp_object_Variable_5) == 0x000298, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_TryIncrementUnorderedAchievement_Result) == 0x0002A0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_TryIncrementUnorderedAchievement_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_AsSound_Cue_1) == 0x0002A8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_AsSound_Cue_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_DynamicCast_bSuccess_10) == 0x0002B0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_NotEqual_NameName_ReturnValue) == 0x0002B1, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_GetMaxCountForAchievement_Result) == 0x0002B4, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_GetMaxCountForAchievement_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_Greater_IntInt_ReturnValue) == 0x0002B8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, CallFunc_IsValid_ReturnValue_5) == 0x0002B9, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CustomEvent_Loaded_5) == 0x0002C0, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002C8, "Member 'ITEM_WeaponBase_C_ExecuteUbergraph_ITEM_WeaponBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_FC9CDFFA4B8E6327F9A536B33F5E5C08::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_F95A27484EEBCA2C60555B9F4C909E23
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_F95A27484EEBCA2C60555B9F4C909E23::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_982DF01C4672B4DF3610A791CBB18814
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_982DF01C4672B4DF3610A791CBB18814::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_E731026D4682628E706B3E9E5E5543CE
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_E731026D4682628E706B3E9E5E5543CE::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_FFC92A4B49A40804BC72D8BA13D15C00::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.OnLoaded_78FD906845BE6D6089755093C72A442C
// 0x0008 (0x0008 - 0x0000)
struct ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C");
static_assert(sizeof(ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C) == 0x000008, "Wrong size on ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C");
static_assert(offsetof(ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C, Loaded) == 0x000000, "Member 'ITEM_WeaponBase_C_OnLoaded_78FD906845BE6D6089755093C72A442C::Loaded' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.SetEquipSlotActive
// 0x0028 (0x0028 - 0x0000)
struct ITEM_WeaponBase_C_SetEquipSlotActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBag_Result_1;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetEquipSlotActive_Result;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_Result_1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ForceEquipItemInSlot_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_SetEquipSlotActive) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_SetEquipSlotActive");
static_assert(sizeof(ITEM_WeaponBase_C_SetEquipSlotActive) == 0x000028, "Wrong size on ITEM_WeaponBase_C_SetEquipSlotActive");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, Active) == 0x000000, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::Active' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_GetSlotIndex_Result) == 0x000004, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_GetBag_Result) == 0x000008, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_GetBag_Result_1) == 0x000010, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_GetBag_Result_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_SetEquipSlotActive_Result) == 0x000018, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_SetEquipSlotActive_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_GetSlotIndex_Result_1) == 0x00001C, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_GetSlotIndex_Result_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_SetEquipSlotActive, CallFunc_ForceEquipItemInSlot_Result) == 0x000020, "Member 'ITEM_WeaponBase_C_SetEquipSlotActive::CallFunc_ForceEquipItemInSlot_Result' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.EnableDamage
// 0x0001 (0x0001 - 0x0000)
struct ITEM_WeaponBase_C_EnableDamage final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_EnableDamage) == 0x000001, "Wrong alignment on ITEM_WeaponBase_C_EnableDamage");
static_assert(sizeof(ITEM_WeaponBase_C_EnableDamage) == 0x000001, "Wrong size on ITEM_WeaponBase_C_EnableDamage");
static_assert(offsetof(ITEM_WeaponBase_C_EnableDamage, Result) == 0x000000, "Member 'ITEM_WeaponBase_C_EnableDamage::Result' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.DisableDamage
// 0x0001 (0x0001 - 0x0000)
struct ITEM_WeaponBase_C_DisableDamage final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_DisableDamage) == 0x000001, "Wrong alignment on ITEM_WeaponBase_C_DisableDamage");
static_assert(sizeof(ITEM_WeaponBase_C_DisableDamage) == 0x000001, "Wrong size on ITEM_WeaponBase_C_DisableDamage");
static_assert(offsetof(ITEM_WeaponBase_C_DisableDamage, Result) == 0x000000, "Member 'ITEM_WeaponBase_C_DisableDamage::Result' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.ReceiveAnimationMessage
// 0x0040 (0x0040 - 0x0000)
struct ITEM_WeaponBase_C_ReceiveAnimationMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisableDamageMessage;                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableDamageMessage;                               // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisableDamage_Result;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EnableDamage_Result;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_ReceiveAnimationMessage) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_ReceiveAnimationMessage");
static_assert(sizeof(ITEM_WeaponBase_C_ReceiveAnimationMessage) == 0x000040, "Wrong size on ITEM_WeaponBase_C_ReceiveAnimationMessage");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, Message) == 0x000000, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::Message' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, Result) == 0x000010, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, DisableDamageMessage) == 0x000018, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::DisableDamageMessage' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, EnableDamageMessage) == 0x000028, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::EnableDamageMessage' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, CallFunc_DisableDamage_Result) == 0x000038, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::CallFunc_DisableDamage_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, CallFunc_EnableDamage_Result) == 0x000039, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::CallFunc_EnableDamage_Result' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00003A, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_ReceiveAnimationMessage, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00003B, "Member 'ITEM_WeaponBase_C_ReceiveAnimationMessage::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function ITEM_WeaponBase.ITEM_WeaponBase_C.EVENT_OnHolsterFinished
// 0x00B8 (0x00B8 - 0x0000)
struct ITEM_WeaponBase_C_EVENT_OnHolsterFinished final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetActionMeshComponent_SkeletalMeshComponent; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Hacker_C> K2Node_DynamicCast_AsINTERF_ANIM_Hacker;           // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOverrideIdleSequence_Result;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetActionMeshComponent_SkeletalMeshComponent_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayMesh_Result;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Hacker_C> K2Node_DynamicCast_AsINTERF_ANIM_Hacker_1;         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEquippedItem_Result;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished) == 0x000008, "Wrong alignment on ITEM_WeaponBase_C_EVENT_OnHolsterFinished");
static_assert(sizeof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished) == 0x0000B8, "Wrong size on ITEM_WeaponBase_C_EVENT_OnHolsterFinished");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, Character) == 0x000000, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::Character' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_GetInventory_Inventory) == 0x000008, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000018, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000030, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, Temp_bool_Variable) == 0x000039, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00003A, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_Select_Default) == 0x000040, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_GetActionMeshComponent_SkeletalMeshComponent) == 0x000050, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_GetActionMeshComponent_SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000058, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_AsINTERF_ANIM_Hacker) == 0x000070, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_AsINTERF_ANIM_Hacker' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ITEM_WeaponBase_C_EVENT_OnHolsterFinished, CallFunc_SetOverrideIdleSequence_Result) == 0x000081, "Member 'ITEM_WeaponBase_C_EVENT_OnHolsterFinished::CallFunc_SetOverrideIdleSequence_Result' has a wrong offset!");
