#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_ConsumableBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ITEM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ITEM_ConsumableBase.ITEM_ConsumableBase_C
// 0x00E0 (0x01E0 - 0x0100)
class UITEM_ConsumableBase_C : public UITEM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UAnimMontage>            ActivateMontage;                                   // 0x0108(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 HandheldClass;                                     // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DisplayMeshMaterial;                               // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           DisplayMesh;                                       // 0x0140(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DisplayAnimClass;                                  // 0x0168(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ConsumeMessage;                                    // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ConsumableSound;                                   // 0x01A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsHolsteringToUse;                                 // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CachedActivateMontage;                             // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CachedDisplayMesh;                                 // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ITEM_ConsumableBase(int32 EntryPoint);
	void StreamConsumableAssets();
	void PlayConsumableSound(class APAWN_SystemShockCharacter_C* Character);
	void OnLoaded_49D782F144B7FE27127973B496EEE974(class UObject* Loaded);
	void OnLoaded_6C2C606447223CF60BBDA7BAA36FED84(class UObject* Loaded);
	void OnLoaded_40F0C26F43F6BC4415500EBC5D7F5FD7(class UObject* Loaded);
	void UseConsumable(class APAWN_SystemShockCharacter_C* Character, class UITEM_ConsumableBase_C** ConsumedItem);
	void RemoveConsumableFromInventory(class UITEM_ConsumableBase_C** RemovedItem);
	void ShouldShowDetailedEffects(bool* Result);
	void GetEffects(class FText* EffectsText);
	void GetSideEffects(class FText* SideEffectsText);
	void GetDuration(class FText* DurationText);
	void TryPlayActivateMontage(class APAWN_SystemShockCharacter_C* Character, bool* Success);
	void PlayActivateMontage();
	void ChangeDisplayMesh();
	void CanPlayActivateMontage(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void GetActivateMontage(class UAnimMontage** Montage);
	void GetDisplayMesh(class USkeletalMesh** SkeletalMesh);
	void EVENT_OnActivatedConsumable();
	void TryUseHandheldItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void GetHandheldItem(class UCOMP_Inventory_C* SpecificInventory, class UITEM_HandheldConsumable_Base_C** HandheldItem);
	void GetOrCreateHandheldItem(class UCOMP_Inventory_C* SpecificInventory, class UITEM_HandheldConsumable_Base_C** HandheldItem);
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void GetDisplayProperties(class USkeletalMesh** SkeletalMesh, class UClass** AnimInstanceClass, class UMaterialInterface** OverrideMaterial);
	void OnInventoryChanged(class UCOMP_Inventory_C* PrevInventory, bool* Result);
	void CanUnslot(bool* Result);
	void Activate(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void GetInventoryItemDetailsClass(class UClass** InventoryItemDetailsWidget);
	void GetHotbarSlottableObject(bool* Valid, TScriptInterface<class IINTERF_HotbarSlottable_C>* SlottableObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ITEM_ConsumableBase_C">();
	}
	static class UITEM_ConsumableBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UITEM_ConsumableBase_C>();
	}
};
static_assert(alignof(UITEM_ConsumableBase_C) == 0x000008, "Wrong alignment on UITEM_ConsumableBase_C");
static_assert(sizeof(UITEM_ConsumableBase_C) == 0x0001E0, "Wrong size on UITEM_ConsumableBase_C");
static_assert(offsetof(UITEM_ConsumableBase_C, UberGraphFrame) == 0x000100, "Member 'UITEM_ConsumableBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, ActivateMontage) == 0x000108, "Member 'UITEM_ConsumableBase_C::ActivateMontage' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, HandheldClass) == 0x000130, "Member 'UITEM_ConsumableBase_C::HandheldClass' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, DisplayMeshMaterial) == 0x000138, "Member 'UITEM_ConsumableBase_C::DisplayMeshMaterial' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, DisplayMesh) == 0x000140, "Member 'UITEM_ConsumableBase_C::DisplayMesh' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, DisplayAnimClass) == 0x000168, "Member 'UITEM_ConsumableBase_C::DisplayAnimClass' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, ConsumeMessage) == 0x000190, "Member 'UITEM_ConsumableBase_C::ConsumeMessage' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, ConsumableSound) == 0x0001A0, "Member 'UITEM_ConsumableBase_C::ConsumableSound' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, IsHolsteringToUse) == 0x0001C8, "Member 'UITEM_ConsumableBase_C::IsHolsteringToUse' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, CachedActivateMontage) == 0x0001D0, "Member 'UITEM_ConsumableBase_C::CachedActivateMontage' has a wrong offset!");
static_assert(offsetof(UITEM_ConsumableBase_C, CachedDisplayMesh) == 0x0001D8, "Member 'UITEM_ConsumableBase_C::CachedDisplayMesh' has a wrong offset!");

}

