#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_CyberWeapon_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function ITEM_CyberWeapon_Base.ITEM_CyberWeapon_Base_C.EVENT_FireProjectile
// 0x0018 (0x0018 - 0x0000)
struct ITEM_CyberWeapon_Base_C_EVENT_FireProjectile final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       PlayerCam;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_CyberWeapon_Base_C_EVENT_FireProjectile) == 0x000008, "Wrong alignment on ITEM_CyberWeapon_Base_C_EVENT_FireProjectile");
static_assert(sizeof(ITEM_CyberWeapon_Base_C_EVENT_FireProjectile) == 0x000018, "Wrong size on ITEM_CyberWeapon_Base_C_EVENT_FireProjectile");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_EVENT_FireProjectile, SpawnLocation) == 0x000000, "Member 'ITEM_CyberWeapon_Base_C_EVENT_FireProjectile::SpawnLocation' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_EVENT_FireProjectile, PlayerCam) == 0x000010, "Member 'ITEM_CyberWeapon_Base_C_EVENT_FireProjectile::PlayerCam' has a wrong offset!");

// Function ITEM_CyberWeapon_Base.ITEM_CyberWeapon_Base_C.SpawnProjectile
// 0x0180 (0x0180 - 0x0000)
struct ITEM_CyberWeapon_Base_C_SpawnProjectile final
{
public:
	struct FVector                                LocalOffset;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Projectile;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APROJECTILE_Cyberspace_Base_C*          ProjectileActor;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation;                                     // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         Avatar;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAttribModApplyData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAvatarVelocity_Velocity;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APROJECTILE_Cyberspace_Base_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_CyberWeapon_Base_C_SpawnProjectile) == 0x000010, "Wrong alignment on ITEM_CyberWeapon_Base_C_SpawnProjectile");
static_assert(sizeof(ITEM_CyberWeapon_Base_C_SpawnProjectile) == 0x000180, "Wrong size on ITEM_CyberWeapon_Base_C_SpawnProjectile");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, LocalOffset) == 0x000000, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::LocalOffset' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, Projectile) == 0x000010, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::Projectile' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, ProjectileActor) == 0x000018, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::ProjectileActor' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, Offset) == 0x000020, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::Offset' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, SpawnLocation) == 0x00002C, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::SpawnLocation' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, Avatar) == 0x000038, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::Avatar' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, Temp_bool_Variable) == 0x000040, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000044, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000050, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00005C, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetForwardVector_ReturnValue_1) == 0x000074, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, K2Node_MakeArray_Array) == 0x000080, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000090, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetInventory_Inventory) == 0x000098, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, K2Node_DynamicCast_AsPAWN_Avatar) == 0x0000A8, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetAvatarVelocity_Velocity) == 0x0000B4, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetAvatarVelocity_Velocity' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000C0, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C4, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, K2Node_Select_Default) == 0x0000C8, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_VSize_ReturnValue) == 0x0000CC, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Normal_ReturnValue) == 0x0000D0, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000DC, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E8, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_ComposeRotators_ReturnValue) == 0x0000F4, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_GetForwardVector_ReturnValue_2) == 0x000130, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000140, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000148, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000160, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_SpawnProjectile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00016C, "Member 'ITEM_CyberWeapon_Base_C_SpawnProjectile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function ITEM_CyberWeapon_Base.ITEM_CyberWeapon_Base_C.NotifyThreatenedEnemy
// 0x0170 (0x0170 - 0x0000)
struct ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy final
{
public:
	class APAWN_Avatar_C*                         Avatar;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy) == 0x000008, "Wrong alignment on ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy");
static_assert(sizeof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy) == 0x000170, "Wrong size on ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, Avatar) == 0x000000, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::Avatar' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, Camera) == 0x000008, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::Camera' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, K2Node_MakeArray_Array) == 0x000010, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00002C, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_Add_VectorVector_ReturnValue) == 0x000044, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_SphereTraceSingle_OutHit) == 0x000050, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_SphereTraceSingle_ReturnValue) == 0x0000D8, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D9, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000DA, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_Time) == 0x0000DC, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_Distance) == 0x0000E0, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_Location) == 0x0000E4, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_ImpactPoint) == 0x0000F0, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_Normal) == 0x0000FC, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_ImpactNormal) == 0x000108, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_PhysMat) == 0x000118, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_HitActor) == 0x000120, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_HitComponent) == 0x000128, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_HitBoneName) == 0x000130, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_HitItem) == 0x000138, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_ElementIndex) == 0x00013C, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_FaceIndex) == 0x000140, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_TraceStart) == 0x000144, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, CallFunc_BreakHitResult_TraceEnd) == 0x000150, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000160, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'ITEM_CyberWeapon_Base_C_NotifyThreatenedEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ITEM_CyberWeapon_Base.ITEM_CyberWeapon_Base_C.GetIsActivated
// 0x0001 (0x0001 - 0x0000)
struct ITEM_CyberWeapon_Base_C_GetIsActivated final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_CyberWeapon_Base_C_GetIsActivated) == 0x000001, "Wrong alignment on ITEM_CyberWeapon_Base_C_GetIsActivated");
static_assert(sizeof(ITEM_CyberWeapon_Base_C_GetIsActivated) == 0x000001, "Wrong size on ITEM_CyberWeapon_Base_C_GetIsActivated");
static_assert(offsetof(ITEM_CyberWeapon_Base_C_GetIsActivated, Result) == 0x000000, "Member 'ITEM_CyberWeapon_Base_C_GetIsActivated::Result' has a wrong offset!");

}

