#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_JunkFood_Base

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "ITEM_Junk_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ITEM_JunkFood_Base.ITEM_JunkFood_Base_C
// 0x0140 (0x02A0 - 0x0160)
class UITEM_JunkFood_Base_C : public UITEM_Junk_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ConsumedItemClass;                                 // 0x0160(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FAttribModApplyData                    ConsumeApplyData;                                  // 0x0188(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    AchievementHandle;                                 // 0x0228(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   Flavor;                                            // 0x0238(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Manufacturer;                                      // 0x0250(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Calories;                                          // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ServingSize;                                       // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Nutrition;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               ConsumeCue;                                        // 0x0278(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ConsumeJunkFood(class APAWN_SystemShockCharacter_C* Character);
	void PlayConsumeSFX(class APAWN_SystemShockCharacter_C* Character);
	void Activate(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void GetInventoryItemDetailsClass(class UClass** InventoryItemDetailsWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ITEM_JunkFood_Base_C">();
	}
	static class UITEM_JunkFood_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UITEM_JunkFood_Base_C>();
	}
};
static_assert(alignof(UITEM_JunkFood_Base_C) == 0x000008, "Wrong alignment on UITEM_JunkFood_Base_C");
static_assert(sizeof(UITEM_JunkFood_Base_C) == 0x0002A0, "Wrong size on UITEM_JunkFood_Base_C");
static_assert(offsetof(UITEM_JunkFood_Base_C, ConsumedItemClass) == 0x000160, "Member 'UITEM_JunkFood_Base_C::ConsumedItemClass' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, ConsumeApplyData) == 0x000188, "Member 'UITEM_JunkFood_Base_C::ConsumeApplyData' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, AchievementHandle) == 0x000228, "Member 'UITEM_JunkFood_Base_C::AchievementHandle' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, Flavor) == 0x000238, "Member 'UITEM_JunkFood_Base_C::Flavor' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, Manufacturer) == 0x000250, "Member 'UITEM_JunkFood_Base_C::Manufacturer' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, Calories) == 0x000268, "Member 'UITEM_JunkFood_Base_C::Calories' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, ServingSize) == 0x00026C, "Member 'UITEM_JunkFood_Base_C::ServingSize' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, Nutrition) == 0x000270, "Member 'UITEM_JunkFood_Base_C::Nutrition' has a wrong offset!");
static_assert(offsetof(UITEM_JunkFood_Base_C, ConsumeCue) == 0x000278, "Member 'UITEM_JunkFood_Base_C::ConsumeCue' has a wrong offset!");

}

