#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_ProjectileWeapon_Base

#include "Basic.hpp"

#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_ActionPriority_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"


namespace SDK::Params
{

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.ExecuteUbergraph_ITEM_ProjectileWeapon_Base
// 0x0128 (0x0128 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_4;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_5;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base) == 0x000128, "Wrong size on ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, EntryPoint) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded_5) == 0x000028, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable) == 0x000040, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage) == 0x000048, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded_4) == 0x000058, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable_1) == 0x000060, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000068, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded_3) == 0x000078, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable_2) == 0x000080, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_2) == 0x000088, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded_2) == 0x000098, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable_3) == 0x0000A0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_3) == 0x0000A8, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded_1) == 0x0000B8, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable_4) == 0x0000C0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_4) == 0x0000C8, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_4' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CustomEvent_Loaded) == 0x0000D8, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, Temp_object_Variable_5) == 0x0000E0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_5) == 0x0000E8, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_5' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F4, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000104, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000114, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000124, "Member 'ITEM_ProjectileWeapon_Base_C_ExecuteUbergraph_ITEM_ProjectileWeapon_Base::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_9046651747D724C56C1F3FB472BA2644
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_9046651747D724C56C1F3FB472BA2644::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_5DAA8C1E43E8A4939EEF1C91476CA4D4::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_2842429F4E6B3880E4FBCCB35F2E69FA::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_690C388B40163C7491D441BA893CD6FC
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_690C388B40163C7491D441BA893CD6FC::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_36493C924805267668187694115D493B
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_36493C924805267668187694115D493B::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnLoaded_3960340748179C183102AEBC17F001F3
// 0x0008 (0x0008 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3) == 0x000008, "Wrong size on ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3, Loaded) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_OnLoaded_3960340748179C183102AEBC17F001F3::Loaded' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.ForceActivateWithPriority
// 0x0188 (0x0188 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority final
{
public:
	ENUM_ActionPriority                           Priority;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         QueueDuration;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ActionManager_C*                  ActionManager;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FLatentEventHandle                     CallFunc_CreateEventHandle_ReturnValue;            // 0x0020(0x0010)(ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetDischargeMontage_DischargeAnimation;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0048(0x0100)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAmmoInMagazineOrChamber_Result;        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeginAction_Result;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority) == 0x000188, "Wrong size on ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, Priority) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::Priority' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, QueueDuration) == 0x000004, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::QueueDuration' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, ActionManager) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::ActionManager' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_CreateEventHandle_ReturnValue) == 0x000020, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_CreateEventHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, Temp_int_Variable) == 0x000030, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_GetDischargeMontage_DischargeAnimation) == 0x000038, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_GetDischargeMontage_DischargeAnimation' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, Temp_bool_Variable) == 0x000040, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_GetCurrentMode_Mode) == 0x000048, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000148, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_ForceBeginAction_Action) == 0x000150, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, K2Node_Select_Default) == 0x00015C, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_HasAmmoInMagazineOrChamber_Result) == 0x000160, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_HasAmmoInMagazineOrChamber_Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_CanBeginAction_Result) == 0x000161, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_CanBeginAction_Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_GetInventory_Inventory) == 0x000168, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, CallFunc_GetOwner_ReturnValue) == 0x000170, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000178, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'ITEM_ProjectileWeapon_Base_C_ForceActivateWithPriority::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.ConsumeAmmo
// 0x0028 (0x0028 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_ConsumeAmmo final
{
public:
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_ConsumeAmmo");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo) == 0x000028, "Wrong size on ITEM_ProjectileWeapon_Base_C_ConsumeAmmo");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, CallFunc_GetInventory_Inventory) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000010, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ConsumeAmmo, CallFunc_Max_ReturnValue) == 0x000020, "Member 'ITEM_ProjectileWeapon_Base_C_ConsumeAmmo::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.GetAdditionalMods
// 0x0010 (0x0010 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_GetAdditionalMods final
{
public:
	TArray<struct FAttribModApplyData>            Result;                                            // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_GetAdditionalMods) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_GetAdditionalMods");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_GetAdditionalMods) == 0x000010, "Wrong size on ITEM_ProjectileWeapon_Base_C_GetAdditionalMods");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAdditionalMods, Result) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_GetAdditionalMods::Result' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.HasAmmoInMagazineOrChamber
// 0x000C (0x000C - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoInMagazineAndChamber_Ammo;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber) == 0x000004, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber) == 0x00000C, "Wrong size on ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber, Result) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber::Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber, CallFunc_GetAmmoInMagazineAndChamber_Ammo) == 0x000004, "Member 'ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber::CallFunc_GetAmmoInMagazineAndChamber_Ammo' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_HasAmmoInMagazineOrChamber::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.GetAmmoInMagazineAndChamber
// 0x0010 (0x0010 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber final
{
public:
	int32                                         Ammo;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoInChamber_Ammo;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoInMagazine_Ammo;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber) == 0x000004, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber) == 0x000010, "Wrong size on ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber, Ammo) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber::Ammo' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber, CallFunc_GetAmmoInChamber_Ammo) == 0x000004, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber::CallFunc_GetAmmoInChamber_Ammo' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber, CallFunc_GetAmmoInMagazine_Ammo) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber::CallFunc_GetAmmoInMagazine_Ammo' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazineAndChamber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.CanEmptyAmmoInMagazineOrChamber
// 0x0002 (0x0002 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAmmoInMagazineOrChamber_Result;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber) == 0x000001, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber) == 0x000002, "Wrong size on ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber, Result) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber::Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber, CallFunc_HasAmmoInMagazineOrChamber_Result) == 0x000001, "Member 'ITEM_ProjectileWeapon_Base_C_CanEmptyAmmoInMagazineOrChamber::CallFunc_HasAmmoInMagazineOrChamber_Result' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.HasLowAmmoInMagazineAndChamber
// 0x0120 (0x0120 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0008(0x0100)(HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoInMagazineAndChamber_Ammo;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber) == 0x000120, "Wrong size on ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, Result) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_GetCurrentMode_Mode) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_GetAmmoInMagazineAndChamber_Ammo) == 0x000108, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_GetAmmoInMagazineAndChamber_Ammo' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_GetWeaponPropertyValueByType_Value) == 0x00010C, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000110, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000114, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000118, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00011C, "Member 'ITEM_ProjectileWeapon_Base_C_HasLowAmmoInMagazineAndChamber::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.GetAmmoInMagazine
// 0x0004 (0x0004 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine final
{
public:
	int32                                         Ammo;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine) == 0x000004, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine) == 0x000004, "Wrong size on ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine, Ammo) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInMagazine::Ammo' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.GetAmmoInChamber
// 0x0004 (0x0004 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber final
{
public:
	int32                                         Ammo;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber) == 0x000004, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber) == 0x000004, "Wrong size on ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber, Ammo) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_GetAmmoInChamber::Ammo' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.GetSpreadHalfAngle
// 0x0020 (0x0020 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentSpreadAngle_Result;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle) == 0x000020, "Wrong size on ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle, Result) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle::Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000010, "Member 'ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle, CallFunc_GetCurrentSpreadAngle_Result) == 0x00001C, "Member 'ITEM_ProjectileWeapon_Base_C_GetSpreadHalfAngle::CallFunc_GetCurrentSpreadAngle_Result' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.ComputeSpreadDirection
// 0x0028 (0x0028 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection final
{
public:
	struct FVector                                BarrelDirection;                                   // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpreadDirection;                                   // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSpreadHalfAngle_Result;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRandomWeaponSpreadDirection_SpreadDirection; // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection) == 0x000004, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection) == 0x000028, "Wrong size on ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection, BarrelDirection) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection::BarrelDirection' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection, SpreadDirection) == 0x00000C, "Member 'ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection::SpreadDirection' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection, CallFunc_GetSpreadHalfAngle_Result) == 0x000018, "Member 'ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection::CallFunc_GetSpreadHalfAngle_Result' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection, CallFunc_GetRandomWeaponSpreadDirection_SpreadDirection) == 0x00001C, "Member 'ITEM_ProjectileWeapon_Base_C_ComputeSpreadDirection::CallFunc_GetRandomWeaponSpreadDirection_SpreadDirection' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.QueueReloading
// 0x0038 (0x0038 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_QueueReloading final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_ProjectileWeapon_Base_C_QueueReloading) == 0x000008, "Wrong alignment on ITEM_ProjectileWeapon_Base_C_QueueReloading");
static_assert(sizeof(ITEM_ProjectileWeapon_Base_C_QueueReloading) == 0x000038, "Wrong size on ITEM_ProjectileWeapon_Base_C_QueueReloading");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, Temp_bool_Variable) == 0x000000, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, CallFunc_GetInventory_Inventory) == 0x000008, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000020, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_ProjectileWeapon_Base_C_QueueReloading, K2Node_Select_Default) == 0x000030, "Member 'ITEM_ProjectileWeapon_Base_C_QueueReloading::K2Node_Select_Default' has a wrong offset!");

// Function ITEM_ProjectileWeapon_Base.ITEM_ProjectileWeapon_Base_C.OnDischargeMontageStarted
// 0x0478 (0x0478 - 0x0000)
struct ITEM_ProjectileWeapon_Base_C_OnDischargeMontageStarted final
{
public:
	float                                         RefireRate;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireRate;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRefire;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0010(0x0100)(HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
