#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_GameCartridge_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function ITEM_GameCartridge_Base.ITEM_GameCartridge_Base_C.ExecuteUbergraph_ITEM_GameCartridge_Base
// 0x0038 (0x0038 - 0x0000)
struct ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryIncrementUnorderedAchievement_Result;  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base) == 0x000008, "Wrong alignment on ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base");
static_assert(sizeof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base) == 0x000038, "Wrong size on ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, EntryPoint) == 0x000000, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, CallFunc_GetOwnerCharacter_Character) == 0x000010, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base, CallFunc_TryIncrementUnorderedAchievement_Result) == 0x000031, "Member 'ITEM_GameCartridge_Base_C_ExecuteUbergraph_ITEM_GameCartridge_Base::CallFunc_TryIncrementUnorderedAchievement_Result' has a wrong offset!");

}

