#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_Software_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function ITEM_Software_Base.ITEM_Software_Base_C.HasCooldown
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Software_Base_C_HasCooldown final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Software_Base_C_HasCooldown) == 0x000001, "Wrong alignment on ITEM_Software_Base_C_HasCooldown");
static_assert(sizeof(ITEM_Software_Base_C_HasCooldown) == 0x000001, "Wrong size on ITEM_Software_Base_C_HasCooldown");
static_assert(offsetof(ITEM_Software_Base_C_HasCooldown, Result) == 0x000000, "Member 'ITEM_Software_Base_C_HasCooldown::Result' has a wrong offset!");

// Function ITEM_Software_Base.ITEM_Software_Base_C.GetCooldownRatio
// 0x0004 (0x0004 - 0x0000)
struct ITEM_Software_Base_C_GetCooldownRatio final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Software_Base_C_GetCooldownRatio) == 0x000004, "Wrong alignment on ITEM_Software_Base_C_GetCooldownRatio");
static_assert(sizeof(ITEM_Software_Base_C_GetCooldownRatio) == 0x000004, "Wrong size on ITEM_Software_Base_C_GetCooldownRatio");
static_assert(offsetof(ITEM_Software_Base_C_GetCooldownRatio, Result) == 0x000000, "Member 'ITEM_Software_Base_C_GetCooldownRatio::Result' has a wrong offset!");

}

