#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_MediaBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_MediaType_structs.hpp"
#include "ITEM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ITEM_MediaBase.ITEM_MediaBase_C
// 0x0098 (0x0198 - 0x0100)
class UITEM_MediaBase_C : public UITEM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class USkeletalMesh>           DisplayMesh;                                       // 0x0108(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AnimBP;                                            // 0x0130(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasBeenViewed;                                     // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FinishDownloadMessage;                             // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	ENUM_MediaType                                MediaType;                                         // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    MediaDataHandle;                                   // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CollectMediaAchievementHandle;                     // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ITEM_MediaBase(int32 EntryPoint);
	void GetOverrideMaterial(class UMaterialInstanceDynamic** Material);
	void PlayMedia(bool* Result);
	void ReceiveMediaAnimationMessage(const class FString& Message, bool* Result);
	void OnFinishedDownloadingMedia();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void GetDisplayProperties(class USkeletalMesh** SkeletalMesh, class UClass** AnimInstanceClass, class UMaterialInterface** OverrideMaterial);
	void OnAddedToInventory();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ITEM_MediaBase_C">();
	}
	static class UITEM_MediaBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UITEM_MediaBase_C>();
	}
};
static_assert(alignof(UITEM_MediaBase_C) == 0x000008, "Wrong alignment on UITEM_MediaBase_C");
static_assert(sizeof(UITEM_MediaBase_C) == 0x000198, "Wrong size on UITEM_MediaBase_C");
static_assert(offsetof(UITEM_MediaBase_C, UberGraphFrame) == 0x000100, "Member 'UITEM_MediaBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, DisplayMesh) == 0x000108, "Member 'UITEM_MediaBase_C::DisplayMesh' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, AnimBP) == 0x000130, "Member 'UITEM_MediaBase_C::AnimBP' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, HasBeenViewed) == 0x000158, "Member 'UITEM_MediaBase_C::HasBeenViewed' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, FinishDownloadMessage) == 0x000160, "Member 'UITEM_MediaBase_C::FinishDownloadMessage' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, MediaType) == 0x000170, "Member 'UITEM_MediaBase_C::MediaType' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, MediaDataHandle) == 0x000178, "Member 'UITEM_MediaBase_C::MediaDataHandle' has a wrong offset!");
static_assert(offsetof(UITEM_MediaBase_C, CollectMediaAchievementHandle) == 0x000188, "Member 'UITEM_MediaBase_C::CollectMediaAchievementHandle' has a wrong offset!");

}

