#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_QuadDamage

#include "Basic.hpp"


namespace SDK::Params
{

// Function ITEM_QuadDamage.ITEM_QuadDamage_C.Activate
// 0x0020 (0x0020 - 0x0000)
struct ITEM_QuadDamage_C_Activate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_QuadDamage_C_Activate) == 0x000008, "Wrong alignment on ITEM_QuadDamage_C_Activate");
static_assert(sizeof(ITEM_QuadDamage_C_Activate) == 0x000020, "Wrong size on ITEM_QuadDamage_C_Activate");
static_assert(offsetof(ITEM_QuadDamage_C_Activate, Character) == 0x000000, "Member 'ITEM_QuadDamage_C_Activate::Character' has a wrong offset!");
static_assert(offsetof(ITEM_QuadDamage_C_Activate, Result) == 0x000008, "Member 'ITEM_QuadDamage_C_Activate::Result' has a wrong offset!");
static_assert(offsetof(ITEM_QuadDamage_C_Activate, K2Node_DynamicCast_AsPAWN_Avatar) == 0x000010, "Member 'ITEM_QuadDamage_C_Activate::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(ITEM_QuadDamage_C_Activate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ITEM_QuadDamage_C_Activate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

