#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_BatteryPack

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.UseConsumable
// 0x0028 (0x0028 - 0x0000)
struct ITEM_BatteryPack_C_UseConsumable final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ConsumableBase_C*                 ConsumedItem;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AttribManager_C*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ConsumableBase_C*                 CallFunc_UseConsumable_ConsumedItem;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_BatteryPack_C_UseConsumable) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_UseConsumable");
static_assert(sizeof(ITEM_BatteryPack_C_UseConsumable) == 0x000028, "Wrong size on ITEM_BatteryPack_C_UseConsumable");
static_assert(offsetof(ITEM_BatteryPack_C_UseConsumable, Character) == 0x000000, "Member 'ITEM_BatteryPack_C_UseConsumable::Character' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_UseConsumable, ConsumedItem) == 0x000008, "Member 'ITEM_BatteryPack_C_UseConsumable::ConsumedItem' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_UseConsumable, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'ITEM_BatteryPack_C_UseConsumable::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_UseConsumable, CallFunc_UseConsumable_ConsumedItem) == 0x000018, "Member 'ITEM_BatteryPack_C_UseConsumable::CallFunc_UseConsumable_ConsumedItem' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_UseConsumable, CallFunc_ApplyMod_ReturnValue) == 0x000020, "Member 'ITEM_BatteryPack_C_UseConsumable::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetEffects
// 0x01C0 (0x01C0 - 0x0000)
struct ITEM_BatteryPack_C_GetEffects final
{
public:
	class FText                                   EffectsText;                                       // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   RestoreText;                                       // 0x0018(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0038(0x0018)()
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowDetailedEffects_Result;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0018)()
	class FText                                   CallFunc_TextToLower_ReturnValue;                  // 0x0140(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A8(0x0018)()
};
static_assert(alignof(ITEM_BatteryPack_C_GetEffects) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_GetEffects");
static_assert(sizeof(ITEM_BatteryPack_C_GetEffects) == 0x0001C0, "Wrong size on ITEM_BatteryPack_C_GetEffects");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, EffectsText) == 0x000000, "Member 'ITEM_BatteryPack_C_GetEffects::EffectsText' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, RestoreText) == 0x000018, "Member 'ITEM_BatteryPack_C_GetEffects::RestoreText' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, Temp_bool_Variable) == 0x000030, "Member 'ITEM_BatteryPack_C_GetEffects::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, Temp_text_Variable) == 0x000038, "Member 'ITEM_BatteryPack_C_GetEffects::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000058, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_GetAttribValue_ReturnValue) == 0x000064, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_ShouldShowDetailedEffects_Result) == 0x0000B4, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_ShouldShowDetailedEffects_Result' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_Round_ReturnValue) == 0x0000B8, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_MakeArray_Array) == 0x000100, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_Format_ReturnValue) == 0x000110, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_Select_Default) == 0x000128, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_TextToLower_ReturnValue) == 0x000140, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_TextToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, K2Node_MakeArray_Array_1) == 0x000198, "Member 'ITEM_BatteryPack_C_GetEffects::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetEffects, CallFunc_Format_ReturnValue_1) == 0x0001A8, "Member 'ITEM_BatteryPack_C_GetEffects::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetOwner
// 0x0010 (0x0010 - 0x0000)
struct ITEM_BatteryPack_C_GetOwner final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_Actor;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_BatteryPack_C_GetOwner) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_GetOwner");
static_assert(sizeof(ITEM_BatteryPack_C_GetOwner) == 0x000010, "Wrong size on ITEM_BatteryPack_C_GetOwner");
static_assert(offsetof(ITEM_BatteryPack_C_GetOwner, Owner) == 0x000000, "Member 'ITEM_BatteryPack_C_GetOwner::Owner' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetOwner, CallFunc_GetOwnerActor_Actor) == 0x000008, "Member 'ITEM_BatteryPack_C_GetOwner::CallFunc_GetOwnerActor_Actor' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetEquipState
// 0x0001 (0x0001 - 0x0000)
struct ITEM_BatteryPack_C_GetEquipState final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_BatteryPack_C_GetEquipState) == 0x000001, "Wrong alignment on ITEM_BatteryPack_C_GetEquipState");
static_assert(sizeof(ITEM_BatteryPack_C_GetEquipState) == 0x000001, "Wrong size on ITEM_BatteryPack_C_GetEquipState");
static_assert(offsetof(ITEM_BatteryPack_C_GetEquipState, Result) == 0x000000, "Member 'ITEM_BatteryPack_C_GetEquipState::Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetHotbarDisplayName
// 0x0018 (0x0018 - 0x0000)
struct ITEM_BatteryPack_C_GetHotbarDisplayName final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(ITEM_BatteryPack_C_GetHotbarDisplayName) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_GetHotbarDisplayName");
static_assert(sizeof(ITEM_BatteryPack_C_GetHotbarDisplayName) == 0x000018, "Wrong size on ITEM_BatteryPack_C_GetHotbarDisplayName");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarDisplayName, Result) == 0x000000, "Member 'ITEM_BatteryPack_C_GetHotbarDisplayName::Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetHotbarCount
// 0x0008 (0x0008 - 0x0000)
struct ITEM_BatteryPack_C_GetHotbarCount final
{
public:
	int32                                         ResultCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Result;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_BatteryPack_C_GetHotbarCount) == 0x000004, "Wrong alignment on ITEM_BatteryPack_C_GetHotbarCount");
static_assert(sizeof(ITEM_BatteryPack_C_GetHotbarCount) == 0x000008, "Wrong size on ITEM_BatteryPack_C_GetHotbarCount");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarCount, ResultCount) == 0x000000, "Member 'ITEM_BatteryPack_C_GetHotbarCount::ResultCount' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarCount, CallFunc_GetCount_Result) == 0x000004, "Member 'ITEM_BatteryPack_C_GetHotbarCount::CallFunc_GetCount_Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.GetHotbarIcon
// 0x0028 (0x0028 - 0x0000)
struct ITEM_BatteryPack_C_GetHotbarIcon final
{
public:
	class UTexture*                               ResultIcon;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetItemHotbarRenderTarget_Result;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_BatteryPack_C_GetHotbarIcon) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_GetHotbarIcon");
static_assert(sizeof(ITEM_BatteryPack_C_GetHotbarIcon) == 0x000028, "Wrong size on ITEM_BatteryPack_C_GetHotbarIcon");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarIcon, ResultIcon) == 0x000000, "Member 'ITEM_BatteryPack_C_GetHotbarIcon::ResultIcon' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarIcon, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'ITEM_BatteryPack_C_GetHotbarIcon::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarIcon, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'ITEM_BatteryPack_C_GetHotbarIcon::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarIcon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ITEM_BatteryPack_C_GetHotbarIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_GetHotbarIcon, CallFunc_GetItemHotbarRenderTarget_Result) == 0x000020, "Member 'ITEM_BatteryPack_C_GetHotbarIcon::CallFunc_GetItemHotbarRenderTarget_Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.DeactivateHotbarSlot
// 0x0001 (0x0001 - 0x0000)
struct ITEM_BatteryPack_C_DeactivateHotbarSlot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_BatteryPack_C_DeactivateHotbarSlot) == 0x000001, "Wrong alignment on ITEM_BatteryPack_C_DeactivateHotbarSlot");
static_assert(sizeof(ITEM_BatteryPack_C_DeactivateHotbarSlot) == 0x000001, "Wrong size on ITEM_BatteryPack_C_DeactivateHotbarSlot");
static_assert(offsetof(ITEM_BatteryPack_C_DeactivateHotbarSlot, Result) == 0x000000, "Member 'ITEM_BatteryPack_C_DeactivateHotbarSlot::Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.ActivateHotbarSlot
// 0x0018 (0x0018 - 0x0000)
struct ITEM_BatteryPack_C_ActivateHotbarSlot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Activate_Result;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_BatteryPack_C_ActivateHotbarSlot) == 0x000008, "Wrong alignment on ITEM_BatteryPack_C_ActivateHotbarSlot");
static_assert(sizeof(ITEM_BatteryPack_C_ActivateHotbarSlot) == 0x000018, "Wrong size on ITEM_BatteryPack_C_ActivateHotbarSlot");
static_assert(offsetof(ITEM_BatteryPack_C_ActivateHotbarSlot, Result) == 0x000000, "Member 'ITEM_BatteryPack_C_ActivateHotbarSlot::Result' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_ActivateHotbarSlot, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'ITEM_BatteryPack_C_ActivateHotbarSlot::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(ITEM_BatteryPack_C_ActivateHotbarSlot, CallFunc_Activate_Result) == 0x000010, "Member 'ITEM_BatteryPack_C_ActivateHotbarSlot::CallFunc_Activate_Result' has a wrong offset!");

// Function ITEM_BatteryPack.ITEM_BatteryPack_C.TryUseConsumable
// 0x0001 (0x0001 - 0x0000)
struct ITEM_BatteryPack_C_TryUseConsumable final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_BatteryPack_C_TryUseConsumable) == 0x000001, "Wrong alignment on ITEM_BatteryPack_C_TryUseConsumable");
static_assert(sizeof(ITEM_BatteryPack_C_TryUseConsumable) == 0x000001, "Wrong size on ITEM_BatteryPack_C_TryUseConsumable");
static_assert(offsetof(ITEM_BatteryPack_C_TryUseConsumable, Result) == 0x000000, "Member 'ITEM_BatteryPack_C_TryUseConsumable::Result' has a wrong offset!");

}

