#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_Plastique

#include "Basic.hpp"


namespace SDK::Params
{

// Function ITEM_Plastique.ITEM_Plastique_C.AddCount
// 0x0018 (0x0018 - 0x0000)
struct ITEM_Plastique_C_AddCount final
{
public:
	int32                                         CountToAdd;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           SourceItem;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultCount;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddCount_ResultCount;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Plastique_C_AddCount) == 0x000008, "Wrong alignment on ITEM_Plastique_C_AddCount");
static_assert(sizeof(ITEM_Plastique_C_AddCount) == 0x000018, "Wrong size on ITEM_Plastique_C_AddCount");
static_assert(offsetof(ITEM_Plastique_C_AddCount, CountToAdd) == 0x000000, "Member 'ITEM_Plastique_C_AddCount::CountToAdd' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_AddCount, SourceItem) == 0x000008, "Member 'ITEM_Plastique_C_AddCount::SourceItem' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_AddCount, ResultCount) == 0x000010, "Member 'ITEM_Plastique_C_AddCount::ResultCount' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_AddCount, CallFunc_AddCount_ResultCount) == 0x000014, "Member 'ITEM_Plastique_C_AddCount::CallFunc_AddCount_ResultCount' has a wrong offset!");

// Function ITEM_Plastique.ITEM_Plastique_C.TryCompletePickupPlastiquesQuest
// 0x00A8 (0x00A8 - 0x0000)
struct ITEM_Plastique_C_TryCompletePickupPlastiquesQuest final
{
public:
	class UInventoryBag_C*                        StoryBag;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SetCompletedStoryQuest_LogString;         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest) == 0x000008, "Wrong alignment on ITEM_Plastique_C_TryCompletePickupPlastiquesQuest");
static_assert(sizeof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest) == 0x0000A8, "Wrong size on ITEM_Plastique_C_TryCompletePickupPlastiquesQuest");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, StoryBag) == 0x000000, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::StoryBag' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, GameInstance) == 0x000008, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::GameInstance' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_SetCompletedStoryQuest_LogString) == 0x000018, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_SetCompletedStoryQuest_LogString' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000030, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetItemCount_Result) == 0x000058, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00005C, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_HasCompletedStoryQuest_Completed) == 0x00005D, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, K2Node_DynamicCast_AsGI_Single_Player) == 0x000070, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetOwnerCharacter_Character) == 0x000080, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000088, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetInventoryComponent_Inventory) == 0x000098, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_TryCompletePickupPlastiquesQuest, CallFunc_GetBagByType_Bag) == 0x0000A0, "Member 'ITEM_Plastique_C_TryCompletePickupPlastiquesQuest::CallFunc_GetBagByType_Bag' has a wrong offset!");

// Function ITEM_Plastique.ITEM_Plastique_C.SetInventoryLocation
// 0x0010 (0x0010 - 0x0000)
struct ITEM_Plastique_C_SetInventoryLocation final
{
public:
	class UInventoryBag_C*                        NewBag;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewSlotIndex;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Plastique_C_SetInventoryLocation) == 0x000008, "Wrong alignment on ITEM_Plastique_C_SetInventoryLocation");
static_assert(sizeof(ITEM_Plastique_C_SetInventoryLocation) == 0x000010, "Wrong size on ITEM_Plastique_C_SetInventoryLocation");
static_assert(offsetof(ITEM_Plastique_C_SetInventoryLocation, NewBag) == 0x000000, "Member 'ITEM_Plastique_C_SetInventoryLocation::NewBag' has a wrong offset!");
static_assert(offsetof(ITEM_Plastique_C_SetInventoryLocation, NewSlotIndex) == 0x000008, "Member 'ITEM_Plastique_C_SetInventoryLocation::NewSlotIndex' has a wrong offset!");

}

