#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_MeleeWeapon_Base

#include "Basic.hpp"

#include "ENUM_Melee_AttackState_structs.hpp"
#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_LeftRightCenter_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"


namespace SDK::Params
{

// Function ITEM_MeleeWeapon_Base.ITEM_MeleeWeapon_Base_C.ExecuteUbergraph_ITEM_MeleeWeapon_Base
// 0x0468 (0x0468 - 0x0000)
struct ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_21;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_20;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_19;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_18;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_17;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_4;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_16;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_5;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_15;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_6;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_14;                      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_7;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_13;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_12;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base_1;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_11;                      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_10;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_8;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_10;                      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_11;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_9;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_12;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_10;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_13;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base_2;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_14;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base_3;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_15;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_11;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_16;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_12;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_17;                           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_13;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_18;                           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_14;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_19;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_15;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_20;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_16;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_21;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_17;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0354(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x0384(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_13;           // 0x0394(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_18;              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_14;           // 0x03C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_15;           // 0x03D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_16;           // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_17;           // 0x03F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_18;           // 0x0404(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_19;           // 0x0414(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_426[0x2];                                      // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_19;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x043B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_20;           // 0x043C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_21;           // 0x0450(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base) == 0x000008, "Wrong alignment on ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base");
static_assert(sizeof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base) == 0x000468, "Wrong size on ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, EntryPoint) == 0x000000, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_21) == 0x000028, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_21' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable) == 0x000040, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage) == 0x000048, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_20) == 0x000058, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_20' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_1) == 0x000060, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000068, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_19) == 0x000078, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_19' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_2) == 0x000080, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_2) == 0x000088, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_18) == 0x000098, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_18' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_3) == 0x0000A0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_3) == 0x0000A8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_17) == 0x0000B8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_17' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_4) == 0x0000C0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_4) == 0x0000C8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_4' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_16) == 0x0000D8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_16' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_5) == 0x0000E0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_5) == 0x0000E8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_5' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_5) == 0x0000F0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_15) == 0x0000F8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_15' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_6) == 0x000100, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_6) == 0x000108, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_6' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_6) == 0x000110, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_14) == 0x000118, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_14' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_7) == 0x000120, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_7) == 0x000128, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_7' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_7) == 0x000130, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_13) == 0x000138, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_13' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_8) == 0x000140, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x000148, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_8) == 0x000150, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_12) == 0x000158, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_12' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_9) == 0x000160, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Sequence_Base_1) == 0x000168, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Sequence_Base_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_9) == 0x000170, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_11) == 0x000178, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_11' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_10) == 0x000180, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_8) == 0x000188, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_8' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_10) == 0x000190, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_10) == 0x000198, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_10' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_11) == 0x0001A0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_9) == 0x0001A8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_9' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_11) == 0x0001B0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_9) == 0x0001B8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_9' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_12) == 0x0001C0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_10) == 0x0001C8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_10' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_12) == 0x0001D0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_8) == 0x0001D8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_13) == 0x0001E0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Sequence_Base_2) == 0x0001E8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Sequence_Base_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_13) == 0x0001F0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_7) == 0x0001F8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_14) == 0x000200, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Sequence_Base_3) == 0x000208, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Sequence_Base_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_14) == 0x000210, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_6) == 0x000218, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_15) == 0x000220, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_11) == 0x000228, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_11' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_15) == 0x000230, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_5) == 0x000238, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_16) == 0x000240, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_12) == 0x000248, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_12' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_16) == 0x000250, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_4) == 0x000258, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_17) == 0x000260, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_13) == 0x000268, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_13' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_17) == 0x000270, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_3) == 0x000278, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_18) == 0x000280, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_14) == 0x000288, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_14' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_18) == 0x000290, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_2) == 0x000298, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_19) == 0x0002A0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_15) == 0x0002A8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_15' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_19) == 0x0002B0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded_1) == 0x0002B8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_20) == 0x0002C0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_16) == 0x0002C8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_16' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_20) == 0x0002D0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CustomEvent_Loaded) == 0x0002D8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, Temp_object_Variable_21) == 0x0002E0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::Temp_object_Variable_21' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_17) == 0x0002E8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_17' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_21) == 0x0002F0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002F4, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000304, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000314, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_6) == 0x000324, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_7) == 0x000334, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_8) == 0x000344, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_9) == 0x000354, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_10) == 0x000364, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_11) == 0x000374, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_12) == 0x000384, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_13) == 0x000394, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0003A8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_IsValid_ReturnValue) == 0x0003B0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_18) == 0x0003B8, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_18' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_22) == 0x0003C0, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_Not_PreBool_ReturnValue) == 0x0003C1, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_14) == 0x0003C4, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_15) == 0x0003D4, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_16) == 0x0003E4, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_17) == 0x0003F4, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_18) == 0x000404, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_19) == 0x000414, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000424, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_BooleanAND_ReturnValue) == 0x000425, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000428, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_AsAnim_Montage_19) == 0x000430, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_AsAnim_Montage_19' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_DynamicCast_bSuccess_23) == 0x000438, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_IsValid_ReturnValue_1) == 0x000439, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x00043A, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x00043B, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, K2Node_CreateDelegate_OutputDelegate_20) == 0x00043C, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base, CallFunc_BooleanAND_ReturnValue_1) == 0x00044C, "Member 'ITEM_MeleeWeapon_Base_C_ExecuteUbergraph_ITEM_MeleeWeapon_Base::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
