#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_Decoy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ITEM_Decoy.ITEM_Decoy_C.Activate
// 0x0170 (0x0170 - 0x0000)
struct ITEM_Decoy_C_Activate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACYBR_Decoy_C*                          DecoyActor;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraForward;                                     // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Avatar_C*                         AvatarPawn;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivate_Result;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_RemoveItemCount_RemovedItem;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAvatarVelocity_Velocity;               // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0xC];                                      // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACYBR_Decoy_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Decoy_C_Activate) == 0x000010, "Wrong alignment on ITEM_Decoy_C_Activate");
static_assert(sizeof(ITEM_Decoy_C_Activate) == 0x000170, "Wrong size on ITEM_Decoy_C_Activate");
static_assert(offsetof(ITEM_Decoy_C_Activate, Character) == 0x000000, "Member 'ITEM_Decoy_C_Activate::Character' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, Result) == 0x000008, "Member 'ITEM_Decoy_C_Activate::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, DecoyActor) == 0x000010, "Member 'ITEM_Decoy_C_Activate::DecoyActor' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CameraForward) == 0x000018, "Member 'ITEM_Decoy_C_Activate::CameraForward' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, AvatarPawn) == 0x000028, "Member 'ITEM_Decoy_C_Activate::AvatarPawn' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_CanActivate_Result) == 0x000030, "Member 'ITEM_Decoy_C_Activate::CallFunc_CanActivate_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_GetBag_Result) == 0x000038, "Member 'ITEM_Decoy_C_Activate::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_RemoveItemCount_RemovedItem) == 0x000040, "Member 'ITEM_Decoy_C_Activate::CallFunc_RemoveItemCount_RemovedItem' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, K2Node_DynamicCast_AsPAWN_Avatar) == 0x000048, "Member 'ITEM_Decoy_C_Activate::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ITEM_Decoy_C_Activate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000054, "Member 'ITEM_Decoy_C_Activate::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_GetAvatarVelocity_Velocity) == 0x000058, "Member 'ITEM_Decoy_C_Activate::CallFunc_GetAvatarVelocity_Velocity' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_RandomUnitVector_ReturnValue) == 0x000064, "Member 'ITEM_Decoy_C_Activate::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'ITEM_Decoy_C_Activate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00007C, "Member 'ITEM_Decoy_C_Activate::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_GetForwardVector_ReturnValue) == 0x000088, "Member 'ITEM_Decoy_C_Activate::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_GetForwardVector_ReturnValue_1) == 0x000094, "Member 'ITEM_Decoy_C_Activate::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000A0, "Member 'ITEM_Decoy_C_Activate::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000B0, "Member 'ITEM_Decoy_C_Activate::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E0, "Member 'ITEM_Decoy_C_Activate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_BreakTransform_Location) == 0x0000E4, "Member 'ITEM_Decoy_C_Activate::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_BreakTransform_Rotation) == 0x0000F0, "Member 'ITEM_Decoy_C_Activate::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_BreakTransform_Scale) == 0x0000FC, "Member 'ITEM_Decoy_C_Activate::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_FMin_ReturnValue) == 0x000108, "Member 'ITEM_Decoy_C_Activate::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Add_VectorVector_ReturnValue) == 0x00010C, "Member 'ITEM_Decoy_C_Activate::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000118, "Member 'ITEM_Decoy_C_Activate::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'ITEM_Decoy_C_Activate::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'ITEM_Decoy_C_Activate::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_Activate, CallFunc_FinishSpawningActor_ReturnValue) == 0x000168, "Member 'ITEM_Decoy_C_Activate::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ITEM_Decoy.ITEM_Decoy_C.CanActivate
// 0x0018 (0x0018 - 0x0000)
struct ITEM_Decoy_C_CanActivate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivate_Result;                       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTimeSinceActivation_Result;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Decoy_C_CanActivate) == 0x000008, "Wrong alignment on ITEM_Decoy_C_CanActivate");
static_assert(sizeof(ITEM_Decoy_C_CanActivate) == 0x000018, "Wrong size on ITEM_Decoy_C_CanActivate");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, Character) == 0x000000, "Member 'ITEM_Decoy_C_CanActivate::Character' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, Result) == 0x000008, "Member 'ITEM_Decoy_C_CanActivate::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, CallFunc_CanActivate_Result) == 0x000009, "Member 'ITEM_Decoy_C_CanActivate::CallFunc_CanActivate_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000A, "Member 'ITEM_Decoy_C_CanActivate::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, CallFunc_GetElapsedTimeSinceActivation_Result) == 0x00000C, "Member 'ITEM_Decoy_C_CanActivate::CallFunc_GetElapsedTimeSinceActivation_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_CanActivate, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'ITEM_Decoy_C_CanActivate::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function ITEM_Decoy.ITEM_Decoy_C.HasCooldown
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Decoy_C_HasCooldown final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Decoy_C_HasCooldown) == 0x000001, "Wrong alignment on ITEM_Decoy_C_HasCooldown");
static_assert(sizeof(ITEM_Decoy_C_HasCooldown) == 0x000001, "Wrong size on ITEM_Decoy_C_HasCooldown");
static_assert(offsetof(ITEM_Decoy_C_HasCooldown, Result) == 0x000000, "Member 'ITEM_Decoy_C_HasCooldown::Result' has a wrong offset!");

// Function ITEM_Decoy.ITEM_Decoy_C.GetCooldownRatio
// 0x0014 (0x0014 - 0x0000)
struct ITEM_Decoy_C_GetCooldownRatio final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimeSinceActivation_Result;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Decoy_C_GetCooldownRatio) == 0x000004, "Wrong alignment on ITEM_Decoy_C_GetCooldownRatio");
static_assert(sizeof(ITEM_Decoy_C_GetCooldownRatio) == 0x000014, "Wrong size on ITEM_Decoy_C_GetCooldownRatio");
static_assert(offsetof(ITEM_Decoy_C_GetCooldownRatio, Result) == 0x000000, "Member 'ITEM_Decoy_C_GetCooldownRatio::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetCooldownRatio, CallFunc_GetElapsedTimeSinceActivation_Result) == 0x000004, "Member 'ITEM_Decoy_C_GetCooldownRatio::CallFunc_GetElapsedTimeSinceActivation_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetCooldownRatio, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'ITEM_Decoy_C_GetCooldownRatio::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetCooldownRatio, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'ITEM_Decoy_C_GetCooldownRatio::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetCooldownRatio, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'ITEM_Decoy_C_GetCooldownRatio::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function ITEM_Decoy.ITEM_Decoy_C.GetElapsedTimeSinceActivation
// 0x000C (0x000C - 0x0000)
struct ITEM_Decoy_C_GetElapsedTimeSinceActivation final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Decoy_C_GetElapsedTimeSinceActivation) == 0x000004, "Wrong alignment on ITEM_Decoy_C_GetElapsedTimeSinceActivation");
static_assert(sizeof(ITEM_Decoy_C_GetElapsedTimeSinceActivation) == 0x00000C, "Wrong size on ITEM_Decoy_C_GetElapsedTimeSinceActivation");
static_assert(offsetof(ITEM_Decoy_C_GetElapsedTimeSinceActivation, Result) == 0x000000, "Member 'ITEM_Decoy_C_GetElapsedTimeSinceActivation::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetElapsedTimeSinceActivation, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000004, "Member 'ITEM_Decoy_C_GetElapsedTimeSinceActivation::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Decoy_C_GetElapsedTimeSinceActivation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'ITEM_Decoy_C_GetElapsedTimeSinceActivation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

