#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ITEM_Base

#include "Basic.hpp"

#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ITEM_Base.ITEM_Base_C.DropEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ITEM_Base_C_DropEvent__DelegateSignature final
{
public:
	class APICKUP_Base_C*                         Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_DropEvent__DelegateSignature) == 0x000008, "Wrong alignment on ITEM_Base_C_DropEvent__DelegateSignature");
static_assert(sizeof(ITEM_Base_C_DropEvent__DelegateSignature) == 0x000008, "Wrong size on ITEM_Base_C_DropEvent__DelegateSignature");
static_assert(offsetof(ITEM_Base_C_DropEvent__DelegateSignature, Pickup) == 0x000000, "Member 'ITEM_Base_C_DropEvent__DelegateSignature::Pickup' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.CountChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ITEM_Base_C_CountChanged__DelegateSignature final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_CountChanged__DelegateSignature) == 0x000008, "Wrong alignment on ITEM_Base_C_CountChanged__DelegateSignature");
static_assert(sizeof(ITEM_Base_C_CountChanged__DelegateSignature) == 0x000010, "Wrong size on ITEM_Base_C_CountChanged__DelegateSignature");
static_assert(offsetof(ITEM_Base_C_CountChanged__DelegateSignature, Item) == 0x000000, "Member 'ITEM_Base_C_CountChanged__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CountChanged__DelegateSignature, Count_0) == 0x000008, "Member 'ITEM_Base_C_CountChanged__DelegateSignature::Count_0' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.GetInventory
// 0x0020 (0x0020 - 0x0000)
struct ITEM_Base_C_GetInventory final
{
public:
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      K2Node_DynamicCast_AsCOMP_Inventory;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_GetInventory) == 0x000008, "Wrong alignment on ITEM_Base_C_GetInventory");
static_assert(sizeof(ITEM_Base_C_GetInventory) == 0x000020, "Wrong size on ITEM_Base_C_GetInventory");
static_assert(offsetof(ITEM_Base_C_GetInventory, Inventory) == 0x000000, "Member 'ITEM_Base_C_GetInventory::Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_GetInventory, CallFunc_GetOuterObject_ReturnValue) == 0x000008, "Member 'ITEM_Base_C_GetInventory::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_GetInventory, K2Node_DynamicCast_AsCOMP_Inventory) == 0x000010, "Member 'ITEM_Base_C_GetInventory::K2Node_DynamicCast_AsCOMP_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_GetInventory, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ITEM_Base_C_GetInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.IsStackable
// 0x0002 (0x0002 - 0x0000)
struct ITEM_Base_C_IsStackable final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_IsStackable) == 0x000001, "Wrong alignment on ITEM_Base_C_IsStackable");
static_assert(sizeof(ITEM_Base_C_IsStackable) == 0x000002, "Wrong size on ITEM_Base_C_IsStackable");
static_assert(offsetof(ITEM_Base_C_IsStackable, Result) == 0x000000, "Member 'ITEM_Base_C_IsStackable::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_IsStackable, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000001, "Member 'ITEM_Base_C_IsStackable::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.ShouldAutoEquip
// 0x0002 (0x0002 - 0x0000)
struct ITEM_Base_C_ShouldAutoEquip final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_ShouldAutoEquip) == 0x000001, "Wrong alignment on ITEM_Base_C_ShouldAutoEquip");
static_assert(sizeof(ITEM_Base_C_ShouldAutoEquip) == 0x000002, "Wrong size on ITEM_Base_C_ShouldAutoEquip");
static_assert(offsetof(ITEM_Base_C_ShouldAutoEquip, Result) == 0x000000, "Member 'ITEM_Base_C_ShouldAutoEquip::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_ShouldAutoEquip, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'ITEM_Base_C_ShouldAutoEquip::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.HasLinkedPickup
// 0x0002 (0x0002 - 0x0000)
struct ITEM_Base_C_HasLinkedPickup final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_HasLinkedPickup) == 0x000001, "Wrong alignment on ITEM_Base_C_HasLinkedPickup");
static_assert(sizeof(ITEM_Base_C_HasLinkedPickup) == 0x000002, "Wrong size on ITEM_Base_C_HasLinkedPickup");
static_assert(offsetof(ITEM_Base_C_HasLinkedPickup, Result) == 0x000000, "Member 'ITEM_Base_C_HasLinkedPickup::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_HasLinkedPickup, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ITEM_Base_C_HasLinkedPickup::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.GetLinkedPickup
// 0x0008 (0x0008 - 0x0000)
struct ITEM_Base_C_GetLinkedPickup final
{
public:
	class APICKUP_Base_C*                         Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_GetLinkedPickup) == 0x000008, "Wrong alignment on ITEM_Base_C_GetLinkedPickup");
static_assert(sizeof(ITEM_Base_C_GetLinkedPickup) == 0x000008, "Wrong size on ITEM_Base_C_GetLinkedPickup");
static_assert(offsetof(ITEM_Base_C_GetLinkedPickup, Result) == 0x000000, "Member 'ITEM_Base_C_GetLinkedPickup::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.DestroyLinkedPickup
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Base_C_DestroyLinkedPickup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_DestroyLinkedPickup) == 0x000001, "Wrong alignment on ITEM_Base_C_DestroyLinkedPickup");
static_assert(sizeof(ITEM_Base_C_DestroyLinkedPickup) == 0x000001, "Wrong size on ITEM_Base_C_DestroyLinkedPickup");
static_assert(offsetof(ITEM_Base_C_DestroyLinkedPickup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ITEM_Base_C_DestroyLinkedPickup::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.AddCount
// 0x0028 (0x0028 - 0x0000)
struct ITEM_Base_C_AddCount final
{
public:
	int32                                         CountToAdd;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           SourceItem;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultCount;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Result;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_AddCount) == 0x000008, "Wrong alignment on ITEM_Base_C_AddCount");
static_assert(sizeof(ITEM_Base_C_AddCount) == 0x000028, "Wrong size on ITEM_Base_C_AddCount");
static_assert(offsetof(ITEM_Base_C_AddCount, CountToAdd) == 0x000000, "Member 'ITEM_Base_C_AddCount::CountToAdd' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, SourceItem) == 0x000008, "Member 'ITEM_Base_C_AddCount::SourceItem' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, ResultCount) == 0x000010, "Member 'ITEM_Base_C_AddCount::ResultCount' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, CallFunc_GetCount_Result) == 0x000014, "Member 'ITEM_Base_C_AddCount::CallFunc_GetCount_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ITEM_Base_C_AddCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'ITEM_Base_C_AddCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ITEM_Base_C_AddCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_AddCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'ITEM_Base_C_AddCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.SetInventory
// 0x0040 (0x0040 - 0x0000)
struct ITEM_Base_C_SetInventory final
{
public:
	class UCOMP_Inventory_C*                      NewInventory;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      PrevInventory;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldCreateLinkedPickups_Result;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasLinkedPickup_Result;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnInventoryChanged_Result;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_SetInventory) == 0x000008, "Wrong alignment on ITEM_Base_C_SetInventory");
static_assert(sizeof(ITEM_Base_C_SetInventory) == 0x000040, "Wrong size on ITEM_Base_C_SetInventory");
static_assert(offsetof(ITEM_Base_C_SetInventory, NewInventory) == 0x000000, "Member 'ITEM_Base_C_SetInventory::NewInventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, Result) == 0x000008, "Member 'ITEM_Base_C_SetInventory::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, PrevInventory) == 0x000010, "Member 'ITEM_Base_C_SetInventory::PrevInventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'ITEM_Base_C_SetInventory::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_GetInventory_Inventory) == 0x000020, "Member 'ITEM_Base_C_SetInventory::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ITEM_Base_C_SetInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_GetInventory_Inventory_1) == 0x000030, "Member 'ITEM_Base_C_SetInventory::CallFunc_GetInventory_Inventory_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'ITEM_Base_C_SetInventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_ShouldCreateLinkedPickups_Result) == 0x000039, "Member 'ITEM_Base_C_SetInventory::CallFunc_ShouldCreateLinkedPickups_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_HasLinkedPickup_Result) == 0x00003A, "Member 'ITEM_Base_C_SetInventory::CallFunc_HasLinkedPickup_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_OnInventoryChanged_Result) == 0x00003B, "Member 'ITEM_Base_C_SetInventory::CallFunc_OnInventoryChanged_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventory, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00003C, "Member 'ITEM_Base_C_SetInventory::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.OnInventoryChanged
// 0x0010 (0x0010 - 0x0000)
struct ITEM_Base_C_OnInventoryChanged final
{
public:
	class UCOMP_Inventory_C*                      PrevInventory;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_OnInventoryChanged) == 0x000008, "Wrong alignment on ITEM_Base_C_OnInventoryChanged");
static_assert(sizeof(ITEM_Base_C_OnInventoryChanged) == 0x000010, "Wrong size on ITEM_Base_C_OnInventoryChanged");
static_assert(offsetof(ITEM_Base_C_OnInventoryChanged, PrevInventory) == 0x000000, "Member 'ITEM_Base_C_OnInventoryChanged::PrevInventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_OnInventoryChanged, Result) == 0x000008, "Member 'ITEM_Base_C_OnInventoryChanged::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.InitializeItem
// 0x0008 (0x0008 - 0x0000)
struct ITEM_Base_C_InitializeItem final
{
public:
	class UInventoryBag_C*                        Bag_0;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_InitializeItem) == 0x000008, "Wrong alignment on ITEM_Base_C_InitializeItem");
static_assert(sizeof(ITEM_Base_C_InitializeItem) == 0x000008, "Wrong size on ITEM_Base_C_InitializeItem");
static_assert(offsetof(ITEM_Base_C_InitializeItem, Bag_0) == 0x000000, "Member 'ITEM_Base_C_InitializeItem::Bag_0' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.SetInventoryLocation
// 0x0010 (0x0010 - 0x0000)
struct ITEM_Base_C_SetInventoryLocation final
{
public:
	class UInventoryBag_C*                        NewBag;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewSlotIndex;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_SetInventoryLocation) == 0x000008, "Wrong alignment on ITEM_Base_C_SetInventoryLocation");
static_assert(sizeof(ITEM_Base_C_SetInventoryLocation) == 0x000010, "Wrong size on ITEM_Base_C_SetInventoryLocation");
static_assert(offsetof(ITEM_Base_C_SetInventoryLocation, NewBag) == 0x000000, "Member 'ITEM_Base_C_SetInventoryLocation::NewBag' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_SetInventoryLocation, NewSlotIndex) == 0x000008, "Member 'ITEM_Base_C_SetInventoryLocation::NewSlotIndex' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.GetCount
// 0x0004 (0x0004 - 0x0000)
struct ITEM_Base_C_GetCount final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_GetCount) == 0x000004, "Wrong alignment on ITEM_Base_C_GetCount");
static_assert(sizeof(ITEM_Base_C_GetCount) == 0x000004, "Wrong size on ITEM_Base_C_GetCount");
static_assert(offsetof(ITEM_Base_C_GetCount, Result) == 0x000000, "Member 'ITEM_Base_C_GetCount::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.GetSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct ITEM_Base_C_GetSlotIndex final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_GetSlotIndex) == 0x000004, "Wrong alignment on ITEM_Base_C_GetSlotIndex");
static_assert(sizeof(ITEM_Base_C_GetSlotIndex) == 0x000004, "Wrong size on ITEM_Base_C_GetSlotIndex");
static_assert(offsetof(ITEM_Base_C_GetSlotIndex, Result) == 0x000000, "Member 'ITEM_Base_C_GetSlotIndex::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.GetBag
// 0x0008 (0x0008 - 0x0000)
struct ITEM_Base_C_GetBag final
{
public:
	class UInventoryBag_C*                        Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_GetBag) == 0x000008, "Wrong alignment on ITEM_Base_C_GetBag");
static_assert(sizeof(ITEM_Base_C_GetBag) == 0x000008, "Wrong size on ITEM_Base_C_GetBag");
static_assert(offsetof(ITEM_Base_C_GetBag, Result) == 0x000000, "Member 'ITEM_Base_C_GetBag::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.ShouldForceEquip
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Base_C_ShouldForceEquip final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_ShouldForceEquip) == 0x000001, "Wrong alignment on ITEM_Base_C_ShouldForceEquip");
static_assert(sizeof(ITEM_Base_C_ShouldForceEquip) == 0x000001, "Wrong size on ITEM_Base_C_ShouldForceEquip");
static_assert(offsetof(ITEM_Base_C_ShouldForceEquip, Result) == 0x000000, "Member 'ITEM_Base_C_ShouldForceEquip::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.CanUnslot
// 0x0002 (0x0002 - 0x0000)
struct ITEM_Base_C_CanUnslot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlotted_Result;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_CanUnslot) == 0x000001, "Wrong alignment on ITEM_Base_C_CanUnslot");
static_assert(sizeof(ITEM_Base_C_CanUnslot) == 0x000002, "Wrong size on ITEM_Base_C_CanUnslot");
static_assert(offsetof(ITEM_Base_C_CanUnslot, Result) == 0x000000, "Member 'ITEM_Base_C_CanUnslot::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CanUnslot, CallFunc_IsSlotted_Result) == 0x000001, "Member 'ITEM_Base_C_CanUnslot::CallFunc_IsSlotted_Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.CanDropItem
// 0x0018 (0x0018 - 0x0000)
struct ITEM_Base_C_CanDropItem final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanUnslot_Result;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_CanDropItem) == 0x000008, "Wrong alignment on ITEM_Base_C_CanDropItem");
static_assert(sizeof(ITEM_Base_C_CanDropItem) == 0x000018, "Wrong size on ITEM_Base_C_CanDropItem");
static_assert(offsetof(ITEM_Base_C_CanDropItem, Result) == 0x000000, "Member 'ITEM_Base_C_CanDropItem::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CanDropItem, CallFunc_CanUnslot_Result) == 0x000001, "Member 'ITEM_Base_C_CanDropItem::CallFunc_CanUnslot_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CanDropItem, CallFunc_GetInventory_Inventory) == 0x000008, "Member 'ITEM_Base_C_CanDropItem::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CanDropItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ITEM_Base_C_CanDropItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.IsDestructible
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Base_C_IsDestructible final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_IsDestructible) == 0x000001, "Wrong alignment on ITEM_Base_C_IsDestructible");
static_assert(sizeof(ITEM_Base_C_IsDestructible) == 0x000001, "Wrong size on ITEM_Base_C_IsDestructible");
static_assert(offsetof(ITEM_Base_C_IsDestructible, Result) == 0x000000, "Member 'ITEM_Base_C_IsDestructible::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.DestroyItem
// 0x0028 (0x0028 - 0x0000)
struct ITEM_Base_C_DestroyItem final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDestructible_Result;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CleanupSlot_Result;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result_1;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_DestroyItem) == 0x000008, "Wrong alignment on ITEM_Base_C_DestroyItem");
static_assert(sizeof(ITEM_Base_C_DestroyItem) == 0x000028, "Wrong size on ITEM_Base_C_DestroyItem");
static_assert(offsetof(ITEM_Base_C_DestroyItem, Result) == 0x000000, "Member 'ITEM_Base_C_DestroyItem::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_DestroyItem, CallFunc_GetBag_Result) == 0x000008, "Member 'ITEM_Base_C_DestroyItem::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_DestroyItem, CallFunc_IsDestructible_Result) == 0x000010, "Member 'ITEM_Base_C_DestroyItem::CallFunc_IsDestructible_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_DestroyItem, CallFunc_CleanupSlot_Result) == 0x000011, "Member 'ITEM_Base_C_DestroyItem::CallFunc_CleanupSlot_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_DestroyItem, CallFunc_GetBag_Result_1) == 0x000018, "Member 'ITEM_Base_C_DestroyItem::CallFunc_GetBag_Result_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_DestroyItem, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ITEM_Base_C_DestroyItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.OnRemovedFromInventory
// 0x0005 (0x0005 - 0x0000)
struct ITEM_Base_C_OnRemovedFromInventory final
{
public:
	bool                                          CallFunc_Deactivate_Result;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsActivated_Result;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetEquipped_Result;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipped_Result;                        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInventory_Result;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_OnRemovedFromInventory) == 0x000001, "Wrong alignment on ITEM_Base_C_OnRemovedFromInventory");
static_assert(sizeof(ITEM_Base_C_OnRemovedFromInventory) == 0x000005, "Wrong size on ITEM_Base_C_OnRemovedFromInventory");
static_assert(offsetof(ITEM_Base_C_OnRemovedFromInventory, CallFunc_Deactivate_Result) == 0x000000, "Member 'ITEM_Base_C_OnRemovedFromInventory::CallFunc_Deactivate_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_OnRemovedFromInventory, CallFunc_GetIsActivated_Result) == 0x000001, "Member 'ITEM_Base_C_OnRemovedFromInventory::CallFunc_GetIsActivated_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_OnRemovedFromInventory, CallFunc_SetEquipped_Result) == 0x000002, "Member 'ITEM_Base_C_OnRemovedFromInventory::CallFunc_SetEquipped_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_OnRemovedFromInventory, CallFunc_IsEquipped_Result) == 0x000003, "Member 'ITEM_Base_C_OnRemovedFromInventory::CallFunc_IsEquipped_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_OnRemovedFromInventory, CallFunc_SetInventory_Result) == 0x000004, "Member 'ITEM_Base_C_OnRemovedFromInventory::CallFunc_SetInventory_Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.TryDropItem
// 0x0038 (0x0038 - 0x0000)
struct ITEM_Base_C_TryDropItem final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RelativeOffset;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WasItemRemoved;                                    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipped_Result;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryHandleDropEvent_Result;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivatable_Result;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDropItem_Result;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_RemoveItem_RemovedItem;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_TryDropItem) == 0x000008, "Wrong alignment on ITEM_Base_C_TryDropItem");
static_assert(sizeof(ITEM_Base_C_TryDropItem) == 0x000038, "Wrong size on ITEM_Base_C_TryDropItem");
static_assert(offsetof(ITEM_Base_C_TryDropItem, SceneComponent) == 0x000000, "Member 'ITEM_Base_C_TryDropItem::SceneComponent' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, RelativeOffset) == 0x000008, "Member 'ITEM_Base_C_TryDropItem::RelativeOffset' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, Result) == 0x000010, "Member 'ITEM_Base_C_TryDropItem::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, WasItemRemoved) == 0x000011, "Member 'ITEM_Base_C_TryDropItem::WasItemRemoved' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_GetInventory_Inventory) == 0x000018, "Member 'ITEM_Base_C_TryDropItem::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_IsEquipped_Result) == 0x000020, "Member 'ITEM_Base_C_TryDropItem::CallFunc_IsEquipped_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ITEM_Base_C_TryDropItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_TryHandleDropEvent_Result) == 0x000022, "Member 'ITEM_Base_C_TryDropItem::CallFunc_TryHandleDropEvent_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_IsActivatable_Result) == 0x000023, "Member 'ITEM_Base_C_TryDropItem::CallFunc_IsActivatable_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'ITEM_Base_C_TryDropItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_CanDropItem_Result) == 0x000025, "Member 'ITEM_Base_C_TryDropItem::CallFunc_CanDropItem_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_RemoveItem_RemovedItem) == 0x000028, "Member 'ITEM_Base_C_TryDropItem::CallFunc_RemoveItem_RemovedItem' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropItem, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'ITEM_Base_C_TryDropItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.IsDeployed
// 0x0001 (0x0001 - 0x0000)
struct ITEM_Base_C_IsDeployed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_IsDeployed) == 0x000001, "Wrong alignment on ITEM_Base_C_IsDeployed");
static_assert(sizeof(ITEM_Base_C_IsDeployed) == 0x000001, "Wrong size on ITEM_Base_C_IsDeployed");
static_assert(offsetof(ITEM_Base_C_IsDeployed, Result) == 0x000000, "Member 'ITEM_Base_C_IsDeployed::Result' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.TryDropAndPushItem
// 0x0028 (0x0028 - 0x0000)
struct ITEM_Base_C_TryDropAndPushItem final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RelativeOffset;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WasItemRemoved;                                    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDropItem_Result;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryDropItem_Result;                       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class APICKUP_Base_C* Pickup)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_TryDropAndPushItem) == 0x000008, "Wrong alignment on ITEM_Base_C_TryDropAndPushItem");
static_assert(sizeof(ITEM_Base_C_TryDropAndPushItem) == 0x000028, "Wrong size on ITEM_Base_C_TryDropAndPushItem");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, SceneComponent) == 0x000000, "Member 'ITEM_Base_C_TryDropAndPushItem::SceneComponent' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, RelativeOffset) == 0x000008, "Member 'ITEM_Base_C_TryDropAndPushItem::RelativeOffset' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, Result) == 0x000010, "Member 'ITEM_Base_C_TryDropAndPushItem::Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, WasItemRemoved) == 0x000011, "Member 'ITEM_Base_C_TryDropAndPushItem::WasItemRemoved' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, CallFunc_CanDropItem_Result) == 0x000012, "Member 'ITEM_Base_C_TryDropAndPushItem::CallFunc_CanDropItem_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, CallFunc_TryDropItem_Result) == 0x000013, "Member 'ITEM_Base_C_TryDropAndPushItem::CallFunc_TryDropItem_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_TryDropAndPushItem, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'ITEM_Base_C_TryDropAndPushItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.CreateDroppedPickupItem
// 0x01B0 (0x01B0 - 0x0000)
struct ITEM_Base_C_CreateDroppedPickupItem final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RelativeOffset;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         PickupActor;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       NewLocalVar_0;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         SpawnedPickup;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        StreamingLevel;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             PickupTransform;                                   // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CharacterTransform;                                // 0x0060(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UCameraComponent*                       CameraComponent;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_GetLoadedLevel_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetBestPickupClass_Result;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBestPickupClass_Result_1;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_GetLoadedLevel_ReturnValue_1;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         CallFunc_SpawnActorInLevel_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetPrimaryStreamingLevel_Level;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(ITEM_Base_C_CreateDroppedPickupItem) == 0x000010, "Wrong alignment on ITEM_Base_C_CreateDroppedPickupItem");
static_assert(sizeof(ITEM_Base_C_CreateDroppedPickupItem) == 0x0001B0, "Wrong size on ITEM_Base_C_CreateDroppedPickupItem");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, SceneComponent) == 0x000000, "Member 'ITEM_Base_C_CreateDroppedPickupItem::SceneComponent' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, RelativeOffset) == 0x000008, "Member 'ITEM_Base_C_CreateDroppedPickupItem::RelativeOffset' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, PickupActor) == 0x000010, "Member 'ITEM_Base_C_CreateDroppedPickupItem::PickupActor' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, NewLocalVar_0) == 0x000018, "Member 'ITEM_Base_C_CreateDroppedPickupItem::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, SpawnedPickup) == 0x000020, "Member 'ITEM_Base_C_CreateDroppedPickupItem::SpawnedPickup' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, StreamingLevel) == 0x000028, "Member 'ITEM_Base_C_CreateDroppedPickupItem::StreamingLevel' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, PickupTransform) == 0x000030, "Member 'ITEM_Base_C_CreateDroppedPickupItem::PickupTransform' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CharacterTransform) == 0x000060, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CharacterTransform' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CameraComponent) == 0x000090, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CameraComponent' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetLoadedLevel_ReturnValue) == 0x000098, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetLoadedLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000A0, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B0, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetForwardVector_ReturnValue) == 0x0000BC, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetRightVector_ReturnValue) == 0x0000D4, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetUpVector_ReturnValue) == 0x0000E0, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetBestPickupClass_Result) == 0x0000F0, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetBestPickupClass_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetBestPickupClass_Result_1) == 0x0000F8, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetBestPickupClass_Result_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetLoadedLevel_ReturnValue_1) == 0x000110, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetLoadedLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_SpawnActorInLevel_ReturnValue) == 0x000118, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_SpawnActorInLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetGameInstance_ReturnValue) == 0x000120, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, K2Node_DynamicCast_AsGI_Single_Player) == 0x000128, "Member 'ITEM_Base_C_CreateDroppedPickupItem::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'ITEM_Base_C_CreateDroppedPickupItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_GetPrimaryStreamingLevel_Level) == 0x000138, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_GetPrimaryStreamingLevel_Level' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_BreakVector2D_X) == 0x000144, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_BreakVector2D_Y) == 0x000148, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00014C, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000158, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000164, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000170, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateDroppedPickupItem, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'ITEM_Base_C_CreateDroppedPickupItem::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function ITEM_Base.ITEM_Base_C.CreateLinkedPickupItem
// 0x0090 (0x0090 - 0x0000)
struct ITEM_Base_C_CreateLinkedPickupItem final
{
public:
	struct FTransform                             PickupTransform;                                   // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class APICKUP_Base_C*                         PickupActor;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerActor;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         SpawnedPickup;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelStreaming*                        StreamingLevel;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBestPickupClass_Result;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBestPickupClass_Result_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_GetActorLevel_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_Actor;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Base_C*                         CallFunc_SpawnActorInLevel_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ITEM_Base_C_CreateLinkedPickupItem) == 0x000010, "Wrong alignment on ITEM_Base_C_CreateLinkedPickupItem");
static_assert(sizeof(ITEM_Base_C_CreateLinkedPickupItem) == 0x000090, "Wrong size on ITEM_Base_C_CreateLinkedPickupItem");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, PickupTransform) == 0x000000, "Member 'ITEM_Base_C_CreateLinkedPickupItem::PickupTransform' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, PickupActor) == 0x000030, "Member 'ITEM_Base_C_CreateLinkedPickupItem::PickupActor' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, OwnerActor) == 0x000038, "Member 'ITEM_Base_C_CreateLinkedPickupItem::OwnerActor' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, SpawnedPickup) == 0x000040, "Member 'ITEM_Base_C_CreateLinkedPickupItem::SpawnedPickup' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, StreamingLevel) == 0x000048, "Member 'ITEM_Base_C_CreateLinkedPickupItem::StreamingLevel' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, CallFunc_GetBestPickupClass_Result) == 0x000050, "Member 'ITEM_Base_C_CreateLinkedPickupItem::CallFunc_GetBestPickupClass_Result' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, CallFunc_GetBestPickupClass_Result_1) == 0x000058, "Member 'ITEM_Base_C_CreateLinkedPickupItem::CallFunc_GetBestPickupClass_Result_1' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, CallFunc_GetActorLevel_ReturnValue) == 0x000060, "Member 'ITEM_Base_C_CreateLinkedPickupItem::CallFunc_GetActorLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, CallFunc_GetOwnerActor_Actor) == 0x000068, "Member 'ITEM_Base_C_CreateLinkedPickupItem::CallFunc_GetOwnerActor_Actor' has a wrong offset!");
static_assert(offsetof(ITEM_Base_C_CreateLinkedPickupItem, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'ITEM_Base_C_CreateLinkedPickupItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
