#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JUNK_FinanceChip

#include "Basic.hpp"


namespace SDK::Params
{

// Function JUNK_FinanceChip.JUNK_FinanceChip_C.Activate
// 0x0038 (0x0038 - 0x0000)
struct JUNK_FinanceChip_C_Activate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryReceiveItem_self_CastInput;            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryReceiveItem_Result;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JUNK_FinanceChip_C_Activate) == 0x000008, "Wrong alignment on JUNK_FinanceChip_C_Activate");
static_assert(sizeof(JUNK_FinanceChip_C_Activate) == 0x000038, "Wrong size on JUNK_FinanceChip_C_Activate");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, Character) == 0x000000, "Member 'JUNK_FinanceChip_C_Activate::Character' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, Result) == 0x000008, "Member 'JUNK_FinanceChip_C_Activate::Result' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000010, "Member 'JUNK_FinanceChip_C_Activate::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'JUNK_FinanceChip_C_Activate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'JUNK_FinanceChip_C_Activate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, CallFunc_TryReceiveItem_self_CastInput) == 0x000020, "Member 'JUNK_FinanceChip_C_Activate::CallFunc_TryReceiveItem_self_CastInput' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_Activate, CallFunc_TryReceiveItem_Result) == 0x000030, "Member 'JUNK_FinanceChip_C_Activate::CallFunc_TryReceiveItem_Result' has a wrong offset!");

// Function JUNK_FinanceChip.JUNK_FinanceChip_C.CanActivate
// 0x0048 (0x0048 - 0x0000)
struct JUNK_FinanceChip_C_CanActivate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       TargetInteract;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivate_Result;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_CanReceiveItem_self_CastInput;            // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanReceiveItem_Result;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPrimitiveInInteractRange_Result;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JUNK_FinanceChip_C_CanActivate) == 0x000008, "Wrong alignment on JUNK_FinanceChip_C_CanActivate");
static_assert(sizeof(JUNK_FinanceChip_C_CanActivate) == 0x000048, "Wrong size on JUNK_FinanceChip_C_CanActivate");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, Character) == 0x000000, "Member 'JUNK_FinanceChip_C_CanActivate::Character' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, Result) == 0x000008, "Member 'JUNK_FinanceChip_C_CanActivate::Result' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, TargetInteract) == 0x000010, "Member 'JUNK_FinanceChip_C_CanActivate::TargetInteract' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, CallFunc_CanActivate_Result) == 0x000018, "Member 'JUNK_FinanceChip_C_CanActivate::CallFunc_CanActivate_Result' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, CallFunc_CanReceiveItem_self_CastInput) == 0x000020, "Member 'JUNK_FinanceChip_C_CanActivate::CallFunc_CanReceiveItem_self_CastInput' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, CallFunc_CanReceiveItem_Result) == 0x000030, "Member 'JUNK_FinanceChip_C_CanActivate::CallFunc_CanReceiveItem_Result' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'JUNK_FinanceChip_C_CanActivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000038, "Member 'JUNK_FinanceChip_C_CanActivate::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'JUNK_FinanceChip_C_CanActivate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(JUNK_FinanceChip_C_CanActivate, CallFunc_IsPrimitiveInInteractRange_Result) == 0x000041, "Member 'JUNK_FinanceChip_C_CanActivate::CallFunc_IsPrimitiveInInteractRange_Result' has a wrong offset!");

}

