#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelVoxelization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LevelVoxelization.LevelVoxelizationData.GetBlendedVoxelMeshSurfaceNormal
// 0x0070 (0x0070 - 0x0000)
struct LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal final
{
public:
	struct FTransform                             SourceTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SnapDistance;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendAmount;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        LocalTraceOffsets;                                 // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x0048(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludePerspectiveMeshes;                         // 0x0054(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawTraces;                                  // 0x0055(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutNormal;                                         // 0x0058(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDistance;                                       // 0x0064(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal) == 0x000010, "Wrong alignment on LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal");
static_assert(sizeof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal) == 0x000070, "Wrong size on LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, SourceTransform) == 0x000000, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::SourceTransform' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, SnapDistance) == 0x000030, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::SnapDistance' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, BlendAmount) == 0x000034, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::BlendAmount' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, LocalTraceOffsets) == 0x000038, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::LocalTraceOffsets' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, LevelOffset) == 0x000048, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::LevelOffset' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, bIncludePerspectiveMeshes) == 0x000054, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::bIncludePerspectiveMeshes' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, bDebugDrawTraces) == 0x000055, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::bDebugDrawTraces' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, OutNormal) == 0x000058, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::OutNormal' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, OutDistance) == 0x000064, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::OutDistance' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal, ReturnValue) == 0x000068, "Member 'LevelVoxelizationData_GetBlendedVoxelMeshSurfaceNormal::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetColumnLocationFromVoxelLocation2D
// 0x0010 (0x0010 - 0x0000)
struct LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D final
{
public:
	struct FIntPoint                              VoxelLocation2D;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D");
static_assert(sizeof(LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D) == 0x000010, "Wrong size on LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D");
static_assert(offsetof(LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D, VoxelLocation2D) == 0x000000, "Member 'LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D::VoxelLocation2D' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D, ReturnValue) == 0x000008, "Member 'LevelVoxelizationData_GetColumnLocationFromVoxelLocation2D::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetNeighborWallLocations
// 0x0020 (0x0020 - 0x0000)
struct LevelVoxelizationData_GetNeighborWallLocations final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoxelWallLocation>             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetNeighborWallLocations) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetNeighborWallLocations");
static_assert(sizeof(LevelVoxelizationData_GetNeighborWallLocations) == 0x000020, "Wrong size on LevelVoxelizationData_GetNeighborWallLocations");
static_assert(offsetof(LevelVoxelizationData_GetNeighborWallLocations, WallLocation) == 0x000000, "Member 'LevelVoxelizationData_GetNeighborWallLocations::WallLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetNeighborWallLocations, ReturnValue) == 0x000010, "Member 'LevelVoxelizationData_GetNeighborWallLocations::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetPortalCount
// 0x0004 (0x0004 - 0x0000)
struct LevelVoxelizationData_GetPortalCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetPortalCount) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetPortalCount");
static_assert(sizeof(LevelVoxelizationData_GetPortalCount) == 0x000004, "Wrong size on LevelVoxelizationData_GetPortalCount");
static_assert(offsetof(LevelVoxelizationData_GetPortalCount, ReturnValue) == 0x000000, "Member 'LevelVoxelizationData_GetPortalCount::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetRegionRowHandleForWorldLocation
// 0x0040 (0x0040 - 0x0000)
struct LevelVoxelizationData_GetRegionRowHandleForWorldLocation final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldForwardVector;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldRightVector;                                  // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetRegionRowHandleForWorldLocation");
static_assert(sizeof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation) == 0x000040, "Wrong size on LevelVoxelizationData_GetRegionRowHandleForWorldLocation");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation, WorldLocation) == 0x000000, "Member 'LevelVoxelizationData_GetRegionRowHandleForWorldLocation::WorldLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation, WorldForwardVector) == 0x00000C, "Member 'LevelVoxelizationData_GetRegionRowHandleForWorldLocation::WorldForwardVector' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation, WorldRightVector) == 0x000018, "Member 'LevelVoxelizationData_GetRegionRowHandleForWorldLocation::WorldRightVector' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation, LevelOffset) == 0x000024, "Member 'LevelVoxelizationData_GetRegionRowHandleForWorldLocation::LevelOffset' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleForWorldLocation, ReturnValue) == 0x000030, "Member 'LevelVoxelizationData_GetRegionRowHandleForWorldLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetRegionRowHandleFromColumnLocation
// 0x0018 (0x0018 - 0x0000)
struct LevelVoxelizationData_GetRegionRowHandleFromColumnLocation final
{
public:
	struct FIntPoint                              ColumnLocation;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetRegionRowHandleFromColumnLocation) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetRegionRowHandleFromColumnLocation");
static_assert(sizeof(LevelVoxelizationData_GetRegionRowHandleFromColumnLocation) == 0x000018, "Wrong size on LevelVoxelizationData_GetRegionRowHandleFromColumnLocation");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleFromColumnLocation, ColumnLocation) == 0x000000, "Member 'LevelVoxelizationData_GetRegionRowHandleFromColumnLocation::ColumnLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetRegionRowHandleFromColumnLocation, ReturnValue) == 0x000008, "Member 'LevelVoxelizationData_GetRegionRowHandleFromColumnLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetRoomCount
// 0x0004 (0x0004 - 0x0000)
struct LevelVoxelizationData_GetRoomCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetRoomCount) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetRoomCount");
static_assert(sizeof(LevelVoxelizationData_GetRoomCount) == 0x000004, "Wrong size on LevelVoxelizationData_GetRoomCount");
static_assert(offsetof(LevelVoxelizationData_GetRoomCount, ReturnValue) == 0x000000, "Member 'LevelVoxelizationData_GetRoomCount::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetVoxelLocation2DFromColumnLocation
// 0x0010 (0x0010 - 0x0000)
struct LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation final
{
public:
	struct FIntPoint                              ColumnLocation;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation");
static_assert(sizeof(LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation) == 0x000010, "Wrong size on LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation");
static_assert(offsetof(LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation, ColumnLocation) == 0x000000, "Member 'LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation::ColumnLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation, ReturnValue) == 0x000008, "Member 'LevelVoxelizationData_GetVoxelLocation2DFromColumnLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetVoxelMeshSurfaceTransform
// 0x00A0 (0x00A0 - 0x0000)
struct LevelVoxelizationData_GetVoxelMeshSurfaceTransform final
{
public:
	struct FTransform                             SourceTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SourceRadius;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SnapDistance;                                      // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredTranslation;                                // 0x0038(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x0044(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludePerspectiveMeshes;                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosestSurfaceFallback;                           // 0x0051(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0xE];                                       // 0x0052(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutSurfaceTransform;                               // 0x0060(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform) == 0x000010, "Wrong alignment on LevelVoxelizationData_GetVoxelMeshSurfaceTransform");
static_assert(sizeof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform) == 0x0000A0, "Wrong size on LevelVoxelizationData_GetVoxelMeshSurfaceTransform");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, SourceTransform) == 0x000000, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::SourceTransform' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, SourceRadius) == 0x000030, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::SourceRadius' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, SnapDistance) == 0x000034, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::SnapDistance' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, DesiredTranslation) == 0x000038, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::DesiredTranslation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, LevelOffset) == 0x000044, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::LevelOffset' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, bIncludePerspectiveMeshes) == 0x000050, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::bIncludePerspectiveMeshes' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, bClosestSurfaceFallback) == 0x000051, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::bClosestSurfaceFallback' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, OutSurfaceTransform) == 0x000060, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::OutSurfaceTransform' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetVoxelMeshSurfaceTransform, ReturnValue) == 0x000090, "Member 'LevelVoxelizationData_GetVoxelMeshSurfaceTransform::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallComponentCount
// 0x0004 (0x0004 - 0x0000)
struct LevelVoxelizationData_GetWallComponentCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallComponentCount) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetWallComponentCount");
static_assert(sizeof(LevelVoxelizationData_GetWallComponentCount) == 0x000004, "Wrong size on LevelVoxelizationData_GetWallComponentCount");
static_assert(offsetof(LevelVoxelizationData_GetWallComponentCount, ReturnValue) == 0x000000, "Member 'LevelVoxelizationData_GetWallComponentCount::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallComponentIndexAtWallLocation
// 0x0014 (0x0014 - 0x0000)
struct LevelVoxelizationData_GetWallComponentIndexAtWallLocation final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallComponentIndexAtWallLocation) == 0x000004, "Wrong alignment on LevelVoxelizationData_GetWallComponentIndexAtWallLocation");
static_assert(sizeof(LevelVoxelizationData_GetWallComponentIndexAtWallLocation) == 0x000014, "Wrong size on LevelVoxelizationData_GetWallComponentIndexAtWallLocation");
static_assert(offsetof(LevelVoxelizationData_GetWallComponentIndexAtWallLocation, WallLocation) == 0x000000, "Member 'LevelVoxelizationData_GetWallComponentIndexAtWallLocation::WallLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallComponentIndexAtWallLocation, ReturnValue) == 0x000010, "Member 'LevelVoxelizationData_GetWallComponentIndexAtWallLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallComponentPathNameFromIndex
// 0x0018 (0x0018 - 0x0000)
struct LevelVoxelizationData_GetWallComponentPathNameFromIndex final
{
public:
	int32                                         ComponentIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallComponentPathNameFromIndex) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetWallComponentPathNameFromIndex");
static_assert(sizeof(LevelVoxelizationData_GetWallComponentPathNameFromIndex) == 0x000018, "Wrong size on LevelVoxelizationData_GetWallComponentPathNameFromIndex");
static_assert(offsetof(LevelVoxelizationData_GetWallComponentPathNameFromIndex, ComponentIndex) == 0x000000, "Member 'LevelVoxelizationData_GetWallComponentPathNameFromIndex::ComponentIndex' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallComponentPathNameFromIndex, ReturnValue) == 0x000008, "Member 'LevelVoxelizationData_GetWallComponentPathNameFromIndex::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallLocationForPrimitiveComponentAtVoxelLocation
// 0x0030 (0x0030 - 0x0000)
struct LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             VoxelLocation;                                     // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContextObject;                                // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoxelWallLocation                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation");
static_assert(sizeof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation) == 0x000030, "Wrong size on LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation, PrimitiveComponent) == 0x000000, "Member 'LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation, VoxelLocation) == 0x000008, "Member 'LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation::VoxelLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation, WorldContextObject) == 0x000018, "Member 'LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation, ReturnValue) == 0x000020, "Member 'LevelVoxelizationData_GetWallLocationForPrimitiveComponentAtVoxelLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallLocationsForPrimitiveComponentAtVoxelLocations
// 0x0030 (0x0030 - 0x0000)
struct LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     VoxelLocations;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoxelWallLocation>             ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations");
static_assert(sizeof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations) == 0x000030, "Wrong size on LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations, PrimitiveComponent) == 0x000000, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations, VoxelLocations) == 0x000008, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations::VoxelLocations' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations, WorldContextObject) == 0x000018, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations, ReturnValue) == 0x000020, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentAtVoxelLocations::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.GetWallLocationsForPrimitiveComponentInVoxelBounds
// 0x0038 (0x0038 - 0x0000)
struct LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             MinVoxelLocation;                                  // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             MaxVoxelLocation;                                  // 0x0014(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoxelWallLocation>             ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds) == 0x000008, "Wrong alignment on LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds");
static_assert(sizeof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds) == 0x000038, "Wrong size on LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds, PrimitiveComponent) == 0x000000, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds, MinVoxelLocation) == 0x000008, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds::MinVoxelLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds, MaxVoxelLocation) == 0x000014, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds::MaxVoxelLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds, WorldContextObject) == 0x000020, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds, ReturnValue) == 0x000028, "Member 'LevelVoxelizationData_GetWallLocationsForPrimitiveComponentInVoxelBounds::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.RayTraceThroughVoxels
// 0x0048 (0x0048 - 0x0000)
struct LevelVoxelizationData_RayTraceThroughVoxels final
{
public:
	struct FVector                                SourceLocation;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceDirection;                                    // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceDistance;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x001C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             OutHitVoxelLocation;                               // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutWorldLocation;                                  // 0x0034(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutHitPolygonIndex;                                // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelVoxelizationData_RayTraceThroughVoxels) == 0x000004, "Wrong alignment on LevelVoxelizationData_RayTraceThroughVoxels");
static_assert(sizeof(LevelVoxelizationData_RayTraceThroughVoxels) == 0x000048, "Wrong size on LevelVoxelizationData_RayTraceThroughVoxels");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, SourceLocation) == 0x000000, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::SourceLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, TraceDirection) == 0x00000C, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::TraceDirection' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, TraceDistance) == 0x000018, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::TraceDistance' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, LevelOffset) == 0x00001C, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::LevelOffset' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, OutHitVoxelLocation) == 0x000028, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::OutHitVoxelLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, OutWorldLocation) == 0x000034, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::OutWorldLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, OutHitPolygonIndex) == 0x000040, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::OutHitPolygonIndex' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraceThroughVoxels, ReturnValue) == 0x000044, "Member 'LevelVoxelizationData_RayTraceThroughVoxels::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.LevelVoxelizationData.RayTraverseThroughVoxels
// 0x0038 (0x0038 - 0x0000)
struct LevelVoxelizationData_RayTraverseThroughVoxels final
{
public:
	struct FVector                                SourceLocation;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceDirection;                                    // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceDistance;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x001C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             OutHitVoxelLocation;                               // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelVoxelizationData_RayTraverseThroughVoxels) == 0x000004, "Wrong alignment on LevelVoxelizationData_RayTraverseThroughVoxels");
static_assert(sizeof(LevelVoxelizationData_RayTraverseThroughVoxels) == 0x000038, "Wrong size on LevelVoxelizationData_RayTraverseThroughVoxels");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, SourceLocation) == 0x000000, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::SourceLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, TraceDirection) == 0x00000C, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::TraceDirection' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, TraceDistance) == 0x000018, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::TraceDistance' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, LevelOffset) == 0x00001C, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::LevelOffset' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, OutHitVoxelLocation) == 0x000028, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::OutHitVoxelLocation' has a wrong offset!");
static_assert(offsetof(LevelVoxelizationData_RayTraverseThroughVoxels, ReturnValue) == 0x000034, "Member 'LevelVoxelizationData_RayTraverseThroughVoxels::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetVoxelDataForLevelByName
// 0x0010 (0x0010 - 0x0000)
struct BatchedLevelVoxelization_GetVoxelDataForLevelByName final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelVoxelizationData*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetVoxelDataForLevelByName) == 0x000008, "Wrong alignment on BatchedLevelVoxelization_GetVoxelDataForLevelByName");
static_assert(sizeof(BatchedLevelVoxelization_GetVoxelDataForLevelByName) == 0x000010, "Wrong size on BatchedLevelVoxelization_GetVoxelDataForLevelByName");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelDataForLevelByName, LevelName) == 0x000000, "Member 'BatchedLevelVoxelization_GetVoxelDataForLevelByName::LevelName' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelDataForLevelByName, ReturnValue) == 0x000008, "Member 'BatchedLevelVoxelization_GetVoxelDataForLevelByName::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetVoxelLocation2DFromWorldLocation2D
// 0x0018 (0x0018 - 0x0000)
struct BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D final
{
public:
	struct FVector2D                              WorldLocation2D;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LevelOffset2D;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D) == 0x000004, "Wrong alignment on BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D");
static_assert(sizeof(BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D) == 0x000018, "Wrong size on BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D, WorldLocation2D) == 0x000000, "Member 'BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D::WorldLocation2D' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D, LevelOffset2D) == 0x000008, "Member 'BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D::LevelOffset2D' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D, ReturnValue) == 0x000010, "Member 'BatchedLevelVoxelization_GetVoxelLocation2DFromWorldLocation2D::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetVoxelLocationFromWorldLocation
// 0x0024 (0x0024 - 0x0000)
struct BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation) == 0x000004, "Wrong alignment on BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation");
static_assert(sizeof(BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation) == 0x000024, "Wrong size on BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation, WorldLocation) == 0x000000, "Member 'BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation::WorldLocation' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation, LevelOffset) == 0x00000C, "Member 'BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation::LevelOffset' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation, ReturnValue) == 0x000018, "Member 'BatchedLevelVoxelization_GetVoxelLocationFromWorldLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetWorldCenterLocation2DFromVoxelLocation2D
// 0x0018 (0x0018 - 0x0000)
struct BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D final
{
public:
	struct FIntPoint                              VoxelLocation2D;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LevelOffset2D;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D) == 0x000004, "Wrong alignment on BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D");
static_assert(sizeof(BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D) == 0x000018, "Wrong size on BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D, VoxelLocation2D) == 0x000000, "Member 'BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D::VoxelLocation2D' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D, LevelOffset2D) == 0x000008, "Member 'BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D::LevelOffset2D' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D, ReturnValue) == 0x000010, "Member 'BatchedLevelVoxelization_GetWorldCenterLocation2DFromVoxelLocation2D::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetWorldCenterLocationFromVoxelLocation
// 0x0024 (0x0024 - 0x0000)
struct BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation final
{
public:
	struct FIntVector                             VoxelLocation;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation) == 0x000004, "Wrong alignment on BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation");
static_assert(sizeof(BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation) == 0x000024, "Wrong size on BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation, VoxelLocation) == 0x000000, "Member 'BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation::VoxelLocation' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation, LevelOffset) == 0x00000C, "Member 'BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation::LevelOffset' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation, ReturnValue) == 0x000018, "Member 'BatchedLevelVoxelization_GetWorldCenterLocationFromVoxelLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.BatchedLevelVoxelization.GetWorldCornerLocationFromVoxelLocation
// 0x0024 (0x0024 - 0x0000)
struct BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation final
{
public:
	struct FIntVector                             VoxelLocation;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation) == 0x000004, "Wrong alignment on BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation");
static_assert(sizeof(BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation) == 0x000024, "Wrong size on BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation, VoxelLocation) == 0x000000, "Member 'BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation::VoxelLocation' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation, LevelOffset) == 0x00000C, "Member 'BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation::LevelOffset' has a wrong offset!");
static_assert(offsetof(BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation, ReturnValue) == 0x000018, "Member 'BatchedLevelVoxelization_GetWorldCornerLocationFromVoxelLocation::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.VoxelActorComponent.GetVoxelLevelManager
// 0x0008 (0x0008 - 0x0000)
struct VoxelActorComponent_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoxelActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong alignment on VoxelActorComponent_GetVoxelLevelManager");
static_assert(sizeof(VoxelActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong size on VoxelActorComponent_GetVoxelLevelManager");
static_assert(offsetof(VoxelActorComponent_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'VoxelActorComponent_GetVoxelLevelManager::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.VoxelActorComponent.SetHalfExtent
// 0x000C (0x000C - 0x0000)
struct VoxelActorComponent_SetHalfExtent final
{
public:
	struct FVector                                InHalfExtent;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoxelActorComponent_SetHalfExtent) == 0x000004, "Wrong alignment on VoxelActorComponent_SetHalfExtent");
static_assert(sizeof(VoxelActorComponent_SetHalfExtent) == 0x00000C, "Wrong size on VoxelActorComponent_SetHalfExtent");
static_assert(offsetof(VoxelActorComponent_SetHalfExtent, InHalfExtent) == 0x000000, "Member 'VoxelActorComponent_SetHalfExtent::InHalfExtent' has a wrong offset!");

// Function LevelVoxelization.CullableVoxelActorComponent.SetRoomAssignmentType
// 0x0002 (0x0002 - 0x0000)
struct CullableVoxelActorComponent_SetRoomAssignmentType final
{
public:
	ECullableRoomAssignmentType                   NewAssignmentType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CullableVoxelActorComponent_SetRoomAssignmentType) == 0x000001, "Wrong alignment on CullableVoxelActorComponent_SetRoomAssignmentType");
static_assert(sizeof(CullableVoxelActorComponent_SetRoomAssignmentType) == 0x000002, "Wrong size on CullableVoxelActorComponent_SetRoomAssignmentType");
static_assert(offsetof(CullableVoxelActorComponent_SetRoomAssignmentType, NewAssignmentType) == 0x000000, "Member 'CullableVoxelActorComponent_SetRoomAssignmentType::NewAssignmentType' has a wrong offset!");
static_assert(offsetof(CullableVoxelActorComponent_SetRoomAssignmentType, ReturnValue) == 0x000001, "Member 'CullableVoxelActorComponent_SetRoomAssignmentType::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.CullableVoxelActorComponent.UpdateSunLightChannel
// 0x0001 (0x0001 - 0x0000)
struct CullableVoxelActorComponent_UpdateSunLightChannel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CullableVoxelActorComponent_UpdateSunLightChannel) == 0x000001, "Wrong alignment on CullableVoxelActorComponent_UpdateSunLightChannel");
static_assert(sizeof(CullableVoxelActorComponent_UpdateSunLightChannel) == 0x000001, "Wrong size on CullableVoxelActorComponent_UpdateSunLightChannel");
static_assert(offsetof(CullableVoxelActorComponent_UpdateSunLightChannel, ReturnValue) == 0x000000, "Member 'CullableVoxelActorComponent_UpdateSunLightChannel::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.CullableVoxelActorComponent.IsVisibleToCullingCamera
// 0x0001 (0x0001 - 0x0000)
struct CullableVoxelActorComponent_IsVisibleToCullingCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CullableVoxelActorComponent_IsVisibleToCullingCamera) == 0x000001, "Wrong alignment on CullableVoxelActorComponent_IsVisibleToCullingCamera");
static_assert(sizeof(CullableVoxelActorComponent_IsVisibleToCullingCamera) == 0x000001, "Wrong size on CullableVoxelActorComponent_IsVisibleToCullingCamera");
static_assert(offsetof(CullableVoxelActorComponent_IsVisibleToCullingCamera, ReturnValue) == 0x000000, "Member 'CullableVoxelActorComponent_IsVisibleToCullingCamera::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.CullableExteriorActorComponent.GetVoxelLevelManager
// 0x0008 (0x0008 - 0x0000)
struct CullableExteriorActorComponent_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CullableExteriorActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong alignment on CullableExteriorActorComponent_GetVoxelLevelManager");
static_assert(sizeof(CullableExteriorActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong size on CullableExteriorActorComponent_GetVoxelLevelManager");
static_assert(offsetof(CullableExteriorActorComponent_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'CullableExteriorActorComponent_GetVoxelLevelManager::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.ScannableVoxelActorComponent.GetVoxelLevelManager
// 0x0008 (0x0008 - 0x0000)
struct ScannableVoxelActorComponent_GetVoxelLevelManager final
{
public:
	class UVoxelLevelManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScannableVoxelActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong alignment on ScannableVoxelActorComponent_GetVoxelLevelManager");
static_assert(sizeof(ScannableVoxelActorComponent_GetVoxelLevelManager) == 0x000008, "Wrong size on ScannableVoxelActorComponent_GetVoxelLevelManager");
static_assert(offsetof(ScannableVoxelActorComponent_GetVoxelLevelManager, ReturnValue) == 0x000000, "Member 'ScannableVoxelActorComponent_GetVoxelLevelManager::ReturnValue' has a wrong offset!");

// Function LevelVoxelization.ScannableVoxelActorComponent.SetBillboardIconMaterial
// 0x0008 (0x0008 - 0x0000)
struct ScannableVoxelActorComponent_SetBillboardIconMaterial final
{
public:
	class UMaterialInterface*                     NewMaterial;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScannableVoxelActorComponent_SetBillboardIconMaterial) == 0x000008, "Wrong alignment on ScannableVoxelActorComponent_SetBillboardIconMaterial");
static_assert(sizeof(ScannableVoxelActorComponent_SetBillboardIconMaterial) == 0x000008, "Wrong size on ScannableVoxelActorComponent_SetBillboardIconMaterial");
static_assert(offsetof(ScannableVoxelActorComponent_SetBillboardIconMaterial, NewMaterial) == 0x000000, "Member 'ScannableVoxelActorComponent_SetBillboardIconMaterial::NewMaterial' has a wrong offset!");

// Function LevelVoxelization.ScannableVoxelActorComponent.SetBillboardIconShouldRotate
// 0x0001 (0x0001 - 0x0000)
struct ScannableVoxelActorComponent_SetBillboardIconShouldRotate final
{
public:
	bool                                          bShouldRotate;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScannableVoxelActorComponent_SetBillboardIconShouldRotate) == 0x000001, "Wrong alignment on ScannableVoxelActorComponent_SetBillboardIconShouldRotate");
static_assert(sizeof(ScannableVoxelActorComponent_SetBillboardIconShouldRotate) == 0x000001, "Wrong size on ScannableVoxelActorComponent_SetBillboardIconShouldRotate");
static_assert(offsetof(ScannableVoxelActorComponent_SetBillboardIconShouldRotate, bShouldRotate) == 0x000000, "Member 'ScannableVoxelActorComponent_SetBillboardIconShouldRotate::bShouldRotate' has a wrong offset!");

// Function LevelVoxelization.ScannableVoxelActorComponent.SetInitialMeshMaterial
// 0x0008 (0x0008 - 0x0000)
