#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelAtmosphere

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LevelAtmosphere.LevelAtmosphere_C
// 0x0020 (0x0240 - 0x0220)
class ALevelAtmosphere_C final : public AActor
{
public:
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelAtmosphere_C">();
	}
	static class ALevelAtmosphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelAtmosphere_C>();
	}
};
static_assert(alignof(ALevelAtmosphere_C) == 0x000008, "Wrong alignment on ALevelAtmosphere_C");
static_assert(sizeof(ALevelAtmosphere_C) == 0x000240, "Wrong size on ALevelAtmosphere_C");
static_assert(offsetof(ALevelAtmosphere_C, ExponentialHeightFog) == 0x000220, "Member 'ALevelAtmosphere_C::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(ALevelAtmosphere_C, PostProcess) == 0x000228, "Member 'ALevelAtmosphere_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ALevelAtmosphere_C, SkyLight) == 0x000230, "Member 'ALevelAtmosphere_C::SkyLight' has a wrong offset!");
static_assert(offsetof(ALevelAtmosphere_C, SharedRoot) == 0x000238, "Member 'ALevelAtmosphere_C::SharedRoot' has a wrong offset!");

}

