#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootTableFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "STRUCT_LootTableEntry_structs.hpp"
#include "STRUCT_EmbeddedLootTable_structs.hpp"
#include "STRUCT_LootBonusData_structs.hpp"


namespace SDK::Params
{

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GetLootEntryHasContent
// 0x0050 (0x0050 - 0x0000)
struct LootTableFunctionLibrary_C_GetLootEntryHasContent final
{
public:
	struct FSTRUCT_LootTableEntry                 LootEntry;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_GetLootEntryHasContent) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GetLootEntryHasContent");
static_assert(sizeof(LootTableFunctionLibrary_C_GetLootEntryHasContent) == 0x000050, "Wrong size on LootTableFunctionLibrary_C_GetLootEntryHasContent");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, LootEntry) == 0x000000, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::LootEntry' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, __WorldContext) == 0x000040, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, Result) == 0x000048, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::Result' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000049, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, CallFunc_Greater_IntInt_ReturnValue) == 0x00004A, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, CallFunc_IsValid_ReturnValue) == 0x00004B, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntryHasContent, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'LootTableFunctionLibrary_C_GetLootEntryHasContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.CanLootItemReceiveBonus
// 0x0050 (0x0050 - 0x0000)
struct LootTableFunctionLibrary_C_CanLootItemReceiveBonus final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_CanLootItemReceiveBonus");
static_assert(sizeof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus) == 0x000050, "Wrong size on LootTableFunctionLibrary_C_CanLootItemReceiveBonus");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, ItemClass) == 0x000000, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::ItemClass' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, BonusData) == 0x000008, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::BonusData' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, __WorldContext) == 0x000020, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, Result) == 0x000028, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::Result' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, CallFunc_Array_Get_Item) == 0x000038, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_CanLootItemReceiveBonus, CallFunc_ClassIsChildOf_ReturnValue) == 0x00004C, "Member 'LootTableFunctionLibrary_C_CanLootItemReceiveBonus::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GetLootItemCountWithBonusData
// 0x00A0 (0x00A0 - 0x0000)
struct LootTableFunctionLibrary_C_GetLootItemCountWithBonusData final
{
public:
	class UClass*                                 ItemClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomStream;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	struct FSTRUCT_LootTableEntry                 LootEntry;                                         // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FractionalItemCount;                               // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatFromStream_ReturnValue;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanLootItemReceiveBonus_Result;           // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GetLootItemCountWithBonusData");
static_assert(sizeof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData) == 0x0000A0, "Wrong size on LootTableFunctionLibrary_C_GetLootItemCountWithBonusData");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, ItemClass) == 0x000000, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::ItemClass' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, RandomStream) == 0x000008, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, LootEntry) == 0x000010, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::LootEntry' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, BonusData) == 0x000050, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::BonusData' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, __WorldContext) == 0x000068, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, Result) == 0x000070, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::Result' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, FractionalItemCount) == 0x000074, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::FractionalItemCount' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_RandomFloatFromStream_ReturnValue) == 0x00007C, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_RandomFloatFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_FTrunc_ReturnValue) == 0x000084, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_FTrunc_ReturnValue_1) == 0x000088, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00008C, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_CanLootItemReceiveBonus_Result) == 0x00008D, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_CanLootItemReceiveBonus_Result' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000090, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000094, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Fraction_ReturnValue) == 0x000098, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootItemCountWithBonusData, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'LootTableFunctionLibrary_C_GetLootItemCountWithBonusData::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GetRandomSelectionFromLootEntries
// 0x0030 (0x0030 - 0x0000)
struct LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries final
{
public:
	TArray<struct FSTRUCT_LootTableEntry>         LootEntries;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultIndex;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeightedRandomIndexFromStructArrayWithStream_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries");
static_assert(sizeof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries) == 0x000030, "Wrong size on LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, LootEntries) == 0x000000, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::LootEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, RandomStream) == 0x000010, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, __WorldContext) == 0x000018, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, ResultIndex) == 0x000020, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::ResultIndex' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, SelectedIndex) == 0x000024, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::SelectedIndex' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries, CallFunc_GetWeightedRandomIndexFromStructArrayWithStream_ReturnValue) == 0x000028, "Member 'LootTableFunctionLibrary_C_GetRandomSelectionFromLootEntries::CallFunc_GetWeightedRandomIndexFromStructArrayWithStream_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GenerateRandomSelectionsFromLootEntries
// 0x0078 (0x0078 - 0x0000)
struct LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries final
{
public:
	TArray<struct FSTRUCT_LootTableEntry>         LootEntries;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         SelectionCount;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ResultIndices;                                     // 0x0028(0x0010)(Parm, OutParm)
	int32                                         SelectedIndex;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SelectedIndices;                                   // 0x0040(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRandomSelectionFromLootEntries_ResultIndex; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries");
static_assert(sizeof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries) == 0x000078, "Wrong size on LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, LootEntries) == 0x000000, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::LootEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, RandomStream) == 0x000010, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, SelectionCount) == 0x000018, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::SelectionCount' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, __WorldContext) == 0x000020, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, ResultIndices) == 0x000028, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::ResultIndices' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, SelectedIndex) == 0x000038, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::SelectedIndex' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, SelectedIndices) == 0x000040, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::SelectedIndices' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, Temp_int_Variable) == 0x000050, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000060, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Min_ReturnValue) == 0x000064, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_GetRandomSelectionFromLootEntries_ResultIndex) == 0x000070, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_GetRandomSelectionFromLootEntries_ResultIndex' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000074, "Member 'LootTableFunctionLibrary_C_GenerateRandomSelectionsFromLootEntries::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GetLootEntriesFromDataTable
// 0x00A8 (0x00A8 - 0x0000)
struct LootTableFunctionLibrary_C_GetLootEntriesFromDataTable final
{
public:
	class UDataTable*                             LootTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_LootTableEntry>         ResultEntries;                                     // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FSTRUCT_LootTableEntry>         LootEntries;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_LootTableEntry                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GetLootEntriesFromDataTable");
static_assert(sizeof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable) == 0x0000A8, "Wrong size on LootTableFunctionLibrary_C_GetLootEntriesFromDataTable");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, LootTable) == 0x000000, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::LootTable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, __WorldContext) == 0x000008, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, ResultEntries) == 0x000010, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::ResultEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, LootEntries) == 0x000020, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::LootEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000030, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, Temp_int_Array_Index_Variable) == 0x000040, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_Array_Get_Item) == 0x000048, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GetLootEntriesFromDataTable, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'LootTableFunctionLibrary_C_GetLootEntriesFromDataTable::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GenerateLootFromDataTable
// 0x0050 (0x0050 - 0x0000)
struct LootTableFunctionLibrary_C_GenerateLootFromDataTable final
{
public:
	class UDataTable*                             LootTable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomStream;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         SelectionCount;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTRUCT_LootTableEntry>         CallFunc_GetLootEntriesFromDataTable_ResultEntries; // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(LootTableFunctionLibrary_C_GenerateLootFromDataTable) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GenerateLootFromDataTable");
static_assert(sizeof(LootTableFunctionLibrary_C_GenerateLootFromDataTable) == 0x000050, "Wrong size on LootTableFunctionLibrary_C_GenerateLootFromDataTable");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, LootTable) == 0x000000, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::LootTable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, RandomStream) == 0x000008, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, SelectionCount) == 0x000010, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::SelectionCount' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, Inventory) == 0x000018, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::Inventory' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, BonusData) == 0x000020, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::BonusData' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, __WorldContext) == 0x000038, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromDataTable, CallFunc_GetLootEntriesFromDataTable_ResultEntries) == 0x000040, "Member 'LootTableFunctionLibrary_C_GenerateLootFromDataTable::CallFunc_GetLootEntriesFromDataTable_ResultEntries' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GenerateLootFromEmbeddedTable
// 0x0048 (0x0048 - 0x0000)
struct LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable final
{
public:
	struct FSTRUCT_EmbeddedLootTable              EmbeddedTable;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FRandomStream                          RandomStream;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable");
static_assert(sizeof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable) == 0x000048, "Wrong size on LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable, EmbeddedTable) == 0x000000, "Member 'LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable::EmbeddedTable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable, RandomStream) == 0x000018, "Member 'LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable, Inventory) == 0x000020, "Member 'LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable::Inventory' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable, BonusData) == 0x000028, "Member 'LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable::BonusData' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable, __WorldContext) == 0x000040, "Member 'LootTableFunctionLibrary_C_GenerateLootFromEmbeddedTable::__WorldContext' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GenerateLootFromLootEntries
// 0x0078 (0x0078 - 0x0000)
struct LootTableFunctionLibrary_C_GenerateLootFromLootEntries final
{
public:
	TArray<struct FSTRUCT_LootTableEntry>         LootEntries;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         SelectionCount;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GenerateRandomSelectionsFromLootEntries_ResultIndices; // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GenerateLootFromLootEntries");
static_assert(sizeof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries) == 0x000078, "Wrong size on LootTableFunctionLibrary_C_GenerateLootFromLootEntries");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, LootEntries) == 0x000000, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::LootEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, RandomStream) == 0x000010, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::RandomStream' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, SelectionCount) == 0x000018, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::SelectionCount' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, Inventory) == 0x000020, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::Inventory' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, BonusData) == 0x000028, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::BonusData' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, __WorldContext) == 0x000040, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::__WorldContext' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, Temp_int_Array_Index_Variable) == 0x000048, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, CallFunc_GenerateRandomSelectionsFromLootEntries_ResultIndices) == 0x000058, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::CallFunc_GenerateRandomSelectionsFromLootEntries_ResultIndices' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, CallFunc_Array_Get_Item) == 0x00006C, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromLootEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'LootTableFunctionLibrary_C_GenerateLootFromLootEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LootTableFunctionLibrary.LootTableFunctionLibrary_C.GenerateLootFromSelectedEntry
// 0x0170 (0x0170 - 0x0000)
struct LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry final
{
public:
	TArray<struct FSTRUCT_LootTableEntry>         LootEntries;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FRandomStream                          RandomStream;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         SelectedIndex;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      Inventory;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootBonusData                  BonusData;                                         // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GrantResult;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ItemClass;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_LootTableEntry                 SelectedEntry;                                     // 0x0058(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTRUCT_LootTableEntry                 CallFunc_Array_Get_Item;                           // 0x0098(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLootItemCountWithBonusData_Result;     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0158(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrantItem_Result;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry) == 0x000008, "Wrong alignment on LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry");
static_assert(sizeof(LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry) == 0x000170, "Wrong size on LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry, LootEntries) == 0x000000, "Member 'LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry::LootEntries' has a wrong offset!");
static_assert(offsetof(LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry, RandomStream) == 0x000010, "Member 'LootTableFunctionLibrary_C_GenerateLootFromSelectedEntry::RandomStream' has a wrong offset!");
