#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Maintenance_Floor_TrimLights_On

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Maintenance_Floor_TrimLights_On.Maintenance_Floor_TrimLights_On_C
// 0x0028 (0x0248 - 0x0220)
class AMaintenance_Floor_TrimLights_On_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Lightbar2;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Lightbar;                                          // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Maintenance_Floor_TrimLights_On_C">();
	}
	static class AMaintenance_Floor_TrimLights_On_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMaintenance_Floor_TrimLights_On_C>();
	}
};
static_assert(alignof(AMaintenance_Floor_TrimLights_On_C) == 0x000008, "Wrong alignment on AMaintenance_Floor_TrimLights_On_C");
static_assert(sizeof(AMaintenance_Floor_TrimLights_On_C) == 0x000248, "Wrong size on AMaintenance_Floor_TrimLights_On_C");
static_assert(offsetof(AMaintenance_Floor_TrimLights_On_C, StaticMeshComponent0) == 0x000220, "Member 'AMaintenance_Floor_TrimLights_On_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AMaintenance_Floor_TrimLights_On_C, Lightbar2) == 0x000228, "Member 'AMaintenance_Floor_TrimLights_On_C::Lightbar2' has a wrong offset!");
static_assert(offsetof(AMaintenance_Floor_TrimLights_On_C, Lightbar) == 0x000230, "Member 'AMaintenance_Floor_TrimLights_On_C::Lightbar' has a wrong offset!");
static_assert(offsetof(AMaintenance_Floor_TrimLights_On_C, LightColor) == 0x000238, "Member 'AMaintenance_Floor_TrimLights_On_C::LightColor' has a wrong offset!");

}

