#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Medical_Shelves_Lit

#include "Basic.hpp"


namespace SDK::Params
{

// Function Medical_Shelves_Lit.Medical_Shelves_Lit_C.ExecuteUbergraph_Medical_Shelves_Lit
// 0x0010 (0x0010 - 0x0000)
struct Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit) == 0x000004, "Wrong alignment on Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit");
static_assert(sizeof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit) == 0x000010, "Wrong size on Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit");
static_assert(offsetof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit, EntryPoint) == 0x000000, "Member 'Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit::EntryPoint' has a wrong offset!");
static_assert(offsetof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit, CallFunc_RandomFloat_ReturnValue) == 0x00000C, "Member 'Medical_Shelves_Lit_C_ExecuteUbergraph_Medical_Shelves_Lit::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");

// Function Medical_Shelves_Lit.Medical_Shelves_Lit_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Medical_Shelves_Lit_C_UserConstructionScript final
{
public:
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Medical_Shelves_Lit_C_UserConstructionScript) == 0x000008, "Wrong alignment on Medical_Shelves_Lit_C_UserConstructionScript");
static_assert(sizeof(Medical_Shelves_Lit_C_UserConstructionScript) == 0x000010, "Wrong size on Medical_Shelves_Lit_C_UserConstructionScript");
static_assert(offsetof(Medical_Shelves_Lit_C_UserConstructionScript, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'Medical_Shelves_Lit_C_UserConstructionScript::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Medical_Shelves_Lit_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Medical_Shelves_Lit_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

