#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Medical_Shelves_Lit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Medical_Shelves_Lit.Medical_Shelves_Lit_C
// 0x0040 (0x0260 - 0x0220)
class AMedical_Shelves_Lit_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LightFlicker_Brightness_238B2311400B0046785AB9AACFCA0731; // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LightFlicker__Direction_238B2311400B0046785AB9AACFCA0731; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LightFlicker;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flickering;                                        // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmissiveStrength;                                  // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Medical_Shelves_Lit(int32 EntryPoint);
	void ReceiveBeginPlay();
	void LightFlicker__Click__EventFunc();
	void LightFlicker__UpdateFunc();
	void LightFlicker__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Medical_Shelves_Lit_C">();
	}
	static class AMedical_Shelves_Lit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMedical_Shelves_Lit_C>();
	}
};
static_assert(alignof(AMedical_Shelves_Lit_C) == 0x000008, "Wrong alignment on AMedical_Shelves_Lit_C");
static_assert(sizeof(AMedical_Shelves_Lit_C) == 0x000260, "Wrong size on AMedical_Shelves_Lit_C");
static_assert(offsetof(AMedical_Shelves_Lit_C, UberGraphFrame) == 0x000220, "Member 'AMedical_Shelves_Lit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, SpotLight) == 0x000228, "Member 'AMedical_Shelves_Lit_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, StaticMesh) == 0x000230, "Member 'AMedical_Shelves_Lit_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, LightFlicker_Brightness_238B2311400B0046785AB9AACFCA0731) == 0x000238, "Member 'AMedical_Shelves_Lit_C::LightFlicker_Brightness_238B2311400B0046785AB9AACFCA0731' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, LightFlicker__Direction_238B2311400B0046785AB9AACFCA0731) == 0x00023C, "Member 'AMedical_Shelves_Lit_C::LightFlicker__Direction_238B2311400B0046785AB9AACFCA0731' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, LightFlicker) == 0x000240, "Member 'AMedical_Shelves_Lit_C::LightFlicker' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, Flickering) == 0x000248, "Member 'AMedical_Shelves_Lit_C::Flickering' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, MaterialInstance) == 0x000250, "Member 'AMedical_Shelves_Lit_C::MaterialInstance' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, EmissiveStrength) == 0x000258, "Member 'AMedical_Shelves_Lit_C::EmissiveStrength' has a wrong offset!");
static_assert(offsetof(AMedical_Shelves_Lit_C, LightIntensity) == 0x00025C, "Member 'AMedical_Shelves_Lit_C::LightIntensity' has a wrong offset!");

}

