#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Medical_Light_Slope_Destroyed

#include "Basic.hpp"

#include "TILE_BrokenSingleLightPanel_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Medical_Light_Slope_Destroyed.Medical_Light_Slope_Destroyed_C
// 0x0090 (0x0340 - 0x02B0)
class AMedical_Light_Slope_Destroyed_C final : public ATILE_BrokenSingleLightPanel_C
{
public:
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_14;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_17;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_07;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_35;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_13;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_37;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_03;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_29;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_18;                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_38;                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_09;                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_36;                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_02;                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_010;                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_10;                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_39;                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BrokenGlass1;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Medical_Light_Slope_Destroyed_C">();
	}
	static class AMedical_Light_Slope_Destroyed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMedical_Light_Slope_Destroyed_C>();
	}
};
static_assert(alignof(AMedical_Light_Slope_Destroyed_C) == 0x000010, "Wrong alignment on AMedical_Light_Slope_Destroyed_C");
static_assert(sizeof(AMedical_Light_Slope_Destroyed_C) == 0x000340, "Wrong size on AMedical_Light_Slope_Destroyed_C");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_14) == 0x0002B0, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_14' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_17) == 0x0002B8, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_17' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_07) == 0x0002C0, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_07' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_35) == 0x0002C8, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_35' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_13) == 0x0002D0, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_13' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_37) == 0x0002D8, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_37' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_03) == 0x0002E0, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_03' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_29) == 0x0002E8, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_29' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_18) == 0x0002F0, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_18' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_38) == 0x0002F8, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_38' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_09) == 0x000300, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_09' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_36) == 0x000308, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_36' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_02) == 0x000310, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_02' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_010) == 0x000318, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_010' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_10) == 0x000320, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_10' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, SK_BrokenGlass_Piece_39) == 0x000328, "Member 'AMedical_Light_Slope_Destroyed_C::SK_BrokenGlass_Piece_39' has a wrong offset!");
static_assert(offsetof(AMedical_Light_Slope_Destroyed_C, BrokenGlass1) == 0x000330, "Member 'AMedical_Light_Slope_Destroyed_C::BrokenGlass1' has a wrong offset!");

}

