#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionWaypoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ENUM_GameDifficulty_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MissionWaypoint.MissionWaypoint_C
// 0x0028 (0x0248 - 0x0220)
class AMissionWaypoint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_ScannableObject;                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    WaypointHandle;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, NoDestructor)

public:
	void ExecuteUbergraph_MissionWaypoint(int32 EntryPoint);
	void ReceiveBeginPlay();
	void InitializeMissionWaypoint();
	void SetWaypointVisible(bool State);
	void EVENT_OnStoryQuestChanged(class FName StoryQuestName, bool Value);
	void EVENT_OnFinishedLoadingLevelCollection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionWaypoint_C">();
	}
	static class AMissionWaypoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMissionWaypoint_C>();
	}
};
static_assert(alignof(AMissionWaypoint_C) == 0x000008, "Wrong alignment on AMissionWaypoint_C");
static_assert(sizeof(AMissionWaypoint_C) == 0x000248, "Wrong size on AMissionWaypoint_C");
static_assert(offsetof(AMissionWaypoint_C, UberGraphFrame) == 0x000220, "Member 'AMissionWaypoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMissionWaypoint_C, Billboard) == 0x000228, "Member 'AMissionWaypoint_C::Billboard' has a wrong offset!");
static_assert(offsetof(AMissionWaypoint_C, COMP_ScannableObject) == 0x000230, "Member 'AMissionWaypoint_C::COMP_ScannableObject' has a wrong offset!");
static_assert(offsetof(AMissionWaypoint_C, WaypointHandle) == 0x000238, "Member 'AMissionWaypoint_C::WaypointHandle' has a wrong offset!");

}

