#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MOVECONTROL_CyberspaceTerminal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_MoveControlParams_structs.hpp"


namespace SDK::Params
{

// Function MOVECONTROL_CyberspaceTerminal.MOVECONTROL_CyberspaceTerminal_C.InitializeMoveControl
// 0x0068 (0x0068 - 0x0000)
struct MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl final
{
public:
	class APAWN_Hacker_Simple_C*                  Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GameTime;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MoveControlParams              InitialControlParams;                              // 0x000C(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeMoveControl_Result;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl) == 0x000008, "Wrong alignment on MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl");
static_assert(sizeof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl) == 0x000068, "Wrong size on MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, Player_0) == 0x000000, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::Player_0' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, GameTime) == 0x000008, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::GameTime' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, InitialControlParams) == 0x00000C, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::InitialControlParams' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, Result) == 0x000034, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::Result' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_InitializeMoveControl_Result) == 0x000035, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_InitializeMoveControl_Result' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Roll) == 0x000038, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Pitch) == 0x00003C, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Yaw) == 0x000040, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Roll_1) == 0x00004C, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Pitch_1) == 0x000050, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_BreakRotator_Yaw_1) == 0x000054, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'MOVECONTROL_CyberspaceTerminal_C_InitializeMoveControl::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function MOVECONTROL_CyberspaceTerminal.MOVECONTROL_CyberspaceTerminal_C.UpdateMoveControl
// 0x00E8 (0x00E8 - 0x0000)
struct MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl final
{
public:
	struct FVector2D                              MoveInput;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LookInput;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MoveControlParams              ControlParams;                                     // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ActionInputValues;                                 // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         MoveInputScale;                                    // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldExpire;                                      // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FreeRotateProgress;                                // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpProgress;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue_1;                      // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampPointToLozenge2D_ReturnValue;        // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl) == 0x000008, "Wrong alignment on MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl");
static_assert(sizeof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl) == 0x0000E8, "Wrong size on MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, MoveInput) == 0x000000, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::MoveInput' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, LookInput) == 0x000008, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::LookInput' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, ControlParams) == 0x000010, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::ControlParams' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, ActionInputValues) == 0x000038, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::ActionInputValues' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, MoveInputScale) == 0x000048, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::MoveInputScale' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, Delta_Time) == 0x00004C, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::Delta_Time' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, ShouldExpire) == 0x000050, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::ShouldExpire' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, FreeRotateProgress) == 0x000054, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::FreeRotateProgress' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, InterpProgress) == 0x000058, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::InterpProgress' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, ElapsedTime) == 0x00005C, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::ElapsedTime' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_FClamp_ReturnValue) == 0x000064, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Vector_Zero_ReturnValue) == 0x000068, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000074, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_VEase_ReturnValue) == 0x000080, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_VEase_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakVector_X) == 0x00008C, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakVector_Y) == 0x000090, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakVector_Z) == 0x000094, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_VEase_ReturnValue_1) == 0x000098, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_VEase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_FClamp_ReturnValue_1) == 0x0000A8, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x0000AC, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000B4, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_ClampPointToLozenge2D_ReturnValue) == 0x0000BC, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_ClampPointToLozenge2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_REase_ReturnValue) == 0x0000C4, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakRotator_Roll) == 0x0000D0, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakRotator_Pitch) == 0x0000D4, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_BreakRotator_Yaw) == 0x0000D8, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl, CallFunc_MakeVector_ReturnValue) == 0x0000DC, "Member 'MOVECONTROL_CyberspaceTerminal_C_UpdateMoveControl::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

