#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MOVECONTROL_Cryobed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MOVECONTROL_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MOVECONTROL_Cryobed.MOVECONTROL_Cryobed_C
// 0x0020 (0x00B8 - 0x0098)
class UMOVECONTROL_Cryobed_C final : public UMOVECONTROL_Base_C
{
public:
	struct FVector                                CryoLocation;                                      // 0x0094(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRotator                               CryoRotation;                                      // 0x00A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ExpireNextTick;                                    // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RelativeYawPitchOffset;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMoveControl(const struct FVector2D& MoveInput, const struct FVector2D& LookInput, const struct FSTRUCT_MoveControlParams& ControlParams, TArray<float>& ActionInputValues, float MoveInputScale, float Delta_Time, bool* ShouldExpire);
	void ExpireCryobedMovement();
	void InitializeMoveControl(class APAWN_Hacker_Simple_C* Player_0, float GameTime, const struct FSTRUCT_MoveControlParams& InitialControlParams, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MOVECONTROL_Cryobed_C">();
	}
	static class UMOVECONTROL_Cryobed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMOVECONTROL_Cryobed_C>();
	}
};
static_assert(alignof(UMOVECONTROL_Cryobed_C) == 0x000008, "Wrong alignment on UMOVECONTROL_Cryobed_C");
static_assert(sizeof(UMOVECONTROL_Cryobed_C) == 0x0000B8, "Wrong size on UMOVECONTROL_Cryobed_C");
static_assert(offsetof(UMOVECONTROL_Cryobed_C, CryoLocation) == 0x000094, "Member 'UMOVECONTROL_Cryobed_C::CryoLocation' has a wrong offset!");
static_assert(offsetof(UMOVECONTROL_Cryobed_C, CryoRotation) == 0x0000A0, "Member 'UMOVECONTROL_Cryobed_C::CryoRotation' has a wrong offset!");
static_assert(offsetof(UMOVECONTROL_Cryobed_C, ExpireNextTick) == 0x0000AC, "Member 'UMOVECONTROL_Cryobed_C::ExpireNextTick' has a wrong offset!");
static_assert(offsetof(UMOVECONTROL_Cryobed_C, RelativeYawPitchOffset) == 0x0000B0, "Member 'UMOVECONTROL_Cryobed_C::RelativeYawPitchOffset' has a wrong offset!");

}

