#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MOVECONTROL_FreeMove

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_MoveControlParams_structs.hpp"


namespace SDK::Params
{

// Function MOVECONTROL_FreeMove.MOVECONTROL_FreeMove_C.UpdateMoveControl
// 0x0070 (0x0070 - 0x0000)
struct MOVECONTROL_FreeMove_C_UpdateMoveControl final
{
public:
	struct FVector2D                              MoveInput;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LookInput;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MoveControlParams              ControlParams;                                     // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ActionInputValues;                                 // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         MoveInputScale;                                    // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldExpire;                                      // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MOVECONTROL_FreeMove_C_UpdateMoveControl) == 0x000008, "Wrong alignment on MOVECONTROL_FreeMove_C_UpdateMoveControl");
static_assert(sizeof(MOVECONTROL_FreeMove_C_UpdateMoveControl) == 0x000070, "Wrong size on MOVECONTROL_FreeMove_C_UpdateMoveControl");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, MoveInput) == 0x000000, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::MoveInput' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, LookInput) == 0x000008, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::LookInput' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, ControlParams) == 0x000010, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::ControlParams' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, ActionInputValues) == 0x000038, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::ActionInputValues' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, MoveInputScale) == 0x000048, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::MoveInputScale' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, Delta_Time) == 0x00004C, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::Delta_Time' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, ShouldExpire) == 0x000050, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::ShouldExpire' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000054, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOVECONTROL_FreeMove_C_UpdateMoveControl, CallFunc_Conv_Vector2DToVector_ReturnValue_1) == 0x000060, "Member 'MOVECONTROL_FreeMove_C_UpdateMoveControl::CallFunc_Conv_Vector2DToVector_ReturnValue_1' has a wrong offset!");

}

