#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NOTIFY_CameraShake

#include "Basic.hpp"


namespace SDK::Params
{

// Function NOTIFY_CameraShake.NOTIFY_CameraShake_C.Received_Notify
// 0x0028 (0x0028 - 0x0000)
struct NOTIFY_CameraShake_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NOTIFY_CameraShake_C_Received_Notify) == 0x000008, "Wrong alignment on NOTIFY_CameraShake_C_Received_Notify");
static_assert(sizeof(NOTIFY_CameraShake_C_Received_Notify) == 0x000028, "Wrong size on NOTIFY_CameraShake_C_Received_Notify");
static_assert(offsetof(NOTIFY_CameraShake_C_Received_Notify, MeshComp) == 0x000000, "Member 'NOTIFY_CameraShake_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(NOTIFY_CameraShake_C_Received_Notify, Animation) == 0x000008, "Member 'NOTIFY_CameraShake_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(NOTIFY_CameraShake_C_Received_Notify, ReturnValue) == 0x000010, "Member 'NOTIFY_CameraShake_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(NOTIFY_CameraShake_C_Received_Notify, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'NOTIFY_CameraShake_C_Received_Notify::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NOTIFY_CameraShake_C_Received_Notify, CallFunc_StartCameraShake_ReturnValue) == 0x000020, "Member 'NOTIFY_CameraShake_C_Received_Notify::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");

// Function NOTIFY_CameraShake.NOTIFY_CameraShake_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct NOTIFY_CameraShake_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(NOTIFY_CameraShake_C_GetNotifyName) == 0x000008, "Wrong alignment on NOTIFY_CameraShake_C_GetNotifyName");
static_assert(sizeof(NOTIFY_CameraShake_C_GetNotifyName) == 0x000010, "Wrong size on NOTIFY_CameraShake_C_GetNotifyName");
static_assert(offsetof(NOTIFY_CameraShake_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'NOTIFY_CameraShake_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

