#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_DetectionEvent

#include "Basic.hpp"

#include "ENUM_DetectionState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.InitializeDetectionEvent
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DetectionEvent_C_InitializeDetectionEvent final
{
public:
	class APAWN_SystemShockCharacter_C*           DetectedPawn_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_InitializeDetectionEvent) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_InitializeDetectionEvent");
static_assert(sizeof(OBJ_DetectionEvent_C_InitializeDetectionEvent) == 0x000010, "Wrong size on OBJ_DetectionEvent_C_InitializeDetectionEvent");
static_assert(offsetof(OBJ_DetectionEvent_C_InitializeDetectionEvent, DetectedPawn_0) == 0x000000, "Member 'OBJ_DetectionEvent_C_InitializeDetectionEvent::DetectedPawn_0' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_InitializeDetectionEvent, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000008, "Member 'OBJ_DetectionEvent_C_InitializeDetectionEvent::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.ResumeDetectionState
// 0x001C (0x001C - 0x0000)
struct OBJ_DetectionEvent_C_ResumeDetectionState final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastDetectionTimestamp_Result;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OBJ_DetectionEvent_C_ResumeDetectionState) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_ResumeDetectionState");
static_assert(sizeof(OBJ_DetectionEvent_C_ResumeDetectionState) == 0x00001C, "Wrong size on OBJ_DetectionEvent_C_ResumeDetectionState");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x00000C, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000010, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_GetLastDetectionTimestamp_Result) == 0x000014, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_GetLastDetectionTimestamp_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_Less_FloatFloat_ReturnValue) == 0x000018, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_ResumeDetectionState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'OBJ_DetectionEvent_C_ResumeDetectionState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.UpdateDetectionEvent
// 0x0064 (0x0064 - 0x0000)
struct OBJ_DetectionEvent_C_UpdateDetectionEvent final
{
public:
	float                                         GameTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloseRangeEnter;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloseRangeExit;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxForgetTime;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxForgetTime_Time;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAlertness_Alertness;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToEvent_Distance;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToEvent_Distance_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSinceLastEvent_Result;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSinceLastEvent_Result_1;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_UpdateDetectionEvent) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_UpdateDetectionEvent");
static_assert(sizeof(OBJ_DetectionEvent_C_UpdateDetectionEvent) == 0x000064, "Wrong size on OBJ_DetectionEvent_C_UpdateDetectionEvent");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, GameTime) == 0x000000, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::GameTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, DeltaTime) == 0x000004, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::DeltaTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CloseRangeEnter) == 0x000008, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CloseRangeEnter' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CloseRangeExit) == 0x00000C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CloseRangeExit' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, MaxForgetTime) == 0x000010, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::MaxForgetTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetMaxForgetTime_Time) == 0x00001C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetMaxForgetTime_Time' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetAlertness_Alertness) == 0x000024, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetAlertness_Alertness' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000028, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetDistanceToEvent_Distance) == 0x000034, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetDistanceToEvent_Distance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetDistanceToEvent_Distance_1) == 0x000038, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetDistanceToEvent_Distance_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00003D, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00003E, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00003F, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetTimeSinceLastEvent_Result) == 0x000044, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetTimeSinceLastEvent_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000048, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GetTimeSinceLastEvent_Result_1) == 0x00004C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GetTimeSinceLastEvent_Result_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000050, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000058, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_UpdateDetectionEvent, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'OBJ_DetectionEvent_C_UpdateDetectionEvent::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.SetDetectionState
// 0x0040 (0x0040 - 0x0000)
struct OBJ_DetectionEvent_C_SetDetectionState final
{
public:
	ENUM_DetectionState                           NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DetectionState                           OldState;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEventLocation_EventLocation;           // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_EnemyDetection_C*                 CallFunc_GetDetectionComponent_Result;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_EnemyDetection_C*                 CallFunc_GetDetectionComponent_Result_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDetectAnyEvents_Result;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_EnemyDetection_C*                 CallFunc_GetDetectionComponent_Result_2;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OBJ_DetectionEvent_C_SetDetectionState) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_SetDetectionState");
static_assert(sizeof(OBJ_DetectionEvent_C_SetDetectionState) == 0x000040, "Wrong size on OBJ_DetectionEvent_C_SetDetectionState");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, NewState) == 0x000000, "Member 'OBJ_DetectionEvent_C_SetDetectionState::NewState' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, OldState) == 0x000001, "Member 'OBJ_DetectionEvent_C_SetDetectionState::OldState' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_GetEventLocation_EventLocation) == 0x000008, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_GetEventLocation_EventLocation' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_GetDetectionComponent_Result) == 0x000018, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_GetDetectionComponent_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_GetDetectionComponent_Result_1) == 0x000020, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_GetDetectionComponent_Result_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_CanDetectAnyEvents_Result) == 0x000028, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_CanDetectAnyEvents_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_GetDetectionComponent_Result_2) == 0x000030, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_GetDetectionComponent_Result_2' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SetDetectionState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'OBJ_DetectionEvent_C_SetDetectionState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetLastSeenTimestamp
// 0x0004 (0x0004 - 0x0000)
struct OBJ_DetectionEvent_C_GetLastSeenTimestamp final
{
public:
	float                                         LastSeenTimestamp_0;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetLastSeenTimestamp) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetLastSeenTimestamp");
static_assert(sizeof(OBJ_DetectionEvent_C_GetLastSeenTimestamp) == 0x000004, "Wrong size on OBJ_DetectionEvent_C_GetLastSeenTimestamp");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastSeenTimestamp, LastSeenTimestamp_0) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetLastSeenTimestamp::LastSeenTimestamp_0' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetLastHeardTimestamp
// 0x0004 (0x0004 - 0x0000)
struct OBJ_DetectionEvent_C_GetLastHeardTimestamp final
{
public:
	float                                         LastHeardTimestamp_0;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetLastHeardTimestamp) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetLastHeardTimestamp");
static_assert(sizeof(OBJ_DetectionEvent_C_GetLastHeardTimestamp) == 0x000004, "Wrong size on OBJ_DetectionEvent_C_GetLastHeardTimestamp");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastHeardTimestamp, LastHeardTimestamp_0) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetLastHeardTimestamp::LastHeardTimestamp_0' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetOwnerActor
// 0x0018 (0x0018 - 0x0000)
struct OBJ_DetectionEvent_C_GetOwnerActor final
{
public:
	class AActor*                                 Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_EnemyDetection_C*                 CallFunc_GetDetectionComponent_Result;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetOwnerActor) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_GetOwnerActor");
static_assert(sizeof(OBJ_DetectionEvent_C_GetOwnerActor) == 0x000018, "Wrong size on OBJ_DetectionEvent_C_GetOwnerActor");
static_assert(offsetof(OBJ_DetectionEvent_C_GetOwnerActor, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetOwnerActor::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetOwnerActor, CallFunc_GetDetectionComponent_Result) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetOwnerActor::CallFunc_GetDetectionComponent_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetOwnerActor, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetOwnerActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetAttribManager
// 0x0018 (0x0018 - 0x0000)
struct OBJ_DetectionEvent_C_GetAttribManager final
{
public:
	class UAttribManagerComponent*                Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_Result;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetAttribManager) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_GetAttribManager");
static_assert(sizeof(OBJ_DetectionEvent_C_GetAttribManager) == 0x000018, "Wrong size on OBJ_DetectionEvent_C_GetAttribManager");
static_assert(offsetof(OBJ_DetectionEvent_C_GetAttribManager, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetAttribManager::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetAttribManager, CallFunc_GetOwnerActor_Result) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetAttribManager::CallFunc_GetOwnerActor_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetAttribManager, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetAttribManager::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetDetectionComponent
// 0x0020 (0x0020 - 0x0000)
struct OBJ_DetectionEvent_C_GetDetectionComponent final
{
public:
	class UCOMP_EnemyDetection_C*                 Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_EnemyDetection_C*                 K2Node_DynamicCast_AsCOMP_Enemy_Detection;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetDetectionComponent) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_GetDetectionComponent");
static_assert(sizeof(OBJ_DetectionEvent_C_GetDetectionComponent) == 0x000020, "Wrong size on OBJ_DetectionEvent_C_GetDetectionComponent");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDetectionComponent, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetDetectionComponent::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDetectionComponent, CallFunc_GetOuterObject_ReturnValue) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetDetectionComponent::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDetectionComponent, K2Node_DynamicCast_AsCOMP_Enemy_Detection) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetDetectionComponent::K2Node_DynamicCast_AsCOMP_Enemy_Detection' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDetectionComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OBJ_DetectionEvent_C_GetDetectionComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetDetectedPawn
// 0x0008 (0x0008 - 0x0000)
struct OBJ_DetectionEvent_C_GetDetectedPawn final
{
public:
	class APAWN_SystemShockCharacter_C*           Pawn;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetDetectedPawn) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_GetDetectedPawn");
static_assert(sizeof(OBJ_DetectionEvent_C_GetDetectedPawn) == 0x000008, "Wrong size on OBJ_DetectionEvent_C_GetDetectedPawn");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDetectedPawn, Pawn) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetDetectedPawn::Pawn' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetCurrentDetectionRating
// 0x0004 (0x0004 - 0x0000)
struct OBJ_DetectionEvent_C_GetCurrentDetectionRating final
{
public:
	float                                         DetectionRating;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetCurrentDetectionRating) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetCurrentDetectionRating");
static_assert(sizeof(OBJ_DetectionEvent_C_GetCurrentDetectionRating) == 0x000004, "Wrong size on OBJ_DetectionEvent_C_GetCurrentDetectionRating");
static_assert(offsetof(OBJ_DetectionEvent_C_GetCurrentDetectionRating, DetectionRating) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetCurrentDetectionRating::DetectionRating' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetIsIdentified
// 0x0002 (0x0002 - 0x0000)
struct OBJ_DetectionEvent_C_GetIsIdentified final
{
public:
	bool                                          IsDetected;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetIsIdentified) == 0x000001, "Wrong alignment on OBJ_DetectionEvent_C_GetIsIdentified");
static_assert(sizeof(OBJ_DetectionEvent_C_GetIsIdentified) == 0x000002, "Wrong size on OBJ_DetectionEvent_C_GetIsIdentified");
static_assert(offsetof(OBJ_DetectionEvent_C_GetIsIdentified, IsDetected) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetIsIdentified::IsDetected' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetIsIdentified, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'OBJ_DetectionEvent_C_GetIsIdentified::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetEventLocation
// 0x002C (0x002C - 0x0000)
struct OBJ_DetectionEvent_C_GetEventLocation final
{
public:
	struct FVector                                EventLocation;                                     // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsIdentified_IsDetected;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetEventLocation) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetEventLocation");
static_assert(sizeof(OBJ_DetectionEvent_C_GetEventLocation) == 0x00002C, "Wrong size on OBJ_DetectionEvent_C_GetEventLocation");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, EventLocation) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetEventLocation::EventLocation' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, CallFunc_GetIsIdentified_IsDetected) == 0x00000C, "Member 'OBJ_DetectionEvent_C_GetEventLocation::CallFunc_GetIsIdentified_IsDetected' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'OBJ_DetectionEvent_C_GetEventLocation::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, Temp_bool_Variable) == 0x00000E, "Member 'OBJ_DetectionEvent_C_GetEventLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetEventLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, K2Node_Select_Default) == 0x00001C, "Member 'OBJ_DetectionEvent_C_GetEventLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetEventLocation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'OBJ_DetectionEvent_C_GetEventLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.SeePawn
// 0x0020 (0x0020 - 0x0000)
struct OBJ_DetectionEvent_C_SeePawn final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceAlpha;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarDistance;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearDistance;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_SeePawn) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_SeePawn");
static_assert(sizeof(OBJ_DetectionEvent_C_SeePawn) == 0x000020, "Wrong size on OBJ_DetectionEvent_C_SeePawn");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, CurrentTime) == 0x000000, "Member 'OBJ_DetectionEvent_C_SeePawn::CurrentTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, DistanceAlpha) == 0x000004, "Member 'OBJ_DetectionEvent_C_SeePawn::DistanceAlpha' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, FarDistance) == 0x000008, "Member 'OBJ_DetectionEvent_C_SeePawn::FarDistance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, NearDistance) == 0x00000C, "Member 'OBJ_DetectionEvent_C_SeePawn::NearDistance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, ElapsedTime) == 0x000010, "Member 'OBJ_DetectionEvent_C_SeePawn::ElapsedTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeePawn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'OBJ_DetectionEvent_C_SeePawn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.SeeEvent
// 0x0050 (0x0050 - 0x0000)
struct OBJ_DetectionEvent_C_SeeEvent final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceAlpha;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarDistance;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearDistance;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlertness_Alertness;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToEvent_Distance;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDetectable_IsDetectable;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_SeeEvent) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_SeeEvent");
static_assert(sizeof(OBJ_DetectionEvent_C_SeeEvent) == 0x000050, "Wrong size on OBJ_DetectionEvent_C_SeeEvent");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CurrentTime) == 0x000000, "Member 'OBJ_DetectionEvent_C_SeeEvent::CurrentTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, Location) == 0x000004, "Member 'OBJ_DetectionEvent_C_SeeEvent::Location' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, DistanceAlpha) == 0x000010, "Member 'OBJ_DetectionEvent_C_SeeEvent::DistanceAlpha' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, FarDistance) == 0x000014, "Member 'OBJ_DetectionEvent_C_SeeEvent::FarDistance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, NearDistance) == 0x000018, "Member 'OBJ_DetectionEvent_C_SeeEvent::NearDistance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, ElapsedTime) == 0x00001C, "Member 'OBJ_DetectionEvent_C_SeeEvent::ElapsedTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_GetAlertness_Alertness) == 0x000020, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_GetAlertness_Alertness' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Ease_ReturnValue) == 0x000024, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_GetDistanceToEvent_Distance) == 0x000028, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_GetDistanceToEvent_Distance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_IsDetectable_IsDetectable) == 0x000030, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_IsDetectable_IsDetectable' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000034, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000044, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_SeeEvent, CallFunc_FClamp_ReturnValue_1) == 0x00004C, "Member 'OBJ_DetectionEvent_C_SeeEvent::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.HearPawn
// 0x0014 (0x0014 - 0x0000)
struct OBJ_DetectionEvent_C_HearPawn final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Loudness;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_HearPawn) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_HearPawn");
static_assert(sizeof(OBJ_DetectionEvent_C_HearPawn) == 0x000014, "Wrong size on OBJ_DetectionEvent_C_HearPawn");
static_assert(offsetof(OBJ_DetectionEvent_C_HearPawn, CurrentTime) == 0x000000, "Member 'OBJ_DetectionEvent_C_HearPawn::CurrentTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_HearPawn, Loudness) == 0x000004, "Member 'OBJ_DetectionEvent_C_HearPawn::Loudness' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_HearPawn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'OBJ_DetectionEvent_C_HearPawn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetLastSeenLocation
// 0x000C (0x000C - 0x0000)
struct OBJ_DetectionEvent_C_GetLastSeenLocation final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetLastSeenLocation) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetLastSeenLocation");
static_assert(sizeof(OBJ_DetectionEvent_C_GetLastSeenLocation) == 0x00000C, "Wrong size on OBJ_DetectionEvent_C_GetLastSeenLocation");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastSeenLocation, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetLastSeenLocation::Result' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetLastHeardLocation
// 0x000C (0x000C - 0x0000)
struct OBJ_DetectionEvent_C_GetLastHeardLocation final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetLastHeardLocation) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetLastHeardLocation");
static_assert(sizeof(OBJ_DetectionEvent_C_GetLastHeardLocation) == 0x00000C, "Wrong size on OBJ_DetectionEvent_C_GetLastHeardLocation");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastHeardLocation, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetLastHeardLocation::Result' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetTimeInCurrentState
// 0x000C (0x000C - 0x0000)
struct OBJ_DetectionEvent_C_GetTimeInCurrentState final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetTimeInCurrentState) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetTimeInCurrentState");
static_assert(sizeof(OBJ_DetectionEvent_C_GetTimeInCurrentState) == 0x00000C, "Wrong size on OBJ_DetectionEvent_C_GetTimeInCurrentState");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeInCurrentState, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetTimeInCurrentState::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeInCurrentState, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'OBJ_DetectionEvent_C_GetTimeInCurrentState::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeInCurrentState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetTimeInCurrentState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetTimeSinceLastEvent
// 0x0018 (0x0018 - 0x0000)
struct OBJ_DetectionEvent_C_GetTimeSinceLastEvent final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastDetectionTimestamp;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLastDetectionTimestamp_Result;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetTimeSinceLastEvent");
static_assert(sizeof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent) == 0x000018, "Wrong size on OBJ_DetectionEvent_C_GetTimeSinceLastEvent");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, CurrentTime) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::CurrentTime' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, Result) == 0x000004, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, LastDetectionTimestamp) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::LastDetectionTimestamp' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, CallFunc_GetLastDetectionTimestamp_Result) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::CallFunc_GetLastDetectionTimestamp_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetTimeSinceLastEvent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'OBJ_DetectionEvent_C_GetTimeSinceLastEvent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetLastDetectionTimestamp
// 0x0008 (0x0008 - 0x0000)
struct OBJ_DetectionEvent_C_GetLastDetectionTimestamp final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetLastDetectionTimestamp) == 0x000004, "Wrong alignment on OBJ_DetectionEvent_C_GetLastDetectionTimestamp");
static_assert(sizeof(OBJ_DetectionEvent_C_GetLastDetectionTimestamp) == 0x000008, "Wrong size on OBJ_DetectionEvent_C_GetLastDetectionTimestamp");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastDetectionTimestamp, Result) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetLastDetectionTimestamp::Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetLastDetectionTimestamp, CallFunc_FMax_ReturnValue) == 0x000004, "Member 'OBJ_DetectionEvent_C_GetLastDetectionTimestamp::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function OBJ_DetectionEvent.OBJ_DetectionEvent_C.GetDistanceToEvent
// 0x0068 (0x0068 - 0x0000)
struct OBJ_DetectionEvent_C_GetDistanceToEvent final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_Result;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEventLocation_EventLocation;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OBJ_DetectionEvent_C_GetDistanceToEvent) == 0x000008, "Wrong alignment on OBJ_DetectionEvent_C_GetDistanceToEvent");
static_assert(sizeof(OBJ_DetectionEvent_C_GetDistanceToEvent) == 0x000068, "Wrong size on OBJ_DetectionEvent_C_GetDistanceToEvent");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDistanceToEvent, Distance) == 0x000000, "Member 'OBJ_DetectionEvent_C_GetDistanceToEvent::Distance' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDistanceToEvent, CallFunc_GetOwnerActor_Result) == 0x000008, "Member 'OBJ_DetectionEvent_C_GetDistanceToEvent::CallFunc_GetOwnerActor_Result' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDistanceToEvent, CallFunc_GetEventLocation_EventLocation) == 0x000010, "Member 'OBJ_DetectionEvent_C_GetDistanceToEvent::CallFunc_GetEventLocation_EventLocation' has a wrong offset!");
static_assert(offsetof(OBJ_DetectionEvent_C_GetDistanceToEvent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'OBJ_DetectionEvent_C_GetDistanceToEvent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
