#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Audio_SpeechVolume

#include "Basic.hpp"


namespace SDK::Params
{

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.ApplyDirtyValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_ApplyDirtyValue final
{
public:
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_ApplyDirtyValue) == 0x000010, "Wrong size on OPTION_Audio_SpeechVolume_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_ApplyDirtyValue, CallFunc_GetSliderValue_NormalizedValue) == 0x000004, "Member 'OPTION_Audio_SpeechVolume_C_ApplyDirtyValue::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_ApplyDirtyValue, CallFunc_GetSaveSettings_ShockSettings) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_ApplyDirtyValue::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.OnSliderValueChanged
// 0x0004 (0x0004 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_OnSliderValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_OnSliderValueChanged) == 0x000004, "Wrong alignment on OPTION_Audio_SpeechVolume_C_OnSliderValueChanged");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_OnSliderValueChanged) == 0x000004, "Wrong size on OPTION_Audio_SpeechVolume_C_OnSliderValueChanged");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_OnSliderValueChanged, NewValue) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_OnSliderValueChanged::NewValue' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.ApplyCleanValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_ApplyCleanValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolume_Result;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_ApplyCleanValue) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_ApplyCleanValue");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_ApplyCleanValue) == 0x000010, "Wrong size on OPTION_Audio_SpeechVolume_C_ApplyCleanValue");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_ApplyCleanValue, CallFunc_GetSaveSettings_ShockSettings) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_ApplyCleanValue::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_ApplyCleanValue, CallFunc_GetVoiceVolume_Result) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_ApplyCleanValue::CallFunc_GetVoiceVolume_Result' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.AcceptCurrentValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_AcceptCurrentValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_AcceptCurrentValue) == 0x000010, "Wrong size on OPTION_Audio_SpeechVolume_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_AcceptCurrentValue, CallFunc_GetSaveSettings_ShockSettings) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_AcceptCurrentValue::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_AcceptCurrentValue, CallFunc_GetSliderValue_NormalizedValue) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_AcceptCurrentValue::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.IsDirty
// 0x0020 (0x0020 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolume_Result;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_IsDirty");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_IsDirty) == 0x000020, "Wrong size on OPTION_Audio_SpeechVolume_C_IsDirty");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDirty, CallFunc_GetSaveSettings_ShockSettings) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_IsDirty::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDirty, CallFunc_GetSliderValue_NormalizedValue) == 0x000010, "Member 'OPTION_Audio_SpeechVolume_C_IsDirty::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDirty, CallFunc_GetVoiceVolume_Result) == 0x000014, "Member 'OPTION_Audio_SpeechVolume_C_IsDirty::CallFunc_GetVoiceVolume_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDirty, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'OPTION_Audio_SpeechVolume_C_IsDirty::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.UpdateVisuals
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_UpdateVisuals final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolume_Result;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_UpdateVisuals");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_UpdateVisuals) == 0x000010, "Wrong size on OPTION_Audio_SpeechVolume_C_UpdateVisuals");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_UpdateVisuals, CallFunc_GetSaveSettings_ShockSettings) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_UpdateVisuals::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_UpdateVisuals, CallFunc_GetVoiceVolume_Result) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_UpdateVisuals::CallFunc_GetVoiceVolume_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_UpdateVisuals, CallFunc_SetSliderValue_RealValue) == 0x00000C, "Member 'OPTION_Audio_SpeechVolume_C_UpdateVisuals::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.SelectDefaultValue
// 0x0030 (0x0030 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_SelectDefaultValue final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolumeProfleValue_Result;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue) == 0x000030, "Wrong size on OPTION_Audio_SpeechVolume_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000010, "Member 'OPTION_Audio_SpeechVolume_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000020, "Member 'OPTION_Audio_SpeechVolume_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue, CallFunc_GetVoiceVolumeProfleValue_Result) == 0x000028, "Member 'OPTION_Audio_SpeechVolume_C_SelectDefaultValue::CallFunc_GetVoiceVolumeProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_SelectDefaultValue, CallFunc_SetSliderValue_RealValue) == 0x00002C, "Member 'OPTION_Audio_SpeechVolume_C_SelectDefaultValue::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

// Function OPTION_Audio_SpeechVolume.OPTION_Audio_SpeechVolume_C.IsDefault
// 0x0040 (0x0040 - 0x0000)
struct OPTION_Audio_SpeechVolume_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVoiceVolumeProfleValue_Result;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Audio_SpeechVolume_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Audio_SpeechVolume_C_IsDefault");
static_assert(sizeof(OPTION_Audio_SpeechVolume_C_IsDefault) == 0x000040, "Wrong size on OPTION_Audio_SpeechVolume_C_IsDefault");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000018, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_GetSaveSettings_ShockSettings) == 0x000028, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_GetSliderValue_NormalizedValue) == 0x000030, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_GetVoiceVolumeProfleValue_Result) == 0x000034, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_GetVoiceVolumeProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Audio_SpeechVolume_C_IsDefault, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'OPTION_Audio_SpeechVolume_C_IsDefault::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

