#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Interface_HUDCurvature

#include "Basic.hpp"


namespace SDK::Params
{

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.AcceptCurrentValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_AcceptCurrentValue final
{
public:
	float                                         CallFunc_GetScaledCurrentSliderValue_Result;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_AcceptCurrentValue) == 0x000010, "Wrong size on OPTION_Interface_HUDCurvature_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_AcceptCurrentValue, CallFunc_GetScaledCurrentSliderValue_Result) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_AcceptCurrentValue::CallFunc_GetScaledCurrentSliderValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.ApplyDirtyValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_ApplyDirtyValue final
{
public:
	float                                         CallFunc_GetScaledCurrentSliderValue_Result;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_ApplyDirtyValue) == 0x000010, "Wrong size on OPTION_Interface_HUDCurvature_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_ApplyDirtyValue, CallFunc_GetScaledCurrentSliderValue_Result) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_ApplyDirtyValue::CallFunc_GetScaledCurrentSliderValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000004, "Member 'OPTION_Interface_HUDCurvature_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_ApplyDirtyValue, CallFunc_GetSaveSettings_ShockSettings) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_ApplyDirtyValue::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.OnSliderValueChanged
// 0x0004 (0x0004 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_OnSliderValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_OnSliderValueChanged) == 0x000004, "Wrong alignment on OPTION_Interface_HUDCurvature_C_OnSliderValueChanged");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_OnSliderValueChanged) == 0x000004, "Wrong size on OPTION_Interface_HUDCurvature_C_OnSliderValueChanged");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_OnSliderValueChanged, NewValue) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_OnSliderValueChanged::NewValue' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.IsDirty
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCurrentSliderValue_Result;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHUDCurvature_Result;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_IsDirty");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_IsDirty) == 0x000018, "Wrong size on OPTION_Interface_HUDCurvature_C_IsDirty");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDirty, CallFunc_GetScaledCurrentSliderValue_Result) == 0x000004, "Member 'OPTION_Interface_HUDCurvature_C_IsDirty::CallFunc_GetScaledCurrentSliderValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDirty, CallFunc_GetHUDCurvature_Result) == 0x000010, "Member 'OPTION_Interface_HUDCurvature_C_IsDirty::CallFunc_GetHUDCurvature_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDirty, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'OPTION_Interface_HUDCurvature_C_IsDirty::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.UpdateVisuals
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_UpdateVisuals final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHUDCurvature_Result;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_UpdateVisuals");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_UpdateVisuals) == 0x000018, "Wrong size on OPTION_Interface_HUDCurvature_C_UpdateVisuals");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_UpdateVisuals, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_UpdateVisuals::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_UpdateVisuals, CallFunc_GetHUDCurvature_Result) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_UpdateVisuals::CallFunc_GetHUDCurvature_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_UpdateVisuals, CallFunc_MapRangeClamped_ReturnValue) == 0x00000C, "Member 'OPTION_Interface_HUDCurvature_C_UpdateVisuals::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_UpdateVisuals, CallFunc_SetSliderValue_RealValue) == 0x000010, "Member 'OPTION_Interface_HUDCurvature_C_UpdateVisuals::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.SelectDefaultValue
// 0x0030 (0x0030 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_SelectDefaultValue final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHUDCurvatureProfleValue_Result;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue) == 0x000030, "Wrong size on OPTION_Interface_HUDCurvature_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000010, "Member 'OPTION_Interface_HUDCurvature_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000020, "Member 'OPTION_Interface_HUDCurvature_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue, CallFunc_GetHUDCurvatureProfleValue_Result) == 0x000028, "Member 'OPTION_Interface_HUDCurvature_C_SelectDefaultValue::CallFunc_GetHUDCurvatureProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_SelectDefaultValue, CallFunc_SetSliderValue_RealValue) == 0x00002C, "Member 'OPTION_Interface_HUDCurvature_C_SelectDefaultValue::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.IsDefault
// 0x0038 (0x0038 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCurrentSliderValue_Result;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHUDCurvatureProfleValue_Result;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_IsDefault");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_IsDefault) == 0x000038, "Wrong size on OPTION_Interface_HUDCurvature_C_IsDefault");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_GetScaledCurrentSliderValue_Result) == 0x000004, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_GetScaledCurrentSliderValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000018, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000028, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_GetHUDCurvatureProfleValue_Result) == 0x000030, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_GetHUDCurvatureProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_IsDefault, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'OPTION_Interface_HUDCurvature_C_IsDefault::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDCurvature.OPTION_Interface_HUDCurvature_C.ApplyCleanValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_HUDCurvature_C_ApplyCleanValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHUDCurvature_Result;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDCurvature_C_ApplyCleanValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDCurvature_C_ApplyCleanValue");
static_assert(sizeof(OPTION_Interface_HUDCurvature_C_ApplyCleanValue) == 0x000010, "Wrong size on OPTION_Interface_HUDCurvature_C_ApplyCleanValue");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_ApplyCleanValue, CallFunc_GetSaveSettings_ShockSettings) == 0x000000, "Member 'OPTION_Interface_HUDCurvature_C_ApplyCleanValue::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDCurvature_C_ApplyCleanValue, CallFunc_GetHUDCurvature_Result) == 0x000008, "Member 'OPTION_Interface_HUDCurvature_C_ApplyCleanValue::CallFunc_GetHUDCurvature_Result' has a wrong offset!");

}

