#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Interface_Language

#include "Basic.hpp"


namespace SDK::Params
{

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.DisplayNameToCulture
// 0x00A0 (0x00A0 - 0x0000)
struct OPTION_Interface_Language_C_DisplayNameToCulture final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CultureTag;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         AvailableCultures;                                 // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCultureDisplayName_ReturnValue;        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	TArray<class FString>                         CallFunc_GetLocalizedCultures_ReturnValue;         // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Language_C_DisplayNameToCulture) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_DisplayNameToCulture");
static_assert(sizeof(OPTION_Interface_Language_C_DisplayNameToCulture) == 0x0000A0, "Wrong size on OPTION_Interface_Language_C_DisplayNameToCulture");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, DisplayName) == 0x000000, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::DisplayName' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CultureTag) == 0x000018, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CultureTag' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, AvailableCultures) == 0x000028, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::AvailableCultures' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, Temp_int_Array_Index_Variable) == 0x000038, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_Array_Get_Item) == 0x000048, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_GetCultureDisplayName_ReturnValue) == 0x000060, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_GetCultureDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_GetLocalizedCultures_ReturnValue) == 0x000088, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_GetLocalizedCultures_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_DisplayNameToCulture, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000098, "Member 'OPTION_Interface_Language_C_DisplayNameToCulture::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.PopulateUniqueSettings
// 0x0068 (0x0068 - 0x0000)
struct OPTION_Interface_Language_C_PopulateUniqueSettings final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetLocalizedCultures_ReturnValue;         // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCultureDisplayName_ReturnValue;        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Language_C_PopulateUniqueSettings) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_PopulateUniqueSettings");
static_assert(sizeof(OPTION_Interface_Language_C_PopulateUniqueSettings) == 0x000068, "Wrong size on OPTION_Interface_Language_C_PopulateUniqueSettings");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, Temp_int_Array_Index_Variable) == 0x000000, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_GetLocalizedCultures_ReturnValue) == 0x000010, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_GetLocalizedCultures_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Array_Get_Item) == 0x000020, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_GetCultureDisplayName_ReturnValue) == 0x000030, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_GetCultureDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_PopulateUniqueSettings, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'OPTION_Interface_Language_C_PopulateUniqueSettings::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.AcceptCurrentValue
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_Language_C_AcceptCurrentValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DisplayNameToCulture_CultureTag;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Language_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Interface_Language_C_AcceptCurrentValue) == 0x000018, "Wrong size on OPTION_Interface_Language_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Interface_Language_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_Language_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_AcceptCurrentValue, CallFunc_DisplayNameToCulture_CultureTag) == 0x000008, "Member 'OPTION_Interface_Language_C_AcceptCurrentValue::CallFunc_DisplayNameToCulture_CultureTag' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.ApplyDirtyValue
// 0x0038 (0x0038 - 0x0000)
struct OPTION_Interface_Language_C_ApplyDirtyValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	class FString                                 CallFunc_DisplayNameToCulture_CultureTag;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Language_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Interface_Language_C_ApplyDirtyValue) == 0x000038, "Wrong size on OPTION_Interface_Language_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Interface_Language_C_ApplyDirtyValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_Language_C_ApplyDirtyValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000008, "Member 'OPTION_Interface_Language_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_ApplyDirtyValue, CallFunc_Array_Get_Item) == 0x000010, "Member 'OPTION_Interface_Language_C_ApplyDirtyValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_ApplyDirtyValue, CallFunc_DisplayNameToCulture_CultureTag) == 0x000028, "Member 'OPTION_Interface_Language_C_ApplyDirtyValue::CallFunc_DisplayNameToCulture_CultureTag' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.IsDirty
// 0x0038 (0x0038 - 0x0000)
struct OPTION_Interface_Language_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLanguage_Result;                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DisplayNameToCulture_CultureTag;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Language_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_IsDirty");
static_assert(sizeof(OPTION_Interface_Language_C_IsDirty) == 0x000038, "Wrong size on OPTION_Interface_Language_C_IsDirty");
static_assert(offsetof(OPTION_Interface_Language_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Interface_Language_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_Language_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDirty, CallFunc_GetLanguage_Result) == 0x000010, "Member 'OPTION_Interface_Language_C_IsDirty::CallFunc_GetLanguage_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDirty, CallFunc_DisplayNameToCulture_CultureTag) == 0x000020, "Member 'OPTION_Interface_Language_C_IsDirty::CallFunc_DisplayNameToCulture_CultureTag' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDirty, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000030, "Member 'OPTION_Interface_Language_C_IsDirty::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.UpdateVisuals
// 0x0040 (0x0040 - 0x0000)
struct OPTION_Interface_Language_C_UpdateVisuals final
{
public:
	class FString                                 SavedCulture;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetSaveSettings_ShockSettings;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetLocalizedCultures_ReturnValue;         // 0x0018(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetLanguage_Result;                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBestCultureIndex_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Language_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_UpdateVisuals");
static_assert(sizeof(OPTION_Interface_Language_C_UpdateVisuals) == 0x000040, "Wrong size on OPTION_Interface_Language_C_UpdateVisuals");
static_assert(offsetof(OPTION_Interface_Language_C_UpdateVisuals, SavedCulture) == 0x000000, "Member 'OPTION_Interface_Language_C_UpdateVisuals::SavedCulture' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_UpdateVisuals, CallFunc_GetSaveSettings_ShockSettings) == 0x000010, "Member 'OPTION_Interface_Language_C_UpdateVisuals::CallFunc_GetSaveSettings_ShockSettings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_UpdateVisuals, CallFunc_GetLocalizedCultures_ReturnValue) == 0x000018, "Member 'OPTION_Interface_Language_C_UpdateVisuals::CallFunc_GetLocalizedCultures_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_UpdateVisuals, CallFunc_GetLanguage_Result) == 0x000028, "Member 'OPTION_Interface_Language_C_UpdateVisuals::CallFunc_GetLanguage_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_UpdateVisuals, CallFunc_GetBestCultureIndex_ReturnValue) == 0x000038, "Member 'OPTION_Interface_Language_C_UpdateVisuals::CallFunc_GetBestCultureIndex_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.SelectDefaultValue
// 0x0040 (0x0040 - 0x0000)
struct OPTION_Interface_Language_C_SelectDefaultValue final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLanguageProfleValue_Result;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBestCultureIndex_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Language_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Interface_Language_C_SelectDefaultValue) == 0x000040, "Wrong size on OPTION_Interface_Language_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Interface_Language_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'OPTION_Interface_Language_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000010, "Member 'OPTION_Interface_Language_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000020, "Member 'OPTION_Interface_Language_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_SelectDefaultValue, CallFunc_GetLanguageProfleValue_Result) == 0x000028, "Member 'OPTION_Interface_Language_C_SelectDefaultValue::CallFunc_GetLanguageProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_SelectDefaultValue, CallFunc_GetBestCultureIndex_ReturnValue) == 0x000038, "Member 'OPTION_Interface_Language_C_SelectDefaultValue::CallFunc_GetBestCultureIndex_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Language.OPTION_Interface_Language_C.IsDefault
// 0x0058 (0x0058 - 0x0000)
struct OPTION_Interface_Language_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_DisplayNameToCulture_CultureTag;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLanguageProfleValue_Result;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Language_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Interface_Language_C_IsDefault");
static_assert(sizeof(OPTION_Interface_Language_C_IsDefault) == 0x000058, "Wrong size on OPTION_Interface_Language_C_IsDefault");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Interface_Language_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000018, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_DisplayNameToCulture_CultureTag) == 0x000028, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_DisplayNameToCulture_CultureTag' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000038, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_GetLanguageProfleValue_Result) == 0x000040, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_GetLanguageProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Language_C_IsDefault, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000050, "Member 'OPTION_Interface_Language_C_IsDefault::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

