#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Graphics_ShadowQuality

#include "Basic.hpp"

#include "ENUM_QualitySetting_structs.hpp"


namespace SDK::Params
{

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.AcceptCurrentValue
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue) == 0x000018, "Wrong size on OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, Temp_int_Variable) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, Temp_byte_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, Temp_byte_Variable_1) == 0x000005, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, Temp_byte_Variable_2) == 0x000006, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, Temp_byte_Variable_3) == 0x000007, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue, K2Node_Select_Default) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_AcceptCurrentValue::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.ApplyDirtyValue
// 0x0020 (0x0020 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_QualitySetting                           K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue) == 0x000020, "Wrong size on OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_int_Variable) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_byte_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_byte_Variable_1) == 0x000005, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_byte_Variable_2) == 0x000006, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_byte_Variable_3) == 0x000007, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, Temp_byte_Variable_4) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000018, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue, K2Node_Select_Default) == 0x000019, "Member 'OPTION_Graphics_ShadowQuality_C_ApplyDirtyValue::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.UpdateVisuals
// 0x0028 (0x0028 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_UpdateVisuals final
{
public:
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           CallFunc_GetShadowQuality_Result;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_UpdateVisuals");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals) == 0x000028, "Wrong size on OPTION_Graphics_ShadowQuality_C_UpdateVisuals");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, Temp_byte_Variable) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, Temp_int_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, Temp_int_Variable_3) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000018, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, CallFunc_GetShadowQuality_Result) == 0x000020, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::CallFunc_GetShadowQuality_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_UpdateVisuals, K2Node_Select_Default) == 0x000024, "Member 'OPTION_Graphics_ShadowQuality_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.IsDirty
// 0x0020 (0x0020 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           CallFunc_GetShadowQuality_Result;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_IsDirty");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_IsDirty) == 0x000020, "Wrong size on OPTION_Graphics_ShadowQuality_C_IsDirty");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_int_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_byte_Variable) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_byte_Variable_1) == 0x000009, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_byte_Variable_2) == 0x00000A, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_byte_Variable_3) == 0x00000B, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, Temp_byte_Variable_4) == 0x00000C, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, CallFunc_GetShadowQuality_Result) == 0x000018, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::CallFunc_GetShadowQuality_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, K2Node_Select_Default) == 0x000019, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDirty, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'OPTION_Graphics_ShadowQuality_C_IsDirty::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.SelectDefaultValue
// 0x0048 (0x0048 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_SelectDefaultValue final
{
public:
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           CallFunc_GetShadowQualityProfileValue_Result;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue) == 0x000048, "Wrong size on OPTION_Graphics_ShadowQuality_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, Temp_byte_Variable) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, Temp_int_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, Temp_int_Variable_3) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000028, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000038, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, CallFunc_GetShadowQualityProfileValue_Result) == 0x000040, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::CallFunc_GetShadowQualityProfileValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_SelectDefaultValue, K2Node_Select_Default) == 0x000044, "Member 'OPTION_Graphics_ShadowQuality_C_SelectDefaultValue::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Graphics_ShadowQuality.OPTION_Graphics_ShadowQuality_C.IsDefault
// 0x0050 (0x0050 - 0x0000)
struct OPTION_Graphics_ShadowQuality_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_QualitySetting                           Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_QualitySetting                           CallFunc_GetShadowQualityProfileValue_Result;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Graphics_ShadowQuality_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Graphics_ShadowQuality_C_IsDefault");
static_assert(sizeof(OPTION_Graphics_ShadowQuality_C_IsDefault) == 0x000050, "Wrong size on OPTION_Graphics_ShadowQuality_C_IsDefault");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Temp_byte_Variable) == 0x000001, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Temp_int_Variable) == 0x000004, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, Temp_int_Variable_3) == 0x000010, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000018, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000028, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000038, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, CallFunc_GetShadowQualityProfileValue_Result) == 0x000040, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::CallFunc_GetShadowQualityProfileValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, K2Node_Select_Default) == 0x000044, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPTION_Graphics_ShadowQuality_C_IsDefault, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'OPTION_Graphics_ShadowQuality_C_IsDefault::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

