#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Interface_HUDColorTheme

#include "Basic.hpp"

#include "STRUCT_UserTintOption_structs.hpp"


namespace SDK::Params
{

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.PopulateUniqueSettings
// 0x0188 (0x0188 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_UserTintOption                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0148)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0170(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings) == 0x000188, "Wrong size on OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, Temp_int_Array_Index_Variable) == 0x000004, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_Array_Get_Item) == 0x00000C, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000170, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings, CallFunc_Array_Add_ReturnValue) == 0x000180, "Member 'OPTION_Interface_HUDColorTheme_C_PopulateUniqueSettings::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.AcceptCurrentValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue) == 0x000010, "Wrong size on OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue, CallFunc_Array_Get_Item) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_AcceptCurrentValue::CallFunc_Array_Get_Item' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.ApplyDirtyValue
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue final
{
public:
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue) == 0x000018, "Wrong size on OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue, CallFunc_Array_Get_Item) == 0x000010, "Member 'OPTION_Interface_HUDColorTheme_C_ApplyDirtyValue::CallFunc_Array_Get_Item' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.IsDirty
// 0x0028 (0x0028 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHUDColorTheme_Result;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_IsDirty");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_IsDirty) == 0x000028, "Wrong size on OPTION_Interface_HUDColorTheme_C_IsDirty");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDirty, CallFunc_GetHUDColorTheme_Result) == 0x000010, "Member 'OPTION_Interface_HUDColorTheme_C_IsDirty::CallFunc_GetHUDColorTheme_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDirty, CallFunc_Array_Get_Item) == 0x000018, "Member 'OPTION_Interface_HUDColorTheme_C_IsDirty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDirty, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'OPTION_Interface_HUDColorTheme_C_IsDirty::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.UpdateVisuals
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_UpdateVisuals final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHUDColorTheme_Result;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_UpdateVisuals");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_UpdateVisuals) == 0x000018, "Wrong size on OPTION_Interface_HUDColorTheme_C_UpdateVisuals");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_UpdateVisuals, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_UpdateVisuals::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_UpdateVisuals, CallFunc_GetHUDColorTheme_Result) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_UpdateVisuals::CallFunc_GetHUDColorTheme_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_UpdateVisuals, CallFunc_Array_Find_ReturnValue) == 0x000010, "Member 'OPTION_Interface_HUDColorTheme_C_UpdateVisuals::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.ApplyCleanValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_ApplyCleanValue final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHUDColorTheme_Result;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_ApplyCleanValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_ApplyCleanValue");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_ApplyCleanValue) == 0x000010, "Wrong size on OPTION_Interface_HUDColorTheme_C_ApplyCleanValue");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_ApplyCleanValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_ApplyCleanValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_ApplyCleanValue, CallFunc_GetHUDColorTheme_Result) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_ApplyCleanValue::CallFunc_GetHUDColorTheme_Result' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.SelectDefaultValue
// 0x0038 (0x0038 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_SelectDefaultValue final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHUDColorThemeProfleValue_Result;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue) == 0x000038, "Wrong size on OPTION_Interface_HUDColorTheme_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000010, "Member 'OPTION_Interface_HUDColorTheme_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000020, "Member 'OPTION_Interface_HUDColorTheme_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue, CallFunc_GetHUDColorThemeProfleValue_Result) == 0x000028, "Member 'OPTION_Interface_HUDColorTheme_C_SelectDefaultValue::CallFunc_GetHUDColorThemeProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_SelectDefaultValue, CallFunc_Array_Find_ReturnValue) == 0x000030, "Member 'OPTION_Interface_HUDColorTheme_C_SelectDefaultValue::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.IsDefault
// 0x0048 (0x0048 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHUDColorThemeProfleValue_Result;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_IsDefault");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_IsDefault) == 0x000048, "Wrong size on OPTION_Interface_HUDColorTheme_C_IsDefault");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_Array_Get_Item) == 0x000018, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000020, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000030, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_GetHUDColorThemeProfleValue_Result) == 0x000038, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_GetHUDColorThemeProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_IsDefault, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000040, "Member 'OPTION_Interface_HUDColorTheme_C_IsDefault::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_HUDColorTheme.OPTION_Interface_HUDColorTheme_C.OnMultiSelectorValueModifiedByUser
// 0x0001 (0x0001 - 0x0000)
struct OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser final
{
public:
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser) == 0x000001, "Wrong alignment on OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser");
static_assert(sizeof(OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser) == 0x000001, "Wrong size on OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser");
static_assert(offsetof(OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser, CallFunc_IsDirty_IsDirty) == 0x000000, "Member 'OPTION_Interface_HUDColorTheme_C_OnMultiSelectorValueModifiedByUser::CallFunc_IsDirty_IsDirty' has a wrong offset!");

}

