#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Interface_Gore

#include "Basic.hpp"

#include "ENUM_OffReducedNormal_structs.hpp"


namespace SDK::Params
{

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.PopulateUniqueSettings
// 0x0048 (0x0048 - 0x0000)
struct OPTION_Interface_Gore_C_PopulateUniqueSettings final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Gore_C_PopulateUniqueSettings) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_PopulateUniqueSettings");
static_assert(sizeof(OPTION_Interface_Gore_C_PopulateUniqueSettings) == 0x000048, "Wrong size on OPTION_Interface_Gore_C_PopulateUniqueSettings");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, Temp_int_Variable) == 0x000000, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_Conv_IntToByte_ReturnValue) == 0x000004, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_GetValidValue_ReturnValue) == 0x000005, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_MakeLiteralInt_ReturnValue) == 0x000038, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_PopulateUniqueSettings, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'OPTION_Interface_Gore_C_PopulateUniqueSettings::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.AcceptCurrentValue
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_Gore_C_AcceptCurrentValue final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Gore_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Interface_Gore_C_AcceptCurrentValue) == 0x000018, "Wrong size on OPTION_Interface_Gore_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, Temp_int_Variable) == 0x000000, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, Temp_byte_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, Temp_byte_Variable_1) == 0x000005, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, Temp_byte_Variable_2) == 0x000006, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_AcceptCurrentValue, K2Node_Select_Default) == 0x000010, "Member 'OPTION_Interface_Gore_C_AcceptCurrentValue::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.ApplyDirtyValue
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_Gore_C_ApplyDirtyValue final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Gore_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Interface_Gore_C_ApplyDirtyValue) == 0x000018, "Wrong size on OPTION_Interface_Gore_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, Temp_int_Variable) == 0x000000, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, Temp_byte_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, Temp_byte_Variable_1) == 0x000005, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, Temp_byte_Variable_2) == 0x000006, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, K2Node_Select_Default) == 0x000010, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000011, "Member 'OPTION_Interface_Gore_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.IsDirty
// 0x0020 (0x0020 - 0x0000)
struct OPTION_Interface_Gore_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         CallFunc_GetGoreAmount_Result;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Gore_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_IsDirty");
static_assert(sizeof(OPTION_Interface_Gore_C_IsDirty) == 0x000020, "Wrong size on OPTION_Interface_Gore_C_IsDirty");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Interface_Gore_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, Temp_int_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_IsDirty::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, Temp_byte_Variable) == 0x000008, "Member 'OPTION_Interface_Gore_C_IsDirty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, Temp_byte_Variable_1) == 0x000009, "Member 'OPTION_Interface_Gore_C_IsDirty::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, Temp_byte_Variable_2) == 0x00000A, "Member 'OPTION_Interface_Gore_C_IsDirty::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'OPTION_Interface_Gore_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, K2Node_Select_Default) == 0x000018, "Member 'OPTION_Interface_Gore_C_IsDirty::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, CallFunc_GetGoreAmount_Result) == 0x000019, "Member 'OPTION_Interface_Gore_C_IsDirty::CallFunc_GetGoreAmount_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDirty, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'OPTION_Interface_Gore_C_IsDirty::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.UpdateVisuals
// 0x0020 (0x0020 - 0x0000)
struct OPTION_Interface_Gore_C_UpdateVisuals final
{
public:
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         CallFunc_GetGoreAmount_Result;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Gore_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_UpdateVisuals");
static_assert(sizeof(OPTION_Interface_Gore_C_UpdateVisuals) == 0x000020, "Wrong size on OPTION_Interface_Gore_C_UpdateVisuals");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, Temp_byte_Variable) == 0x000000, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, Temp_int_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, CallFunc_GetGoreAmount_Result) == 0x000018, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::CallFunc_GetGoreAmount_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_UpdateVisuals, K2Node_Select_Default) == 0x00001C, "Member 'OPTION_Interface_Gore_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.SelectDefaultValue
// 0x0040 (0x0040 - 0x0000)
struct OPTION_Interface_Gore_C_SelectDefaultValue final
{
public:
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         CallFunc_GetGoreAmountProfleValue_Result;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_Gore_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Interface_Gore_C_SelectDefaultValue) == 0x000040, "Wrong size on OPTION_Interface_Gore_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, Temp_byte_Variable) == 0x000000, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, Temp_int_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000020, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000030, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, CallFunc_GetGoreAmountProfleValue_Result) == 0x000038, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::CallFunc_GetGoreAmountProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_SelectDefaultValue, K2Node_Select_Default) == 0x00003C, "Member 'OPTION_Interface_Gore_C_SelectDefaultValue::K2Node_Select_Default' has a wrong offset!");

// Function OPTION_Interface_Gore.OPTION_Interface_Gore_C.IsDefault
// 0x0048 (0x0048 - 0x0000)
struct OPTION_Interface_Gore_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_OffReducedNormal                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OffReducedNormal                         CallFunc_GetGoreAmountProfleValue_Result;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_Gore_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Interface_Gore_C_IsDefault");
static_assert(sizeof(OPTION_Interface_Gore_C_IsDefault) == 0x000048, "Wrong size on OPTION_Interface_Gore_C_IsDefault");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Interface_Gore_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, Temp_byte_Variable) == 0x000001, "Member 'OPTION_Interface_Gore_C_IsDefault::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, Temp_int_Variable) == 0x000004, "Member 'OPTION_Interface_Gore_C_IsDefault::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, Temp_int_Variable_1) == 0x000008, "Member 'OPTION_Interface_Gore_C_IsDefault::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, Temp_int_Variable_2) == 0x00000C, "Member 'OPTION_Interface_Gore_C_IsDefault::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'OPTION_Interface_Gore_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000020, "Member 'OPTION_Interface_Gore_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000030, "Member 'OPTION_Interface_Gore_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, CallFunc_GetGoreAmountProfleValue_Result) == 0x000038, "Member 'OPTION_Interface_Gore_C_IsDefault::CallFunc_GetGoreAmountProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, K2Node_Select_Default) == 0x00003C, "Member 'OPTION_Interface_Gore_C_IsDefault::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_Gore_C_IsDefault, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'OPTION_Interface_Gore_C_IsDefault::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

