#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPTION_Interface_SoundEffectCaptions

#include "Basic.hpp"


namespace SDK::Params
{

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.AcceptCurrentValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue final
{
public:
	bool                                          CallFunc_GetCheckboxValue_Result;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue) == 0x000010, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue, CallFunc_GetCheckboxValue_Result) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue::CallFunc_GetCheckboxValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_SoundEffectCaptions_C_AcceptCurrentValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.ApplyDirtyValue
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue final
{
public:
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCheckboxValue_Result;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue) == 0x000010, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue, CallFunc_IsDirty_IsDirty) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue, CallFunc_GetCheckboxValue_Result) == 0x000001, "Member 'OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue::CallFunc_GetCheckboxValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_SoundEffectCaptions_C_ApplyDirtyValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.IsDirty
// 0x0018 (0x0018 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_IsDirty final
{
public:
	bool                                          Param_IsDirty_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCheckboxValue_Result;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSoundEffectCaptionsEnabled_Result;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_IsDirty) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_IsDirty");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_IsDirty) == 0x000018, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_IsDirty");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDirty, Param_IsDirty_0) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDirty::Param_IsDirty_0' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDirty, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDirty::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDirty, CallFunc_GetCheckboxValue_Result) == 0x000010, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDirty::CallFunc_GetCheckboxValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDirty, CallFunc_GetSoundEffectCaptionsEnabled_Result) == 0x000011, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDirty::CallFunc_GetSoundEffectCaptionsEnabled_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDirty, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000012, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDirty::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.UpdateVisuals
// 0x0010 (0x0010 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundEffectCaptionsEnabled_Result;     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals) == 0x000010, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals, CallFunc_GetSoundEffectCaptionsEnabled_Result) == 0x000008, "Member 'OPTION_Interface_SoundEffectCaptions_C_UpdateVisuals::CallFunc_GetSoundEffectCaptionsEnabled_Result' has a wrong offset!");

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.SelectDefaultValue
// 0x0030 (0x0030 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue) == 0x000030, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue, CallFunc_GetCurrentCulture_ReturnValue) == 0x000010, "Member 'OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000020, "Member 'OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue, CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result) == 0x000028, "Member 'OPTION_Interface_SoundEffectCaptions_C_SelectDefaultValue::CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result' has a wrong offset!");

// Function OPTION_Interface_SoundEffectCaptions.OPTION_Interface_SoundEffectCaptions_C.IsDefault
// 0x0038 (0x0038 - 0x0000)
struct OPTION_Interface_SoundEffectCaptions_C_IsDefault final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCheckboxValue_Result;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPTION_Interface_SoundEffectCaptions_C_IsDefault) == 0x000008, "Wrong alignment on OPTION_Interface_SoundEffectCaptions_C_IsDefault");
static_assert(sizeof(OPTION_Interface_SoundEffectCaptions_C_IsDefault) == 0x000038, "Wrong size on OPTION_Interface_SoundEffectCaptions_C_IsDefault");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, Result) == 0x000000, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_GetCheckboxValue_Result) == 0x000001, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_GetCheckboxValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_GetCurrentCulture_ReturnValue) == 0x000018, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000028, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result) == 0x000030, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_GetSoundEffectCaptionsEnabledProfleValue_Result' has a wrong offset!");
static_assert(offsetof(OPTION_Interface_SoundEffectCaptions_C_IsDefault, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000031, "Member 'OPTION_Interface_SoundEffectCaptions_C_IsDefault::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

}

