#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PATCH_Berserk

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PATCH_Berserk.PATCH_Berserk_C.GetEffects
// 0x00B8 (0x00B8 - 0x0000)
struct PATCH_Berserk_C_GetEffects final
{
public:
	class FText                                   EffectsText;                                       // 0x0000(0x0018)(Parm, OutParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_ShouldShowDetailedEffects_Result;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0030(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00A0(0x0018)()
};
static_assert(alignof(PATCH_Berserk_C_GetEffects) == 0x000008, "Wrong alignment on PATCH_Berserk_C_GetEffects");
static_assert(sizeof(PATCH_Berserk_C_GetEffects) == 0x0000B8, "Wrong size on PATCH_Berserk_C_GetEffects");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, EffectsText) == 0x000000, "Member 'PATCH_Berserk_C_GetEffects::EffectsText' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, K2Node_MakeArray_Array) == 0x000018, "Member 'PATCH_Berserk_C_GetEffects::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, CallFunc_ShouldShowDetailedEffects_Result) == 0x000028, "Member 'PATCH_Berserk_C_GetEffects::CallFunc_ShouldShowDetailedEffects_Result' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, CallFunc_Format_ReturnValue) == 0x000030, "Member 'PATCH_Berserk_C_GetEffects::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, CallFunc_Round_ReturnValue) == 0x000048, "Member 'PATCH_Berserk_C_GetEffects::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'PATCH_Berserk_C_GetEffects::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, K2Node_MakeArray_Array_1) == 0x000090, "Member 'PATCH_Berserk_C_GetEffects::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetEffects, CallFunc_Format_ReturnValue_1) == 0x0000A0, "Member 'PATCH_Berserk_C_GetEffects::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function PATCH_Berserk.PATCH_Berserk_C.GetSideEffects
// 0x0120 (0x0120 - 0x0000)
struct PATCH_Berserk_C_GetSideEffects final
{
public:
	class FText                                   SideEffectsText;                                   // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_ShouldShowDetailedEffects_Result;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToLower_ReturnValue;                  // 0x0020(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDefaultPatchSideEffectText_Result;     // 0x0040(0x0018)()
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_TextToLower_ReturnValue_1;                // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
};
static_assert(alignof(PATCH_Berserk_C_GetSideEffects) == 0x000008, "Wrong alignment on PATCH_Berserk_C_GetSideEffects");
static_assert(sizeof(PATCH_Berserk_C_GetSideEffects) == 0x000120, "Wrong size on PATCH_Berserk_C_GetSideEffects");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, SideEffectsText) == 0x000000, "Member 'PATCH_Berserk_C_GetSideEffects::SideEffectsText' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_ShouldShowDetailedEffects_Result) == 0x000018, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_ShouldShowDetailedEffects_Result' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00001C, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_TextToLower_ReturnValue) == 0x000020, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_TextToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_Round_ReturnValue) == 0x000038, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_GetDefaultPatchSideEffectText_Result) == 0x000040, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_GetDefaultPatchSideEffectText_Result' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_Abs_Int_ReturnValue) == 0x000058, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'PATCH_Berserk_C_GetSideEffects::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_TextToLower_ReturnValue_1) == 0x0000A0, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_TextToLower_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'PATCH_Berserk_C_GetSideEffects::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, K2Node_MakeArray_Array) == 0x0000F8, "Member 'PATCH_Berserk_C_GetSideEffects::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetSideEffects, CallFunc_Format_ReturnValue) == 0x000108, "Member 'PATCH_Berserk_C_GetSideEffects::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function PATCH_Berserk.PATCH_Berserk_C.GetDuration
// 0x0038 (0x0038 - 0x0000)
struct PATCH_Berserk_C_GetDuration final
{
public:
	class FText                                   DurationText;                                      // 0x0000(0x0018)(Parm, OutParm)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDefaultPatchDurationText_Text;         // 0x0020(0x0018)()
};
static_assert(alignof(PATCH_Berserk_C_GetDuration) == 0x000008, "Wrong alignment on PATCH_Berserk_C_GetDuration");
static_assert(sizeof(PATCH_Berserk_C_GetDuration) == 0x000038, "Wrong size on PATCH_Berserk_C_GetDuration");
static_assert(offsetof(PATCH_Berserk_C_GetDuration, DurationText) == 0x000000, "Member 'PATCH_Berserk_C_GetDuration::DurationText' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetDuration, CallFunc_Round_ReturnValue) == 0x000018, "Member 'PATCH_Berserk_C_GetDuration::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_GetDuration, CallFunc_GetDefaultPatchDurationText_Text) == 0x000020, "Member 'PATCH_Berserk_C_GetDuration::CallFunc_GetDefaultPatchDurationText_Text' has a wrong offset!");

// Function PATCH_Berserk.PATCH_Berserk_C.UseConsumable
// 0x0030 (0x0030 - 0x0000)
struct PATCH_Berserk_C_UseConsumable final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ConsumableBase_C*                 ConsumedItem;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AttribManager_C*                  AttribManager;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ConsumableBase_C*                 CallFunc_UseConsumable_ConsumedItem;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PATCH_Berserk_C_UseConsumable) == 0x000008, "Wrong alignment on PATCH_Berserk_C_UseConsumable");
static_assert(sizeof(PATCH_Berserk_C_UseConsumable) == 0x000030, "Wrong size on PATCH_Berserk_C_UseConsumable");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, Character) == 0x000000, "Member 'PATCH_Berserk_C_UseConsumable::Character' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, ConsumedItem) == 0x000008, "Member 'PATCH_Berserk_C_UseConsumable::ConsumedItem' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, AttribManager) == 0x000010, "Member 'PATCH_Berserk_C_UseConsumable::AttribManager' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, CallFunc_ApplyMod_ReturnValue) == 0x000018, "Member 'PATCH_Berserk_C_UseConsumable::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, CallFunc_UseConsumable_ConsumedItem) == 0x000020, "Member 'PATCH_Berserk_C_UseConsumable::CallFunc_UseConsumable_ConsumedItem' has a wrong offset!");
static_assert(offsetof(PATCH_Berserk_C_UseConsumable, CallFunc_ApplyMod_ReturnValue_1) == 0x000028, "Member 'PATCH_Berserk_C_UseConsumable::CallFunc_ApplyMod_ReturnValue_1' has a wrong offset!");

}

