#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PatrolNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PatrolNode.PatrolNode_C
// 0x0070 (0x0290 - 0x0220)
class APatrolNode_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow_Forward;                                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow_FacingDirection;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BB_PatrolNode;                                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    BB_HasAction;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULocalBehaviorComponent_C*              LocalBehaviorComponent;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APatrolNode_C*                          NextNode;                                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PatrolPathID;                                      // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowFullConnection;                                // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UBehaviorTree>           GenericLocalBehaviorTree;                          // 0x0268(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PatrolNode(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ValidatePatrolNode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PatrolNode_C">();
	}
	static class APatrolNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APatrolNode_C>();
	}
};
static_assert(alignof(APatrolNode_C) == 0x000008, "Wrong alignment on APatrolNode_C");
static_assert(sizeof(APatrolNode_C) == 0x000290, "Wrong size on APatrolNode_C");
static_assert(offsetof(APatrolNode_C, UberGraphFrame) == 0x000220, "Member 'APatrolNode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, Arrow_Forward) == 0x000228, "Member 'APatrolNode_C::Arrow_Forward' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, Arrow_FacingDirection) == 0x000230, "Member 'APatrolNode_C::Arrow_FacingDirection' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, BB_PatrolNode) == 0x000238, "Member 'APatrolNode_C::BB_PatrolNode' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, BB_HasAction) == 0x000240, "Member 'APatrolNode_C::BB_HasAction' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, LocalBehaviorComponent) == 0x000248, "Member 'APatrolNode_C::LocalBehaviorComponent' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, Scene) == 0x000250, "Member 'APatrolNode_C::Scene' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, NextNode) == 0x000258, "Member 'APatrolNode_C::NextNode' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, PatrolPathID) == 0x000260, "Member 'APatrolNode_C::PatrolPathID' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, ShowFullConnection) == 0x000264, "Member 'APatrolNode_C::ShowFullConnection' has a wrong offset!");
static_assert(offsetof(APatrolNode_C, GenericLocalBehaviorTree) == 0x000268, "Member 'APatrolNode_C::GenericLocalBehaviorTree' has a wrong offset!");

}

