#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Avatar

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_CameraEffectInstance_structs.hpp"
#include "STRUCT_ScannableRegionData_structs.hpp"
#include "UMG_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "ENUM_PrimarySecondary_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function PAWN_Avatar.PAWN_Avatar_C.ExecuteUbergraph_PAWN_Avatar
// 0x0D28 (0x0D28 - 0x0000)
struct PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_61;                    // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_60;                    // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0050(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_59;                    // 0x0068(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_58;                    // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_57;                    // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_56;                    // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_3;                            // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_55;                    // 0x00F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_54;                    // 0x0110(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_4;                            // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_53;                    // 0x0140(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_52;                    // 0x0158(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_51;                    // 0x0170(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_50;                    // 0x0188(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_5;                            // 0x01A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_49;                    // 0x01B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_48;                    // 0x01D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_6;                            // 0x01E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_47;                    // 0x0200(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_46;                    // 0x0218(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_7;                            // 0x0230(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_45;                    // 0x0248(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_44;                    // 0x0260(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_8;                            // 0x0278(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_43;                    // 0x0290(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_42;                    // 0x02A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_9;                            // 0x02C0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_41;                    // 0x02D8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_40;                    // 0x02F0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_10;                           // 0x0308(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_39;                    // 0x0320(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_38;                    // 0x0338(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_11;                           // 0x0350(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_37;                    // 0x0368(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_36;                    // 0x0380(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_12;                           // 0x0398(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_35;                    // 0x03B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_34;                    // 0x03C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_13;                           // 0x03E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_33;                    // 0x03F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_32;                    // 0x0410(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_14;                           // 0x0428(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_31;                    // 0x0440(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_30;                    // 0x0458(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_15;                           // 0x0470(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_29;                    // 0x0488(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_28;                    // 0x04A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_16;                           // 0x04B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_27;                    // 0x04D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_26;                    // 0x04E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_17;                           // 0x0500(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_25;                    // 0x0518(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_24;                    // 0x0530(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_18;                           // 0x0548(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_23;                    // 0x0560(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_22;                    // 0x0578(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_19;                           // 0x0590(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_21;                    // 0x05A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_20;                    // 0x05C0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_20;                           // 0x05D8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_19;                    // 0x05F0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_18;                    // 0x0608(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_21;                           // 0x0620(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_17;                    // 0x0638(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_16;                    // 0x0650(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_22;                           // 0x0668(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0680(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_15;                    // 0x0698(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_14;                    // 0x06B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_23;                           // 0x06C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_13;                    // 0x06E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_12;                    // 0x06F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_24;                           // 0x0710(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_11;                    // 0x0728(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_10;                    // 0x0740(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_25;                           // 0x0758(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_9;                     // 0x0770(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_8;                     // 0x0788(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_26;                           // 0x07A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_7;                     // 0x07B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_6;                     // 0x07D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_27;                           // 0x07E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_5;                     // 0x0800(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0818(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_28;                           // 0x0830(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0848(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0860(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_29;                           // 0x0878(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0890(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x08A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_30;                           // 0x08C0(0x0018)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x08F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x08F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0904(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_98C[0x4];                                      // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0990(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_ShouldBounce_Result;                      // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_62;                    // 0x09A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_65;                    // 0x09C0(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x09DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9DD[0x3];                                      // 0x09DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x09E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x09E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E7[0x1];                                      // 0x09E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_31;                           // 0x09E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_66;                    // 0x0A00(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_67;                    // 0x0A18(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_32;                           // 0x0A30(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_7;                 // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_6;                 // 0x0A4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_68;                    // 0x0A50(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_5;                 // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_4;                 // 0x0A6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_69;                    // 0x0A70(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x0A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x0A8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_33;                           // 0x0A90(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_70;                    // 0x0AA8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_71;                    // 0x0AC0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_34;                           // 0x0AD8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_72;                    // 0x0AF0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_73;                    // 0x0B08(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_35;                           // 0x0B20(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0B41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0B42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0B43(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_74;                    // 0x0B48(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_75;                    // 0x0B60(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_36;                           // 0x0B78(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_76;                    // 0x0B90(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_77;                    // 0x0BA8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_37;                           // 0x0BC0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_78;                    // 0x0BD8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_79;                    // 0x0BF0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_38;                           // 0x0C08(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_80;                    // 0x0C20(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0C39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3A[0x6];                                      // 0x0C3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_81;                    // 0x0C40(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0C58(0x0018)(HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0C70(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0C80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C84[0x4];                                      // 0x0C84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_63;                    // 0x0C88(0x0018)(HasGetValueTypeHash)
	class AController*                            K2Node_Event_NewController;                        // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_OldController;                        // 0x0CA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0CB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0CC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CC1[0x7];                                      // 0x0CC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_39;                           // 0x0CC8(0x0018)(HasGetValueTypeHash)
	class UBP_MusicCue_C*                         CallFunc_SetMusicState_MusicCue;                   // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0CE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_64;                    // 0x0D00(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0D19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0D1A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartTrackingLocation_ReturnValue;        // 0x0D1B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopTrackingLocation_ReturnValue;         // 0x0D1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1D[0x3];                                      // 0x0D1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar) == 0x000008, "Wrong alignment on PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar");
static_assert(sizeof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar) == 0x000D28, "Wrong size on PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, EntryPoint) == 0x000000, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::EntryPoint' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable) == 0x000008, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_61) == 0x000020, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_61' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_60) == 0x000038, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_60' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_1) == 0x000050, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_59) == 0x000068, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_59' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_58) == 0x000080, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_58' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_2) == 0x000098, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_57) == 0x0000B0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_57' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_56) == 0x0000C8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_56' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_3) == 0x0000E0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_55) == 0x0000F8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_55' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_54) == 0x000110, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_54' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_4) == 0x000128, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_53) == 0x000140, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_53' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_52) == 0x000158, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_52' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_51) == 0x000170, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_51' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_50) == 0x000188, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_50' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_5) == 0x0001A0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_49) == 0x0001B8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_49' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_48) == 0x0001D0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_48' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_6) == 0x0001E8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_47) == 0x000200, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_47' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_46) == 0x000218, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_46' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_7) == 0x000230, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_45) == 0x000248, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_45' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_44) == 0x000260, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_44' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_8) == 0x000278, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_43) == 0x000290, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_43' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_42) == 0x0002A8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_42' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_9) == 0x0002C0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_41) == 0x0002D8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_41' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_40) == 0x0002F0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_40' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_10) == 0x000308, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_39) == 0x000320, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_39' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_38) == 0x000338, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_38' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_11) == 0x000350, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_37) == 0x000368, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_37' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_36) == 0x000380, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_36' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_12) == 0x000398, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_35) == 0x0003B0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_35' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_34) == 0x0003C8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_34' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_13) == 0x0003E0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_33) == 0x0003F8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_33' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_32) == 0x000410, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_32' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_14) == 0x000428, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_31) == 0x000440, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_31' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_30) == 0x000458, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_30' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_15) == 0x000470, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_29) == 0x000488, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_29' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_28) == 0x0004A0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_28' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_16) == 0x0004B8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_27) == 0x0004D0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_27' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_26) == 0x0004E8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_26' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_17) == 0x000500, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_17' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_25) == 0x000518, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_25' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_24) == 0x000530, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_24' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_18) == 0x000548, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_18' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_23) == 0x000560, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_23' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_22) == 0x000578, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_22' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_19) == 0x000590, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_19' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_21) == 0x0005A8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_21' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_20) == 0x0005C0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_20' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_20) == 0x0005D8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_20' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_19) == 0x0005F0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_19' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_18) == 0x000608, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_18' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_21) == 0x000620, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_21' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_17) == 0x000638, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_17' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_16) == 0x000650, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_16' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_22) == 0x000668, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_22' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputKeyEvent_Key) == 0x000680, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_15) == 0x000698, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_15' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_14) == 0x0006B0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_14' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_23) == 0x0006C8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_23' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_13) == 0x0006E0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_13' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_12) == 0x0006F8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_12' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_24) == 0x000710, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_24' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_11) == 0x000728, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_11' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_10) == 0x000740, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_10' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_25) == 0x000758, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_25' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_9) == 0x000770, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_9' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_8) == 0x000788, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_8' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_26) == 0x0007A0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_26' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_7) == 0x0007B8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_7' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_6) == 0x0007D0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_6' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_27) == 0x0007E8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_27' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_5) == 0x000800, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_5' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_4) == 0x000818, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_28) == 0x000830, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_28' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_3) == 0x000848, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_2) == 0x000860, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_29) == 0x000878, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_29' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_1) == 0x000890, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key) == 0x0008A8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_30) == 0x0008C0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_30' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0008D8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_HitComponent) == 0x0008E0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_OtherActor) == 0x0008E8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_OtherComp) == 0x0008F0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0008F8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_Hit) == 0x000904, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000990, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_ShouldBounce_Result) == 0x0009A0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_ShouldBounce_Result' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_62) == 0x0009A8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_62' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_65) == 0x0009C0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_65' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x0009D8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0009DC, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_SelectFloat_ReturnValue) == 0x0009E0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_ComponentBoundEvent_bVisibleState) == 0x0009E4, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0009E5, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_Not_PreBool_ReturnValue) == 0x0009E6, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_31) == 0x0009E8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_31' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_66) == 0x000A00, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_66' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_67) == 0x000A18, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_67' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_32) == 0x000A30, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_32' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_7) == 0x000A48, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_7' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_6) == 0x000A4C, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_6' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_68) == 0x000A50, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_68' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_5) == 0x000A68, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_5' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_4) == 0x000A6C, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_4' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_69) == 0x000A70, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_69' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_3) == 0x000A88, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_3' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_2) == 0x000A8C, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_2' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_33) == 0x000A90, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_33' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_70) == 0x000AA8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_70' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_71) == 0x000AC0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_71' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_34) == 0x000AD8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_34' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_72) == 0x000AF0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_72' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_73) == 0x000B08, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_73' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_35) == 0x000B20, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_35' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue_1) == 0x000B38, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputAxisEvent_AxisValue) == 0x000B3C, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_Less_FloatFloat_ReturnValue) == 0x000B40, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000B41, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000B42, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000B43, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_74) == 0x000B48, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_74' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_75) == 0x000B60, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_75' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_36) == 0x000B78, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_36' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_76) == 0x000B90, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_76' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_77) == 0x000BA8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_77' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_37) == 0x000BC0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_37' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_78) == 0x000BD8, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_78' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_79) == 0x000BF0, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_79' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, Temp_struct_Variable_38) == 0x000C08, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::Temp_struct_Variable_38' has a wrong offset!");
static_assert(offsetof(PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar, K2Node_InputActionEvent_Key_80) == 0x000C20, "Member 'PAWN_Avatar_C_ExecuteUbergraph_PAWN_Avatar::K2Node_InputActionEvent_Key_80' has a wrong offset!");
