#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Mutant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_MutantVariations_structs.hpp"
#include "PAWN_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_Mutant.PAWN_Mutant_C
// 0x0080 (0x0A90 - 0x0A10)
class APAWN_Mutant_C final : public APAWN_Enemy_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_Mutant_C;                      // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     FootAudioR;                                        // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioL;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_MeleeDamageComponent_C*           COMP_MeleeDamageComponent;                         // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RightHandHitbox;                                   // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RightForearmHitbox;                                // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftHandHitbox;                                    // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftForearmHitbox;                                 // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpineBoneName;                                     // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPhysicalAnimationData                 DamageImpulsePhysicsData;                          // 0x0A60(0x0024)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	ENUM_MutantVariations                         MutantVariation;                                   // 0x0A84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PAWN_Mutant(int32 EntryPoint);
	void BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature(const class USoundWave* PlayingSoundWave, const float EnvelopeValue);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void TrySetSpawnData(bool* Result);
	void TryRandomizeMutantVariant(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_Mutant_C">();
	}
	static class APAWN_Mutant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_Mutant_C>();
	}
};
static_assert(alignof(APAWN_Mutant_C) == 0x000010, "Wrong alignment on APAWN_Mutant_C");
static_assert(sizeof(APAWN_Mutant_C) == 0x000A90, "Wrong size on APAWN_Mutant_C");
static_assert(offsetof(APAWN_Mutant_C, UberGraphFrame_PAWN_Mutant_C) == 0x000A08, "Member 'APAWN_Mutant_C::UberGraphFrame_PAWN_Mutant_C' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, FootAudioR) == 0x000A10, "Member 'APAWN_Mutant_C::FootAudioR' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, FootAudioL) == 0x000A18, "Member 'APAWN_Mutant_C::FootAudioL' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, MouthAudio) == 0x000A20, "Member 'APAWN_Mutant_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, ScanBox) == 0x000A28, "Member 'APAWN_Mutant_C::ScanBox' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, COMP_MeleeDamageComponent) == 0x000A30, "Member 'APAWN_Mutant_C::COMP_MeleeDamageComponent' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, RightHandHitbox) == 0x000A38, "Member 'APAWN_Mutant_C::RightHandHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, RightForearmHitbox) == 0x000A40, "Member 'APAWN_Mutant_C::RightForearmHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, LeftHandHitbox) == 0x000A48, "Member 'APAWN_Mutant_C::LeftHandHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, LeftForearmHitbox) == 0x000A50, "Member 'APAWN_Mutant_C::LeftForearmHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, SpineBoneName) == 0x000A58, "Member 'APAWN_Mutant_C::SpineBoneName' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, DamageImpulsePhysicsData) == 0x000A60, "Member 'APAWN_Mutant_C::DamageImpulsePhysicsData' has a wrong offset!");
static_assert(offsetof(APAWN_Mutant_C, MutantVariation) == 0x000A84, "Member 'APAWN_Mutant_C::MutantVariation' has a wrong offset!");

}

