#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_DiegoV3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PAWN_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_DiegoV3.PAWN_DiegoV3_C
// 0x0040 (0x0A50 - 0x0A10)
class APAWN_DiegoV3_C final : public APAWN_Enemy_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_DiegoV3_C;                     // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_TeleportEffect;                                 // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioR;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioL;                                        // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    RapierDeathAchievement;                            // 0x0A38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_PAWN_DiegoV3(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnCharacterDied(class UOBJ_ImpactData_C* ImpactData, const struct FAttribDamageInstance& DamageInstance, class AActor* OtherActor, bool* Result);
	void TryCompleteRapierDeathAchievement(class UAttribDamageType* DamageType);
	void ForceReappear();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_DiegoV3_C">();
	}
	static class APAWN_DiegoV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_DiegoV3_C>();
	}
};
static_assert(alignof(APAWN_DiegoV3_C) == 0x000010, "Wrong alignment on APAWN_DiegoV3_C");
static_assert(sizeof(APAWN_DiegoV3_C) == 0x000A50, "Wrong size on APAWN_DiegoV3_C");
static_assert(offsetof(APAWN_DiegoV3_C, UberGraphFrame_PAWN_DiegoV3_C) == 0x000A08, "Member 'APAWN_DiegoV3_C::UberGraphFrame_PAWN_DiegoV3_C' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, NS_TeleportEffect) == 0x000A10, "Member 'APAWN_DiegoV3_C::NS_TeleportEffect' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, FootAudioR) == 0x000A18, "Member 'APAWN_DiegoV3_C::FootAudioR' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, FootAudioL) == 0x000A20, "Member 'APAWN_DiegoV3_C::FootAudioL' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, MouthAudio) == 0x000A28, "Member 'APAWN_DiegoV3_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, ScanBox) == 0x000A30, "Member 'APAWN_DiegoV3_C::ScanBox' has a wrong offset!");
static_assert(offsetof(APAWN_DiegoV3_C, RapierDeathAchievement) == 0x000A38, "Member 'APAWN_DiegoV3_C::RapierDeathAchievement' has a wrong offset!");

}

