#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Security1Bot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PAWN_Enemy_classes.hpp"
#include "ENUM_LeftRight_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_Security1Bot.PAWN_Security1Bot_C
// 0x0080 (0x0A90 - 0x0A10)
class APAWN_Security1Bot_C final : public APAWN_Enemy_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_Security1Bot_C;                // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Hitbox_Melee_R;                                    // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_Melee_L;                                    // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     HoverIdleAudio;                                    // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SecBot_Thruster_Right;                          // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SecBot_Thruster_Left;                           // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_MeleeDamageComponent_C*           COMP_MeleeDamageComponent;                         // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BlastOffStartTimestamp;                            // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlastOffDuration;                                  // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SOCKET_Torso;                                      // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            EngineThrustCurve;                                 // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            HoverThrustCurve;                                  // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RotateThrustCurve;                                 // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlastOffEngineStrength;                            // 0x0A78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlastOffHoverStrength;                             // 0x0A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlastOffRotateStrength;                            // 0x0A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlastOff_RotateForward;                            // 0x0A84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BlastOff_RotateLeft;                               // 0x0A85(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PAWN_Security1Bot(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateCustomDeathBehavior(bool* IsFinished);
	void UpdateBlastOff(bool* IsFinished);
	void CheckBlastOffOverlap(bool* IsOverlapping);
	void HasCustomDeathBehavior(bool* Result);
	void SpawnEngineExplosion(ENUM_LeftRight Engine);
	void OnDynaDamage(class FName DynaElement, bool OnBeginPlay);
	void BlastOffFinished();
	void SetCharacterPropertiesToDead(bool* Result);
	void OnCharacterVisibilityChanged(bool VisibilityState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_Security1Bot_C">();
	}
	static class APAWN_Security1Bot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_Security1Bot_C>();
	}
};
static_assert(alignof(APAWN_Security1Bot_C) == 0x000010, "Wrong alignment on APAWN_Security1Bot_C");
static_assert(sizeof(APAWN_Security1Bot_C) == 0x000A90, "Wrong size on APAWN_Security1Bot_C");
static_assert(offsetof(APAWN_Security1Bot_C, UberGraphFrame_PAWN_Security1Bot_C) == 0x000A08, "Member 'APAWN_Security1Bot_C::UberGraphFrame_PAWN_Security1Bot_C' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, Hitbox_Melee_R) == 0x000A10, "Member 'APAWN_Security1Bot_C::Hitbox_Melee_R' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, Hitbox_Melee_L) == 0x000A18, "Member 'APAWN_Security1Bot_C::Hitbox_Melee_L' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, HoverIdleAudio) == 0x000A20, "Member 'APAWN_Security1Bot_C::HoverIdleAudio' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, MouthAudio) == 0x000A28, "Member 'APAWN_Security1Bot_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, NS_SecBot_Thruster_Right) == 0x000A30, "Member 'APAWN_Security1Bot_C::NS_SecBot_Thruster_Right' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, NS_SecBot_Thruster_Left) == 0x000A38, "Member 'APAWN_Security1Bot_C::NS_SecBot_Thruster_Left' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, ScanBox) == 0x000A40, "Member 'APAWN_Security1Bot_C::ScanBox' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, COMP_MeleeDamageComponent) == 0x000A48, "Member 'APAWN_Security1Bot_C::COMP_MeleeDamageComponent' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOffStartTimestamp) == 0x000A50, "Member 'APAWN_Security1Bot_C::BlastOffStartTimestamp' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOffDuration) == 0x000A54, "Member 'APAWN_Security1Bot_C::BlastOffDuration' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, SOCKET_Torso) == 0x000A58, "Member 'APAWN_Security1Bot_C::SOCKET_Torso' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, EngineThrustCurve) == 0x000A60, "Member 'APAWN_Security1Bot_C::EngineThrustCurve' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, HoverThrustCurve) == 0x000A68, "Member 'APAWN_Security1Bot_C::HoverThrustCurve' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, RotateThrustCurve) == 0x000A70, "Member 'APAWN_Security1Bot_C::RotateThrustCurve' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOffEngineStrength) == 0x000A78, "Member 'APAWN_Security1Bot_C::BlastOffEngineStrength' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOffHoverStrength) == 0x000A7C, "Member 'APAWN_Security1Bot_C::BlastOffHoverStrength' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOffRotateStrength) == 0x000A80, "Member 'APAWN_Security1Bot_C::BlastOffRotateStrength' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOff_RotateForward) == 0x000A84, "Member 'APAWN_Security1Bot_C::BlastOff_RotateForward' has a wrong offset!");
static_assert(offsetof(APAWN_Security1Bot_C, BlastOff_RotateLeft) == 0x000A85, "Member 'APAWN_Security1Bot_C::BlastOff_RotateLeft' has a wrong offset!");

}

