#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Mutant

#include "Basic.hpp"

#include "ENUM_MutantVariations_structs.hpp"
#include "STRUCT_MutantVariantMesh_structs.hpp"


namespace SDK::Params
{

// Function PAWN_Mutant.PAWN_Mutant_C.ExecuteUbergraph_PAWN_Mutant
// 0x0040 (0x0040 - 0x0000)
struct PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USoundWave*                       K2Node_ComponentBoundEvent_PlayingSoundWave;       // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_EnvelopeValue;          // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVoiceAmplitude_Result;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant) == 0x000008, "Wrong alignment on PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant");
static_assert(sizeof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant) == 0x000040, "Wrong size on PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, EntryPoint) == 0x000000, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::EntryPoint' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000010, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, K2Node_ComponentBoundEvent_PlayingSoundWave) == 0x000028, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::K2Node_ComponentBoundEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, K2Node_ComponentBoundEvent_EnvelopeValue) == 0x000030, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::K2Node_ComponentBoundEvent_EnvelopeValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, CallFunc_MapRangeClamped_ReturnValue) == 0x000034, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant, CallFunc_SetVoiceAmplitude_Result) == 0x000038, "Member 'PAWN_Mutant_C_ExecuteUbergraph_PAWN_Mutant::CallFunc_SetVoiceAmplitude_Result' has a wrong offset!");

// Function PAWN_Mutant.PAWN_Mutant_C.BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnvelopeValue;                                     // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature) == 0x000008, "Wrong alignment on PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature");
static_assert(sizeof(PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature) == 0x000010, "Wrong size on PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature");
static_assert(offsetof(PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature, PlayingSoundWave) == 0x000000, "Member 'PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature, EnvelopeValue) == 0x000008, "Member 'PAWN_Mutant_C_BndEvt__PAWN_Mutant_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature::EnvelopeValue' has a wrong offset!");

// Function PAWN_Mutant.PAWN_Mutant_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct PAWN_Mutant_C_UserConstructionScript final
{
public:
	class UDataTable*                             DesiredDynaData;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DesiredDismemberData;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          DesiredMesh;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UStaticMesh*>         DistanceFields;                                    // 0x0018(0x0050)(Edit, BlueprintVisible)
	bool                                          CallFunc_TryRandomizeMutantVariant_Result;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MutantVariantMesh              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Mutant_C_UserConstructionScript) == 0x000008, "Wrong alignment on PAWN_Mutant_C_UserConstructionScript");
static_assert(sizeof(PAWN_Mutant_C_UserConstructionScript) == 0x0000E0, "Wrong size on PAWN_Mutant_C_UserConstructionScript");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, DesiredDynaData) == 0x000000, "Member 'PAWN_Mutant_C_UserConstructionScript::DesiredDynaData' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, DesiredDismemberData) == 0x000008, "Member 'PAWN_Mutant_C_UserConstructionScript::DesiredDismemberData' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, DesiredMesh) == 0x000010, "Member 'PAWN_Mutant_C_UserConstructionScript::DesiredMesh' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, DistanceFields) == 0x000018, "Member 'PAWN_Mutant_C_UserConstructionScript::DistanceFields' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_TryRandomizeMutantVariant_Result) == 0x000068, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_TryRandomizeMutantVariant_Result' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000070, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_Replace_ReturnValue) == 0x000080, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000090, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000C8, "Member 'PAWN_Mutant_C_UserConstructionScript::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0000D0, "Member 'PAWN_Mutant_C_UserConstructionScript::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'PAWN_Mutant_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PAWN_Mutant.PAWN_Mutant_C.TrySetSpawnData
// 0x00B8 (0x00B8 - 0x0000)
struct PAWN_Mutant_C_TrySetSpawnData final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_MutantVariations                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MutantVariations                         Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             Temp_object_Variable_9;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_10;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_11;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_12;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_13;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_14;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_15;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_16;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Temp_object_Variable_17;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_Select_Default_1;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetSpawnData_Result;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Mutant_C_TrySetSpawnData) == 0x000008, "Wrong alignment on PAWN_Mutant_C_TrySetSpawnData");
static_assert(sizeof(PAWN_Mutant_C_TrySetSpawnData) == 0x0000B8, "Wrong size on PAWN_Mutant_C_TrySetSpawnData");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Result) == 0x000000, "Member 'PAWN_Mutant_C_TrySetSpawnData::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_byte_Variable) == 0x000001, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable) == 0x000008, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_1) == 0x000010, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_2) == 0x000018, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_3) == 0x000020, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_4) == 0x000028, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_5) == 0x000030, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_6) == 0x000038, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_7) == 0x000040, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_8) == 0x000048, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_byte_Variable_1) == 0x000050, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_9) == 0x000058, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_10) == 0x000060, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_11) == 0x000068, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_12) == 0x000070, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_13) == 0x000078, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_14) == 0x000080, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_15) == 0x000088, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_16) == 0x000090, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, Temp_object_Variable_17) == 0x000098, "Member 'PAWN_Mutant_C_TrySetSpawnData::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, K2Node_Select_Default) == 0x0000A0, "Member 'PAWN_Mutant_C_TrySetSpawnData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, K2Node_Select_Default_1) == 0x0000A8, "Member 'PAWN_Mutant_C_TrySetSpawnData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TrySetSpawnData, CallFunc_TrySetSpawnData_Result) == 0x0000B0, "Member 'PAWN_Mutant_C_TrySetSpawnData::CallFunc_TrySetSpawnData_Result' has a wrong offset!");

// Function PAWN_Mutant.PAWN_Mutant_C.TryRandomizeMutantVariant
// 0x0018 (0x0018 - 0x0000)
struct PAWN_Mutant_C_TryRandomizeMutantVariant final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Mutant_C_TryRandomizeMutantVariant) == 0x000004, "Wrong alignment on PAWN_Mutant_C_TryRandomizeMutantVariant");
static_assert(sizeof(PAWN_Mutant_C_TryRandomizeMutantVariant) == 0x000018, "Wrong size on PAWN_Mutant_C_TryRandomizeMutantVariant");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, Result) == 0x000000, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000010, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Mutant_C_TryRandomizeMutantVariant, CallFunc_GetValidValue_ReturnValue) == 0x000015, "Member 'PAWN_Mutant_C_TryRandomizeMutantVariant::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

}

