#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_CyberBully

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PAWN_CyberBully.PAWN_CyberBully_C.ExecuteUbergraph_PAWN_CyberBully
// 0x0024 (0x0024 - 0x0000)
struct PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully) == 0x000004, "Wrong alignment on PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully");
static_assert(sizeof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully) == 0x000024, "Wrong size on PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, EntryPoint) == 0x000000, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::EntryPoint' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, CallFunc_GetSocketRotation_ReturnValue) == 0x000008, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, CallFunc_BreakRotator_Roll) == 0x000014, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, CallFunc_BreakRotator_Pitch) == 0x000018, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, CallFunc_BreakRotator_Yaw) == 0x00001C, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'PAWN_CyberBully_C_ExecuteUbergraph_PAWN_CyberBully::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PAWN_CyberBully_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyberBully_C_ReceiveTick) == 0x000004, "Wrong alignment on PAWN_CyberBully_C_ReceiveTick");
static_assert(sizeof(PAWN_CyberBully_C_ReceiveTick) == 0x000004, "Wrong size on PAWN_CyberBully_C_ReceiveTick");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PAWN_CyberBully_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.DeployBullorang
// 0x0070 (0x0070 - 0x0000)
struct PAWN_CyberBully_C_DeployBullorang final
{
public:
	class UClass*                                 BullorangClass;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevel*                                 CallFunc_GetActorLevel_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class ABULLORANG_Base_C*                      CallFunc_SpawnActorInLevel_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIMBP_CyberBully_C*                   K2Node_DynamicCast_AsANIMBP_Cyber_Bully;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyberBully_C_DeployBullorang) == 0x000010, "Wrong alignment on PAWN_CyberBully_C_DeployBullorang");
static_assert(sizeof(PAWN_CyberBully_C_DeployBullorang) == 0x000070, "Wrong size on PAWN_CyberBully_C_DeployBullorang");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, BullorangClass) == 0x000000, "Member 'PAWN_CyberBully_C_DeployBullorang::BullorangClass' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, CallFunc_GetActorLevel_ReturnValue) == 0x000008, "Member 'PAWN_CyberBully_C_DeployBullorang::CallFunc_GetActorLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'PAWN_CyberBully_C_DeployBullorang::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, CallFunc_SpawnActorInLevel_ReturnValue) == 0x000040, "Member 'PAWN_CyberBully_C_DeployBullorang::CallFunc_SpawnActorInLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'PAWN_CyberBully_C_DeployBullorang::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, K2Node_DynamicCast_AsANIMBP_Cyber_Bully) == 0x000050, "Member 'PAWN_CyberBully_C_DeployBullorang::K2Node_DynamicCast_AsANIMBP_Cyber_Bully' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'PAWN_CyberBully_C_DeployBullorang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_DeployBullorang, CallFunc_ApplyMod_ReturnValue) == 0x000060, "Member 'PAWN_CyberBully_C_DeployBullorang::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.DisplayMeshBullorang
// 0x0001 (0x0001 - 0x0000)
struct PAWN_CyberBully_C_DisplayMeshBullorang final
{
public:
	bool                                          Display;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyberBully_C_DisplayMeshBullorang) == 0x000001, "Wrong alignment on PAWN_CyberBully_C_DisplayMeshBullorang");
static_assert(sizeof(PAWN_CyberBully_C_DisplayMeshBullorang) == 0x000001, "Wrong size on PAWN_CyberBully_C_DisplayMeshBullorang");
static_assert(offsetof(PAWN_CyberBully_C_DisplayMeshBullorang, Display) == 0x000000, "Member 'PAWN_CyberBully_C_DisplayMeshBullorang::Display' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.ReceiveBullorang
// 0x0020 (0x0020 - 0x0000)
struct PAWN_CyberBully_C_ReceiveBullorang final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExpireMod_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIMBP_CyberBully_C*                   K2Node_DynamicCast_AsANIMBP_Cyber_Bully;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyberBully_C_ReceiveBullorang) == 0x000008, "Wrong alignment on PAWN_CyberBully_C_ReceiveBullorang");
static_assert(sizeof(PAWN_CyberBully_C_ReceiveBullorang) == 0x000020, "Wrong size on PAWN_CyberBully_C_ReceiveBullorang");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveBullorang, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PAWN_CyberBully_C_ReceiveBullorang::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveBullorang, CallFunc_ExpireMod_ReturnValue) == 0x000001, "Member 'PAWN_CyberBully_C_ReceiveBullorang::CallFunc_ExpireMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveBullorang, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PAWN_CyberBully_C_ReceiveBullorang::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveBullorang, K2Node_DynamicCast_AsANIMBP_Cyber_Bully) == 0x000010, "Member 'PAWN_CyberBully_C_ReceiveBullorang::K2Node_DynamicCast_AsANIMBP_Cyber_Bully' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_ReceiveBullorang, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PAWN_CyberBully_C_ReceiveBullorang::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.GetIceShieldSize
// 0x0004 (0x0004 - 0x0000)
struct PAWN_CyberBully_C_GetIceShieldSize final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyberBully_C_GetIceShieldSize) == 0x000004, "Wrong alignment on PAWN_CyberBully_C_GetIceShieldSize");
static_assert(sizeof(PAWN_CyberBully_C_GetIceShieldSize) == 0x000004, "Wrong size on PAWN_CyberBully_C_GetIceShieldSize");
static_assert(offsetof(PAWN_CyberBully_C_GetIceShieldSize, Result) == 0x000000, "Member 'PAWN_CyberBully_C_GetIceShieldSize::Result' has a wrong offset!");

// Function PAWN_CyberBully.PAWN_CyberBully_C.OnCharacterDied
// 0x0110 (0x0110 - 0x0000)
struct PAWN_CyberBully_C_OnCharacterDied final
{
public:
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 OtherActor;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCharacterDied_Result;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyberBully_C_OnCharacterDied) == 0x000010, "Wrong alignment on PAWN_CyberBully_C_OnCharacterDied");
static_assert(sizeof(PAWN_CyberBully_C_OnCharacterDied) == 0x000110, "Wrong size on PAWN_CyberBully_C_OnCharacterDied");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, ImpactData) == 0x000000, "Member 'PAWN_CyberBully_C_OnCharacterDied::ImpactData' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, DamageInstance) == 0x000008, "Member 'PAWN_CyberBully_C_OnCharacterDied::DamageInstance' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, OtherActor) == 0x000030, "Member 'PAWN_CyberBully_C_OnCharacterDied::OtherActor' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, Result) == 0x000038, "Member 'PAWN_CyberBully_C_OnCharacterDied::Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_OnCharacterDied_Result) == 0x000039, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_OnCharacterDied_Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Location) == 0x000070, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_GetTransform_ReturnValue_1) == 0x0000A0, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000D0, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Location_1) == 0x0000D8, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Rotation_1) == 0x0000E4, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_BreakTransform_Scale_1) == 0x0000F0, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(PAWN_CyberBully_C_OnCharacterDied, CallFunc_MakeLiteralName_ReturnValue) == 0x0000FC, "Member 'PAWN_CyberBully_C_OnCharacterDied::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

}

