#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_CyborgDrone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.ExecuteUbergraph_PAWN_CyborgDrone
// 0x0040 (0x0040 - 0x0000)
struct PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USoundWave*                       K2Node_ComponentBoundEvent_PlayingSoundWave;       // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_EnvelopeValue;          // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVoiceAmplitude_Result;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone) == 0x000008, "Wrong alignment on PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone");
static_assert(sizeof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone) == 0x000040, "Wrong size on PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, EntryPoint) == 0x000000, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, K2Node_ComponentBoundEvent_PlayingSoundWave) == 0x000010, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::K2Node_ComponentBoundEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, K2Node_ComponentBoundEvent_EnvelopeValue) == 0x000018, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::K2Node_ComponentBoundEvent_EnvelopeValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000020, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, CallFunc_MapRangeClamped_ReturnValue) == 0x000034, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone, CallFunc_SetVoiceAmplitude_Result) == 0x000038, "Member 'PAWN_CyborgDrone_C_ExecuteUbergraph_PAWN_CyborgDrone::CallFunc_SetVoiceAmplitude_Result' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnvelopeValue;                                     // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature) == 0x000008, "Wrong alignment on PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature");
static_assert(sizeof(PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature) == 0x000010, "Wrong size on PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature");
static_assert(offsetof(PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature, PlayingSoundWave) == 0x000000, "Member 'PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature, EnvelopeValue) == 0x000008, "Member 'PAWN_CyborgDrone_C_BndEvt__PAWN_CyborgDrone_MouthAudio_K2Node_ComponentBoundEvent_1_OnAudioSingleEnvelopeValue__DelegateSignature::EnvelopeValue' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.OnCharacterDied
// 0x0040 (0x0040 - 0x0000)
struct PAWN_CyborgDrone_C_OnCharacterDied final
{
public:
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 OtherActor;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCharacterDied_Result;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_OnCharacterDied) == 0x000008, "Wrong alignment on PAWN_CyborgDrone_C_OnCharacterDied");
static_assert(sizeof(PAWN_CyborgDrone_C_OnCharacterDied) == 0x000040, "Wrong size on PAWN_CyborgDrone_C_OnCharacterDied");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterDied, ImpactData) == 0x000000, "Member 'PAWN_CyborgDrone_C_OnCharacterDied::ImpactData' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterDied, DamageInstance) == 0x000008, "Member 'PAWN_CyborgDrone_C_OnCharacterDied::DamageInstance' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterDied, OtherActor) == 0x000030, "Member 'PAWN_CyborgDrone_C_OnCharacterDied::OtherActor' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterDied, Result) == 0x000038, "Member 'PAWN_CyborgDrone_C_OnCharacterDied::Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterDied, CallFunc_OnCharacterDied_Result) == 0x000039, "Member 'PAWN_CyborgDrone_C_OnCharacterDied::CallFunc_OnCharacterDied_Result' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.DestroyDroneWeapon
// 0x0120 (0x0120 - 0x0000)
struct PAWN_CyborgDrone_C_DestroyDroneWeapon final
{
public:
	bool                                          DuringBeginPlay;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class ULevel*                                 CallFunc_GetActorLevel_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APICKUP_Base_C*                         CallFunc_SpawnActorInLevel_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_DestroyDroneWeapon) == 0x000010, "Wrong alignment on PAWN_CyborgDrone_C_DestroyDroneWeapon");
static_assert(sizeof(PAWN_CyborgDrone_C_DestroyDroneWeapon) == 0x000120, "Wrong size on PAWN_CyborgDrone_C_DestroyDroneWeapon");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, DuringBeginPlay) == 0x000000, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::DuringBeginPlay' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, SpawnTransform) == 0x000010, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::SpawnTransform' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_GetActorLevel_ReturnValue) == 0x000040, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_GetActorLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_SpawnActorInLevel_ReturnValue) == 0x000050, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_SpawnActorInLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000090, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_DestroyDroneWeapon, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'PAWN_CyborgDrone_C_DestroyDroneWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.InitializeCharacterAsDead
// 0x0002 (0x0002 - 0x0000)
struct PAWN_CyborgDrone_C_InitializeCharacterAsDead final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeCharacterAsDead_Result;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_InitializeCharacterAsDead) == 0x000001, "Wrong alignment on PAWN_CyborgDrone_C_InitializeCharacterAsDead");
static_assert(sizeof(PAWN_CyborgDrone_C_InitializeCharacterAsDead) == 0x000002, "Wrong size on PAWN_CyborgDrone_C_InitializeCharacterAsDead");
static_assert(offsetof(PAWN_CyborgDrone_C_InitializeCharacterAsDead, Result) == 0x000000, "Member 'PAWN_CyborgDrone_C_InitializeCharacterAsDead::Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_InitializeCharacterAsDead, CallFunc_InitializeCharacterAsDead_Result) == 0x000001, "Member 'PAWN_CyborgDrone_C_InitializeCharacterAsDead::CallFunc_InitializeCharacterAsDead_Result' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.OnUpdateLaserVisibility
// 0x0010 (0x0010 - 0x0000)
struct PAWN_CyborgDrone_C_OnUpdateLaserVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterVisible_Result;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnemyAware_Result;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility) == 0x000004, "Wrong alignment on PAWN_CyborgDrone_C_OnUpdateLaserVisibility");
static_assert(sizeof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility) == 0x000010, "Wrong size on PAWN_CyborgDrone_C_OnUpdateLaserVisibility");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, VisibilityState) == 0x000000, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_IsCharacterVisible_Result) == 0x000002, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_IsCharacterVisible_Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_GetAttribValue_ReturnValue) == 0x000004, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_Not_PreBool_ReturnValue_1) == 0x000009, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_IsEnemyAware_Result) == 0x00000A, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_IsEnemyAware_Result' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnUpdateLaserVisibility, CallFunc_BooleanAND_ReturnValue_1) == 0x00000C, "Member 'PAWN_CyborgDrone_C_OnUpdateLaserVisibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.OnMagneticDisableStateChanged
// 0x0001 (0x0001 - 0x0000)
struct PAWN_CyborgDrone_C_OnMagneticDisableStateChanged final
{
public:
	bool                                          DisableState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_OnMagneticDisableStateChanged) == 0x000001, "Wrong alignment on PAWN_CyborgDrone_C_OnMagneticDisableStateChanged");
static_assert(sizeof(PAWN_CyborgDrone_C_OnMagneticDisableStateChanged) == 0x000001, "Wrong size on PAWN_CyborgDrone_C_OnMagneticDisableStateChanged");
static_assert(offsetof(PAWN_CyborgDrone_C_OnMagneticDisableStateChanged, DisableState) == 0x000000, "Member 'PAWN_CyborgDrone_C_OnMagneticDisableStateChanged::DisableState' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.OnDynaDamage
// 0x0060 (0x0060 - 0x0000)
struct PAWN_CyborgDrone_C_OnDynaDamage final
{
public:
	class FName                                   DynaElement;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnBeginPlay;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_OnDynaDamage) == 0x000010, "Wrong alignment on PAWN_CyborgDrone_C_OnDynaDamage");
static_assert(sizeof(PAWN_CyborgDrone_C_OnDynaDamage) == 0x000060, "Wrong size on PAWN_CyborgDrone_C_OnDynaDamage");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, DynaElement) == 0x000000, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::DynaElement' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, OnBeginPlay) == 0x000008, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::OnBeginPlay' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, CallFunc_GetRightVector_ReturnValue) == 0x000040, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_CyborgDrone_C_OnDynaDamage, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000058, "Member 'PAWN_CyborgDrone_C_OnDynaDamage::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function PAWN_CyborgDrone.PAWN_CyborgDrone_C.OnCharacterVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct PAWN_CyborgDrone_C_OnCharacterVisibilityChanged final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_CyborgDrone_C_OnCharacterVisibilityChanged) == 0x000001, "Wrong alignment on PAWN_CyborgDrone_C_OnCharacterVisibilityChanged");
static_assert(sizeof(PAWN_CyborgDrone_C_OnCharacterVisibilityChanged) == 0x000001, "Wrong size on PAWN_CyborgDrone_C_OnCharacterVisibilityChanged");
static_assert(offsetof(PAWN_CyborgDrone_C_OnCharacterVisibilityChanged, VisibilityState) == 0x000000, "Member 'PAWN_CyborgDrone_C_OnCharacterVisibilityChanged::VisibilityState' has a wrong offset!");

}

