#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_DiegoV2

#include "Basic.hpp"


namespace SDK::Params
{

// Function PAWN_DiegoV2.PAWN_DiegoV2_C.ExecuteUbergraph_PAWN_DiegoV2
// 0x0028 (0x0028 - 0x0000)
struct PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEvent_DetectionEvent;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2) == 0x000008, "Wrong alignment on PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2");
static_assert(sizeof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2) == 0x000028, "Wrong size on PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2");
static_assert(offsetof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2, EntryPoint) == 0x000000, "Member 'PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000010, "Member 'PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2, CallFunc_GetDetectionEvent_DetectionEvent) == 0x000020, "Member 'PAWN_DiegoV2_C_ExecuteUbergraph_PAWN_DiegoV2::CallFunc_GetDetectionEvent_DetectionEvent' has a wrong offset!");

// Function PAWN_DiegoV2.PAWN_DiegoV2_C.ToggleSwordEffects
// 0x0003 (0x0003 - 0x0000)
struct PAWN_DiegoV2_C_ToggleSwordEffects final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_DiegoV2_C_ToggleSwordEffects) == 0x000001, "Wrong alignment on PAWN_DiegoV2_C_ToggleSwordEffects");
static_assert(sizeof(PAWN_DiegoV2_C_ToggleSwordEffects) == 0x000003, "Wrong size on PAWN_DiegoV2_C_ToggleSwordEffects");
static_assert(offsetof(PAWN_DiegoV2_C_ToggleSwordEffects, Enabled) == 0x000000, "Member 'PAWN_DiegoV2_C_ToggleSwordEffects::Enabled' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ToggleSwordEffects, CallFunc_IsActive_ReturnValue) == 0x000001, "Member 'PAWN_DiegoV2_C_ToggleSwordEffects::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_DiegoV2_C_ToggleSwordEffects, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'PAWN_DiegoV2_C_ToggleSwordEffects::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

