#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_CyborgAssassin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PAWN_Cyborg_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_CyborgAssassin.PAWN_CyborgAssassin_C
// 0x00A0 (0x0AB0 - 0x0A10)
class APAWN_CyborgAssassin_C final : public APAWN_Cyborg_Base_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_CyborgAssassin_C;              // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     FootAudioR;                                        // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioL;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MuzzleFlash;                                       // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AssaultRifle;                                      // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Laser1;                                            // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_MeleeDamageComponent_C*           COMP_MeleeDamageComponent;                         // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RightHandHitbox;                                   // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RightForearmHitbox;                                // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftHandHitbox;                                    // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LeftForearmHitbox;                                 // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RootBoneName;                                      // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpineBoneName;                                     // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPhysicalAnimationData                 DeathRattlePhysicsData;                            // 0x0A80(0x0024)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_PAWN_CyborgAssassin(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void SetLaserEnabled(bool IsEnabled);
	void UpdateLaser();
	void DestroyRifle(bool DuringBeginPlay);
	void InitializeCharacterAsDead(bool* Result);
	void OnCharacterDied(class UOBJ_ImpactData_C* ImpactData, const struct FAttribDamageInstance& DamageInstance, class AActor* OtherActor, bool* Result);
	void OnUpdateLaserVisibility();
	void OnMagneticDisableStateChanged(bool DisableState);
	void OnCharacterVisibilityChanged(bool VisibilityState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_CyborgAssassin_C">();
	}
	static class APAWN_CyborgAssassin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_CyborgAssassin_C>();
	}
};
static_assert(alignof(APAWN_CyborgAssassin_C) == 0x000010, "Wrong alignment on APAWN_CyborgAssassin_C");
static_assert(sizeof(APAWN_CyborgAssassin_C) == 0x000AB0, "Wrong size on APAWN_CyborgAssassin_C");
static_assert(offsetof(APAWN_CyborgAssassin_C, UberGraphFrame_PAWN_CyborgAssassin_C) == 0x000A08, "Member 'APAWN_CyborgAssassin_C::UberGraphFrame_PAWN_CyborgAssassin_C' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, FootAudioR) == 0x000A10, "Member 'APAWN_CyborgAssassin_C::FootAudioR' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, FootAudioL) == 0x000A18, "Member 'APAWN_CyborgAssassin_C::FootAudioL' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, MouthAudio) == 0x000A20, "Member 'APAWN_CyborgAssassin_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, MuzzleFlash) == 0x000A28, "Member 'APAWN_CyborgAssassin_C::MuzzleFlash' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, AssaultRifle) == 0x000A30, "Member 'APAWN_CyborgAssassin_C::AssaultRifle' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, Laser1) == 0x000A38, "Member 'APAWN_CyborgAssassin_C::Laser1' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, ScanBox) == 0x000A40, "Member 'APAWN_CyborgAssassin_C::ScanBox' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, COMP_MeleeDamageComponent) == 0x000A48, "Member 'APAWN_CyborgAssassin_C::COMP_MeleeDamageComponent' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, RightHandHitbox) == 0x000A50, "Member 'APAWN_CyborgAssassin_C::RightHandHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, RightForearmHitbox) == 0x000A58, "Member 'APAWN_CyborgAssassin_C::RightForearmHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, LeftHandHitbox) == 0x000A60, "Member 'APAWN_CyborgAssassin_C::LeftHandHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, LeftForearmHitbox) == 0x000A68, "Member 'APAWN_CyborgAssassin_C::LeftForearmHitbox' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, RootBoneName) == 0x000A70, "Member 'APAWN_CyborgAssassin_C::RootBoneName' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, SpineBoneName) == 0x000A78, "Member 'APAWN_CyborgAssassin_C::SpineBoneName' has a wrong offset!");
static_assert(offsetof(APAWN_CyborgAssassin_C, DeathRattlePhysicsData) == 0x000A80, "Member 'APAWN_CyborgAssassin_C::DeathRattlePhysicsData' has a wrong offset!");

}

