#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Hopper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PAWN_Hopper.PAWN_Hopper_C.GetProxyBarrelLocation
// 0x003C (0x003C - 0x0000)
struct PAWN_Hopper_C_GetProxyBarrelLocation final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Hopper_C_GetProxyBarrelLocation) == 0x000004, "Wrong alignment on PAWN_Hopper_C_GetProxyBarrelLocation");
static_assert(sizeof(PAWN_Hopper_C_GetProxyBarrelLocation) == 0x00003C, "Wrong size on PAWN_Hopper_C_GetProxyBarrelLocation");
static_assert(offsetof(PAWN_Hopper_C_GetProxyBarrelLocation, Result) == 0x000000, "Member 'PAWN_Hopper_C_GetProxyBarrelLocation::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_GetProxyBarrelLocation, CallFunc_GetUpVector_ReturnValue) == 0x00000C, "Member 'PAWN_Hopper_C_GetProxyBarrelLocation::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_GetProxyBarrelLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'PAWN_Hopper_C_GetProxyBarrelLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_GetProxyBarrelLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000024, "Member 'PAWN_Hopper_C_GetProxyBarrelLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_GetProxyBarrelLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000030, "Member 'PAWN_Hopper_C_GetProxyBarrelLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.EVENT_OnDisableAttribChanged
// 0x0050 (0x0050 - 0x0000)
struct PAWN_Hopper_C_EVENT_OnDisableAttribChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_GetIdleOverrideSequence_IdleOverride;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged) == 0x000008, "Wrong alignment on PAWN_Hopper_C_EVENT_OnDisableAttribChanged");
static_assert(sizeof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged) == 0x000050, "Wrong size on PAWN_Hopper_C_EVENT_OnDisableAttribChanged");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CurrValue) == 0x000000, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, LastValue) == 0x000004, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::LastValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000020, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_GetIdleOverrideSequence_IdleOverride) == 0x000040, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_GetIdleOverrideSequence_IdleOverride' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000049, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004B, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnDisableAttribChanged, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'PAWN_Hopper_C_EVENT_OnDisableAttribChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.EVENT_OnHopperDieFromDisable
// 0x00A8 (0x00A8 - 0x0000)
struct PAWN_Hopper_C_EVENT_OnHopperDieFromDisable final
{
public:
	struct FAttribModApplyData                    DamageApplyData;                                   // 0x0000(0x00A0)(Edit, BlueprintVisible)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Hopper_C_EVENT_OnHopperDieFromDisable) == 0x000008, "Wrong alignment on PAWN_Hopper_C_EVENT_OnHopperDieFromDisable");
static_assert(sizeof(PAWN_Hopper_C_EVENT_OnHopperDieFromDisable) == 0x0000A8, "Wrong size on PAWN_Hopper_C_EVENT_OnHopperDieFromDisable");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHopperDieFromDisable, DamageApplyData) == 0x000000, "Member 'PAWN_Hopper_C_EVENT_OnHopperDieFromDisable::DamageApplyData' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHopperDieFromDisable, CallFunc_ApplyMod_ReturnValue) == 0x0000A0, "Member 'PAWN_Hopper_C_EVENT_OnHopperDieFromDisable::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.OnCharacterDied
// 0x0040 (0x0040 - 0x0000)
struct PAWN_Hopper_C_OnCharacterDied final
{
public:
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 OtherActor;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnCharacterDied_Result;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldHopperExplode_Result;               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_OnCharacterDied) == 0x000008, "Wrong alignment on PAWN_Hopper_C_OnCharacterDied");
static_assert(sizeof(PAWN_Hopper_C_OnCharacterDied) == 0x000040, "Wrong size on PAWN_Hopper_C_OnCharacterDied");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, ImpactData) == 0x000000, "Member 'PAWN_Hopper_C_OnCharacterDied::ImpactData' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, DamageInstance) == 0x000008, "Member 'PAWN_Hopper_C_OnCharacterDied::DamageInstance' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, OtherActor) == 0x000030, "Member 'PAWN_Hopper_C_OnCharacterDied::OtherActor' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, Result) == 0x000038, "Member 'PAWN_Hopper_C_OnCharacterDied::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, CallFunc_OnCharacterDied_Result) == 0x000039, "Member 'PAWN_Hopper_C_OnCharacterDied::CallFunc_OnCharacterDied_Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnCharacterDied, CallFunc_ShouldHopperExplode_Result) == 0x00003A, "Member 'PAWN_Hopper_C_OnCharacterDied::CallFunc_ShouldHopperExplode_Result' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.ShouldHopperExplode
// 0x0038 (0x0038 - 0x0000)
struct PAWN_Hopper_C_ShouldHopperExplode final
{
public:
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_ShouldHopperExplode) == 0x000008, "Wrong alignment on PAWN_Hopper_C_ShouldHopperExplode");
static_assert(sizeof(PAWN_Hopper_C_ShouldHopperExplode) == 0x000038, "Wrong size on PAWN_Hopper_C_ShouldHopperExplode");
static_assert(offsetof(PAWN_Hopper_C_ShouldHopperExplode, DamageInstance) == 0x000000, "Member 'PAWN_Hopper_C_ShouldHopperExplode::DamageInstance' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_ShouldHopperExplode, Result) == 0x000028, "Member 'PAWN_Hopper_C_ShouldHopperExplode::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_ShouldHopperExplode, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'PAWN_Hopper_C_ShouldHopperExplode::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_ShouldHopperExplode, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'PAWN_Hopper_C_ShouldHopperExplode::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.OnHopperExplode
// 0x0140 (0x0140 - 0x0000)
struct PAWN_Hopper_C_OnHopperExplode final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAttribMod*, struct FAttribDamageInstance> CallFunc_ApplyExplosiveDamageAndImpulse_DamageInstances; // 0x00F0(0x0050)()
};
static_assert(alignof(PAWN_Hopper_C_OnHopperExplode) == 0x000010, "Wrong alignment on PAWN_Hopper_C_OnHopperExplode");
static_assert(sizeof(PAWN_Hopper_C_OnHopperExplode) == 0x000140, "Wrong size on PAWN_Hopper_C_OnHopperExplode");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, SourceActor) == 0x000000, "Member 'PAWN_Hopper_C_OnHopperExplode::SourceActor' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000020, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetGameInstance_ReturnValue_1) == 0x000070, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetComponentBounds_Origin) == 0x000078, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetComponentBounds_BoxExtent) == 0x000084, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_GetComponentBounds_SphereRadius) == 0x000090, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x000098, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'PAWN_Hopper_C_OnHopperExplode::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000B0, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E0, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnHopperExplode, CallFunc_ApplyExplosiveDamageAndImpulse_DamageInstances) == 0x0000F0, "Member 'PAWN_Hopper_C_OnHopperExplode::CallFunc_ApplyExplosiveDamageAndImpulse_DamageInstances' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.OnDeathImpact
// 0x0040 (0x0040 - 0x0000)
struct PAWN_Hopper_C_OnDeathImpact final
{
public:
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UOBJ_ImpactData_C*                      ImpactData;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnDeathImpact_Result;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldHopperExplode_Result;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Hopper_C_OnDeathImpact) == 0x000008, "Wrong alignment on PAWN_Hopper_C_OnDeathImpact");
static_assert(sizeof(PAWN_Hopper_C_OnDeathImpact) == 0x000040, "Wrong size on PAWN_Hopper_C_OnDeathImpact");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, DamageInstance) == 0x000000, "Member 'PAWN_Hopper_C_OnDeathImpact::DamageInstance' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, ImpactData) == 0x000028, "Member 'PAWN_Hopper_C_OnDeathImpact::ImpactData' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, Result) == 0x000030, "Member 'PAWN_Hopper_C_OnDeathImpact::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, CallFunc_OnDeathImpact_Result) == 0x000031, "Member 'PAWN_Hopper_C_OnDeathImpact::CallFunc_OnDeathImpact_Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, CallFunc_ShouldHopperExplode_Result) == 0x000032, "Member 'PAWN_Hopper_C_OnDeathImpact::CallFunc_ShouldHopperExplode_Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_OnDeathImpact, CallFunc_GetPlayerPawn_ReturnValue) == 0x000038, "Member 'PAWN_Hopper_C_OnDeathImpact::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.TryStartHoverEffects
// 0x0028 (0x0028 - 0x0000)
struct PAWN_Hopper_C_TryStartHoverEffects final
{
public:
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_TryStartHoverEffects) == 0x000008, "Wrong alignment on PAWN_Hopper_C_TryStartHoverEffects");
static_assert(sizeof(PAWN_Hopper_C_TryStartHoverEffects) == 0x000028, "Wrong size on PAWN_Hopper_C_TryStartHoverEffects");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue) == 0x000000, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000010, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1) == 0x000018, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverEffects, CallFunc_Not_PreBool_ReturnValue_1) == 0x000022, "Member 'PAWN_Hopper_C_TryStartHoverEffects::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.TryStopHoverEffects
// 0x0018 (0x0018 - 0x0000)
struct PAWN_Hopper_C_TryStopHoverEffects final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_TryStopHoverEffects) == 0x000008, "Wrong alignment on PAWN_Hopper_C_TryStopHoverEffects");
static_assert(sizeof(PAWN_Hopper_C_TryStopHoverEffects) == 0x000018, "Wrong size on PAWN_Hopper_C_TryStopHoverEffects");
static_assert(offsetof(PAWN_Hopper_C_TryStopHoverEffects, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'PAWN_Hopper_C_TryStopHoverEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStopHoverEffects, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue) == 0x000008, "Member 'PAWN_Hopper_C_TryStopHoverEffects::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStopHoverEffects, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'PAWN_Hopper_C_TryStopHoverEffects::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStopHoverEffects, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'PAWN_Hopper_C_TryStopHoverEffects::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.SetCharacterPropertiesToDead
// 0x0002 (0x0002 - 0x0000)
struct PAWN_Hopper_C_SetCharacterPropertiesToDead final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCharacterPropertiesToDead_Result;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_SetCharacterPropertiesToDead) == 0x000001, "Wrong alignment on PAWN_Hopper_C_SetCharacterPropertiesToDead");
static_assert(sizeof(PAWN_Hopper_C_SetCharacterPropertiesToDead) == 0x000002, "Wrong size on PAWN_Hopper_C_SetCharacterPropertiesToDead");
static_assert(offsetof(PAWN_Hopper_C_SetCharacterPropertiesToDead, Result) == 0x000000, "Member 'PAWN_Hopper_C_SetCharacterPropertiesToDead::Result' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_SetCharacterPropertiesToDead, CallFunc_SetCharacterPropertiesToDead_Result) == 0x000001, "Member 'PAWN_Hopper_C_SetCharacterPropertiesToDead::CallFunc_SetCharacterPropertiesToDead_Result' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.TryStartHoverLightTimer
// 0x0008 (0x0008 - 0x0000)
struct PAWN_Hopper_C_TryStartHoverLightTimer final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Hopper_C_TryStartHoverLightTimer) == 0x000004, "Wrong alignment on PAWN_Hopper_C_TryStartHoverLightTimer");
static_assert(sizeof(PAWN_Hopper_C_TryStartHoverLightTimer) == 0x000008, "Wrong size on PAWN_Hopper_C_TryStartHoverLightTimer");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverLightTimer, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'PAWN_Hopper_C_TryStartHoverLightTimer::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverLightTimer, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000004, "Member 'PAWN_Hopper_C_TryStartHoverLightTimer::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_TryStartHoverLightTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'PAWN_Hopper_C_TryStartHoverLightTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.EVENT_OnHoverLightTick
// 0x0034 (0x0034 - 0x0000)
struct PAWN_Hopper_C_EVENT_OnHoverLightTick final
{
public:
	float                                         DesiredIntensityChange;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Hopper_C_EVENT_OnHoverLightTick) == 0x000004, "Wrong alignment on PAWN_Hopper_C_EVENT_OnHoverLightTick");
static_assert(sizeof(PAWN_Hopper_C_EVENT_OnHoverLightTick) == 0x000034, "Wrong size on PAWN_Hopper_C_EVENT_OnHoverLightTick");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, DesiredIntensityChange) == 0x000000, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::DesiredIntensityChange' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, ElapsedTime) == 0x000004, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::ElapsedTime' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CurrentTime) == 0x000008, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CurrentTime' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000024, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000028, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_EVENT_OnHoverLightTick, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'PAWN_Hopper_C_EVENT_OnHoverLightTick::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function PAWN_Hopper.PAWN_Hopper_C.ForceStartNextHoverLightTick
// 0x0018 (0x0018 - 0x0000)
struct PAWN_Hopper_C_ForceStartNextHoverLightTick final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Hopper_C_ForceStartNextHoverLightTick) == 0x000008, "Wrong alignment on PAWN_Hopper_C_ForceStartNextHoverLightTick");
static_assert(sizeof(PAWN_Hopper_C_ForceStartNextHoverLightTick) == 0x000018, "Wrong size on PAWN_Hopper_C_ForceStartNextHoverLightTick");
static_assert(offsetof(PAWN_Hopper_C_ForceStartNextHoverLightTick, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PAWN_Hopper_C_ForceStartNextHoverLightTick::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PAWN_Hopper_C_ForceStartNextHoverLightTick, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'PAWN_Hopper_C_ForceStartNextHoverLightTick::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

