#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Servbot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PAWN_Enemy_classes.hpp"
#include "ENUM_DeathBlowType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_Servbot.PAWN_ServBot_C
// 0x0060 (0x0A70 - 0x0A10)
class APAWN_ServBot_C final : public APAWN_Enemy_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_ServBot_C;                     // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelAudio_C*                     HoverAudio;                                        // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HoverEffect;                                       // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        ServBot_CompartmentMarker;                         // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScanBox;                                           // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_Right_UpperArm;                             // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_Left_UpperArm;                              // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_MeleeDamageComponent_C*           COMP_MeleeDamageComponent;                         // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_Right_Forearm;                              // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_Left_Forearm;                               // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PAWN_ServBot(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnCharacterDied(class UOBJ_ImpactData_C* ImpactData, const struct FAttribDamageInstance& DamageInstance, class AActor* OtherActor, bool* Result);
	void UpdateHoverAudio();
	void InitializeCharacterAsDead(bool* Result);
	void InitializeCharacter(bool* Result);
	void OnDynaDamage(class FName DynaElement, bool OnBeginPlay);
	void OnEnemyAwarenessChanged();
	void SetLowFiVisibilityState(bool NewLowFiState);
	void SetCharacterPropertiesToDead(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_ServBot_C">();
	}
	static class APAWN_ServBot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_ServBot_C>();
	}
};
static_assert(alignof(APAWN_ServBot_C) == 0x000010, "Wrong alignment on APAWN_ServBot_C");
static_assert(sizeof(APAWN_ServBot_C) == 0x000A70, "Wrong size on APAWN_ServBot_C");
static_assert(offsetof(APAWN_ServBot_C, UberGraphFrame_PAWN_ServBot_C) == 0x000A08, "Member 'APAWN_ServBot_C::UberGraphFrame_PAWN_ServBot_C' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, HoverAudio) == 0x000A10, "Member 'APAWN_ServBot_C::HoverAudio' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, MouthAudio) == 0x000A18, "Member 'APAWN_ServBot_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, HoverEffect) == 0x000A20, "Member 'APAWN_ServBot_C::HoverEffect' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, ServBot_CompartmentMarker) == 0x000A28, "Member 'APAWN_ServBot_C::ServBot_CompartmentMarker' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, SpotLight) == 0x000A30, "Member 'APAWN_ServBot_C::SpotLight' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, ScanBox) == 0x000A38, "Member 'APAWN_ServBot_C::ScanBox' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, Hitbox_Right_UpperArm) == 0x000A40, "Member 'APAWN_ServBot_C::Hitbox_Right_UpperArm' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, Hitbox_Left_UpperArm) == 0x000A48, "Member 'APAWN_ServBot_C::Hitbox_Left_UpperArm' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, COMP_MeleeDamageComponent) == 0x000A50, "Member 'APAWN_ServBot_C::COMP_MeleeDamageComponent' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, Hitbox_Right_Forearm) == 0x000A58, "Member 'APAWN_ServBot_C::Hitbox_Right_Forearm' has a wrong offset!");
static_assert(offsetof(APAWN_ServBot_C, Hitbox_Left_Forearm) == 0x000A60, "Member 'APAWN_ServBot_C::Hitbox_Left_Forearm' has a wrong offset!");

}

