#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Security2Bot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PAWN_Security2Bot.PAWN_Security2Bot_C.UpdateCustomDeathBehavior
// 0x0070 (0x0070 - 0x0000)
struct PAWN_Security2Bot_C_UpdateCustomDeathBehavior final
{
public:
	bool                                          IsFinished;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Security1Bot_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior) == 0x000010, "Wrong alignment on PAWN_Security2Bot_C_UpdateCustomDeathBehavior");
static_assert(sizeof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior) == 0x000070, "Wrong size on PAWN_Security2Bot_C_UpdateCustomDeathBehavior");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, IsFinished) == 0x000000, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::IsFinished' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, CallFunc_ForceBeginAction_Action) == 0x000058, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_UpdateCustomDeathBehavior, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'PAWN_Security2Bot_C_UpdateCustomDeathBehavior::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function PAWN_Security2Bot.PAWN_Security2Bot_C.PlayGatlingGunDischargeSound
// 0x0090 (0x0090 - 0x0000)
struct PAWN_Security2Bot_C_PlayGatlingGunDischargeSound final
{
public:
	float                                         RefireTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeDilation;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_SoftObjectReference_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound) == 0x000008, "Wrong alignment on PAWN_Security2Bot_C_PlayGatlingGunDischargeSound");
static_assert(sizeof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound) == 0x000090, "Wrong size on PAWN_Security2Bot_C_PlayGatlingGunDischargeSound");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, RefireTime) == 0x000000, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::RefireTime' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, TimeDilation) == 0x000004, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::TimeDilation' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000020, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_GetGameInstance_ReturnValue_1) == 0x000050, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x000058, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_NotEqual_SoftObjectReference_ReturnValue) == 0x000080, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_NotEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000081, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_Less_FloatFloat_ReturnValue) == 0x000082, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000084, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_PlayGatlingGunDischargeSound, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'PAWN_Security2Bot_C_PlayGatlingGunDischargeSound::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PAWN_Security2Bot.PAWN_Security2Bot_C.StopGatlingGunDischargeSound
// 0x0048 (0x0048 - 0x0000)
struct PAWN_Security2Bot_C_StopGatlingGunDischargeSound final
{
public:
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound) == 0x000008, "Wrong alignment on PAWN_Security2Bot_C_StopGatlingGunDischargeSound");
static_assert(sizeof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound) == 0x000048, "Wrong size on PAWN_Security2Bot_C_StopGatlingGunDischargeSound");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000000, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, K2Node_DynamicCast_AsGI_Single_Player) == 0x000038, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PAWN_Security2Bot_C_StopGatlingGunDischargeSound, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000041, "Member 'PAWN_Security2Bot_C_StopGatlingGunDischargeSound::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");

}

