#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PAWN_Diego_v1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PAWN_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PAWN_Diego_v1.PAWN_Diego_v1_C
// 0x0090 (0x0AA0 - 0x0A10)
class APAWN_Diego_v1_C final : public APAWN_Enemy_C
{
public:
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PAWN_Diego_v1_C;                    // 0x0A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Character_Recharge;                             // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TeleportEffect;                                 // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HairMesh;                                          // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_LaserSword;                                     // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_r_Forearm;                                  // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioR;                                        // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     FootAudioL;                                        // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelAudio_C*                     MouthAudio;                                        // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hitbox_r_LaserSword;                               // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_MeleeDamageComponent_C*           COMP_MeleeDamageComponent;                         // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RootBoneName;                                      // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpineBoneName;                                     // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPhysicalAnimationData                 DeathRattlePhysicsData;                            // 0x0A70(0x0024)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         NoShieldTimestamp;                                 // 0x0A94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ArmProtectionTimer;                                // 0x0A98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PAWN_Diego_v1(int32 EntryPoint);
	void OnArmProtectionDelayOver();
	void OnHealthChanged(float CurrValue, float LastValue);
	void ReceiveBeginPlay();
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void OnEnemySpawned(class APatrolNode_C* InitialPatrolNode, TSoftClassPtr<class UClass> UniqueLootItem, bool AdjustToFloor);
	void ToggleSwordEffect(bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PAWN_Diego_v1_C">();
	}
	static class APAWN_Diego_v1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APAWN_Diego_v1_C>();
	}
};
static_assert(alignof(APAWN_Diego_v1_C) == 0x000010, "Wrong alignment on APAWN_Diego_v1_C");
static_assert(sizeof(APAWN_Diego_v1_C) == 0x000AA0, "Wrong size on APAWN_Diego_v1_C");
static_assert(offsetof(APAWN_Diego_v1_C, UberGraphFrame_PAWN_Diego_v1_C) == 0x000A08, "Member 'APAWN_Diego_v1_C::UberGraphFrame_PAWN_Diego_v1_C' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, NS_Character_Recharge) == 0x000A10, "Member 'APAWN_Diego_v1_C::NS_Character_Recharge' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, NS_TeleportEffect) == 0x000A18, "Member 'APAWN_Diego_v1_C::NS_TeleportEffect' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, HairMesh) == 0x000A20, "Member 'APAWN_Diego_v1_C::HairMesh' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, FX_LaserSword) == 0x000A28, "Member 'APAWN_Diego_v1_C::FX_LaserSword' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, Hitbox_r_Forearm) == 0x000A30, "Member 'APAWN_Diego_v1_C::Hitbox_r_Forearm' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, FootAudioR) == 0x000A38, "Member 'APAWN_Diego_v1_C::FootAudioR' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, FootAudioL) == 0x000A40, "Member 'APAWN_Diego_v1_C::FootAudioL' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, MouthAudio) == 0x000A48, "Member 'APAWN_Diego_v1_C::MouthAudio' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, Hitbox_r_LaserSword) == 0x000A50, "Member 'APAWN_Diego_v1_C::Hitbox_r_LaserSword' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, COMP_MeleeDamageComponent) == 0x000A58, "Member 'APAWN_Diego_v1_C::COMP_MeleeDamageComponent' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, RootBoneName) == 0x000A60, "Member 'APAWN_Diego_v1_C::RootBoneName' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, SpineBoneName) == 0x000A68, "Member 'APAWN_Diego_v1_C::SpineBoneName' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, DeathRattlePhysicsData) == 0x000A70, "Member 'APAWN_Diego_v1_C::DeathRattlePhysicsData' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, NoShieldTimestamp) == 0x000A94, "Member 'APAWN_Diego_v1_C::NoShieldTimestamp' has a wrong offset!");
static_assert(offsetof(APAWN_Diego_v1_C, ArmProtectionTimer) == 0x000A98, "Member 'APAWN_Diego_v1_C::ArmProtectionTimer' has a wrong offset!");

}

