#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_EnergyWeapon_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_EnergyWeapon_Base.PICKUP_EnergyWeapon_Base_C.ExecuteUbergraph_PICKUP_EnergyWeapon_Base
// 0x0020 (0x0020 - 0x0000)
struct PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_EnergyWeapon_Base_C*              K2Node_DynamicCast_AsITEM_Energy_Weapon_Base;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base) == 0x000008, "Wrong alignment on PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base");
static_assert(sizeof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base) == 0x000020, "Wrong size on PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base, EntryPoint) == 0x000000, "Member 'PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base, CallFunc_GetItem_Result) == 0x000008, "Member 'PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base, K2Node_DynamicCast_AsITEM_Energy_Weapon_Base) == 0x000010, "Member 'PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base::K2Node_DynamicCast_AsITEM_Energy_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PICKUP_EnergyWeapon_Base_C_ExecuteUbergraph_PICKUP_EnergyWeapon_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PICKUP_EnergyWeapon_Base.PICKUP_EnergyWeapon_Base_C.SetItem
// 0x0040 (0x0040 - 0x0000)
struct PICKUP_EnergyWeapon_Base_C_SetItem final
{
public:
	class UITEM_Base_C*                           InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_EnergyWeapon_Base_C*              K2Node_DynamicCast_AsITEM_Energy_Weapon_Base;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_EnergyWeapon_Base_C*              K2Node_DynamicCast_AsITEM_Energy_Weapon_Base_1;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetItem_Result_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_EnergyWeapon_Base_C_SetItem) == 0x000008, "Wrong alignment on PICKUP_EnergyWeapon_Base_C_SetItem");
static_assert(sizeof(PICKUP_EnergyWeapon_Base_C_SetItem) == 0x000040, "Wrong size on PICKUP_EnergyWeapon_Base_C_SetItem");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, InItem) == 0x000000, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::InItem' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, CallFunc_GetItem_Result) == 0x000008, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, K2Node_DynamicCast_AsITEM_Energy_Weapon_Base) == 0x000010, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::K2Node_DynamicCast_AsITEM_Energy_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, K2Node_DynamicCast_AsITEM_Energy_Weapon_Base_1) == 0x000020, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::K2Node_DynamicCast_AsITEM_Energy_Weapon_Base_1' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, CallFunc_GetItem_Result_1) == 0x000030, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::CallFunc_GetItem_Result_1' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_SetItem, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'PICKUP_EnergyWeapon_Base_C_SetItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function PICKUP_EnergyWeapon_Base.PICKUP_EnergyWeapon_Base_C.GetDefaultDescription
// 0x00B8 (0x00B8 - 0x0000)
struct PICKUP_EnergyWeapon_Base_C_GetDefaultDescription final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDefaultDescription_Result;             // 0x0020(0x0018)()
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_HasInstalledAnyModKits_Result;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription) == 0x000008, "Wrong alignment on PICKUP_EnergyWeapon_Base_C_GetDefaultDescription");
static_assert(sizeof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription) == 0x0000B8, "Wrong size on PICKUP_EnergyWeapon_Base_C_GetDefaultDescription");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, Result) == 0x000000, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, CallFunc_GetItem_Result) == 0x000018, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, CallFunc_GetDefaultDescription_Result) == 0x000020, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::CallFunc_GetDefaultDescription_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000038, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, CallFunc_HasInstalledAnyModKits_Result) == 0x000088, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::CallFunc_HasInstalledAnyModKits_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, K2Node_MakeArray_Array) == 0x000090, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_EnergyWeapon_Base_C_GetDefaultDescription, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'PICKUP_EnergyWeapon_Base_C_GetDefaultDescription::CallFunc_Format_ReturnValue' has a wrong offset!");

}

