#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_WeaponModKit_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.ExecuteUbergraph_PICKUP_WeaponModKit_Base
// 0x0010 (0x0010 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base) == 0x000004, "Wrong alignment on PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base) == 0x000010, "Wrong size on PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base, EntryPoint) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x000009, "Member 'PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'PICKUP_WeaponModKit_Base_C_ExecuteUbergraph_PICKUP_WeaponModKit_Base::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on PICKUP_WeaponModKit_Base_C_ReceiveTick");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_ReceiveTick) == 0x000004, "Wrong size on PICKUP_WeaponModKit_Base_C_ReceiveTick");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.CanPickupItem
// 0x0040 (0x0040 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_CanPickupItem final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FailMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_CanPickupItem_Result;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPickupItem_FailMessage;                // 0x0028(0x0018)()
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_CanPickupItem) == 0x000008, "Wrong alignment on PICKUP_WeaponModKit_Base_C_CanPickupItem");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_CanPickupItem) == 0x000040, "Wrong size on PICKUP_WeaponModKit_Base_C_CanPickupItem");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_CanPickupItem, Result) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_CanPickupItem::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_CanPickupItem, FailMessage) == 0x000008, "Member 'PICKUP_WeaponModKit_Base_C_CanPickupItem::FailMessage' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_CanPickupItem, CallFunc_CanPickupItem_Result) == 0x000020, "Member 'PICKUP_WeaponModKit_Base_C_CanPickupItem::CallFunc_CanPickupItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_CanPickupItem, CallFunc_CanPickupItem_FailMessage) == 0x000028, "Member 'PICKUP_WeaponModKit_Base_C_CanPickupItem::CallFunc_CanPickupItem_FailMessage' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.IsInsideModStation
// 0x0001 (0x0001 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_IsInsideModStation final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_IsInsideModStation) == 0x000001, "Wrong alignment on PICKUP_WeaponModKit_Base_C_IsInsideModStation");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_IsInsideModStation) == 0x000001, "Wrong size on PICKUP_WeaponModKit_Base_C_IsInsideModStation");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_IsInsideModStation, Result) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_IsInsideModStation::Result' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.SetInsideModStation
// 0x0002 (0x0002 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_SetInsideModStation final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_SetInsideModStation) == 0x000001, "Wrong alignment on PICKUP_WeaponModKit_Base_C_SetInsideModStation");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_SetInsideModStation) == 0x000002, "Wrong size on PICKUP_WeaponModKit_Base_C_SetInsideModStation");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_SetInsideModStation, State) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_SetInsideModStation::State' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_SetInsideModStation, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'PICKUP_WeaponModKit_Base_C_SetInsideModStation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.UpdateModkitColor
// 0x0030 (0x0030 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_UpdateModkitColor final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor) == 0x000010, "Wrong alignment on PICKUP_WeaponModKit_Base_C_UpdateModkitColor");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor) == 0x000030, "Wrong size on PICKUP_WeaponModKit_Base_C_UpdateModkitColor");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor, State) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitColor::State' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor, Temp_bool_Variable) == 0x000001, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor, K2Node_Select_Default) == 0x000004, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitColor, K2Node_MakeStruct_Vector4) == 0x000020, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitColor::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.TickModkitHandleTransition
// 0x0020 (0x0020 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition) == 0x000004, "Wrong alignment on PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition) == 0x000020, "Wrong size on PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, DeltaTime) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::DeltaTime' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, Temp_float_Variable) == 0x000004, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, Temp_float_Variable_1) == 0x000008, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, Temp_bool_Variable) == 0x00000C, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000E, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, K2Node_Select_Default) == 0x000010, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'PICKUP_WeaponModKit_Base_C_TickModkitHandleTransition::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C.UpdateModkitHandlePosition
// 0x0008 (0x0008 - 0x0000)
struct PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition final
{
public:
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition) == 0x000004, "Wrong alignment on PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition");
static_assert(sizeof(PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition) == 0x000008, "Wrong size on PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition, CallFunc_Ease_ReturnValue) == 0x000000, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'PICKUP_WeaponModKit_Base_C_UpdateModkitHandlePosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

