#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_Base

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_UpgradeResult_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_Base.PICKUP_Base_C.OnPickedUp__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PICKUP_Base_C_OnPickedUp__DelegateSignature final
{
public:
	class APICKUP_Base_C*                         PickupActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Base_C_OnPickedUp__DelegateSignature) == 0x000008, "Wrong alignment on PICKUP_Base_C_OnPickedUp__DelegateSignature");
static_assert(sizeof(PICKUP_Base_C_OnPickedUp__DelegateSignature) == 0x000008, "Wrong size on PICKUP_Base_C_OnPickedUp__DelegateSignature");
static_assert(offsetof(PICKUP_Base_C_OnPickedUp__DelegateSignature, PickupActor) == 0x000000, "Member 'PICKUP_Base_C_OnPickedUp__DelegateSignature::PickupActor' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.ExecuteUbergraph_PICKUP_Base
// 0x0028 (0x0028 - 0x0000)
struct PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDefaultDescription_Result;             // 0x0008(0x0018)()
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base) == 0x000008, "Wrong alignment on PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base");
static_assert(sizeof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base) == 0x000028, "Wrong size on PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, EntryPoint) == 0x000000, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x000004, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, CallFunc_TextIsEmpty_ReturnValue) == 0x000005, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, CallFunc_GetDefaultDescription_Result) == 0x000008, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::CallFunc_GetDefaultDescription_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, CallFunc_RandomFloat_ReturnValue) == 0x000020, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x000024, "Member 'PICKUP_Base_C_ExecuteUbergraph_PICKUP_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'PICKUP_Base_C_BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct PICKUP_Base_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_UserConstructionScript) == 0x000004, "Wrong alignment on PICKUP_Base_C_UserConstructionScript");
static_assert(sizeof(PICKUP_Base_C_UserConstructionScript) == 0x000008, "Wrong size on PICKUP_Base_C_UserConstructionScript");
static_assert(offsetof(PICKUP_Base_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'PICKUP_Base_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'PICKUP_Base_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000005, "Member 'PICKUP_Base_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.TryInteract
// 0x0220 (0x0220 - 0x0000)
struct PICKUP_Base_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            PickupMontageToPlay;                               // 0x0040(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   InteractMessage;                                   // 0x0068(0x0018)(Edit, BlueprintVisible)
	bool                                          ItemWasAdded;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GeneratePickupMessage_Result;             // 0x0098(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_Array_Get_Item;                           // 0x00C0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_CanPickupItem_Result;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPickupItem_FailMessage;                // 0x00F0(0x0018)()
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0108(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_TryGrantHeroicItem_Result;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGrantHeroicItem_FailMessage;           // 0x0130(0x0018)()
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory_1;        // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0158(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_GeneratePickupMessage_Result_1;           // 0x0178(0x0018)()
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x0190(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_TryGrabItemFromGround_Result;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGrantItem_Result;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldTryGrantHeroicItem_Result;          // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldGrabItem_Result;                    // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GenerateUpgradeMessage_Result;            // 0x01B8(0x0018)()
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x01D8(0x0020)(HasGetValueTypeHash)
	TDelegate<void(class UClass* UpgradeClass, class UClass* DowngradeClass, ENUM_UpgradeResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UClass* UpgradeClass, class UClass* DowngradeClass, ENUM_UpgradeResult Result)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_OnPickup_Result;                          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_TryInteract) == 0x000008, "Wrong alignment on PICKUP_Base_C_TryInteract");
static_assert(sizeof(PICKUP_Base_C_TryInteract) == 0x000220, "Wrong size on PICKUP_Base_C_TryInteract");
static_assert(offsetof(PICKUP_Base_C_TryInteract, SourceActor) == 0x000000, "Member 'PICKUP_Base_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'PICKUP_Base_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, InteractionType) == 0x000010, "Member 'PICKUP_Base_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, InteractResults) == 0x000018, "Member 'PICKUP_Base_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, Character) == 0x000038, "Member 'PICKUP_Base_C_TryInteract::Character' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, PickupMontageToPlay) == 0x000040, "Member 'PICKUP_Base_C_TryInteract::PickupMontageToPlay' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, InteractMessage) == 0x000068, "Member 'PICKUP_Base_C_TryInteract::InteractMessage' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, ItemWasAdded) == 0x000080, "Member 'PICKUP_Base_C_TryInteract::ItemWasAdded' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000088, "Member 'PICKUP_Base_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'PICKUP_Base_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_GeneratePickupMessage_Result) == 0x000098, "Member 'PICKUP_Base_C_TryInteract::CallFunc_GeneratePickupMessage_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'PICKUP_Base_C_TryInteract::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'PICKUP_Base_C_TryInteract::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_RandomInteger_ReturnValue) == 0x0000B8, "Member 'PICKUP_Base_C_TryInteract::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BC, "Member 'PICKUP_Base_C_TryInteract::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'PICKUP_Base_C_TryInteract::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_CanPickupItem_Result) == 0x0000E8, "Member 'PICKUP_Base_C_TryInteract::CallFunc_CanPickupItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_CanPickupItem_FailMessage) == 0x0000F0, "Member 'PICKUP_Base_C_TryInteract::CallFunc_CanPickupItem_FailMessage' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000108, "Member 'PICKUP_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_TryGrantHeroicItem_Result) == 0x000128, "Member 'PICKUP_Base_C_TryInteract::CallFunc_TryGrantHeroicItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_TryGrantHeroicItem_FailMessage) == 0x000130, "Member 'PICKUP_Base_C_TryInteract::CallFunc_TryGrantHeroicItem_FailMessage' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_GetInventoryComponent_Inventory) == 0x000148, "Member 'PICKUP_Base_C_TryInteract::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_GetInventoryComponent_Inventory_1) == 0x000150, "Member 'PICKUP_Base_C_TryInteract::CallFunc_GetInventoryComponent_Inventory_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000158, "Member 'PICKUP_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_GeneratePickupMessage_Result_1) == 0x000178, "Member 'PICKUP_Base_C_TryInteract::CallFunc_GeneratePickupMessage_Result_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x000190, "Member 'PICKUP_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_TryGrabItemFromGround_Result) == 0x0001B0, "Member 'PICKUP_Base_C_TryInteract::CallFunc_TryGrabItemFromGround_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_TryGrantItem_Result) == 0x0001B1, "Member 'PICKUP_Base_C_TryInteract::CallFunc_TryGrantItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_ShouldTryGrantHeroicItem_Result) == 0x0001B2, "Member 'PICKUP_Base_C_TryInteract::CallFunc_ShouldTryGrantHeroicItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_ShouldGrabItem_Result) == 0x0001B3, "Member 'PICKUP_Base_C_TryInteract::CallFunc_ShouldGrabItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_GenerateUpgradeMessage_Result) == 0x0001B8, "Member 'PICKUP_Base_C_TryInteract::CallFunc_GenerateUpgradeMessage_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001D0, "Member 'PICKUP_Base_C_TryInteract::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001D1, "Member 'PICKUP_Base_C_TryInteract::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0001D8, "Member 'PICKUP_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_CreateDelegate_OutputDelegate) == 0x0001F8, "Member 'PICKUP_Base_C_TryInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000208, "Member 'PICKUP_Base_C_TryInteract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_TryInteract, CallFunc_OnPickup_Result) == 0x000218, "Member 'PICKUP_Base_C_TryInteract::CallFunc_OnPickup_Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.CanPickupItem
// 0x0020 (0x0020 - 0x0000)
struct PICKUP_Base_C_CanPickupItem final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FailMessage;                                       // 0x0008(0x0018)(Parm, OutParm)
};
static_assert(alignof(PICKUP_Base_C_CanPickupItem) == 0x000008, "Wrong alignment on PICKUP_Base_C_CanPickupItem");
static_assert(sizeof(PICKUP_Base_C_CanPickupItem) == 0x000020, "Wrong size on PICKUP_Base_C_CanPickupItem");
static_assert(offsetof(PICKUP_Base_C_CanPickupItem, Result) == 0x000000, "Member 'PICKUP_Base_C_CanPickupItem::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_CanPickupItem, FailMessage) == 0x000008, "Member 'PICKUP_Base_C_CanPickupItem::FailMessage' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetPhysicsPrimitive
// 0x0008 (0x0008 - 0x0000)
struct PICKUP_Base_C_GetPhysicsPrimitive final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Base_C_GetPhysicsPrimitive) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetPhysicsPrimitive");
static_assert(sizeof(PICKUP_Base_C_GetPhysicsPrimitive) == 0x000008, "Wrong size on PICKUP_Base_C_GetPhysicsPrimitive");
static_assert(offsetof(PICKUP_Base_C_GetPhysicsPrimitive, Primitive) == 0x000000, "Member 'PICKUP_Base_C_GetPhysicsPrimitive::Primitive' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetTargetShape
// 0x0010 (0x0010 - 0x0000)
struct PICKUP_Base_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Base_C_GetTargetShape) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetTargetShape");
static_assert(sizeof(PICKUP_Base_C_GetTargetShape) == 0x000010, "Wrong size on PICKUP_Base_C_GetTargetShape");
static_assert(offsetof(PICKUP_Base_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'PICKUP_Base_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'PICKUP_Base_C_GetTargetShape::ShapeComponent' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.SetItem
// 0x0038 (0x0038 - 0x0000)
struct PICKUP_Base_C_SetItem final
{
public:
	class UITEM_Base_C*                           InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDefaultDescription_Result;             // 0x0008(0x0018)()
	class APICKUP_Base_C*                         CallFunc_GetLinkedPickup_Result;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APICKUP_Base_C*                         CallFunc_GetLinkedPickup_Result_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_SetItem) == 0x000008, "Wrong alignment on PICKUP_Base_C_SetItem");
static_assert(sizeof(PICKUP_Base_C_SetItem) == 0x000038, "Wrong size on PICKUP_Base_C_SetItem");
static_assert(offsetof(PICKUP_Base_C_SetItem, InItem) == 0x000000, "Member 'PICKUP_Base_C_SetItem::InItem' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_GetDefaultDescription_Result) == 0x000008, "Member 'PICKUP_Base_C_SetItem::CallFunc_GetDefaultDescription_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_GetLinkedPickup_Result) == 0x000020, "Member 'PICKUP_Base_C_SetItem::CallFunc_GetLinkedPickup_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_GetLinkedPickup_Result_1) == 0x000028, "Member 'PICKUP_Base_C_SetItem::CallFunc_GetLinkedPickup_Result_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'PICKUP_Base_C_SetItem::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'PICKUP_Base_C_SetItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_SetItem, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'PICKUP_Base_C_SetItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetItem
// 0x0008 (0x0008 - 0x0000)
struct PICKUP_Base_C_GetItem final
{
public:
	class UITEM_Base_C*                           Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Base_C_GetItem) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetItem");
static_assert(sizeof(PICKUP_Base_C_GetItem) == 0x000008, "Wrong size on PICKUP_Base_C_GetItem");
static_assert(offsetof(PICKUP_Base_C_GetItem, Result) == 0x000000, "Member 'PICKUP_Base_C_GetItem::Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetItemClass
// 0x0028 (0x0028 - 0x0000)
struct PICKUP_Base_C_GetItemClass final
{
public:
	class UClass*                                 Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_GetItemClass) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetItemClass");
static_assert(sizeof(PICKUP_Base_C_GetItemClass) == 0x000028, "Wrong size on PICKUP_Base_C_GetItemClass");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, Result) == 0x000000, "Member 'PICKUP_Base_C_GetItemClass::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000008, "Member 'PICKUP_Base_C_GetItemClass::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'PICKUP_Base_C_GetItemClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, K2Node_ClassDynamicCast_AsITEM_Base) == 0x000018, "Member 'PICKUP_Base_C_GetItemClass::K2Node_ClassDynamicCast_AsITEM_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'PICKUP_Base_C_GetItemClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemClass, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'PICKUP_Base_C_GetItemClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetItemCount
// 0x000C (0x000C - 0x0000)
struct PICKUP_Base_C_GetItemCount final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_Result;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_GetItemCount) == 0x000004, "Wrong alignment on PICKUP_Base_C_GetItemCount");
static_assert(sizeof(PICKUP_Base_C_GetItemCount) == 0x00000C, "Wrong size on PICKUP_Base_C_GetItemCount");
static_assert(offsetof(PICKUP_Base_C_GetItemCount, Result) == 0x000000, "Member 'PICKUP_Base_C_GetItemCount::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemCount, CallFunc_GetCount_Result) == 0x000004, "Member 'PICKUP_Base_C_GetItemCount::CallFunc_GetCount_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemCount, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'PICKUP_Base_C_GetItemCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetItemDisplayName
// 0x0040 (0x0040 - 0x0000)
struct PICKUP_Base_C_GetItemDisplayName final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_Result;                    // 0x0020(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_GetItemDisplayName) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetItemDisplayName");
static_assert(sizeof(PICKUP_Base_C_GetItemDisplayName) == 0x000040, "Wrong size on PICKUP_Base_C_GetItemDisplayName");
static_assert(offsetof(PICKUP_Base_C_GetItemDisplayName, Result) == 0x000000, "Member 'PICKUP_Base_C_GetItemDisplayName::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemDisplayName, CallFunc_GetItemClass_Result) == 0x000018, "Member 'PICKUP_Base_C_GetItemDisplayName::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemDisplayName, CallFunc_GetDisplayName_Result) == 0x000020, "Member 'PICKUP_Base_C_GetItemDisplayName::CallFunc_GetDisplayName_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetItemDisplayName, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'PICKUP_Base_C_GetItemDisplayName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.HasItemInstance
// 0x0002 (0x0002 - 0x0000)
struct PICKUP_Base_C_HasItemInstance final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_HasItemInstance) == 0x000001, "Wrong alignment on PICKUP_Base_C_HasItemInstance");
static_assert(sizeof(PICKUP_Base_C_HasItemInstance) == 0x000002, "Wrong size on PICKUP_Base_C_HasItemInstance");
static_assert(offsetof(PICKUP_Base_C_HasItemInstance, Result) == 0x000000, "Member 'PICKUP_Base_C_HasItemInstance::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_HasItemInstance, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'PICKUP_Base_C_HasItemInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.ShouldGrabItem
// 0x0050 (0x0050 - 0x0000)
struct PICKUP_Base_C_ShouldGrabItem final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Implant_C*                 HackerPawn;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInventoryVisible_Result;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBagByIndex_Bag;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSlotItemClass_Result;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_ShouldGrabItem) == 0x000008, "Wrong alignment on PICKUP_Base_C_ShouldGrabItem");
static_assert(sizeof(PICKUP_Base_C_ShouldGrabItem) == 0x000050, "Wrong size on PICKUP_Base_C_ShouldGrabItem");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, Character) == 0x000000, "Member 'PICKUP_Base_C_ShouldGrabItem::Character' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, Result) == 0x000008, "Member 'PICKUP_Base_C_ShouldGrabItem::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, HackerPawn) == 0x000010, "Member 'PICKUP_Base_C_ShouldGrabItem::HackerPawn' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000018, "Member 'PICKUP_Base_C_ShouldGrabItem::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PICKUP_Base_C_ShouldGrabItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, CallFunc_GetNeuralHUD_Result) == 0x000028, "Member 'PICKUP_Base_C_ShouldGrabItem::CallFunc_GetNeuralHUD_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, CallFunc_IsInventoryVisible_Result) == 0x000030, "Member 'PICKUP_Base_C_ShouldGrabItem::CallFunc_IsInventoryVisible_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, CallFunc_GetBagByIndex_Bag) == 0x000038, "Member 'PICKUP_Base_C_ShouldGrabItem::CallFunc_GetBagByIndex_Bag' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, CallFunc_GetItemClass_Result) == 0x000040, "Member 'PICKUP_Base_C_ShouldGrabItem::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldGrabItem, CallFunc_CanSlotItemClass_Result) == 0x000048, "Member 'PICKUP_Base_C_ShouldGrabItem::CallFunc_CanSlotItemClass_Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.ShouldTryGrantHeroicItem
// 0x0040 (0x0040 - 0x0000)
struct PICKUP_Base_C_ShouldTryGrantHeroicItem final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  HackerPawn;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetItemClass_Result_1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDiscoveredSuperiorHeroicItem_Result;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDiscoveredHeroicItem_Result;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_ShouldTryGrantHeroicItem) == 0x000008, "Wrong alignment on PICKUP_Base_C_ShouldTryGrantHeroicItem");
static_assert(sizeof(PICKUP_Base_C_ShouldTryGrantHeroicItem) == 0x000040, "Wrong size on PICKUP_Base_C_ShouldTryGrantHeroicItem");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, Character) == 0x000000, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::Character' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, Result) == 0x000008, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, HackerPawn) == 0x000010, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::HackerPawn' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000018, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_GetItemClass_Result) == 0x000028, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_GetItemClass_Result_1) == 0x000030, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_GetItemClass_Result_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_HasDiscoveredSuperiorHeroicItem_Result) == 0x000038, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_HasDiscoveredSuperiorHeroicItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_HasDiscoveredHeroicItem_Result) == 0x000039, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_HasDiscoveredHeroicItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003B, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_ShouldTryGrantHeroicItem, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00003C, "Member 'PICKUP_Base_C_ShouldTryGrantHeroicItem::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.ShouldGrantDefaultAttributes
// 0x0001 (0x0001 - 0x0000)
struct PICKUP_Base_C_ShouldGrantDefaultAttributes final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_ShouldGrantDefaultAttributes) == 0x000001, "Wrong alignment on PICKUP_Base_C_ShouldGrantDefaultAttributes");
static_assert(sizeof(PICKUP_Base_C_ShouldGrantDefaultAttributes) == 0x000001, "Wrong size on PICKUP_Base_C_ShouldGrantDefaultAttributes");
static_assert(offsetof(PICKUP_Base_C_ShouldGrantDefaultAttributes, Result) == 0x000000, "Member 'PICKUP_Base_C_ShouldGrantDefaultAttributes::Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GenerateUpgradeMessage
// 0x0078 (0x0078 - 0x0000)
struct PICKUP_Base_C_GenerateUpgradeMessage final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   TextResult;                                        // 0x0018(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GeneratePickupMessage_Result;             // 0x0038(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetUpgradeMessageFromResult_Result;       // 0x0060(0x0018)()
};
static_assert(alignof(PICKUP_Base_C_GenerateUpgradeMessage) == 0x000008, "Wrong alignment on PICKUP_Base_C_GenerateUpgradeMessage");
static_assert(sizeof(PICKUP_Base_C_GenerateUpgradeMessage) == 0x000078, "Wrong size on PICKUP_Base_C_GenerateUpgradeMessage");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, Result) == 0x000000, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, TextResult) == 0x000018, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::TextResult' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, CallFunc_GeneratePickupMessage_Result) == 0x000038, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::CallFunc_GeneratePickupMessage_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, CallFunc_GetItemClass_Result) == 0x000058, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GenerateUpgradeMessage, CallFunc_GetUpgradeMessageFromResult_Result) == 0x000060, "Member 'PICKUP_Base_C_GenerateUpgradeMessage::CallFunc_GetUpgradeMessageFromResult_Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GeneratePickupMessage
// 0x00F0 (0x00F0 - 0x0000)
struct PICKUP_Base_C_GeneratePickupMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Result;                                            // 0x0018(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetItemDisplayName_Result;                // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
};
static_assert(alignof(PICKUP_Base_C_GeneratePickupMessage) == 0x000008, "Wrong alignment on PICKUP_Base_C_GeneratePickupMessage");
static_assert(sizeof(PICKUP_Base_C_GeneratePickupMessage) == 0x0000F0, "Wrong size on PICKUP_Base_C_GeneratePickupMessage");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, Message) == 0x000000, "Member 'PICKUP_Base_C_GeneratePickupMessage::Message' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, Result) == 0x000018, "Member 'PICKUP_Base_C_GeneratePickupMessage::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, CallFunc_GetItemDisplayName_Result) == 0x000030, "Member 'PICKUP_Base_C_GeneratePickupMessage::CallFunc_GetItemDisplayName_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'PICKUP_Base_C_GeneratePickupMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'PICKUP_Base_C_GeneratePickupMessage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, K2Node_MakeArray_Array) == 0x0000C8, "Member 'PICKUP_Base_C_GeneratePickupMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GeneratePickupMessage, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'PICKUP_Base_C_GeneratePickupMessage::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetBusyMessage
// 0x00A0 (0x00A0 - 0x0000)
struct PICKUP_Base_C_GetBusyMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(Parm, OutParm)
	class UClass*                                 PickupClass;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDisplayName_Result;                // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(PICKUP_Base_C_GetBusyMessage) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetBusyMessage");
static_assert(sizeof(PICKUP_Base_C_GetBusyMessage) == 0x0000A0, "Wrong size on PICKUP_Base_C_GetBusyMessage");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, Message) == 0x000000, "Member 'PICKUP_Base_C_GetBusyMessage::Message' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, PickupClass) == 0x000018, "Member 'PICKUP_Base_C_GetBusyMessage::PickupClass' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, CallFunc_GetItemDisplayName_Result) == 0x000020, "Member 'PICKUP_Base_C_GetBusyMessage::CallFunc_GetItemDisplayName_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'PICKUP_Base_C_GetBusyMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, K2Node_MakeArray_Array) == 0x000078, "Member 'PICKUP_Base_C_GetBusyMessage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetBusyMessage, CallFunc_Format_ReturnValue) == 0x000088, "Member 'PICKUP_Base_C_GetBusyMessage::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.GetRenderIconClassCollection
// 0x0060 (0x0060 - 0x0000)
struct PICKUP_Base_C_GetRenderIconClassCollection final
{
public:
	struct FObjectClassCollection                 Result;                                            // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	struct FObjectClassCollection                 K2Node_MakeStruct_ObjectClassCollection;           // 0x0050(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Base_C_GetRenderIconClassCollection) == 0x000008, "Wrong alignment on PICKUP_Base_C_GetRenderIconClassCollection");
static_assert(sizeof(PICKUP_Base_C_GetRenderIconClassCollection) == 0x000060, "Wrong size on PICKUP_Base_C_GetRenderIconClassCollection");
static_assert(offsetof(PICKUP_Base_C_GetRenderIconClassCollection, Result) == 0x000000, "Member 'PICKUP_Base_C_GetRenderIconClassCollection::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetRenderIconClassCollection, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'PICKUP_Base_C_GetRenderIconClassCollection::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetRenderIconClassCollection, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000018, "Member 'PICKUP_Base_C_GetRenderIconClassCollection::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetRenderIconClassCollection, K2Node_MakeArray_Array) == 0x000040, "Member 'PICKUP_Base_C_GetRenderIconClassCollection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_GetRenderIconClassCollection, K2Node_MakeStruct_ObjectClassCollection) == 0x000050, "Member 'PICKUP_Base_C_GetRenderIconClassCollection::K2Node_MakeStruct_ObjectClassCollection' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.InitializeAttributes
// 0x0018 (0x0018 - 0x0000)
struct PICKUP_Base_C_InitializeAttributes final
{
public:
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ShouldGrantDefaultAttributes_Result;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_InitializeAttributes) == 0x000004, "Wrong alignment on PICKUP_Base_C_InitializeAttributes");
static_assert(sizeof(PICKUP_Base_C_InitializeAttributes) == 0x000018, "Wrong size on PICKUP_Base_C_InitializeAttributes");
static_assert(offsetof(PICKUP_Base_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000000, "Member 'PICKUP_Base_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PICKUP_Base_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_InitializeAttributes, CallFunc_ShouldGrantDefaultAttributes_Result) == 0x000014, "Member 'PICKUP_Base_C_InitializeAttributes::CallFunc_ShouldGrantDefaultAttributes_Result' has a wrong offset!");

// Function PICKUP_Base.PICKUP_Base_C.OnPickup
// 0x0028 (0x0028 - 0x0000)
struct PICKUP_Base_C_OnPickup final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Base_C_OnPickup) == 0x000008, "Wrong alignment on PICKUP_Base_C_OnPickup");
static_assert(sizeof(PICKUP_Base_C_OnPickup) == 0x000028, "Wrong size on PICKUP_Base_C_OnPickup");
static_assert(offsetof(PICKUP_Base_C_OnPickup, Character) == 0x000000, "Member 'PICKUP_Base_C_OnPickup::Character' has a wrong offset!");
static_assert(offsetof(PICKUP_Base_C_OnPickup, Result) == 0x000008, "Member 'PICKUP_Base_C_OnPickup::Result' has a wrong offset!");
