#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_ProjectileWeapon_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_ProjectileWeapon_Base.PICKUP_ProjectileWeapon_Base_C.UserConstructionScript
// 0x0168 (0x0168 - 0x0000)
struct PICKUP_ProjectileWeapon_Base_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Weapon_Base;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0100)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on PICKUP_ProjectileWeapon_Base_C_UserConstructionScript");
static_assert(sizeof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript) == 0x000168, "Wrong size on PICKUP_ProjectileWeapon_Base_C_UserConstructionScript");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000000, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000040, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, K2Node_ClassDynamicCast_AsITEM_Weapon_Base) == 0x000048, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::K2Node_ClassDynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, K2Node_ClassDynamicCast_bSuccess) == 0x000050, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000158, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_GetWeaponPropertyValueByType_Value) == 0x00015C, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_UserConstructionScript, CallFunc_Min_ReturnValue) == 0x000160, "Member 'PICKUP_ProjectileWeapon_Base_C_UserConstructionScript::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function PICKUP_ProjectileWeapon_Base.PICKUP_ProjectileWeapon_Base_C.OnPrePickup
// 0x0180 (0x0180 - 0x0000)
struct PICKUP_ProjectileWeapon_Base_C_OnPrePickup final
{
public:
	int32                                         MagazineCapacity;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingAmmoInMag;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     CreatedWeapon;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCurrentMode_Result;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0020(0x0100)(HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Select_Default;                             // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWEAPON_MagPulse_C*                     K2Node_DynamicCast_AsWEAPON_Mag_Pulse;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ProjectileWeapon_Base_C*          K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base;  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasItemInstance_Result;                   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0158(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_CreateInventoryItem_Item;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup) == 0x000008, "Wrong alignment on PICKUP_ProjectileWeapon_Base_C_OnPrePickup");
static_assert(sizeof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup) == 0x000180, "Wrong size on PICKUP_ProjectileWeapon_Base_C_OnPrePickup");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, MagazineCapacity) == 0x000000, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::MagazineCapacity' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, StartingAmmoInMag) == 0x000004, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::StartingAmmoInMag' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CreatedWeapon) == 0x000008, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CreatedWeapon' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, Temp_byte_Variable) == 0x000010, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, Temp_byte_Variable_1) == 0x000011, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, Temp_bool_Variable) == 0x000012, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_Greater_IntInt_ReturnValue) == 0x000013, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_SetCurrentMode_Result) == 0x000014, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_SetCurrentMode_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_GetItemClass_Result) == 0x000018, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_GetCurrentMode_Mode) == 0x000020, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_GetWeaponPropertyValueByType_Value) == 0x000120, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, Temp_bool_Variable_1) == 0x000124, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000125, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_Select_Default) == 0x000126, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000128, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_SelectInt_ReturnValue) == 0x00012C, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_AsWEAPON_Mag_Pulse) == 0x000130, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_AsWEAPON_Mag_Pulse' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_Min_ReturnValue) == 0x00013C, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000140, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_Select_Default_1) == 0x000144, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base) == 0x000148, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_HasItemInstance_Result) == 0x000151, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_HasItemInstance_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_Not_PreBool_ReturnValue) == 0x000152, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000158, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, CallFunc_CreateInventoryItem_Item) == 0x000168, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::CallFunc_CreateInventoryItem_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000170, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_OnPrePickup, K2Node_DynamicCast_bSuccess_2) == 0x000178, "Member 'PICKUP_ProjectileWeapon_Base_C_OnPrePickup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function PICKUP_ProjectileWeapon_Base.PICKUP_ProjectileWeapon_Base_C.GetDefaultDescription
// 0x00B8 (0x00B8 - 0x0000)
struct PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDefaultDescription_Result;             // 0x0020(0x0018)()
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_HasInstalledAnyModKits_Result;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription) == 0x000008, "Wrong alignment on PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription");
static_assert(sizeof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription) == 0x0000B8, "Wrong size on PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, Result) == 0x000000, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, CallFunc_GetItem_Result) == 0x000018, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, CallFunc_GetDefaultDescription_Result) == 0x000020, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::CallFunc_GetDefaultDescription_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000038, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, CallFunc_HasInstalledAnyModKits_Result) == 0x000088, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::CallFunc_HasInstalledAnyModKits_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, K2Node_MakeArray_Array) == 0x000090, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'PICKUP_ProjectileWeapon_Base_C_GetDefaultDescription::CallFunc_Format_ReturnValue' has a wrong offset!");

}

