#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_Explosive_Base

#include "Basic.hpp"

#include "PICKUP_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PICKUP_Explosive_Base.PICKUP_Explosive_Base_C
// 0x0020 (0x0498 - 0x0478)
class APICKUP_Explosive_Base_C : public APICKUP_Base_C
{
public:
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PICKUP_Explosive_Base_C;            // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FlashingLight;                                     // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DetonationTimerHandle;                             // 0x0488(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingToDetonate;                                 // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PICKUP_Explosive_Base(int32 EntryPoint);
	void BndEvt__PICKUP_Explosive_Base_COMP_AttribManager_K2Node_ComponentBoundEvent_1_OnDamageSignature__DelegateSignature(class AActor* OtherActor, const struct FAttribDamageInstance& DamageInstance, class UObject* UserParams);
	void ReceiveBeginPlay();
	void StartExplosiveDetonationTimer(float DesiredDelayTime);
	void StartDefaultExplosiveDetonationTimer();
	void OnDetonateExplosivePickup();
	void ShouldGrantDefaultAttributes(bool* Result);
	void CanPickupItem(bool* Result, class FText* FailMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PICKUP_Explosive_Base_C">();
	}
	static class APICKUP_Explosive_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APICKUP_Explosive_Base_C>();
	}
};
static_assert(alignof(APICKUP_Explosive_Base_C) == 0x000008, "Wrong alignment on APICKUP_Explosive_Base_C");
static_assert(sizeof(APICKUP_Explosive_Base_C) == 0x000498, "Wrong size on APICKUP_Explosive_Base_C");
static_assert(offsetof(APICKUP_Explosive_Base_C, UberGraphFrame_PICKUP_Explosive_Base_C) == 0x000478, "Member 'APICKUP_Explosive_Base_C::UberGraphFrame_PICKUP_Explosive_Base_C' has a wrong offset!");
static_assert(offsetof(APICKUP_Explosive_Base_C, FlashingLight) == 0x000480, "Member 'APICKUP_Explosive_Base_C::FlashingLight' has a wrong offset!");
static_assert(offsetof(APICKUP_Explosive_Base_C, DetonationTimerHandle) == 0x000488, "Member 'APICKUP_Explosive_Base_C::DetonationTimerHandle' has a wrong offset!");
static_assert(offsetof(APICKUP_Explosive_Base_C, WaitingToDetonate) == 0x000490, "Member 'APICKUP_Explosive_Base_C::WaitingToDetonate' has a wrong offset!");

}

