#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_WeaponModKit_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PICKUP_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PICKUP_WeaponModKit_Base.PICKUP_WeaponModKit_Base_C
// 0x0050 (0x04C8 - 0x0478)
class APICKUP_WeaponModKit_Base_C : public APICKUP_Base_C
{
public:
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_PICKUP_WeaponModKit_Base_C;         // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsInModStation;                                    // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LockedInModStationMessage;                         // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HandleProgress;                                    // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHandleOffset;                                   // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnabledColor;                                      // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PICKUP_WeaponModKit_Base(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void CanPickupItem(bool* Result, class FText* FailMessage);
	void IsInsideModStation(bool* Result);
	void SetInsideModStation(bool State);
	void UpdateModkitColor(bool State);
	void TickModkitHandleTransition(float DeltaTime);
	void UpdateModkitHandlePosition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PICKUP_WeaponModKit_Base_C">();
	}
	static class APICKUP_WeaponModKit_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APICKUP_WeaponModKit_Base_C>();
	}
};
static_assert(alignof(APICKUP_WeaponModKit_Base_C) == 0x000008, "Wrong alignment on APICKUP_WeaponModKit_Base_C");
static_assert(sizeof(APICKUP_WeaponModKit_Base_C) == 0x0004C8, "Wrong size on APICKUP_WeaponModKit_Base_C");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, UberGraphFrame_PICKUP_WeaponModKit_Base_C) == 0x000478, "Member 'APICKUP_WeaponModKit_Base_C::UberGraphFrame_PICKUP_WeaponModKit_Base_C' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, IsInModStation) == 0x000480, "Member 'APICKUP_WeaponModKit_Base_C::IsInModStation' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, LockedInModStationMessage) == 0x000488, "Member 'APICKUP_WeaponModKit_Base_C::LockedInModStationMessage' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, HandleProgress) == 0x0004A0, "Member 'APICKUP_WeaponModKit_Base_C::HandleProgress' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, MaxHandleOffset) == 0x0004A4, "Member 'APICKUP_WeaponModKit_Base_C::MaxHandleOffset' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, EnabledColor) == 0x0004A8, "Member 'APICKUP_WeaponModKit_Base_C::EnabledColor' has a wrong offset!");
static_assert(offsetof(APICKUP_WeaponModKit_Base_C, DisabledColor) == 0x0004B8, "Member 'APICKUP_WeaponModKit_Base_C::DisabledColor' has a wrong offset!");

}

