#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_AMMO_TeflonRoundBox_Large

#include "Basic.hpp"

#include "PICKUP_AMMO_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PICKUP_AMMO_TeflonRoundBox_Large.PICKUP_AMMO_TeflonRoundBox_Large_C
// 0x0020 (0x04A0 - 0x0480)
class APICKUP_AMMO_TeflonRoundBox_Large_C final : public APICKUP_AMMO_Base_C
{
public:
	class UNiagaraComponent*                      FlashingLight;                                     // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FlashingLight3;                                    // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FlashingLight2;                                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FlashingLight1;                                    // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PICKUP_AMMO_TeflonRoundBox_Large_C">();
	}
	static class APICKUP_AMMO_TeflonRoundBox_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APICKUP_AMMO_TeflonRoundBox_Large_C>();
	}
};
static_assert(alignof(APICKUP_AMMO_TeflonRoundBox_Large_C) == 0x000008, "Wrong alignment on APICKUP_AMMO_TeflonRoundBox_Large_C");
static_assert(sizeof(APICKUP_AMMO_TeflonRoundBox_Large_C) == 0x0004A0, "Wrong size on APICKUP_AMMO_TeflonRoundBox_Large_C");
static_assert(offsetof(APICKUP_AMMO_TeflonRoundBox_Large_C, FlashingLight) == 0x000480, "Member 'APICKUP_AMMO_TeflonRoundBox_Large_C::FlashingLight' has a wrong offset!");
static_assert(offsetof(APICKUP_AMMO_TeflonRoundBox_Large_C, FlashingLight3) == 0x000488, "Member 'APICKUP_AMMO_TeflonRoundBox_Large_C::FlashingLight3' has a wrong offset!");
static_assert(offsetof(APICKUP_AMMO_TeflonRoundBox_Large_C, FlashingLight2) == 0x000490, "Member 'APICKUP_AMMO_TeflonRoundBox_Large_C::FlashingLight2' has a wrong offset!");
static_assert(offsetof(APICKUP_AMMO_TeflonRoundBox_Large_C, FlashingLight1) == 0x000498, "Member 'APICKUP_AMMO_TeflonRoundBox_Large_C::FlashingLight1' has a wrong offset!");

}

