#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_SodaCan

#include "Basic.hpp"

#include "STRUCT_HardItemParams_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_SodaCan.PICKUP_SodaCan_C.ExecuteUbergraph_PICKUP_SodaCan
// 0x0040 (0x0040 - 0x0000)
struct PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemInstance_Result;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_CreateInventoryItem_Item;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan) == 0x000008, "Wrong alignment on PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan");
static_assert(sizeof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan) == 0x000040, "Wrong size on PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, EntryPoint) == 0x000000, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::EntryPoint' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, CallFunc_RandomInteger_ReturnValue) == 0x000004, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, CallFunc_HasItemInstance_Result) == 0x000008, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::CallFunc_HasItemInstance_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, CallFunc_Array_Get_Item) == 0x000020, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000028, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan, CallFunc_CreateInventoryItem_Item) == 0x000038, "Member 'PICKUP_SodaCan_C_ExecuteUbergraph_PICKUP_SodaCan::CallFunc_CreateInventoryItem_Item' has a wrong offset!");

// Function PICKUP_SodaCan.PICKUP_SodaCan_C.SetItem
// 0x0010 (0x0010 - 0x0000)
struct PICKUP_SodaCan_C_SetItem final
{
public:
	class UITEM_Base_C*                           InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItemInstance_Result;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_SodaCan_C_SetItem) == 0x000008, "Wrong alignment on PICKUP_SodaCan_C_SetItem");
static_assert(sizeof(PICKUP_SodaCan_C_SetItem) == 0x000010, "Wrong size on PICKUP_SodaCan_C_SetItem");
static_assert(offsetof(PICKUP_SodaCan_C_SetItem, InItem) == 0x000000, "Member 'PICKUP_SodaCan_C_SetItem::InItem' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_SetItem, CallFunc_HasItemInstance_Result) == 0x000008, "Member 'PICKUP_SodaCan_C_SetItem::CallFunc_HasItemInstance_Result' has a wrong offset!");

// Function PICKUP_SodaCan.PICKUP_SodaCan_C.UpdateMeshFromItemClass
// 0x0028 (0x0028 - 0x0000)
struct PICKUP_SodaCan_C_UpdateMeshFromItemClass final
{
public:
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Junk_Food_Base;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_SodaCan_C_UpdateMeshFromItemClass) == 0x000008, "Wrong alignment on PICKUP_SodaCan_C_UpdateMeshFromItemClass");
static_assert(sizeof(PICKUP_SodaCan_C_UpdateMeshFromItemClass) == 0x000028, "Wrong size on PICKUP_SodaCan_C_UpdateMeshFromItemClass");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, CallFunc_GetItemClass_Result) == 0x000000, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, K2Node_ClassDynamicCast_AsITEM_Junk_Food_Base) == 0x000008, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::K2Node_ClassDynamicCast_AsITEM_Junk_Food_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, K2Node_ClassDynamicCast_bSuccess) == 0x000010, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, CallFunc_Map_Find_Value) == 0x000018, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_SodaCan_C_UpdateMeshFromItemClass, CallFunc_SetStaticMesh_ReturnValue) == 0x000021, "Member 'PICKUP_SodaCan_C_UpdateMeshFromItemClass::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

