#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_Weapon_Base

#include "Basic.hpp"

#include "CoreGame_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.SetItem
// 0x0030 (0x0030 - 0x0000)
struct PICKUP_Weapon_Base_C_SetItem final
{
public:
	class UITEM_Base_C*                           InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_WeaponModKit_Base_C*>      CallFunc_GetInstalledAppearanceModifiers_Result;   // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(PICKUP_Weapon_Base_C_SetItem) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_SetItem");
static_assert(sizeof(PICKUP_Weapon_Base_C_SetItem) == 0x000030, "Wrong size on PICKUP_Weapon_Base_C_SetItem");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetItem, InItem) == 0x000000, "Member 'PICKUP_Weapon_Base_C_SetItem::InItem' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetItem, CallFunc_GetItem_Result) == 0x000008, "Member 'PICKUP_Weapon_Base_C_SetItem::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetItem, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000010, "Member 'PICKUP_Weapon_Base_C_SetItem::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PICKUP_Weapon_Base_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetItem, CallFunc_GetInstalledAppearanceModifiers_Result) == 0x000020, "Member 'PICKUP_Weapon_Base_C_SetItem::CallFunc_GetInstalledAppearanceModifiers_Result' has a wrong offset!");

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.SetIconClassCollection
// 0x0078 (0x0078 - 0x0000)
struct PICKUP_Weapon_Base_C_SetIconClassCollection final
{
public:
	struct FObjectClassCollection                 ClassCollection;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Weapon_Mod_Kit_Base; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponModKit_Base_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Weapon_Base_C_SetIconClassCollection) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_SetIconClassCollection");
static_assert(sizeof(PICKUP_Weapon_Base_C_SetIconClassCollection) == 0x000078, "Wrong size on PICKUP_Weapon_Base_C_SetIconClassCollection");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, ClassCollection) == 0x000000, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::ClassCollection' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, Temp_int_Variable) == 0x000010, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_Array_Get_Item) == 0x000018, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000048, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, K2Node_ClassDynamicCast_AsITEM_Weapon_Mod_Kit_Base) == 0x000058, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::K2Node_ClassDynamicCast_AsITEM_Weapon_Mod_Kit_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, K2Node_ClassDynamicCast_bSuccess) == 0x000060, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_SetIconClassCollection, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'PICKUP_Weapon_Base_C_SetIconClassCollection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.UpdateWeaponPickupAppearance
// 0x0030 (0x0030 - 0x0000)
struct PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_WeaponModKit_Base_C*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryModifyPickupAppearance_Result;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance");
static_assert(sizeof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance) == 0x000030, "Wrong size on PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, Temp_int_Array_Index_Variable) == 0x000000, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_GetAttribValue_ReturnValue) == 0x00000C, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_Array_Get_Item) == 0x000018, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_TryModifyPickupAppearance_Result) == 0x000020, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_TryModifyPickupAppearance_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'PICKUP_Weapon_Base_C_UpdateWeaponPickupAppearance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.GetRenderIconClassCollection
// 0x00E0 (0x00E0 - 0x0000)
struct PICKUP_Weapon_Base_C_GetRenderIconClassCollection final
{
public:
	struct FObjectClassCollection                 Result;                                            // 0x0000(0x0010)(Parm, OutParm, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           ObjectClasses;                                     // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectClassCollection                 K2Node_MakeStruct_ObjectClassCollection;           // 0x0030(0x0010)(HasGetValueTypeHash)
	class UITEM_WeaponModKit_Base_C*              CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FObjectClassCollection                 CallFunc_GetRenderIconClassCollection_Result;      // 0x00D0(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_GetRenderIconClassCollection");
static_assert(sizeof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection) == 0x0000E0, "Wrong size on PICKUP_Weapon_Base_C_GetRenderIconClassCollection");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, Result) == 0x000000, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, ObjectClasses) == 0x000010, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::ObjectClasses' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, Temp_int_Array_Index_Variable) == 0x000020, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, K2Node_MakeStruct_ObjectClassCollection) == 0x000030, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::K2Node_MakeStruct_ObjectClassCollection' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Array_Get_Item) == 0x000040, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_GetObjectClass_ReturnValue) == 0x000050, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000060, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_GetObjectClass_ReturnValue_1) == 0x000090, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1) == 0x000098, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Conv_ClassToSoftClassReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Array_Add_ReturnValue_1) == 0x0000C4, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_GetRenderIconClassCollection, CallFunc_GetRenderIconClassCollection_Result) == 0x0000D0, "Member 'PICKUP_Weapon_Base_C_GetRenderIconClassCollection::CallFunc_GetRenderIconClassCollection_Result' has a wrong offset!");

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.TryInitializeItemInstance
// 0x0048 (0x0048 - 0x0000)
struct PICKUP_Weapon_Base_C_TryInitializeItemInstance final
{
public:
	class UITEM_WeaponBase_C*                     WeaponItem;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInstalledAnyModKits_Result;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_WeaponModKit_Base_C*>      CallFunc_GetInstalledAppearanceModifiers_Result;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetItem_Result;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Weapon_Base_C_TryInitializeItemInstance) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_TryInitializeItemInstance");
static_assert(sizeof(PICKUP_Weapon_Base_C_TryInitializeItemInstance) == 0x000048, "Wrong size on PICKUP_Weapon_Base_C_TryInitializeItemInstance");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, WeaponItem) == 0x000000, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::WeaponItem' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, CallFunc_HasInstalledAnyModKits_Result) == 0x000008, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::CallFunc_HasInstalledAnyModKits_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, CallFunc_GetInstalledAppearanceModifiers_Result) == 0x000010, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::CallFunc_GetInstalledAppearanceModifiers_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, CallFunc_GetItem_Result) == 0x000028, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::CallFunc_GetItem_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000038, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_TryInitializeItemInstance, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PICKUP_Weapon_Base_C_TryInitializeItemInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PICKUP_Weapon_Base.PICKUP_Weapon_Base_C.UpdateMeshEmissiveStrength
// 0x0038 (0x0038 - 0x0000)
struct PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetChildComponentsByClass_ReturnValue;    // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength) == 0x000008, "Wrong alignment on PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength");
static_assert(sizeof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength) == 0x000038, "Wrong size on PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, Scale) == 0x000000, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::Scale' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, CallFunc_GetChildComponentsByClass_ReturnValue) == 0x000010, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::CallFunc_GetChildComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, CallFunc_Array_Get_Item) == 0x000028, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'PICKUP_Weapon_Base_C_UpdateMeshEmissiveStrength::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

