#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup_Software_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Pickup_Software_Base.Pickup_Software_Base_C.ExecuteUbergraph_Pickup_Software_Base
// 0x0118 (0x0118 - 0x0000)
struct Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Avatar_C*                         K2Node_DynamicCast_AsPAWN_Avatar;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_8;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_9;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base");
static_assert(sizeof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base) == 0x000118, "Wrong size on Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, EntryPoint) == 0x000000, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_int_Variable) == 0x0000B0, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_DynamicCast_AsPAWN_Avatar) == 0x0000B8, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_DynamicCast_AsPAWN_Avatar' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable) == 0x0000C4, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_1) == 0x0000C8, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_2) == 0x0000CC, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_3) == 0x0000D0, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_4) == 0x0000D4, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_5) == 0x0000D8, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_6) == 0x0000DC, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_7) == 0x0000E0, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_8) == 0x0000E4, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, Temp_float_Variable_9) == 0x0000E8, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, CallFunc_GetAttribInstance_ReturnValue) == 0x000100, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, K2Node_Select_Default) == 0x000108, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x00010C, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base, CallFunc_ApplyMod_ReturnValue) == 0x000110, "Member 'Pickup_Software_Base_C_ExecuteUbergraph_Pickup_Software_Base::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Pickup_Software_Base_C_BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Pickup_Software_Base_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_UserConstructionScript) == 0x000001, "Wrong alignment on Pickup_Software_Base_C_UserConstructionScript");
static_assert(sizeof(Pickup_Software_Base_C_UserConstructionScript) == 0x000001, "Wrong size on Pickup_Software_Base_C_UserConstructionScript");
static_assert(offsetof(Pickup_Software_Base_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'Pickup_Software_Base_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.EVENT_OnHealthChanged
// 0x0030 (0x0030 - 0x0000)
struct Pickup_Software_Base_C_EVENT_OnHealthChanged final
{
public:
	float                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_EVENT_OnHealthChanged) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_EVENT_OnHealthChanged");
static_assert(sizeof(Pickup_Software_Base_C_EVENT_OnHealthChanged) == 0x000030, "Wrong size on Pickup_Software_Base_C_EVENT_OnHealthChanged");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CurrentValue) == 0x000000, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CurrentValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, PreviousValue) == 0x000004, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::PreviousValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000020, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000024, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x000028, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_EVENT_OnHealthChanged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'Pickup_Software_Base_C_EVENT_OnHealthChanged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.TryShootPlayer
// 0x0100 (0x0100 - 0x0000)
struct Pickup_Software_Base_C_TryShootPlayer final
{
public:
	int32                                         DamageValue;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAttribModApplyData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APROJECTILE_IceDrill_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_TryShootPlayer) == 0x000010, "Wrong alignment on Pickup_Software_Base_C_TryShootPlayer");
static_assert(sizeof(Pickup_Software_Base_C_TryShootPlayer) == 0x000100, "Wrong size on Pickup_Software_Base_C_TryShootPlayer");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, DamageValue) == 0x000000, "Member 'Pickup_Software_Base_C_TryShootPlayer::DamageValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, TargetLocation) == 0x000004, "Member 'Pickup_Software_Base_C_TryShootPlayer::TargetLocation' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, K2Node_MakeArray_Array) == 0x000010, "Member 'Pickup_Software_Base_C_TryShootPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000028, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00002C, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_FTrunc_ReturnValue) == 0x000040, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_VSize_ReturnValue) == 0x000068, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00006C, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000078, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_FindLookAtRotation_ReturnValue) == 0x00007C, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x0000C0, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C8, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000D8, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000E0, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x0000EC, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000F0, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_TryShootPlayer, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x0000F4, "Member 'Pickup_Software_Base_C_TryShootPlayer::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.OnActvateSoftware
// 0x0028 (0x0028 - 0x0000)
struct Pickup_Software_Base_C_OnActvateSoftware final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ICEBoxVisible;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_FindItem_FoundItem;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Activate_Result;                          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_OnActvateSoftware) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_OnActvateSoftware");
static_assert(sizeof(Pickup_Software_Base_C_OnActvateSoftware) == 0x000028, "Wrong size on Pickup_Software_Base_C_OnActvateSoftware");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, Character) == 0x000000, "Member 'Pickup_Software_Base_C_OnActvateSoftware::Character' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, ICEBoxVisible) == 0x000008, "Member 'Pickup_Software_Base_C_OnActvateSoftware::ICEBoxVisible' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, CallFunc_GetInventoryComponent_Inventory) == 0x000010, "Member 'Pickup_Software_Base_C_OnActvateSoftware::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, CallFunc_FindItem_FoundItem) == 0x000018, "Member 'Pickup_Software_Base_C_OnActvateSoftware::CallFunc_FindItem_FoundItem' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x000020, "Member 'Pickup_Software_Base_C_OnActvateSoftware::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnActvateSoftware, CallFunc_Activate_Result) == 0x000024, "Member 'Pickup_Software_Base_C_OnActvateSoftware::CallFunc_Activate_Result' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.OnPickup
// 0x0010 (0x0010 - 0x0000)
struct Pickup_Software_Base_C_OnPickup final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnPickup_Result;                          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_OnPickup) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_OnPickup");
static_assert(sizeof(Pickup_Software_Base_C_OnPickup) == 0x000010, "Wrong size on Pickup_Software_Base_C_OnPickup");
static_assert(offsetof(Pickup_Software_Base_C_OnPickup, Character) == 0x000000, "Member 'Pickup_Software_Base_C_OnPickup::Character' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnPickup, Result) == 0x000008, "Member 'Pickup_Software_Base_C_OnPickup::Result' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_OnPickup, CallFunc_OnPickup_Result) == 0x000009, "Member 'Pickup_Software_Base_C_OnPickup::CallFunc_OnPickup_Result' has a wrong offset!");

// Function Pickup_Software_Base.Pickup_Software_Base_C.CanPickup
// 0x0020 (0x0020 - 0x0000)
struct Pickup_Software_Base_C_CanPickup final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPickup_Result;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pickup_Software_Base_C_CanPickup) == 0x000008, "Wrong alignment on Pickup_Software_Base_C_CanPickup");
static_assert(sizeof(Pickup_Software_Base_C_CanPickup) == 0x000020, "Wrong size on Pickup_Software_Base_C_CanPickup");
static_assert(offsetof(Pickup_Software_Base_C_CanPickup, Character) == 0x000000, "Member 'Pickup_Software_Base_C_CanPickup::Character' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_CanPickup, Result) == 0x000008, "Member 'Pickup_Software_Base_C_CanPickup::Result' has a wrong offset!");
static_assert(offsetof(Pickup_Software_Base_C_CanPickup, CallFunc_CanPickup_Result) == 0x000009, "Member 'Pickup_Software_Base_C_CanPickup::CallFunc_CanPickup_Result' has a wrong offset!");
