#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_MagnumPistol

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_MagnumPistol.PICKUP_MagnumPistol_C.AddBarrelAttachment
// 0x0050 (0x0050 - 0x0000)
struct PICKUP_MagnumPistol_C_AddBarrelAttachment final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_MagnumPistol_C_AddBarrelAttachment) == 0x000010, "Wrong alignment on PICKUP_MagnumPistol_C_AddBarrelAttachment");
static_assert(sizeof(PICKUP_MagnumPistol_C_AddBarrelAttachment) == 0x000050, "Wrong size on PICKUP_MagnumPistol_C_AddBarrelAttachment");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, Transform) == 0x000000, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::Transform' has a wrong offset!");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, CallFunc_SetStaticMesh_ReturnValue) == 0x000030, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000040, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_MagnumPistol_C_AddBarrelAttachment, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'PICKUP_MagnumPistol_C_AddBarrelAttachment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

