#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup_Software_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "CYBR_Pickup_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Pickup_Software_Base.Pickup_Software_Base_C
// 0x00F8 (0x0370 - 0x0278)
class APickup_Software_Base_C final : public ACYBR_Pickup_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Pickup_Software_Base_C;             // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SoftwareMesh;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ICEBox;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         IceValue;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   IceBlockedMessage;                                 // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ShootTimestamp;                                    // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShootWaitDuration;                                 // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastDamagedTimestamp;                              // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribModApplyData                    IceArmorMod;                                       // 0x02C8(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ShootTimerHandle;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Pickup_Software_Base(int32 EntryPoint);
	void BndEvt__OverlapSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void EVENT_OnHealthChanged(float CurrentValue, float PreviousValue);
	void TryShootPlayer();
	void OnActvateSoftware(class APAWN_SystemShockCharacter_C* Character);
	void OnPickup(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void CanPickup(class APAWN_SystemShockCharacter_C* Character, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickup_Software_Base_C">();
	}
	static class APickup_Software_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APickup_Software_Base_C>();
	}
};
static_assert(alignof(APickup_Software_Base_C) == 0x000008, "Wrong alignment on APickup_Software_Base_C");
static_assert(sizeof(APickup_Software_Base_C) == 0x000370, "Wrong size on APickup_Software_Base_C");
static_assert(offsetof(APickup_Software_Base_C, UberGraphFrame_Pickup_Software_Base_C) == 0x000278, "Member 'APickup_Software_Base_C::UberGraphFrame_Pickup_Software_Base_C' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, SoftwareMesh) == 0x000280, "Member 'APickup_Software_Base_C::SoftwareMesh' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, COMP_AttribManager) == 0x000288, "Member 'APickup_Software_Base_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, ICEBox) == 0x000290, "Member 'APickup_Software_Base_C::ICEBox' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, IceValue) == 0x000298, "Member 'APickup_Software_Base_C::IceValue' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, IceBlockedMessage) == 0x0002A0, "Member 'APickup_Software_Base_C::IceBlockedMessage' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, ShootTimestamp) == 0x0002B8, "Member 'APickup_Software_Base_C::ShootTimestamp' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, ShootWaitDuration) == 0x0002BC, "Member 'APickup_Software_Base_C::ShootWaitDuration' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, LastDamagedTimestamp) == 0x0002C0, "Member 'APickup_Software_Base_C::LastDamagedTimestamp' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, IceArmorMod) == 0x0002C8, "Member 'APickup_Software_Base_C::IceArmorMod' has a wrong offset!");
static_assert(offsetof(APickup_Software_Base_C, ShootTimerHandle) == 0x000368, "Member 'APickup_Software_Base_C::ShootTimerHandle' has a wrong offset!");

}

