#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_UpgradeResult_structs.hpp"
#include "INTERACT_Base_classes.hpp"
#include "ENUM_Axis_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PICKUP_Base.PICKUP_Base_C
// 0x0170 (0x0478 - 0x0308)
#pragma pack(push, 0x1)
class alignas(0x08) APICKUP_Base_C : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PICKUP_Base_C;                      // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_AttribManager_C*                  COMP_AttribManager;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_ScannableObject_C*                COMP_ScannableObject;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_VoxelCullable_C*                  COMP_VoxelCullable;                                // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBox;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PickupMesh;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ItemClass;                                         // 0x0338(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PickupMessage;                                     // 0x0368(0x0018)(Edit, BlueprintVisible)
	class FText                                   CantGrabMessage;                                   // 0x0380(0x0018)(Edit, BlueprintVisible)
	class FText                                   NoRoomMessage;                                     // 0x0398(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UAnimMontage>            HeroicPickupMontage;                               // 0x03B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UAnimMontage>>    PickupMontage;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible)
	class UITEM_Base_C*                           Item;                                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_UpgradeResult                            UpgradedResult;                                    // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundCue>               PickupCue;                                         // 0x03F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   AttachPointOnParent;                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    TimedTutorial;                                     // 0x0428(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FDataTableRowHandle>            CompleteGameEvents;                                // 0x0438(0x0010)(Edit, BlueprintVisible)
	struct FRotator                               IconRotation;                                      // 0x0448(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ENUM_Axis                                     PreferredPackAxis;                                 // 0x0454(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPickedUp;                                        // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TeleportTimerHandle;                               // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MinIconCaptureDistance;                            // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPickedUp__DelegateSignature(class APICKUP_Base_C* PickupActor);
	void ExecuteUbergraph_PICKUP_Base(int32 EntryPoint);
	void BndEvt__PICKUP_Base_COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature(bool bVisibleState);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void CanPickupItem(bool* Result, class FText* FailMessage);
	void GetPhysicsPrimitive(class UPrimitiveComponent** Primitive);
	void GetTargetShape(class UPrimitiveComponent* CursorPrimitive, class UShapeComponent** ShapeComponent);
	void SetItem(class UITEM_Base_C* InItem);
	void GetItem(class UITEM_Base_C** Result);
	void GetItemClass(class UClass** Result);
	void GetItemCount(int32* Result);
	void GetItemDisplayName(class FText* Result);
	void HasItemInstance(bool* Result);
	void ShouldGrabItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void ShouldTryGrantHeroicItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void ShouldGrantDefaultAttributes(bool* Result);
	void GenerateUpgradeMessage(class FText* Result);
	void GeneratePickupMessage(const class FText& Message, class FText* Result);
	void GetBusyMessage(class FText* Message);
	void GetRenderIconClassCollection(struct FObjectClassCollection* Result);
	void InitializeAttributes();
	void OnPrePickup();
	void OnPickup(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void GetDefaultDescription(class FText* Result);
	void TryGrantItem(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void TryGrantHeroicItem(class APAWN_SystemShockCharacter_C* Character, TSoftObjectPtr<class UAnimMontage> Montage, bool* Result, class FText* FailMessage);
	void TryGrabItemFromGround(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void TryActivateTimedTutorial(class APAWN_SystemShockCharacter_C* Character);
	void TryCompleteGameEvents();
	void TryRemoveInventoryLink(bool* Result);
	void TryInitializeItemInstance();
	void TryAttachToParentSocket();
	void OnUpgradedItem(class UClass* UpgradeClass, class UClass* DowngradeClass, ENUM_UpgradeResult UpgradeResult);
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	void IsTeleporting(bool* Result);
	void CanTeleportPickup(bool* Result);
	void EVENT_OnFinishedMaterializingFromTeleport();
	void UpdatePickupVisibility(bool VisibilityState);
	void TryTeleportPickup(const struct FVector& Location, const struct FRotator& Rotation, float MaterializeDuration, class USoundCue* SoundCue, class UNiagaraSystem* TeleportFX, bool* Result);
	void UpdateMeshEmissiveStrength(float Scale);
	void EVENT_OnDisableAttribChanged(float CurrValue, float LastValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PICKUP_Base_C">();
	}
	static class APICKUP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APICKUP_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(APICKUP_Base_C) == 0x000008, "Wrong alignment on APICKUP_Base_C");
static_assert(sizeof(APICKUP_Base_C) == 0x000478, "Wrong size on APICKUP_Base_C");
static_assert(offsetof(APICKUP_Base_C, UberGraphFrame_PICKUP_Base_C) == 0x000308, "Member 'APICKUP_Base_C::UberGraphFrame_PICKUP_Base_C' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, COMP_AttribManager) == 0x000310, "Member 'APICKUP_Base_C::COMP_AttribManager' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, COMP_ScannableObject) == 0x000318, "Member 'APICKUP_Base_C::COMP_ScannableObject' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, COMP_VoxelCullable) == 0x000320, "Member 'APICKUP_Base_C::COMP_VoxelCullable' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, TargetBox) == 0x000328, "Member 'APICKUP_Base_C::TargetBox' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, PickupMesh) == 0x000330, "Member 'APICKUP_Base_C::PickupMesh' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, ItemClass) == 0x000338, "Member 'APICKUP_Base_C::ItemClass' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, Count) == 0x000360, "Member 'APICKUP_Base_C::Count' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, PickupMessage) == 0x000368, "Member 'APICKUP_Base_C::PickupMessage' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, CantGrabMessage) == 0x000380, "Member 'APICKUP_Base_C::CantGrabMessage' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, NoRoomMessage) == 0x000398, "Member 'APICKUP_Base_C::NoRoomMessage' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, HeroicPickupMontage) == 0x0003B0, "Member 'APICKUP_Base_C::HeroicPickupMontage' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, PickupMontage) == 0x0003D8, "Member 'APICKUP_Base_C::PickupMontage' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, Item) == 0x0003E8, "Member 'APICKUP_Base_C::Item' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, UpgradedResult) == 0x0003F0, "Member 'APICKUP_Base_C::UpgradedResult' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, PickupCue) == 0x0003F8, "Member 'APICKUP_Base_C::PickupCue' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, AttachPointOnParent) == 0x000420, "Member 'APICKUP_Base_C::AttachPointOnParent' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, TimedTutorial) == 0x000428, "Member 'APICKUP_Base_C::TimedTutorial' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, CompleteGameEvents) == 0x000438, "Member 'APICKUP_Base_C::CompleteGameEvents' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, IconRotation) == 0x000448, "Member 'APICKUP_Base_C::IconRotation' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, PreferredPackAxis) == 0x000454, "Member 'APICKUP_Base_C::PreferredPackAxis' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, OnPickedUp) == 0x000458, "Member 'APICKUP_Base_C::OnPickedUp' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, TeleportTimerHandle) == 0x000468, "Member 'APICKUP_Base_C::TeleportTimerHandle' has a wrong offset!");
static_assert(offsetof(APICKUP_Base_C, MinIconCaptureDistance) == 0x000470, "Member 'APICKUP_Base_C::MinIconCaptureDistance' has a wrong offset!");

}

