#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_AMMO_Base

#include "Basic.hpp"

#include "STRUCT_SoftItemParams_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_AMMO_Base.PICKUP_AMMO_Base_C.GetItemDisplayName
// 0x0030 (0x0030 - 0x0000)
struct PICKUP_AMMO_Base_C_GetItemDisplayName final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PICKUP_AMMO_Base_C_GetItemDisplayName) == 0x000008, "Wrong alignment on PICKUP_AMMO_Base_C_GetItemDisplayName");
static_assert(sizeof(PICKUP_AMMO_Base_C_GetItemDisplayName) == 0x000030, "Wrong size on PICKUP_AMMO_Base_C_GetItemDisplayName");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetItemDisplayName, Result) == 0x000000, "Member 'PICKUP_AMMO_Base_C_GetItemDisplayName::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetItemDisplayName, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000018, "Member 'PICKUP_AMMO_Base_C_GetItemDisplayName::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetItemDisplayName, K2Node_ClassDynamicCast_AsITEM_Base) == 0x000020, "Member 'PICKUP_AMMO_Base_C_GetItemDisplayName::K2Node_ClassDynamicCast_AsITEM_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetItemDisplayName, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'PICKUP_AMMO_Base_C_GetItemDisplayName::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function PICKUP_AMMO_Base.PICKUP_AMMO_Base_C.GetAmmoCount
// 0x0070 (0x0070 - 0x0000)
struct PICKUP_AMMO_Base_C_GetAmmoCount final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PackageCount;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AmmoItemClass;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Package_Base;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_SoftItemParams>         Temp_struct_Variable;                              // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_SoftItemParams                 CallFunc_Array_Get_Item;                           // 0x0038(0x0030)(HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PICKUP_AMMO_Base_C_GetAmmoCount) == 0x000008, "Wrong alignment on PICKUP_AMMO_Base_C_GetAmmoCount");
static_assert(sizeof(PICKUP_AMMO_Base_C_GetAmmoCount) == 0x000070, "Wrong size on PICKUP_AMMO_Base_C_GetAmmoCount");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, Result) == 0x000000, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, PackageCount) == 0x000004, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::PackageCount' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, AmmoItemClass) == 0x000008, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::AmmoItemClass' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, K2Node_ClassDynamicCast_AsITEM_Package_Base) == 0x000010, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::K2Node_ClassDynamicCast_AsITEM_Package_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, K2Node_ClassDynamicCast_bSuccess) == 0x000018, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, Temp_struct_Variable) == 0x000020, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, CallFunc_GetItemCount_Result) == 0x000030, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, CallFunc_Multiply_IntInt_ReturnValue) == 0x000034, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, CallFunc_Array_Get_Item) == 0x000038, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetAmmoCount, CallFunc_GetItemClass_Result) == 0x000068, "Member 'PICKUP_AMMO_Base_C_GetAmmoCount::CallFunc_GetItemClass_Result' has a wrong offset!");

// Function PICKUP_AMMO_Base.PICKUP_AMMO_Base_C.GetDefaultDescription
// 0x00E0 (0x00E0 - 0x0000)
struct PICKUP_AMMO_Base_C_GetDefaultDescription final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	int32                                         CallFunc_GetAmmoCount_Result;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDefaultDescription_Result;             // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
};
static_assert(alignof(PICKUP_AMMO_Base_C_GetDefaultDescription) == 0x000008, "Wrong alignment on PICKUP_AMMO_Base_C_GetDefaultDescription");
static_assert(sizeof(PICKUP_AMMO_Base_C_GetDefaultDescription) == 0x0000E0, "Wrong size on PICKUP_AMMO_Base_C_GetDefaultDescription");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, Result) == 0x000000, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, CallFunc_GetAmmoCount_Result) == 0x000018, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::CallFunc_GetAmmoCount_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, CallFunc_GetDefaultDescription_Result) == 0x000020, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::CallFunc_GetDefaultDescription_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, K2Node_MakeArray_Array) == 0x0000B8, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_AMMO_Base_C_GetDefaultDescription, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'PICKUP_AMMO_Base_C_GetDefaultDescription::CallFunc_Format_ReturnValue' has a wrong offset!");

}

