#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PICKUP_Hardware_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PICKUP_Hardware_Base.PICKUP_Hardware_Base_C.GetItemDisplayName
// 0x00F8 (0x00F8 - 0x0000)
struct PICKUP_Hardware_Base_C_GetItemDisplayName final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UClass*                                 CallFunc_GetItemClass_Result;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDisplayName_Result;                // 0x0020(0x0018)()
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Hardware_Base;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetUpgradeVersionNumber_Version;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(PICKUP_Hardware_Base_C_GetItemDisplayName) == 0x000008, "Wrong alignment on PICKUP_Hardware_Base_C_GetItemDisplayName");
static_assert(sizeof(PICKUP_Hardware_Base_C_GetItemDisplayName) == 0x0000F8, "Wrong size on PICKUP_Hardware_Base_C_GetItemDisplayName");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, Result) == 0x000000, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, CallFunc_GetItemClass_Result) == 0x000018, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::CallFunc_GetItemClass_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, CallFunc_GetItemDisplayName_Result) == 0x000020, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::CallFunc_GetItemDisplayName_Result' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, K2Node_ClassDynamicCast_AsITEM_Hardware_Base) == 0x000038, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::K2Node_ClassDynamicCast_AsITEM_Hardware_Base' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, K2Node_ClassDynamicCast_bSuccess) == 0x000040, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, CallFunc_GetUpgradeVersionNumber_Version) == 0x000088, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::CallFunc_GetUpgradeVersionNumber_Version' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, K2Node_MakeArray_Array) == 0x0000D0, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PICKUP_Hardware_Base_C_GetItemDisplayName, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'PICKUP_Hardware_Base_C_GetItemDisplayName::CallFunc_Format_ReturnValue' has a wrong offset!");

}

