#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayCue

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayCue.PlayCue_C.Received_Notify
// 0x00E8 (0x00E8 - 0x0000)
struct PlayCue_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 AttachSkelMeshComp;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SoundLocation;                                     // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                TagComponents;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class USceneComponent*                        AttachComp;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayCue_C_Received_Notify) == 0x000008, "Wrong alignment on PlayCue_C_Received_Notify");
static_assert(sizeof(PlayCue_C_Received_Notify) == 0x0000E8, "Wrong size on PlayCue_C_Received_Notify");
static_assert(offsetof(PlayCue_C_Received_Notify, MeshComp) == 0x000000, "Member 'PlayCue_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, Animation) == 0x000008, "Member 'PlayCue_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, ReturnValue) == 0x000010, "Member 'PlayCue_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, AttachSkelMeshComp) == 0x000018, "Member 'PlayCue_C_Received_Notify::AttachSkelMeshComp' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, SoundLocation) == 0x000020, "Member 'PlayCue_C_Received_Notify::SoundLocation' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, IsValid) == 0x00002C, "Member 'PlayCue_C_Received_Notify::IsValid' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, TagComponents) == 0x000030, "Member 'PlayCue_C_Received_Notify::TagComponents' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, AttachComp) == 0x000040, "Member 'PlayCue_C_Received_Notify::AttachComp' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Array_Get_Item) == 0x000048, "Member 'PlayCue_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'PlayCue_C_Received_Notify::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_NotEqual_NameName_ReturnValue) == 0x00005C, "Member 'PlayCue_C_Received_Notify::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'PlayCue_C_Received_Notify::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000070, "Member 'PlayCue_C_Received_Notify::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'PlayCue_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_DoesSocketExist_ReturnValue) == 0x000079, "Member 'PlayCue_C_Received_Notify::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue) == 0x000080, "Member 'PlayCue_C_Received_Notify::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'PlayCue_C_Received_Notify::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Greater_IntInt_ReturnValue) == 0x00008C, "Member 'PlayCue_C_Received_Notify::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'PlayCue_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_GetComponentsByTag_ReturnValue) == 0x000098, "Member 'PlayCue_C_Received_Notify::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0000A8, "Member 'PlayCue_C_Received_Notify::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Not_PreBool_ReturnValue) == 0x0000A9, "Member 'PlayCue_C_Received_Notify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'PlayCue_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'PlayCue_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D0, "Member 'PlayCue_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayCue_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'PlayCue_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

