#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PointOfInterestComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LocalBehaviorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PointOfInterestComponent.PointOfInterestComponent_C
// 0x0010 (0x0250 - 0x0240)
class UPointOfInterestComponent_C : public ULocalBehaviorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          EnablePoint;                                       // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RequireBehaviorType;                               // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CooldownDuration;                                  // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownStartedTimestamp;                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PointOfInterestComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void IsCooldownFinished(bool* Result);
	void GetPointOfInterestWeight(float* Weight);
	void CanEnemyUsePointOfInterest(class APAWN_Enemy_C* Enemy, bool* Result);
	bool ShouldSaveComponent(struct FStreamingSaveGameComponentParams* Params_0);
	void UpdateArrivedTimestamp(bool Reset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PointOfInterestComponent_C">();
	}
	static class UPointOfInterestComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointOfInterestComponent_C>();
	}
};
static_assert(alignof(UPointOfInterestComponent_C) == 0x000010, "Wrong alignment on UPointOfInterestComponent_C");
static_assert(sizeof(UPointOfInterestComponent_C) == 0x000250, "Wrong size on UPointOfInterestComponent_C");
static_assert(offsetof(UPointOfInterestComponent_C, UberGraphFrame) == 0x000238, "Member 'UPointOfInterestComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPointOfInterestComponent_C, EnablePoint) == 0x000240, "Member 'UPointOfInterestComponent_C::EnablePoint' has a wrong offset!");
static_assert(offsetof(UPointOfInterestComponent_C, RequireBehaviorType) == 0x000241, "Member 'UPointOfInterestComponent_C::RequireBehaviorType' has a wrong offset!");
static_assert(offsetof(UPointOfInterestComponent_C, CooldownDuration) == 0x000244, "Member 'UPointOfInterestComponent_C::CooldownDuration' has a wrong offset!");
static_assert(offsetof(UPointOfInterestComponent_C, CooldownStartedTimestamp) == 0x000248, "Member 'UPointOfInterestComponent_C::CooldownStartedTimestamp' has a wrong offset!");

}

