#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROP_Table_V3

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PROP_Table_V3.PROP_Table_V3_C
// 0x0020 (0x0240 - 0x0220)
class APROP_Table_V3_C final : public AActor
{
public:
	class UStaticMeshComponent*                   TableOneScreen;                                    // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PROP_Table_V3_C">();
	}
	static class APROP_Table_V3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APROP_Table_V3_C>();
	}
};
static_assert(alignof(APROP_Table_V3_C) == 0x000008, "Wrong alignment on APROP_Table_V3_C");
static_assert(sizeof(APROP_Table_V3_C) == 0x000240, "Wrong size on APROP_Table_V3_C");
static_assert(offsetof(APROP_Table_V3_C, TableOneScreen) == 0x000220, "Member 'APROP_Table_V3_C::TableOneScreen' has a wrong offset!");
static_assert(offsetof(APROP_Table_V3_C, COMP_Descriptor) == 0x000228, "Member 'APROP_Table_V3_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(APROP_Table_V3_C, StaticMeshComponent0) == 0x000230, "Member 'APROP_Table_V3_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APROP_Table_V3_C, SharedRoot) == 0x000238, "Member 'APROP_Table_V3_C::SharedRoot' has a wrong offset!");

}

