#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROP_LoungeChairs

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PROP_LoungeChairs.PROP_LoungeChairs_C
// 0x0018 (0x0238 - 0x0220)
class APROP_LoungeChairs_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight1;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PROP_LoungeChairs_C">();
	}
	static class APROP_LoungeChairs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APROP_LoungeChairs_C>();
	}
};
static_assert(alignof(APROP_LoungeChairs_C) == 0x000008, "Wrong alignment on APROP_LoungeChairs_C");
static_assert(sizeof(APROP_LoungeChairs_C) == 0x000238, "Wrong size on APROP_LoungeChairs_C");
static_assert(offsetof(APROP_LoungeChairs_C, SpotLight1) == 0x000220, "Member 'APROP_LoungeChairs_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(APROP_LoungeChairs_C, SpotLight) == 0x000228, "Member 'APROP_LoungeChairs_C::SpotLight' has a wrong offset!");
static_assert(offsetof(APROP_LoungeChairs_C, StaticMesh) == 0x000230, "Member 'APROP_LoungeChairs_C::StaticMesh' has a wrong offset!");

}

