#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROP_MONITOR_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PROP_MONITOR_Base.PROP_MONITOR_Base_C
// 0x0030 (0x0250 - 0x0220)
class APROP_MONITOR_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_SignGlowMedia;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ScreenMaterialIndex;                               // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FlipbookMaterial;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PROP_MONITOR_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetParticleTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PROP_MONITOR_Base_C">();
	}
	static class APROP_MONITOR_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APROP_MONITOR_Base_C>();
	}
};
static_assert(alignof(APROP_MONITOR_Base_C) == 0x000008, "Wrong alignment on APROP_MONITOR_Base_C");
static_assert(sizeof(APROP_MONITOR_Base_C) == 0x000250, "Wrong size on APROP_MONITOR_Base_C");
static_assert(offsetof(APROP_MONITOR_Base_C, UberGraphFrame) == 0x000220, "Member 'APROP_MONITOR_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APROP_MONITOR_Base_C, P_SignGlowMedia) == 0x000228, "Member 'APROP_MONITOR_Base_C::P_SignGlowMedia' has a wrong offset!");
static_assert(offsetof(APROP_MONITOR_Base_C, RectLight) == 0x000230, "Member 'APROP_MONITOR_Base_C::RectLight' has a wrong offset!");
static_assert(offsetof(APROP_MONITOR_Base_C, StaticMesh) == 0x000238, "Member 'APROP_MONITOR_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(APROP_MONITOR_Base_C, ScreenMaterialIndex) == 0x000240, "Member 'APROP_MONITOR_Base_C::ScreenMaterialIndex' has a wrong offset!");
static_assert(offsetof(APROP_MONITOR_Base_C, FlipbookMaterial) == 0x000248, "Member 'APROP_MONITOR_Base_C::FlipbookMaterial' has a wrong offset!");

}

