#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROP_Table_V1

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PROP_Table_V1.PROP_Table_V1_C
// 0x0028 (0x0248 - 0x0220)
class APROP_Table_V1_C final : public AActor
{
public:
	class UCOMP_VoxelAudio_C*                     Audio_Loop;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PROP_Table_Center_TwoScreens;                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PROP_Table_V1_C">();
	}
	static class APROP_Table_V1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APROP_Table_V1_C>();
	}
};
static_assert(alignof(APROP_Table_V1_C) == 0x000008, "Wrong alignment on APROP_Table_V1_C");
static_assert(sizeof(APROP_Table_V1_C) == 0x000248, "Wrong size on APROP_Table_V1_C");
static_assert(offsetof(APROP_Table_V1_C, Audio_Loop) == 0x000220, "Member 'APROP_Table_V1_C::Audio_Loop' has a wrong offset!");
static_assert(offsetof(APROP_Table_V1_C, COMP_Descriptor) == 0x000228, "Member 'APROP_Table_V1_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(APROP_Table_V1_C, PROP_Table_Center_TwoScreens) == 0x000230, "Member 'APROP_Table_V1_C::PROP_Table_Center_TwoScreens' has a wrong offset!");
static_assert(offsetof(APROP_Table_V1_C, StaticMeshComponent0) == 0x000238, "Member 'APROP_Table_V1_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APROP_Table_V1_C, SharedRoot) == 0x000240, "Member 'APROP_Table_V1_C::SharedRoot' has a wrong offset!");

}

