#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PROP_MONITOR_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function PROP_MONITOR_Base.PROP_MONITOR_Base_C.ExecuteUbergraph_PROP_MONITOR_Base
// 0x0004 (0x0004 - 0x0000)
struct PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base) == 0x000004, "Wrong alignment on PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base");
static_assert(sizeof(PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base) == 0x000004, "Wrong size on PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base");
static_assert(offsetof(PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base, EntryPoint) == 0x000000, "Member 'PROP_MONITOR_Base_C_ExecuteUbergraph_PROP_MONITOR_Base::EntryPoint' has a wrong offset!");

// Function PROP_MONITOR_Base.PROP_MONITOR_Base_C.SetParticleTexture
// 0x0028 (0x0028 - 0x0000)
struct PROP_MONITOR_Base_C_SetParticleTexture final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PROP_MONITOR_Base_C_SetParticleTexture) == 0x000008, "Wrong alignment on PROP_MONITOR_Base_C_SetParticleTexture");
static_assert(sizeof(PROP_MONITOR_Base_C_SetParticleTexture) == 0x000028, "Wrong size on PROP_MONITOR_Base_C_SetParticleTexture");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_CreateNamedDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000010, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000014, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_K2_GetScalarParameterValue_ReturnValue_2) == 0x000018, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_K2_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PROP_MONITOR_Base_C_SetParticleTexture, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000020, "Member 'PROP_MONITOR_Base_C_SetParticleTexture::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");

}

