#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProximityMineProjectile

#include "Basic.hpp"

#include "STRUCT_HardItemParams_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProximityMineProjectile.ProximityMineProjectile_C.ExecuteUbergraph_ProximityMineProjectile
// 0x01E0 (0x01E0 - 0x0000)
struct ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryStartDetonationCountdown_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_Cursor_Primitive_1;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnySimulatingPhysics_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_2; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProxyMineDetonating_Result;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProxyMineDetonating_Result_1;           // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_3; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProxyMineArmed_Result;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProxyMineArmed_Result_1;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsSKILL_Launch_Projectile; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetScaledEnemyStatsDamage_DamageValue;    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0140(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCharacterTripProximityMine_Result;     // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile");
static_assert(sizeof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile) == 0x0001E0, "Wrong size on ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, EntryPoint) == 0x000000, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_TryStartDetonationCountdown_Result) == 0x000038, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_TryStartDetonationCountdown_Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x00003C, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_Event_Cursor_Primitive) == 0x000040, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_Event_Cursor_Primitive' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000048, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_Event_Cursor_Primitive_1) == 0x000050, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_Event_Cursor_Primitive_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_FMax_ReturnValue) == 0x000058, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000070, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent) == 0x000078, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1) == 0x000080, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsAnySimulatingPhysics_ReturnValue) == 0x000088, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsAnySimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CreateDelegate_OutputDelegate_3) == 0x00008C, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_2) == 0x0000A0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_2' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsProxyMineDetonating_Result) == 0x0000AC, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsProxyMineDetonating_Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Not_PreBool_ReturnValue) == 0x0000AD, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsProxyMineDetonating_Result_1) == 0x0000AE, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsProxyMineDetonating_Result_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0000B8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_3) == 0x0000C8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent_3' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0000D0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsProxyMineArmed_Result) == 0x0000D1, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsProxyMineArmed_Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsProxyMineArmed_Result_1) == 0x0000D2, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsProxyMineArmed_Result_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_BooleanAND_ReturnValue) == 0x0000D3, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D4, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D5, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000D8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, Temp_class_Variable) == 0x0000E8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CustomEvent_Loaded) == 0x0000F0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ClassDynamicCast_AsSKILL_Launch_Projectile) == 0x0000F8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ClassDynamicCast_AsSKILL_Launch_Projectile' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ClassDynamicCast_bSuccess) == 0x000100, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_GetScaledEnemyStatsDamage_DamageValue) == 0x000104, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_GetScaledEnemyStatsDamage_DamageValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_CreateDelegate_OutputDelegate_4) == 0x000108, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000118, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_bFromSweep) == 0x00013C, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_ComponentBoundEvent_SweepResult) == 0x000140, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0001D0, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile, CallFunc_CanCharacterTripProximityMine_Result) == 0x0001D9, "Member 'ProximityMineProjectile_C_ExecuteUbergraph_ProximityMineProjectile::CallFunc_CanCharacterTripProximityMine_Result' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'ProximityMineProjectile_C_BndEvt__ProximityMineProjectile_MotionSensor_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ProximityMineProjectile_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_ReceiveTick) == 0x000004, "Wrong alignment on ProximityMineProjectile_C_ReceiveTick");
static_assert(sizeof(ProximityMineProjectile_C_ReceiveTick) == 0x000004, "Wrong size on ProximityMineProjectile_C_ReceiveTick");
static_assert(offsetof(ProximityMineProjectile_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ProximityMineProjectile_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.OnCursorLeave
// 0x0008 (0x0008 - 0x0000)
struct ProximityMineProjectile_C_OnCursorLeave final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_OnCursorLeave) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_OnCursorLeave");
static_assert(sizeof(ProximityMineProjectile_C_OnCursorLeave) == 0x000008, "Wrong size on ProximityMineProjectile_C_OnCursorLeave");
static_assert(offsetof(ProximityMineProjectile_C_OnCursorLeave, Cursor_Primitive) == 0x000000, "Member 'ProximityMineProjectile_C_OnCursorLeave::Cursor_Primitive' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.OnCursorEnter
// 0x0008 (0x0008 - 0x0000)
struct ProximityMineProjectile_C_OnCursorEnter final
{
public:
	class UPrimitiveComponent*                    Cursor_Primitive;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_OnCursorEnter) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_OnCursorEnter");
static_assert(sizeof(ProximityMineProjectile_C_OnCursorEnter) == 0x000008, "Wrong size on ProximityMineProjectile_C_OnCursorEnter");
static_assert(offsetof(ProximityMineProjectile_C_OnCursorEnter, Cursor_Primitive) == 0x000000, "Member 'ProximityMineProjectile_C_OnCursorEnter::Cursor_Primitive' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834
// 0x0008 (0x0008 - 0x0000)
struct ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834");
static_assert(sizeof(ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834) == 0x000008, "Wrong size on ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834");
static_assert(offsetof(ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834, Loaded) == 0x000000, "Member 'ProximityMineProjectile_C_OnLoaded_CBA3A87543E9FAB5CF845EAAF5D9C834::Loaded' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.EVENT_OnArmProximityMine
// 0x0002 (0x0002 - 0x0000)
struct ProximityMineProjectile_C_EVENT_OnArmProximityMine final
{
public:
	bool                                          CallFunc_CanAnyOverlappingActorTripProxyMine_Result; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryStartDetonationCountdown_Result;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_EVENT_OnArmProximityMine) == 0x000001, "Wrong alignment on ProximityMineProjectile_C_EVENT_OnArmProximityMine");
static_assert(sizeof(ProximityMineProjectile_C_EVENT_OnArmProximityMine) == 0x000002, "Wrong size on ProximityMineProjectile_C_EVENT_OnArmProximityMine");
static_assert(offsetof(ProximityMineProjectile_C_EVENT_OnArmProximityMine, CallFunc_CanAnyOverlappingActorTripProxyMine_Result) == 0x000000, "Member 'ProximityMineProjectile_C_EVENT_OnArmProximityMine::CallFunc_CanAnyOverlappingActorTripProxyMine_Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_EVENT_OnArmProximityMine, CallFunc_TryStartDetonationCountdown_Result) == 0x000001, "Member 'ProximityMineProjectile_C_EVENT_OnArmProximityMine::CallFunc_TryStartDetonationCountdown_Result' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.InitializeProximityMine
// 0x0008 (0x0008 - 0x0000)
struct ProximityMineProjectile_C_InitializeProximityMine final
{
public:
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_InitializeProximityMine) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_InitializeProximityMine");
static_assert(sizeof(ProximityMineProjectile_C_InitializeProximityMine) == 0x000008, "Wrong size on ProximityMineProjectile_C_InitializeProximityMine");
static_assert(offsetof(ProximityMineProjectile_C_InitializeProximityMine, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent) == 0x000000, "Member 'ProximityMineProjectile_C_InitializeProximityMine::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.IsProxyMineArmed
// 0x000C (0x000C - 0x0000)
struct ProximityMineProjectile_C_IsProxyMineArmed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_IsProxyMineArmed) == 0x000004, "Wrong alignment on ProximityMineProjectile_C_IsProxyMineArmed");
static_assert(sizeof(ProximityMineProjectile_C_IsProxyMineArmed) == 0x00000C, "Wrong size on ProximityMineProjectile_C_IsProxyMineArmed");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineArmed, Result) == 0x000000, "Member 'ProximityMineProjectile_C_IsProxyMineArmed::Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineArmed, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'ProximityMineProjectile_C_IsProxyMineArmed::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineArmed, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'ProximityMineProjectile_C_IsProxyMineArmed::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineArmed, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'ProximityMineProjectile_C_IsProxyMineArmed::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.IsProxyMineDetonating
// 0x0002 (0x0002 - 0x0000)
struct ProximityMineProjectile_C_IsProxyMineDetonating final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_IsProxyMineDetonating) == 0x000001, "Wrong alignment on ProximityMineProjectile_C_IsProxyMineDetonating");
static_assert(sizeof(ProximityMineProjectile_C_IsProxyMineDetonating) == 0x000002, "Wrong size on ProximityMineProjectile_C_IsProxyMineDetonating");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineDetonating, Result) == 0x000000, "Member 'ProximityMineProjectile_C_IsProxyMineDetonating::Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_IsProxyMineDetonating, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'ProximityMineProjectile_C_IsProxyMineDetonating::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.CanCharacterTripProximityMine
// 0x0010 (0x0010 - 0x0000)
struct ProximityMineProjectile_C_CanCharacterTripProximityMine final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_CanCharacterTripProximityMine) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_CanCharacterTripProximityMine");
static_assert(sizeof(ProximityMineProjectile_C_CanCharacterTripProximityMine) == 0x000010, "Wrong size on ProximityMineProjectile_C_CanCharacterTripProximityMine");
static_assert(offsetof(ProximityMineProjectile_C_CanCharacterTripProximityMine, Character) == 0x000000, "Member 'ProximityMineProjectile_C_CanCharacterTripProximityMine::Character' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanCharacterTripProximityMine, Result) == 0x000008, "Member 'ProximityMineProjectile_C_CanCharacterTripProximityMine::Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanCharacterTripProximityMine, CallFunc_IsPlayerControlled_ReturnValue) == 0x000009, "Member 'ProximityMineProjectile_C_CanCharacterTripProximityMine::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanCharacterTripProximityMine, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00000A, "Member 'ProximityMineProjectile_C_CanCharacterTripProximityMine::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanCharacterTripProximityMine, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'ProximityMineProjectile_C_CanCharacterTripProximityMine::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.CanAnyOverlappingActorTripProxyMine
// 0x0058 (0x0058 - 0x0000)
struct ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         OverlappingActors;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0030(0x0010)(ReferenceParm)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCharacterTripProximityMine_Result;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine");
static_assert(sizeof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine) == 0x000058, "Wrong size on ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, Result) == 0x000000, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, OverlappingActors) == 0x000008, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::OverlappingActors' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_Array_Get_Item) == 0x000028, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000030, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000040, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_CanCharacterTripProximityMine_Result) == 0x000049, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_CanCharacterTripProximityMine_Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ProximityMineProjectile_C_CanAnyOverlappingActorTripProxyMine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.StartBecomingArmed
// 0x0050 (0x0050 - 0x0000)
struct ProximityMineProjectile_C_StartBecomingArmed final
{
public:
	bool                                          OnBeginPlay;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetExplosiveLocation_Location;            // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_StartBecomingArmed) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_StartBecomingArmed");
static_assert(sizeof(ProximityMineProjectile_C_StartBecomingArmed) == 0x000050, "Wrong size on ProximityMineProjectile_C_StartBecomingArmed");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, OnBeginPlay) == 0x000000, "Member 'ProximityMineProjectile_C_StartBecomingArmed::OnBeginPlay' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'ProximityMineProjectile_C_StartBecomingArmed::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ProximityMineProjectile_C_StartBecomingArmed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_GetExplosiveLocation_Location) == 0x00001C, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_GetExplosiveLocation_Location' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'ProximityMineProjectile_C_StartBecomingArmed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000048, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_StartBecomingArmed, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'ProximityMineProjectile_C_StartBecomingArmed::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.TryStartDetonationCountdown
// 0x0038 (0x0038 - 0x0000)
struct ProximityMineProjectile_C_TryStartDetonationCountdown final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewLocalVar_0;                                     // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityMineProjectile_C_TryStartDetonationCountdown) == 0x000008, "Wrong alignment on ProximityMineProjectile_C_TryStartDetonationCountdown");
static_assert(sizeof(ProximityMineProjectile_C_TryStartDetonationCountdown) == 0x000038, "Wrong size on ProximityMineProjectile_C_TryStartDetonationCountdown");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, Result) == 0x000000, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::Result' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, NewLocalVar_0) == 0x000004, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000024, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityMineProjectile_C_TryStartDetonationCountdown, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'ProximityMineProjectile_C_TryStartDetonationCountdown::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProximityMineProjectile.ProximityMineProjectile_C.EVENT_ArmedBeep
// 0x0040 (0x0040 - 0x0000)
struct ProximityMineProjectile_C_EVENT_ArmedBeep final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
