#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PUZZLE_Base

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_CardinalDirection_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"
#include "ENUM_PuzzleSolveType_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function PUZZLE_Base.PUZZLE_Base_C.ExecuteUbergraph_PUZZLE_Base
// 0x0008 (0x0008 - 0x0000)
struct PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bVisibleState;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base) == 0x000004, "Wrong alignment on PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base");
static_assert(sizeof(PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base) == 0x000008, "Wrong size on PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base");
static_assert(offsetof(PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base, EntryPoint) == 0x000000, "Member 'PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base, K2Node_ComponentBoundEvent_bVisibleState) == 0x000004, "Member 'PUZZLE_Base_C_ExecuteUbergraph_PUZZLE_Base::K2Node_ComponentBoundEvent_bVisibleState' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature final
{
public:
	bool                                          bVisibleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong alignment on PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(sizeof(PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature) == 0x000001, "Wrong size on PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature");
static_assert(offsetof(PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature, bVisibleState) == 0x000000, "Member 'PUZZLE_Base_C_BndEvt__COMP_VoxelCullable_K2Node_ComponentBoundEvent_0_CullableVisibilitySignature__DelegateSignature::bVisibleState' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.GetTargetShape
// 0x0030 (0x0030 - 0x0000)
struct PUZZLE_Base_C_GetTargetShape final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShapeComponent*                        ShapeComponent;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldFocusOnInteract_Result;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShapeComponent*                        CallFunc_GetPuzzleShape_TargetShape;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PUZZLE_Base_C_GetTargetShape) == 0x000008, "Wrong alignment on PUZZLE_Base_C_GetTargetShape");
static_assert(sizeof(PUZZLE_Base_C_GetTargetShape) == 0x000030, "Wrong size on PUZZLE_Base_C_GetTargetShape");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CursorPrimitive) == 0x000000, "Member 'PUZZLE_Base_C_GetTargetShape::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, ShapeComponent) == 0x000008, "Member 'PUZZLE_Base_C_GetTargetShape::ShapeComponent' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'PUZZLE_Base_C_GetTargetShape::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'PUZZLE_Base_C_GetTargetShape::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'PUZZLE_Base_C_GetTargetShape::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CallFunc_ShouldFocusOnInteract_Result) == 0x000020, "Member 'PUZZLE_Base_C_GetTargetShape::CallFunc_ShouldFocusOnInteract_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetTargetShape, CallFunc_GetPuzzleShape_TargetShape) == 0x000028, "Member 'PUZZLE_Base_C_GetTargetShape::CallFunc_GetPuzzleShape_TargetShape' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.TryInteract
// 0x02E8 (0x02E8 - 0x0000)
struct PUZZLE_Base_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0040(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0060(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0088(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsJunctionBoxFunctional_Result;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x00B0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsJunctionBoxFunctional_Result_1;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_PuzzleCell_Base_C*                K2Node_DynamicCast_AsCOMP_Puzzle_Cell_Base;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_InteractResultType                       CallFunc_InteractWithPuzzlePrimitive_Result;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InteractWithPuzzlePrimitive_ResultText;   // 0x00E8(0x0018)()
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x0110(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetSecurityLockText_Result;               // 0x0130(0x0018)()
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x0150(0x0020)(HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsITEM_Base;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0188(0x0020)(HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_FindItem_FoundItem;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Activate_Result;                          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_6;        // 0x01B8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_7;        // 0x01E0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_CanManipulateUnlockTargets_Result;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_8;        // 0x0208(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_9;        // 0x0230(0x0020)(HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryBeginFocusInteraction_Result;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldFocusOnInteract_Result;             // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_10;       // 0x0270(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_OpenPuzzleBox_Result;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_11;       // 0x0298(0x0020)(HasGetValueTypeHash)
	class UAnimBP_JunctionBox_C*                  CallFunc_GetAnimInstance_AnimInstance;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_12;       // 0x02C0(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_TryInteract) == 0x000008, "Wrong alignment on PUZZLE_Base_C_TryInteract");
static_assert(sizeof(PUZZLE_Base_C_TryInteract) == 0x0002E8, "Wrong size on PUZZLE_Base_C_TryInteract");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, SourceActor) == 0x000000, "Member 'PUZZLE_Base_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'PUZZLE_Base_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, InteractionType) == 0x000010, "Member 'PUZZLE_Base_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, InteractResults) == 0x000018, "Member 'PUZZLE_Base_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, Character) == 0x000038, "Member 'PUZZLE_Base_C_TryInteract::Character' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000040, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_TryInteract_InteractResults) == 0x000060, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000088, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_IsJunctionBoxFunctional_Result) == 0x0000A8, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_IsJunctionBoxFunctional_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x0000B0, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_IsJunctionBoxFunctional_Result_1) == 0x0000D0, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_IsJunctionBoxFunctional_Result_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_AsCOMP_Puzzle_Cell_Base) == 0x0000D8, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_AsCOMP_Puzzle_Cell_Base' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_InteractWithPuzzlePrimitive_Result) == 0x0000E1, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_InteractWithPuzzlePrimitive_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_InteractWithPuzzlePrimitive_ResultText) == 0x0000E8, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_InteractWithPuzzlePrimitive_ResultText' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000100, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x000110, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_GetSecurityLockText_Result) == 0x000130, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_GetSecurityLockText_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000148, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x000150, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_ClassDynamicCast_AsITEM_Base) == 0x000170, "Member 'PUZZLE_Base_C_TryInteract::K2Node_ClassDynamicCast_AsITEM_Base' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_ClassDynamicCast_bSuccess) == 0x000178, "Member 'PUZZLE_Base_C_TryInteract::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_GetInventoryComponent_Inventory) == 0x000180, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000188, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_FindItem_FoundItem) == 0x0001A8, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_FindItem_FoundItem' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_Activate_Result) == 0x0001B0, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_Activate_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_IsValid_ReturnValue) == 0x0001B1, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_6) == 0x0001B8, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_6' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001D8, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_7) == 0x0001E0, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_7' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_CanManipulateUnlockTargets_Result) == 0x000200, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_CanManipulateUnlockTargets_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_8) == 0x000208, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_8' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_9) == 0x000230, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_9' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000250, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_DynamicCast_bSuccess_2) == 0x000258, "Member 'PUZZLE_Base_C_TryInteract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_GetController_ReturnValue) == 0x000260, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_TryBeginFocusInteraction_Result) == 0x000268, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_TryBeginFocusInteraction_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_ShouldFocusOnInteract_Result) == 0x000269, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_ShouldFocusOnInteract_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_10) == 0x000270, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_10' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_OpenPuzzleBox_Result) == 0x000290, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_OpenPuzzleBox_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_11) == 0x000298, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_11' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_GetAnimInstance_AnimInstance) == 0x0002B8, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_GetAnimInstance_AnimInstance' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_12) == 0x0002C0, "Member 'PUZZLE_Base_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_12' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_TryInteract, CallFunc_IsAnyMontagePlaying_ReturnValue) == 0x0002E0, "Member 'PUZZLE_Base_C_TryInteract::CallFunc_IsAnyMontagePlaying_ReturnValue' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.GetAnimInstance
// 0x0020 (0x0020 - 0x0000)
struct PUZZLE_Base_C_GetAnimInstance final
{
public:
	class UAnimBP_JunctionBox_C*                  AnimInstance;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_JunctionBox_C*                  K2Node_DynamicCast_AsAnim_BP_Junction_Box;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_GetAnimInstance) == 0x000008, "Wrong alignment on PUZZLE_Base_C_GetAnimInstance");
static_assert(sizeof(PUZZLE_Base_C_GetAnimInstance) == 0x000020, "Wrong size on PUZZLE_Base_C_GetAnimInstance");
static_assert(offsetof(PUZZLE_Base_C_GetAnimInstance, AnimInstance) == 0x000000, "Member 'PUZZLE_Base_C_GetAnimInstance::AnimInstance' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetAnimInstance, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PUZZLE_Base_C_GetAnimInstance::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetAnimInstance, K2Node_DynamicCast_AsAnim_BP_Junction_Box) == 0x000010, "Member 'PUZZLE_Base_C_GetAnimInstance::K2Node_DynamicCast_AsAnim_BP_Junction_Box' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_GetAnimInstance, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PUZZLE_Base_C_GetAnimInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.EVENT_IsDoneOpening
// 0x0008 (0x0008 - 0x0000)
struct PUZZLE_Base_C_EVENT_IsDoneOpening final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PUZZLE_Base_C_EVENT_IsDoneOpening) == 0x000008, "Wrong alignment on PUZZLE_Base_C_EVENT_IsDoneOpening");
static_assert(sizeof(PUZZLE_Base_C_EVENT_IsDoneOpening) == 0x000008, "Wrong size on PUZZLE_Base_C_EVENT_IsDoneOpening");
static_assert(offsetof(PUZZLE_Base_C_EVENT_IsDoneOpening, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'PUZZLE_Base_C_EVENT_IsDoneOpening::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.EVENT_OnPuzzleBoxClosed
// 0x0040 (0x0040 - 0x0000)
struct PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_PuzzleCell_Base_C*                CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed) == 0x000008, "Wrong alignment on PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed");
static_assert(sizeof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed) == 0x000040, "Wrong size on PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, Temp_int_Array_Index_Variable) == 0x000000, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Array_Get_Item) == 0x000018, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_Less_IntInt_ReturnValue_1) == 0x000034, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'PUZZLE_Base_C_EVENT_OnPuzzleBoxClosed::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.InitializePuzzle
// 0x0088 (0x0088 - 0x0000)
struct PUZZLE_Base_C_InitializePuzzle final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSecurityForCurrentLevel_Result;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewSecurityLevel)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_InitializePuzzle) == 0x000008, "Wrong alignment on PUZZLE_Base_C_InitializePuzzle");
static_assert(sizeof(PUZZLE_Base_C_InitializePuzzle) == 0x000088, "Wrong size on PUZZLE_Base_C_InitializePuzzle");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, GameInstance) == 0x000000, "Member 'PUZZLE_Base_C_InitializePuzzle::GameInstance' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, Temp_bool_Variable) == 0x000008, "Member 'PUZZLE_Base_C_InitializePuzzle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, Temp_float_Variable) == 0x00000C, "Member 'PUZZLE_Base_C_InitializePuzzle::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, Temp_float_Variable_1) == 0x000010, "Member 'PUZZLE_Base_C_InitializePuzzle::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'PUZZLE_Base_C_InitializePuzzle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_Select_Default) == 0x000040, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000048, "Member 'PUZZLE_Base_C_InitializePuzzle::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, CallFunc_GetSecurityForCurrentLevel_Result) == 0x000050, "Member 'PUZZLE_Base_C_InitializePuzzle::CallFunc_GetSecurityForCurrentLevel_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'PUZZLE_Base_C_InitializePuzzle::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'PUZZLE_Base_C_InitializePuzzle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_DynamicCast_AsGI_Single_Player) == 0x000068, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializePuzzle, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'PUZZLE_Base_C_InitializePuzzle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.InitializeAttributes
// 0x0014 (0x0014 - 0x0000)
struct PUZZLE_Base_C_InitializeAttributes final
{
public:
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PUZZLE_Base_C_InitializeAttributes) == 0x000004, "Wrong alignment on PUZZLE_Base_C_InitializeAttributes");
static_assert(sizeof(PUZZLE_Base_C_InitializeAttributes) == 0x000014, "Wrong size on PUZZLE_Base_C_InitializeAttributes");
static_assert(offsetof(PUZZLE_Base_C_InitializeAttributes, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PUZZLE_Base_C_InitializeAttributes::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InitializeAttributes, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'PUZZLE_Base_C_InitializeAttributes::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.InitializeAsSolved
// 0x0001 (0x0001 - 0x0000)
struct PUZZLE_Base_C_InitializeAsSolved final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_InitializeAsSolved) == 0x000001, "Wrong alignment on PUZZLE_Base_C_InitializeAsSolved");
static_assert(sizeof(PUZZLE_Base_C_InitializeAsSolved) == 0x000001, "Wrong size on PUZZLE_Base_C_InitializeAsSolved");
static_assert(offsetof(PUZZLE_Base_C_InitializeAsSolved, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'PUZZLE_Base_C_InitializeAsSolved::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.InitializeAsOpened
// 0x0008 (0x0008 - 0x0000)
struct PUZZLE_Base_C_InitializeAsOpened final
{
public:
	class UAnimBP_JunctionBox_C*                  CallFunc_GetAnimInstance_AnimInstance;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PUZZLE_Base_C_InitializeAsOpened) == 0x000008, "Wrong alignment on PUZZLE_Base_C_InitializeAsOpened");
static_assert(sizeof(PUZZLE_Base_C_InitializeAsOpened) == 0x000008, "Wrong size on PUZZLE_Base_C_InitializeAsOpened");
static_assert(offsetof(PUZZLE_Base_C_InitializeAsOpened, CallFunc_GetAnimInstance_AnimInstance) == 0x000000, "Member 'PUZZLE_Base_C_InitializeAsOpened::CallFunc_GetAnimInstance_AnimInstance' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.InteractWithPuzzlePrimitive
// 0x0028 (0x0028 - 0x0000)
struct PUZZLE_Base_C_InteractWithPuzzlePrimitive final
{
public:
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractResultType                       Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ResultText;                                        // 0x0010(0x0018)(Parm, OutParm)
};
static_assert(alignof(PUZZLE_Base_C_InteractWithPuzzlePrimitive) == 0x000008, "Wrong alignment on PUZZLE_Base_C_InteractWithPuzzlePrimitive");
static_assert(sizeof(PUZZLE_Base_C_InteractWithPuzzlePrimitive) == 0x000028, "Wrong size on PUZZLE_Base_C_InteractWithPuzzlePrimitive");
static_assert(offsetof(PUZZLE_Base_C_InteractWithPuzzlePrimitive, CursorPrimitive) == 0x000000, "Member 'PUZZLE_Base_C_InteractWithPuzzlePrimitive::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InteractWithPuzzlePrimitive, Result) == 0x000008, "Member 'PUZZLE_Base_C_InteractWithPuzzlePrimitive::Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_InteractWithPuzzlePrimitive, ResultText) == 0x000010, "Member 'PUZZLE_Base_C_InteractWithPuzzlePrimitive::ResultText' has a wrong offset!");

// Function PUZZLE_Base.PUZZLE_Base_C.HandleSolvedOutcomes
// 0x0150 (0x0150 - 0x0000)
struct PUZZLE_Base_C_HandleSolvedOutcomes final
{
public:
	bool                                          SolvedByPlayer;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentKey;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryIncrementOrderedAchievement_Result;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_SetInteractLocked_self_CastInput;         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInteractLocked_Result;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x00A8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SetCompletedStoryQuest_LogString;         // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0100(0x0010)(ReferenceParm)
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput_1;             // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults_1;            // 0x0120(0x0020)(HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PUZZLE_Base_C_HandleSolvedOutcomes) == 0x000008, "Wrong alignment on PUZZLE_Base_C_HandleSolvedOutcomes");
static_assert(sizeof(PUZZLE_Base_C_HandleSolvedOutcomes) == 0x000150, "Wrong size on PUZZLE_Base_C_HandleSolvedOutcomes");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, SolvedByPlayer) == 0x000000, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::SolvedByPlayer' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CurrentKey) == 0x000004, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CurrentKey' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, GameInstance) == 0x000010, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::GameInstance' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, K2Node_DynamicCast_AsGI_Single_Player) == 0x000028, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Array_Index_Variable_2) == 0x000048, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, Temp_int_Loop_Counter_Variable_2) == 0x00004C, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_TryIncrementOrderedAchievement_Result) == 0x000054, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_TryIncrementOrderedAchievement_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Array_Get_Item) == 0x000058, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_SetInteractLocked_self_CastInput) == 0x000068, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_SetInteractLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_SetInteractLocked_Result) == 0x000078, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_SetInteractLocked_Result' has a wrong offset!");
static_assert(offsetof(PUZZLE_Base_C_HandleSolvedOutcomes, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'PUZZLE_Base_C_HandleSolvedOutcomes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
