#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReactorFloor_RadTile_Light

#include "Basic.hpp"


namespace SDK::Params
{

// Function ReactorFloor_RadTile_Light.ReactorFloor_RadTile_Light_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct ReactorFloor_RadTile_Light_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReactorFloor_RadTile_Light_C_UserConstructionScript) == 0x000001, "Wrong alignment on ReactorFloor_RadTile_Light_C_UserConstructionScript");
static_assert(sizeof(ReactorFloor_RadTile_Light_C_UserConstructionScript) == 0x000003, "Wrong size on ReactorFloor_RadTile_Light_C_UserConstructionScript");
static_assert(offsetof(ReactorFloor_RadTile_Light_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'ReactorFloor_RadTile_Light_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ReactorFloor_RadTile_Light_C_UserConstructionScript, Temp_byte_Variable) == 0x000001, "Member 'ReactorFloor_RadTile_Light_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ReactorFloor_RadTile_Light_C_UserConstructionScript, K2Node_Select_Default) == 0x000002, "Member 'ReactorFloor_RadTile_Light_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

