#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SAVE_Settings

#include "Basic.hpp"

#include "ENUM_InputCategory_structs.hpp"
#include "ENUM_OffLowMediumHigh_structs.hpp"
#include "ENUM_SmallMediumLarge_structs.hpp"
#include "Engine_structs.hpp"
#include "DLSSBlueprint_structs.hpp"
#include "ENUM_HotbarStyle_structs.hpp"
#include "ENUM_OffReducedNormal_structs.hpp"
#include "ENUM_QualitySetting_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_BoundInputActionPair_structs.hpp"


namespace SDK::Params
{

// Function SAVE_Settings.SAVE_Settings_C.AreAllSettingsSaved
// 0x0001 (0x0001 - 0x0000)
struct SAVE_Settings_C_AreAllSettingsSaved final
{
public:
	bool                                          IsDefault;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_AreAllSettingsSaved) == 0x000001, "Wrong alignment on SAVE_Settings_C_AreAllSettingsSaved");
static_assert(sizeof(SAVE_Settings_C_AreAllSettingsSaved) == 0x000001, "Wrong size on SAVE_Settings_C_AreAllSettingsSaved");
static_assert(offsetof(SAVE_Settings_C_AreAllSettingsSaved, IsDefault) == 0x000000, "Member 'SAVE_Settings_C_AreAllSettingsSaved::IsDefault' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetHUDCurvature
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetHUDCurvature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetHUDCurvature) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetHUDCurvature");
static_assert(sizeof(SAVE_Settings_C_SetHUDCurvature) == 0x000008, "Wrong size on SAVE_Settings_C_SetHUDCurvature");
static_assert(offsetof(SAVE_Settings_C_SetHUDCurvature, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetHUDCurvature::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetHUDCurvature, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetHUDCurvature::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetHUDCurvature
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetHUDCurvature final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetHUDCurvature) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetHUDCurvature");
static_assert(sizeof(SAVE_Settings_C_GetHUDCurvature) == 0x000004, "Wrong size on SAVE_Settings_C_GetHUDCurvature");
static_assert(offsetof(SAVE_Settings_C_GetHUDCurvature, Result) == 0x000000, "Member 'SAVE_Settings_C_GetHUDCurvature::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.InitializeSaveSettings
// 0x0018 (0x0018 - 0x0000)
struct SAVE_Settings_C_InitializeSaveSettings final
{
public:
	class ACON_Hacker_C*                          HackerCon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     SinglePlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_InitializeSaveSettings) == 0x000008, "Wrong alignment on SAVE_Settings_C_InitializeSaveSettings");
static_assert(sizeof(SAVE_Settings_C_InitializeSaveSettings) == 0x000018, "Wrong size on SAVE_Settings_C_InitializeSaveSettings");
static_assert(offsetof(SAVE_Settings_C_InitializeSaveSettings, HackerCon) == 0x000000, "Member 'SAVE_Settings_C_InitializeSaveSettings::HackerCon' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_InitializeSaveSettings, SinglePlayer) == 0x000008, "Member 'SAVE_Settings_C_InitializeSaveSettings::SinglePlayer' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_InitializeSaveSettings, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'SAVE_Settings_C_InitializeSaveSettings::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_InitializeSaveSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'SAVE_Settings_C_InitializeSaveSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyHUDCurvature
// 0x0030 (0x0030 - 0x0000)
struct SAVE_Settings_C_ApplyHUDCurvature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraPanelWidget*                     CameraPanelWidget;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraPanelWidget*                     CallFunc_GetCameraPanelWidget_Result;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_ApplyHUDCurvature) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyHUDCurvature");
static_assert(sizeof(SAVE_Settings_C_ApplyHUDCurvature) == 0x000030, "Wrong size on SAVE_Settings_C_ApplyHUDCurvature");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyHUDCurvature::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CameraPanelWidget) == 0x000008, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CameraPanelWidget' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CallFunc_GetCameraPanelWidget_Result) == 0x000010, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CallFunc_GetCameraPanelWidget_Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000020, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyHUDCurvature, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'SAVE_Settings_C_ApplyHUDCurvature::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetMasterVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetMasterVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetMasterVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetMasterVolume");
static_assert(sizeof(SAVE_Settings_C_SetMasterVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetMasterVolume");
static_assert(offsetof(SAVE_Settings_C_SetMasterVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetMasterVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetMasterVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetMasterVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetMasterVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetMasterVolume final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetMasterVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetMasterVolume");
static_assert(sizeof(SAVE_Settings_C_GetMasterVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetMasterVolume");
static_assert(offsetof(SAVE_Settings_C_GetMasterVolume, Result) == 0x000000, "Member 'SAVE_Settings_C_GetMasterVolume::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyMasterVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyMasterVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyMasterVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyMasterVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyMasterVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyMasterVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyMasterVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyMasterVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetMusicVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetMusicVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetMusicVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetMusicVolume");
static_assert(sizeof(SAVE_Settings_C_SetMusicVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetMusicVolume");
static_assert(offsetof(SAVE_Settings_C_SetMusicVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetMusicVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetMusicVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetMusicVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetMusicVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetMusicVolume final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetMusicVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetMusicVolume");
static_assert(sizeof(SAVE_Settings_C_GetMusicVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetMusicVolume");
static_assert(offsetof(SAVE_Settings_C_GetMusicVolume, Result) == 0x000000, "Member 'SAVE_Settings_C_GetMusicVolume::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyMusicVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyMusicVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyMusicVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyMusicVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyMusicVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyMusicVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyMusicVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyMusicVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetVoiceVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetVoiceVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetVoiceVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetVoiceVolume");
static_assert(sizeof(SAVE_Settings_C_SetVoiceVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetVoiceVolume");
static_assert(offsetof(SAVE_Settings_C_SetVoiceVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetVoiceVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetVoiceVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetVoiceVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetVoiceVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetVoiceVolume final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetVoiceVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetVoiceVolume");
static_assert(sizeof(SAVE_Settings_C_GetVoiceVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetVoiceVolume");
static_assert(offsetof(SAVE_Settings_C_GetVoiceVolume, Result) == 0x000000, "Member 'SAVE_Settings_C_GetVoiceVolume::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyVoiceVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyVoiceVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyVoiceVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyVoiceVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyVoiceVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyVoiceVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyVoiceVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyVoiceVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetEffectsVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetEffectsVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetEffectsVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetEffectsVolume");
static_assert(sizeof(SAVE_Settings_C_SetEffectsVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetEffectsVolume");
static_assert(offsetof(SAVE_Settings_C_SetEffectsVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetEffectsVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetEffectsVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetEffectsVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetEffectsVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetEffectsVolume final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetEffectsVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetEffectsVolume");
static_assert(sizeof(SAVE_Settings_C_GetEffectsVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetEffectsVolume");
static_assert(offsetof(SAVE_Settings_C_GetEffectsVolume, Result) == 0x000000, "Member 'SAVE_Settings_C_GetEffectsVolume::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyEffectsVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyEffectsVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyEffectsVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyEffectsVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyEffectsVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyEffectsVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyEffectsVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyEffectsVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetEnvironmentVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetEnvironmentVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetEnvironmentVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetEnvironmentVolume");
static_assert(sizeof(SAVE_Settings_C_SetEnvironmentVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetEnvironmentVolume");
static_assert(offsetof(SAVE_Settings_C_SetEnvironmentVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetEnvironmentVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetEnvironmentVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetEnvironmentVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetEnvironmentVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetEnvironmentVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetEnvironmentVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetEnvironmentVolume");
static_assert(sizeof(SAVE_Settings_C_GetEnvironmentVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetEnvironmentVolume");
static_assert(offsetof(SAVE_Settings_C_GetEnvironmentVolume, Volume) == 0x000000, "Member 'SAVE_Settings_C_GetEnvironmentVolume::Volume' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyEnvironmentVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyEnvironmentVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyEnvironmentVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyEnvironmentVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyEnvironmentVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyEnvironmentVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyEnvironmentVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyEnvironmentVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetDefaultLanguage
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_SetDefaultLanguage final
{
public:
	class FString                                 DefaultLanguage;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_SetDefaultLanguage) == 0x000008, "Wrong alignment on SAVE_Settings_C_SetDefaultLanguage");
static_assert(sizeof(SAVE_Settings_C_SetDefaultLanguage) == 0x000010, "Wrong size on SAVE_Settings_C_SetDefaultLanguage");
static_assert(offsetof(SAVE_Settings_C_SetDefaultLanguage, DefaultLanguage) == 0x000000, "Member 'SAVE_Settings_C_SetDefaultLanguage::DefaultLanguage' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetLanguage
// 0x0018 (0x0018 - 0x0000)
struct SAVE_Settings_C_SetLanguage final
{
public:
	class FString                                 NewValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetLanguage) == 0x000008, "Wrong alignment on SAVE_Settings_C_SetLanguage");
static_assert(sizeof(SAVE_Settings_C_SetLanguage) == 0x000018, "Wrong size on SAVE_Settings_C_SetLanguage");
static_assert(offsetof(SAVE_Settings_C_SetLanguage, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetLanguage::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetLanguage, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000010, "Member 'SAVE_Settings_C_SetLanguage::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetLanguage
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_GetLanguage final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetLanguage) == 0x000008, "Wrong alignment on SAVE_Settings_C_GetLanguage");
static_assert(sizeof(SAVE_Settings_C_GetLanguage) == 0x000010, "Wrong size on SAVE_Settings_C_GetLanguage");
static_assert(offsetof(SAVE_Settings_C_GetLanguage, Result) == 0x000000, "Member 'SAVE_Settings_C_GetLanguage::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyLanguage
// 0x0018 (0x0018 - 0x0000)
struct SAVE_Settings_C_ApplyLanguage final
{
public:
	class FString                                 NewValue;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_ApplyLanguage) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyLanguage");
static_assert(sizeof(SAVE_Settings_C_ApplyLanguage) == 0x000018, "Wrong size on SAVE_Settings_C_ApplyLanguage");
static_assert(offsetof(SAVE_Settings_C_ApplyLanguage, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyLanguage::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyLanguage, CallFunc_SetCurrentCulture_ReturnValue) == 0x000010, "Member 'SAVE_Settings_C_ApplyLanguage::CallFunc_SetCurrentCulture_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetUIVolume
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetUIVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetUIVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetUIVolume");
static_assert(sizeof(SAVE_Settings_C_SetUIVolume) == 0x000008, "Wrong size on SAVE_Settings_C_SetUIVolume");
static_assert(offsetof(SAVE_Settings_C_SetUIVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetUIVolume::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetUIVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetUIVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetUIVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetUIVolume final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetUIVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetUIVolume");
static_assert(sizeof(SAVE_Settings_C_GetUIVolume) == 0x000004, "Wrong size on SAVE_Settings_C_GetUIVolume");
static_assert(offsetof(SAVE_Settings_C_GetUIVolume, Result) == 0x000000, "Member 'SAVE_Settings_C_GetUIVolume::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyUIVolume
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyUIVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyUIVolume) == 0x000004, "Wrong alignment on SAVE_Settings_C_ApplyUIVolume");
static_assert(sizeof(SAVE_Settings_C_ApplyUIVolume) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyUIVolume");
static_assert(offsetof(SAVE_Settings_C_ApplyUIVolume, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyUIVolume::NewValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetDLSS
// 0x0002 (0x0002 - 0x0000)
struct SAVE_Settings_C_SetDLSS final
{
public:
	EUDLSSMode                                    NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetDLSS) == 0x000001, "Wrong alignment on SAVE_Settings_C_SetDLSS");
static_assert(sizeof(SAVE_Settings_C_SetDLSS) == 0x000002, "Wrong size on SAVE_Settings_C_SetDLSS");
static_assert(offsetof(SAVE_Settings_C_SetDLSS, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetDLSS::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetDLSS, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SAVE_Settings_C_SetDLSS::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetDLSS
// 0x0001 (0x0001 - 0x0000)
struct SAVE_Settings_C_GetDLSS final
{
public:
	EUDLSSMode                                    Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetDLSS) == 0x000001, "Wrong alignment on SAVE_Settings_C_GetDLSS");
static_assert(sizeof(SAVE_Settings_C_GetDLSS) == 0x000001, "Wrong size on SAVE_Settings_C_GetDLSS");
static_assert(offsetof(SAVE_Settings_C_GetDLSS, Result) == 0x000000, "Member 'SAVE_Settings_C_GetDLSS::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyDLSS
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_ApplyDLSS final
{
public:
	EUDLSSMode                                    NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDLSSModeSupported_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUDLSSMode                                    CallFunc_GetDLSSMode_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_ApplyDLSS) == 0x000001, "Wrong alignment on SAVE_Settings_C_ApplyDLSS");
static_assert(sizeof(SAVE_Settings_C_ApplyDLSS) == 0x000004, "Wrong size on SAVE_Settings_C_ApplyDLSS");
static_assert(offsetof(SAVE_Settings_C_ApplyDLSS, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyDLSS::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyDLSS, CallFunc_IsDLSSModeSupported_ReturnValue) == 0x000001, "Member 'SAVE_Settings_C_ApplyDLSS::CallFunc_IsDLSSModeSupported_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyDLSS, CallFunc_GetDLSSMode_ReturnValue) == 0x000002, "Member 'SAVE_Settings_C_ApplyDLSS::CallFunc_GetDLSSMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyDLSS, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'SAVE_Settings_C_ApplyDLSS::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetSubtitlesEnabled
// 0x0002 (0x0002 - 0x0000)
struct SAVE_Settings_C_SetSubtitlesEnabled final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetSubtitlesEnabled) == 0x000001, "Wrong alignment on SAVE_Settings_C_SetSubtitlesEnabled");
static_assert(sizeof(SAVE_Settings_C_SetSubtitlesEnabled) == 0x000002, "Wrong size on SAVE_Settings_C_SetSubtitlesEnabled");
static_assert(offsetof(SAVE_Settings_C_SetSubtitlesEnabled, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetSubtitlesEnabled::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetSubtitlesEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'SAVE_Settings_C_SetSubtitlesEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetSubtitlesEnabled
// 0x0001 (0x0001 - 0x0000)
struct SAVE_Settings_C_GetSubtitlesEnabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_GetSubtitlesEnabled) == 0x000001, "Wrong alignment on SAVE_Settings_C_GetSubtitlesEnabled");
static_assert(sizeof(SAVE_Settings_C_GetSubtitlesEnabled) == 0x000001, "Wrong size on SAVE_Settings_C_GetSubtitlesEnabled");
static_assert(offsetof(SAVE_Settings_C_GetSubtitlesEnabled, Result) == 0x000000, "Member 'SAVE_Settings_C_GetSubtitlesEnabled::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplySubtitlesEnabled
// 0x0020 (0x0020 - 0x0000)
struct SAVE_Settings_C_ApplySubtitlesEnabled final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Subtitles_C*                    CallFunc_GetSubtitleWidget_Result;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_ApplySubtitlesEnabled) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplySubtitlesEnabled");
static_assert(sizeof(SAVE_Settings_C_ApplySubtitlesEnabled) == 0x000020, "Wrong size on SAVE_Settings_C_ApplySubtitlesEnabled");
static_assert(offsetof(SAVE_Settings_C_ApplySubtitlesEnabled, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplySubtitlesEnabled::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplySubtitlesEnabled, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_ApplySubtitlesEnabled::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplySubtitlesEnabled, CallFunc_GetSubtitleWidget_Result) == 0x000010, "Member 'SAVE_Settings_C_ApplySubtitlesEnabled::CallFunc_GetSubtitleWidget_Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplySubtitlesEnabled, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SAVE_Settings_C_ApplySubtitlesEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetBrightness
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_SetBrightness final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRealspace;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBrightness_Result;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetBrightness) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetBrightness");
static_assert(sizeof(SAVE_Settings_C_SetBrightness) == 0x000010, "Wrong size on SAVE_Settings_C_SetBrightness");
static_assert(offsetof(SAVE_Settings_C_SetBrightness, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetBrightness::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetBrightness, IsRealspace) == 0x000004, "Member 'SAVE_Settings_C_SetBrightness::IsRealspace' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetBrightness, CallFunc_GetBrightness_Result) == 0x000008, "Member 'SAVE_Settings_C_SetBrightness::CallFunc_GetBrightness_Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetBrightness, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'SAVE_Settings_C_SetBrightness::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetBrightness
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_GetBrightness final
{
public:
	bool                                          IsRealspace;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetBrightness) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetBrightness");
static_assert(sizeof(SAVE_Settings_C_GetBrightness) == 0x000010, "Wrong size on SAVE_Settings_C_GetBrightness");
static_assert(offsetof(SAVE_Settings_C_GetBrightness, IsRealspace) == 0x000000, "Member 'SAVE_Settings_C_GetBrightness::IsRealspace' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetBrightness, Result) == 0x000004, "Member 'SAVE_Settings_C_GetBrightness::Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetBrightness, Temp_bool_Variable) == 0x000008, "Member 'SAVE_Settings_C_GetBrightness::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetBrightness, K2Node_Select_Default) == 0x00000C, "Member 'SAVE_Settings_C_GetBrightness::K2Node_Select_Default' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetGammaFromSpecificBrightness
// 0x0040 (0x0040 - 0x0000)
struct SAVE_Settings_C_GetGammaFromSpecificBrightness final
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Result;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GammaW;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetGammaFromSpecificBrightness) == 0x000010, "Wrong alignment on SAVE_Settings_C_GetGammaFromSpecificBrightness");
static_assert(sizeof(SAVE_Settings_C_GetGammaFromSpecificBrightness) == 0x000040, "Wrong size on SAVE_Settings_C_GetGammaFromSpecificBrightness");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, Camera) == 0x000000, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::Camera' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, Value) == 0x000008, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::Value' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, Result) == 0x000010, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, GammaW) == 0x000020, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::GammaW' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetGammaFromSpecificBrightness, CallFunc_MakeVector4_ReturnValue) == 0x000030, "Member 'SAVE_Settings_C_GetGammaFromSpecificBrightness::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetDefaultGammaFromCurrentBrightness
// 0x0020 (0x0020 - 0x0000)
struct SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness final
{
public:
	struct FVector4                               Result;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_GetGammaFromSpecificBrightness_Result;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness) == 0x000010, "Wrong alignment on SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness");
static_assert(sizeof(SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness) == 0x000020, "Wrong size on SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness");
static_assert(offsetof(SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness, Result) == 0x000000, "Member 'SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness::Result' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness, CallFunc_GetGammaFromSpecificBrightness_Result) == 0x000010, "Member 'SAVE_Settings_C_GetDefaultGammaFromCurrentBrightness::CallFunc_GetGammaFromSpecificBrightness_Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyBrightness
// 0x0020 (0x0020 - 0x0000)
struct SAVE_Settings_C_ApplyBrightness final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRealspace;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_ApplyBrightness) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyBrightness");
static_assert(sizeof(SAVE_Settings_C_ApplyBrightness) == 0x000020, "Wrong size on SAVE_Settings_C_ApplyBrightness");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyBrightness::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, IsRealspace) == 0x000004, "Member 'SAVE_Settings_C_ApplyBrightness::IsRealspace' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'SAVE_Settings_C_ApplyBrightness::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_ApplyBrightness::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000010, "Member 'SAVE_Settings_C_ApplyBrightness::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyBrightness, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SAVE_Settings_C_ApplyBrightness::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetWindowMode
// 0x0002 (0x0002 - 0x0000)
struct SAVE_Settings_C_SetWindowMode final
{
public:
	EWindowMode                                   NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetWindowMode) == 0x000001, "Wrong alignment on SAVE_Settings_C_SetWindowMode");
static_assert(sizeof(SAVE_Settings_C_SetWindowMode) == 0x000002, "Wrong size on SAVE_Settings_C_SetWindowMode");
static_assert(offsetof(SAVE_Settings_C_SetWindowMode, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetWindowMode::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetWindowMode, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'SAVE_Settings_C_SetWindowMode::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetWindowMode
// 0x0001 (0x0001 - 0x0000)
struct SAVE_Settings_C_GetWindowMode final
{
public:
	EWindowMode                                   Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetWindowMode) == 0x000001, "Wrong alignment on SAVE_Settings_C_GetWindowMode");
static_assert(sizeof(SAVE_Settings_C_GetWindowMode) == 0x000001, "Wrong size on SAVE_Settings_C_GetWindowMode");
static_assert(offsetof(SAVE_Settings_C_GetWindowMode, Result) == 0x000000, "Member 'SAVE_Settings_C_GetWindowMode::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyWindowMode
// 0x0018 (0x0018 - 0x0000)
struct SAVE_Settings_C_ApplyWindowMode final
{
public:
	EWindowMode                                   NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyWindowMode) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyWindowMode");
static_assert(sizeof(SAVE_Settings_C_ApplyWindowMode) == 0x000018, "Wrong size on SAVE_Settings_C_ApplyWindowMode");
static_assert(offsetof(SAVE_Settings_C_ApplyWindowMode, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyWindowMode::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyWindowMode, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_ApplyWindowMode::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyWindowMode, CallFunc_GetDesktopResolution_ReturnValue) == 0x000010, "Member 'SAVE_Settings_C_ApplyWindowMode::CallFunc_GetDesktopResolution_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetResolution
// 0x000C (0x000C - 0x0000)
struct SAVE_Settings_C_SetResolution final
{
public:
	struct FIntPoint                              NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntPointIntPoint_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetResolution) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetResolution");
static_assert(sizeof(SAVE_Settings_C_SetResolution) == 0x00000C, "Wrong size on SAVE_Settings_C_SetResolution");
static_assert(offsetof(SAVE_Settings_C_SetResolution, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetResolution::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetResolution, CallFunc_NotEqual_IntPointIntPoint_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_SetResolution::CallFunc_NotEqual_IntPointIntPoint_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetResolution
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_GetResolution final
{
public:
	struct FIntPoint                              Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetResolution) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetResolution");
static_assert(sizeof(SAVE_Settings_C_GetResolution) == 0x000008, "Wrong size on SAVE_Settings_C_GetResolution");
static_assert(offsetof(SAVE_Settings_C_GetResolution, Result) == 0x000000, "Member 'SAVE_Settings_C_GetResolution::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyResolution
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_ApplyResolution final
{
public:
	struct FIntPoint                              NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyResolution) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyResolution");
static_assert(sizeof(SAVE_Settings_C_ApplyResolution) == 0x000010, "Wrong size on SAVE_Settings_C_ApplyResolution");
static_assert(offsetof(SAVE_Settings_C_ApplyResolution, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyResolution::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyResolution, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_ApplyResolution::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetResolutionScale
// 0x0008 (0x0008 - 0x0000)
struct SAVE_Settings_C_SetResolutionScale final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetResolutionScale) == 0x000004, "Wrong alignment on SAVE_Settings_C_SetResolutionScale");
static_assert(sizeof(SAVE_Settings_C_SetResolutionScale) == 0x000008, "Wrong size on SAVE_Settings_C_SetResolutionScale");
static_assert(offsetof(SAVE_Settings_C_SetResolutionScale, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetResolutionScale::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetResolutionScale, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'SAVE_Settings_C_SetResolutionScale::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetResolutionScale
// 0x0004 (0x0004 - 0x0000)
struct SAVE_Settings_C_GetResolutionScale final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_GetResolutionScale) == 0x000004, "Wrong alignment on SAVE_Settings_C_GetResolutionScale");
static_assert(sizeof(SAVE_Settings_C_GetResolutionScale) == 0x000004, "Wrong size on SAVE_Settings_C_GetResolutionScale");
static_assert(offsetof(SAVE_Settings_C_GetResolutionScale, Result) == 0x000000, "Member 'SAVE_Settings_C_GetResolutionScale::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyResolutionScale
// 0x0010 (0x0010 - 0x0000)
struct SAVE_Settings_C_ApplyResolutionScale final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAVE_Settings_C_ApplyResolutionScale) == 0x000008, "Wrong alignment on SAVE_Settings_C_ApplyResolutionScale");
static_assert(sizeof(SAVE_Settings_C_ApplyResolutionScale) == 0x000010, "Wrong size on SAVE_Settings_C_ApplyResolutionScale");
static_assert(offsetof(SAVE_Settings_C_ApplyResolutionScale, NewValue) == 0x000000, "Member 'SAVE_Settings_C_ApplyResolutionScale::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_ApplyResolutionScale, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'SAVE_Settings_C_ApplyResolutionScale::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.SetEnableHDR
// 0x0002 (0x0002 - 0x0000)
struct SAVE_Settings_C_SetEnableHDR final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_SetEnableHDR) == 0x000001, "Wrong alignment on SAVE_Settings_C_SetEnableHDR");
static_assert(sizeof(SAVE_Settings_C_SetEnableHDR) == 0x000002, "Wrong size on SAVE_Settings_C_SetEnableHDR");
static_assert(offsetof(SAVE_Settings_C_SetEnableHDR, NewValue) == 0x000000, "Member 'SAVE_Settings_C_SetEnableHDR::NewValue' has a wrong offset!");
static_assert(offsetof(SAVE_Settings_C_SetEnableHDR, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'SAVE_Settings_C_SetEnableHDR::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.GetEnableHDR
// 0x0001 (0x0001 - 0x0000)
struct SAVE_Settings_C_GetEnableHDR final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAVE_Settings_C_GetEnableHDR) == 0x000001, "Wrong alignment on SAVE_Settings_C_GetEnableHDR");
static_assert(sizeof(SAVE_Settings_C_GetEnableHDR) == 0x000001, "Wrong size on SAVE_Settings_C_GetEnableHDR");
static_assert(offsetof(SAVE_Settings_C_GetEnableHDR, Result) == 0x000000, "Member 'SAVE_Settings_C_GetEnableHDR::Result' has a wrong offset!");

// Function SAVE_Settings.SAVE_Settings_C.ApplyEnableHDR
// 0x0018 (0x0018 - 0x0000)
struct SAVE_Settings_C_ApplyEnableHDR final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
