#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_BroadcastDetectedPawn

#include "Basic.hpp"

#include "ENUM_GameDifficulty_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_EnemyType_structs.hpp"


namespace SDK::Params
{

// Function SERV_BroadcastDetectedPawn.SERV_BroadcastDetectedPawn_C.ExecuteUbergraph_SERV_BroadcastDetectedPawn
// 0x0050 (0x0050 - 0x0000)
struct SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetNearestDetectionTarget_EnemyTarget;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn) == 0x000008, "Wrong alignment on SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn");
static_assert(sizeof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn) == 0x000050, "Wrong size on SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, EntryPoint) == 0x000000, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, K2Node_Event_OwnerController) == 0x000008, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, K2Node_Event_ControlledPawn) == 0x000010, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, CallFunc_GetNearestDetectionTarget_EnemyTarget) == 0x000030, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::CallFunc_GetNearestDetectionTarget_EnemyTarget' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, CallFunc_GetDetectedPawn_Pawn) == 0x000040, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'SERV_BroadcastDetectedPawn_C_ExecuteUbergraph_SERV_BroadcastDetectedPawn::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function SERV_BroadcastDetectedPawn.SERV_BroadcastDetectedPawn_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct SERV_BroadcastDetectedPawn_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_BroadcastDetectedPawn_C_ReceiveTickAI) == 0x000008, "Wrong alignment on SERV_BroadcastDetectedPawn_C_ReceiveTickAI");
static_assert(sizeof(SERV_BroadcastDetectedPawn_C_ReceiveTickAI) == 0x000018, "Wrong size on SERV_BroadcastDetectedPawn_C_ReceiveTickAI");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'SERV_BroadcastDetectedPawn_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'SERV_BroadcastDetectedPawn_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'SERV_BroadcastDetectedPawn_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function SERV_BroadcastDetectedPawn.SERV_BroadcastDetectedPawn_C.BroadcastToNearbyEnemies
// 0x0160 (0x0160 - 0x0000)
struct SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies final
{
public:
	class APAWN_Enemy_C*                          NearbyEnemyPawn;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaledSphereRadius;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CombatDifficulty;                                  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Combat;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Mission;              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Puzzle;               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Cyber;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_EnemyType                                CallFunc_GetEnemyType_Result;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyAware_Result;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRoomAudibilityBetweenPoints_OutObstruction; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRoomAudibilityBetweenPoints_OutOcclusion; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRoomAudibilityBetweenPoints_ReturnValue; // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_MakeBox_ReturnValue;                      // 0x00C4(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVoxelNavAgentComponent*>        CallFunc_GetNavigationAgentsInWorldBounds_ReturnValue; // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UVoxelNavAgentComponent*                CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_CyberEnemy_C*                     K2Node_DynamicCast_AsPAWN_Cyber_Enemy;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_GameDifficulty                           K2Node_Select_Default_3;                           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDetectionRatingForPawn_DetectionRating; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies) == 0x000008, "Wrong alignment on SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies");
static_assert(sizeof(SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies) == 0x000160, "Wrong size on SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies, NearbyEnemyPawn) == 0x000000, "Member 'SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies::NearbyEnemyPawn' has a wrong offset!");
static_assert(offsetof(SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies, ScaledSphereRadius) == 0x000008, "Member 'SERV_BroadcastDetectedPawn_C_BroadcastToNearbyEnemies::ScaledSphereRadius' has a wrong offset!");
