#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_Diego_v1_DisableEffects

#include "Basic.hpp"


namespace SDK::Params
{

// Function SERV_Diego_v1_DisableEffects.SERV_Diego_v1_DisableEffects_C.ExecuteUbergraph_SERV_Diego_v1_DisableEffects
// 0x0028 (0x0028 - 0x0000)
struct SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Diego_v1_C*                       K2Node_DynamicCast_AsPAWN_Diego_V_1;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects) == 0x000008, "Wrong alignment on SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects");
static_assert(sizeof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects) == 0x000028, "Wrong size on SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects, EntryPoint) == 0x000000, "Member 'SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects, K2Node_Event_OwnerController) == 0x000008, "Member 'SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects, K2Node_Event_ControlledPawn) == 0x000010, "Member 'SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects, K2Node_DynamicCast_AsPAWN_Diego_V_1) == 0x000018, "Member 'SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects::K2Node_DynamicCast_AsPAWN_Diego_V_1' has a wrong offset!");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SERV_Diego_v1_DisableEffects_C_ExecuteUbergraph_SERV_Diego_v1_DisableEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SERV_Diego_v1_DisableEffects.SERV_Diego_v1_DisableEffects_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI");
static_assert(sizeof(SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'SERV_Diego_v1_DisableEffects_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

}

