#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_ResetEnemyProperties

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_ActivationDeactivation_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SERV_ResetEnemyProperties.SERV_ResetEnemyProperties_C
// 0x0020 (0x00B8 - 0x0098)
class USERV_ResetEnemyProperties_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_ActivationDeactivation                   WhenToTrigger;                                     // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableSprintAnimation;                            // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisableCustomIdle;                                 // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisableAimTarget;                                  // 0x00A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisableHeadlook;                                   // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ClearDynamicIdleBehavior;                          // 0x00A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ExpireModCategories;                               // 0x00A8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_SERV_ResetEnemyProperties(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ResetProperties(class APAWN_Enemy_C* EnemyPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SERV_ResetEnemyProperties_C">();
	}
	static class USERV_ResetEnemyProperties_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USERV_ResetEnemyProperties_C>();
	}
};
static_assert(alignof(USERV_ResetEnemyProperties_C) == 0x000008, "Wrong alignment on USERV_ResetEnemyProperties_C");
static_assert(sizeof(USERV_ResetEnemyProperties_C) == 0x0000B8, "Wrong size on USERV_ResetEnemyProperties_C");
static_assert(offsetof(USERV_ResetEnemyProperties_C, UberGraphFrame) == 0x000098, "Member 'USERV_ResetEnemyProperties_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, WhenToTrigger) == 0x0000A0, "Member 'USERV_ResetEnemyProperties_C::WhenToTrigger' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, DisableSprintAnimation) == 0x0000A1, "Member 'USERV_ResetEnemyProperties_C::DisableSprintAnimation' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, DisableCustomIdle) == 0x0000A2, "Member 'USERV_ResetEnemyProperties_C::DisableCustomIdle' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, DisableAimTarget) == 0x0000A3, "Member 'USERV_ResetEnemyProperties_C::DisableAimTarget' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, DisableHeadlook) == 0x0000A4, "Member 'USERV_ResetEnemyProperties_C::DisableHeadlook' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, ClearDynamicIdleBehavior) == 0x0000A5, "Member 'USERV_ResetEnemyProperties_C::ClearDynamicIdleBehavior' has a wrong offset!");
static_assert(offsetof(USERV_ResetEnemyProperties_C, ExpireModCategories) == 0x0000A8, "Member 'USERV_ResetEnemyProperties_C::ExpireModCategories' has a wrong offset!");

}

