#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_Combat_StayNearSkillTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_MoveSpeed_structs.hpp"
#include "ENUM_StayNearSkillTargetState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"
#include "ENUM_SpeedType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SERV_Combat_StayNearSkillTarget.SERV_Combat_StayNearSkillTarget_C
// 0x0038 (0x00D0 - 0x0098)
class USERV_Combat_StayNearSkillTarget_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          OwnerPawn;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     MoveDirectionTarget;                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     ManeuverTarget;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelSpatialNavigationQuery*           NavQuery;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_StayNearSkillTargetState                 RegisteredState;                                   // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RegisteredManeuverLocation;                        // 0x00C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SERV_Combat_StayNearSkillTarget(int32 EntryPoint);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void GetOrCreateMoveDirectionTarget(class UOBJ_EnemyTarget_C** Target);
	void GetOrCreateManeuverTarget(class UOBJ_EnemyTarget_C** Target);
	void IsMoving(bool* Result);
	void GetSkillTargetAgentLocation(struct FVector* TargetLocation);
	void UpdateMovingCloser();
	void UpdateMovingAway();
	void UpdateStopping();
	void UpdateMoveSpeed();
	void InitializeMovement();
	void ShouldMove(bool* Result);
	void GetDistanceToSkillTarget(float* Distance);
	void GetDistanceToNavTarget(float* Distance);
	void GetDistanceFromNavToSkillTarget(float* Distance);
	void GetPawnTouchingDistance(float* Distance);
	void GetPerfectDistance(float* Distance);
	void GetWalkDistance(float* Distance);
	void GetJogDistance(float* Distance);
	void GetSprintDistance(float* Distance);
	void IsNavigatingDirectlyToSkillTarget(bool* Result);
	void UpdateBodyRotation();
	void GetPerfectDistanceBufferRange(float* BufferRange);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SERV_Combat_StayNearSkillTarget_C">();
	}
	static class USERV_Combat_StayNearSkillTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USERV_Combat_StayNearSkillTarget_C>();
	}
};
static_assert(alignof(USERV_Combat_StayNearSkillTarget_C) == 0x000008, "Wrong alignment on USERV_Combat_StayNearSkillTarget_C");
static_assert(sizeof(USERV_Combat_StayNearSkillTarget_C) == 0x0000D0, "Wrong size on USERV_Combat_StayNearSkillTarget_C");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, UberGraphFrame) == 0x000098, "Member 'USERV_Combat_StayNearSkillTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, OwnerPawn) == 0x0000A0, "Member 'USERV_Combat_StayNearSkillTarget_C::OwnerPawn' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, MoveDirectionTarget) == 0x0000A8, "Member 'USERV_Combat_StayNearSkillTarget_C::MoveDirectionTarget' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, ManeuverTarget) == 0x0000B0, "Member 'USERV_Combat_StayNearSkillTarget_C::ManeuverTarget' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, NavQuery) == 0x0000B8, "Member 'USERV_Combat_StayNearSkillTarget_C::NavQuery' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, RegisteredState) == 0x0000C0, "Member 'USERV_Combat_StayNearSkillTarget_C::RegisteredState' has a wrong offset!");
static_assert(offsetof(USERV_Combat_StayNearSkillTarget_C, RegisteredManeuverLocation) == 0x0000C4, "Member 'USERV_Combat_StayNearSkillTarget_C::RegisteredManeuverLocation' has a wrong offset!");

}

