#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_ResetEnemyProperties

#include "Basic.hpp"


namespace SDK::Params
{

// Function SERV_ResetEnemyProperties.SERV_ResetEnemyProperties_C.ExecuteUbergraph_SERV_ResetEnemyProperties
// 0x0050 (0x0050 - 0x0000)
struct SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy_1;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties) == 0x000008, "Wrong alignment on SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties");
static_assert(sizeof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties) == 0x000050, "Wrong size on SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, EntryPoint) == 0x000000, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::EntryPoint' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_Event_OwnerController_1) == 0x000008, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000020, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_Event_OwnerController) == 0x000030, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_Event_ControlledPawn) == 0x000038, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_DynamicCast_AsPAWN_Enemy_1) == 0x000040, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_DynamicCast_AsPAWN_Enemy_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000049, "Member 'SERV_ResetEnemyProperties_C_ExecuteUbergraph_SERV_ResetEnemyProperties::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function SERV_ResetEnemyProperties.SERV_ResetEnemyProperties_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct SERV_ResetEnemyProperties_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_ResetEnemyProperties_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on SERV_ResetEnemyProperties_C_ReceiveActivationAI");
static_assert(sizeof(SERV_ResetEnemyProperties_C_ReceiveActivationAI) == 0x000010, "Wrong size on SERV_ResetEnemyProperties_C_ReceiveActivationAI");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'SERV_ResetEnemyProperties_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'SERV_ResetEnemyProperties_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function SERV_ResetEnemyProperties.SERV_ResetEnemyProperties_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct SERV_ResetEnemyProperties_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_ResetEnemyProperties_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on SERV_ResetEnemyProperties_C_ReceiveDeactivationAI");
static_assert(sizeof(SERV_ResetEnemyProperties_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on SERV_ResetEnemyProperties_C_ReceiveDeactivationAI");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'SERV_ResetEnemyProperties_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'SERV_ResetEnemyProperties_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function SERV_ResetEnemyProperties.SERV_ResetEnemyProperties_C.ResetProperties
// 0x00B0 (0x00B0 - 0x0000)
struct SERV_ResetEnemyProperties_C_ResetProperties final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character_1;      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLookAtAlpha_Result;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAimTarget_Result;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character_2;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIdleOverrideSequence_Result;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character_3;      // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSprintEnabled_Result;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_ResetEnemyProperties_C_ResetProperties) == 0x000008, "Wrong alignment on SERV_ResetEnemyProperties_C_ResetProperties");
static_assert(sizeof(SERV_ResetEnemyProperties_C_ResetProperties) == 0x0000B0, "Wrong size on SERV_ResetEnemyProperties_C_ResetProperties");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, EnemyPawn) == 0x000000, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::EnemyPawn' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000020, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000028, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_AsINTERF_ANIM_Character_1) == 0x000040, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_AsINTERF_ANIM_Character_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_SetLookAtAlpha_Result) == 0x000051, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_SetLookAtAlpha_Result' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_SetAimTarget_Result) == 0x000052, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_SetAimTarget_Result' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000058, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_AsINTERF_ANIM_Character_2) == 0x000060, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_AsINTERF_ANIM_Character_2' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_SetIdleOverrideSequence_Result) == 0x000071, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_SetIdleOverrideSequence_Result' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_GetAnimInstance_ReturnValue_3) == 0x000078, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_AsINTERF_ANIM_Character_3) == 0x000080, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_AsINTERF_ANIM_Character_3' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_Array_Get_Item) == 0x000094, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_SetSprintEnabled_Result) == 0x00009C, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_SetSprintEnabled_Result' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_ResetEnemyProperties_C_ResetProperties, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x0000A8, "Member 'SERV_ResetEnemyProperties_C_ResetProperties::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");

}

