#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SERV_Combat_EvaluatePosition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_SpeedType_structs.hpp"
#include "ENUM_PreferredCombatStyle_structs.hpp"
#include "ENUM_MoveSpeed_structs.hpp"


namespace SDK::Params
{

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.ExecuteUbergraph_SERV_Combat_EvaluatePosition
// 0x00C8 (0x00C8 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToSkillTarget_Distance;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_2;         // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition) == 0x000008, "Wrong alignment on SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition) == 0x0000C8, "Wrong size on SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, EntryPoint) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::EntryPoint' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_Event_OwnerController) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_Event_ControlledPawn) == 0x000010, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000028, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_GetDistanceToSkillTarget_Distance) == 0x000048, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_GetDistanceToSkillTarget_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Conv_FloatToString_ReturnValue) == 0x000050, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_Event_OwnerController_1) == 0x000070, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_Event_ControlledPawn_1) == 0x000078, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, K2Node_Event_DeltaSeconds) == 0x000080, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000084, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000088, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000098, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Conv_FloatToString_ReturnValue_2) == 0x0000A8, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Conv_FloatToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'SERV_Combat_EvaluatePosition_C_ExecuteUbergraph_SERV_Combat_EvaluatePosition::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on SERV_Combat_EvaluatePosition_C_ReceiveActivationAI");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_ReceiveActivationAI) == 0x000010, "Wrong size on SERV_Combat_EvaluatePosition_C_ReceiveActivationAI");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_ReceiveTickAI) == 0x000008, "Wrong alignment on SERV_Combat_EvaluatePosition_C_ReceiveTickAI");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_ReceiveTickAI) == 0x000018, "Wrong size on SERV_Combat_EvaluatePosition_C_ReceiveTickAI");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'SERV_Combat_EvaluatePosition_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.IsMoving
// 0x000C (0x000C - 0x0000)
struct SERV_Combat_EvaluatePosition_C_IsMoving final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_MoveSpeed                                CallFunc_GetTargetMoveSpeed_MoveSpeed;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SpeedType                                CallFunc_GetTargetMoveSpeed_ChangeRate;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_IsMoving) == 0x000004, "Wrong alignment on SERV_Combat_EvaluatePosition_C_IsMoving");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_IsMoving) == 0x00000C, "Wrong size on SERV_Combat_EvaluatePosition_C_IsMoving");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, Result) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::Result' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_GetTargetMoveSpeed_MoveSpeed) == 0x000001, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_GetTargetMoveSpeed_MoveSpeed' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_GetTargetMoveSpeed_ChangeRate) == 0x000002, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_GetTargetMoveSpeed_ChangeRate' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent) == 0x000004, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_GetUnscaledMoveSpeedCurrent_MoveSpeedCurrent' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_IsMoving, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'SERV_Combat_EvaluatePosition_C_IsMoving::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.GetFrameDesireForNewNavTarget
// 0x0098 (0x0098 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDesire;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToSkillTarget_Distance;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistance_Distance;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceFromNavToSkillTarget_Distance; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToSkillTarget_Distance_1;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistance_Distance_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSkillTargetAgentLocation_TargetLocation; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetShockAgentLocation_Location;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavTargetLocation_Location;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSkillTargetAgentLocation_TargetLocation_1; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue_1;     // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistance_Distance_2;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget) == 0x000004, "Wrong alignment on SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget) == 0x000098, "Wrong size on SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, DeltaSeconds) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, FrameDesire) == 0x000004, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::FrameDesire' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetDistanceToSkillTarget_Distance) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetDistanceToSkillTarget_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetPerfectDistance_Distance) == 0x00000C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetPerfectDistance_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetDistanceFromNavToSkillTarget_Distance) == 0x000010, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetDistanceFromNavToSkillTarget_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetDistanceToSkillTarget_Distance_1) == 0x000018, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetDistanceToSkillTarget_Distance_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetPerfectDistanceBufferRange_BufferRange) == 0x00001C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetPerfectDistanceBufferRange_BufferRange' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Ease_ReturnValue) == 0x000024, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetPerfectDistance_Distance_1) == 0x000028, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetPerfectDistance_Distance_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetSkillTargetAgentLocation_TargetLocation) == 0x000034, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetSkillTargetAgentLocation_TargetLocation' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetShockAgentLocation_Location) == 0x000040, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetShockAgentLocation_Location' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetNavTargetLocation_Location) == 0x00004C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetNavTargetLocation_Location' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetSkillTargetAgentLocation_TargetLocation_1) == 0x000058, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetSkillTargetAgentLocation_TargetLocation_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x000064, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetDirectionUnitVector_ReturnValue_1) == 0x000070, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetDirectionUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_GetPerfectDistance_Distance_2) == 0x00007C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_GetPerfectDistance_Distance_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Dot_VectorVector_ReturnValue) == 0x000080, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Less_FloatFloat_ReturnValue) == 0x000084, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_MapRangeClamped_ReturnValue) == 0x000088, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Ease_ReturnValue_1) == 0x00008C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000090, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000094, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireForNewNavTarget::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.GetFrameDesireToMoveCloser
// 0x0024 (0x0024 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDesire;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceToSkillTarget_Distance;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistance_Distance;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser) == 0x000004, "Wrong alignment on SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser) == 0x000024, "Wrong size on SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, DeltaSeconds) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, FrameDesire) == 0x000004, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::FrameDesire' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_GetDistanceToSkillTarget_Distance) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_GetDistanceToSkillTarget_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_GetPerfectDistance_Distance) == 0x00000C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_GetPerfectDistance_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_GetPerfectDistanceBufferRange_BufferRange) == 0x000010, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_GetPerfectDistanceBufferRange_BufferRange' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_Ease_ReturnValue) == 0x00001C, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'SERV_Combat_EvaluatePosition_C_GetFrameDesireToMoveCloser::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.GetSkillTargetAgentLocation
// 0x0048 (0x0048 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     SkillTarget;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetCharacter_Character;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetShockAgentLocation_Location;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetCharacter_Character_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation) == 0x000008, "Wrong alignment on SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation) == 0x000048, "Wrong size on SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, TargetLocation) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, SkillTarget) == 0x000010, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::SkillTarget' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_GetTargetCharacter_Character) == 0x000018, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_GetTargetCharacter_Character' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_GetShockAgentLocation_Location) == 0x000024, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_GetShockAgentLocation_Location' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_GetTargetCharacter_Character_1) == 0x000030, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_GetTargetCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_GetTarget_Target) == 0x000038, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'SERV_Combat_EvaluatePosition_C_GetSkillTargetAgentLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.UpdateState
// 0x0090 (0x0090 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_UpdateState final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PerfectDistanceDifference;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDirectionToSkillTarget_Direction;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionToManeuverTarget_Direction;   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMoving_Result;                          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange_2; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelSpatialNavigationQuery*           CallFunc_MakeGroundManeuverEQSQuery_Query;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange_3; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistance_Distance;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceToSkillTarget_Distance;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDistanceToManeuverLocation_Distance;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange_4; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFrameDesireToMoveAway_FrameDesire;     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFrameDesireToMoveCloser_FrameDesire;   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SERV_Combat_EvaluatePosition_C_UpdateState) == 0x000008, "Wrong alignment on SERV_Combat_EvaluatePosition_C_UpdateState");
static_assert(sizeof(SERV_Combat_EvaluatePosition_C_UpdateState) == 0x000090, "Wrong size on SERV_Combat_EvaluatePosition_C_UpdateState");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, DeltaSeconds) == 0x000000, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, PerfectDistanceDifference) == 0x000004, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::PerfectDistanceDifference' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetDirectionToSkillTarget_Direction) == 0x00000C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetDirectionToSkillTarget_Direction' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetDirectionToManeuverTarget_Direction) == 0x000018, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetDirectionToManeuverTarget_Direction' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistanceBufferRange_BufferRange) == 0x000024, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistanceBufferRange_BufferRange' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Dot_VectorVector_ReturnValue) == 0x000028, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000030, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistanceBufferRange_BufferRange_1) == 0x00003C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistanceBufferRange_BufferRange_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_IsMoving_Result) == 0x000041, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_IsMoving_Result' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistanceBufferRange_BufferRange_2) == 0x000044, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistanceBufferRange_BufferRange_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_MakeGroundManeuverEQSQuery_Query) == 0x000048, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_MakeGroundManeuverEQSQuery_Query' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000050, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistanceBufferRange_BufferRange_3) == 0x000054, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistanceBufferRange_BufferRange_3' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistance_Distance) == 0x000058, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistance_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetDistanceToSkillTarget_Distance) == 0x000060, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetDistanceToSkillTarget_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000064, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Not_PreBool_ReturnValue_1) == 0x000069, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00006A, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x00006B, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetDistanceToManeuverLocation_Distance) == 0x00006C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetDistanceToManeuverLocation_Distance' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000070, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000071, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Abs_ReturnValue) == 0x000074, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetPerfectDistanceBufferRange_BufferRange_4) == 0x000078, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetPerfectDistanceBufferRange_BufferRange_4' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x00007C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetFrameDesireToMoveAway_FrameDesire) == 0x000080, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetFrameDesireToMoveAway_FrameDesire' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_GetFrameDesireToMoveCloser_FrameDesire) == 0x000088, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_GetFrameDesireToMoveCloser_FrameDesire' has a wrong offset!");
static_assert(offsetof(SERV_Combat_EvaluatePosition_C_UpdateState, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'SERV_Combat_EvaluatePosition_C_UpdateState::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function SERV_Combat_EvaluatePosition.SERV_Combat_EvaluatePosition_C.UpdateTargetLocation
// 0x0070 (0x0070 - 0x0000)
struct SERV_Combat_EvaluatePosition_C_UpdateTargetLocation final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldStop;                                        // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionToSkillTarget_Direction;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionToManeuverTarget_Direction;   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceFromManeuverLocToSkillLoc_Distance; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPerfectDistanceBufferRange_BufferRange; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPerfectDistance_Distance;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelSpatialNavigationQuery*           CallFunc_MakeGroundManeuverEQSQuery_Query;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
