#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShotgunDragonProjectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"


namespace SDK::Params
{

// Function ShotgunDragonProjectile.ShotgunDragonProjectile_C.GetImpactEffectParameters
// 0x0178 (0x0178 - 0x0000)
struct ShotgunDragonProjectile_C_GetImpactEffectParameters final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          IsDeathBlow;                                       // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EffectParams                   EffectParams;                                      // 0x0090(0x0030)(Parm, OutParm, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamedFloat>                    FloatParameters;                                   // 0x00C8(0x0010)(Edit, BlueprintVisible)
	struct FSTRUCT_EffectParams                   CallFunc_GetImpactEffectParameters_EffectParams;   // 0x00D8(0x0030)(HasGetValueTypeHash)
	float                                         CallFunc_GetIncendiaryEffectIntensity_Intensity;   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedFloat                            K2Node_MakeStruct_NamedFloat;                      // 0x010C(0x000C)(NoDestructor)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedFloat                            K2Node_MakeStruct_NamedFloat_1;                    // 0x011C(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EffectParams                   K2Node_SetFieldsInStruct_StructOut;                // 0x0130(0x0030)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetIncendiaryEffectDuration_Duration;     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedFloat                            K2Node_MakeStruct_NamedFloat_2;                    // 0x0168(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShotgunDragonProjectile_C_GetImpactEffectParameters) == 0x000008, "Wrong alignment on ShotgunDragonProjectile_C_GetImpactEffectParameters");
static_assert(sizeof(ShotgunDragonProjectile_C_GetImpactEffectParameters) == 0x000178, "Wrong size on ShotgunDragonProjectile_C_GetImpactEffectParameters");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, Hit) == 0x000000, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::Hit' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, IsDeathBlow) == 0x000088, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::IsDeathBlow' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, EffectParams) == 0x000090, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::EffectParams' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, Intensity) == 0x0000C0, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::Intensity' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, FloatParameters) == 0x0000C8, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::FloatParameters' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_GetImpactEffectParameters_EffectParams) == 0x0000D8, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_GetImpactEffectParameters_EffectParams' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_GetIncendiaryEffectIntensity_Intensity) == 0x000108, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_GetIncendiaryEffectIntensity_Intensity' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, K2Node_MakeStruct_NamedFloat) == 0x00010C, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::K2Node_MakeStruct_NamedFloat' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_Ease_ReturnValue) == 0x000118, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, K2Node_MakeStruct_NamedFloat_1) == 0x00011C, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::K2Node_MakeStruct_NamedFloat_1' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, K2Node_SetFieldsInStruct_StructOut) == 0x000130, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_Array_Add_ReturnValue_1) == 0x000160, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_GetIncendiaryEffectDuration_Duration) == 0x000164, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_GetIncendiaryEffectDuration_Duration' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, K2Node_MakeStruct_NamedFloat_2) == 0x000168, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::K2Node_MakeStruct_NamedFloat_2' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetImpactEffectParameters, CallFunc_Array_Add_ReturnValue_2) == 0x000174, "Member 'ShotgunDragonProjectile_C_GetImpactEffectParameters::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function ShotgunDragonProjectile.ShotgunDragonProjectile_C.GetIncendiaryEffectDuration
// 0x0028 (0x0028 - 0x0000)
struct ShotgunDragonProjectile_C_GetIncendiaryEffectDuration final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TickCount;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TickRateCurve;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValueSumOverTimeInterval_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration) == 0x000008, "Wrong alignment on ShotgunDragonProjectile_C_GetIncendiaryEffectDuration");
static_assert(sizeof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration) == 0x000028, "Wrong size on ShotgunDragonProjectile_C_GetIncendiaryEffectDuration");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, Duration) == 0x000000, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::Duration' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, TickCount) == 0x000004, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::TickCount' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, TickRateCurve) == 0x000008, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::TickRateCurve' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, CallFunc_GetCurveValueSumOverTimeInterval_ReturnValue) == 0x000010, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::CallFunc_GetCurveValueSumOverTimeInterval_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00001C, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectDuration, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectDuration::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function ShotgunDragonProjectile.ShotgunDragonProjectile_C.GetIncendiaryEffectIntensity
// 0x0260 (0x0260 - 0x0000)
struct ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Intensity;                                         // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ArmorPercentage;                                   // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OrganicResist;                                     // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              HitSurfaceType;                                    // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           HitCharacter;                                      // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      HitPhysMat;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue_1;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetArmorAugmentationPercentage_ArmorAugmentPercent; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity) == 0x000008, "Wrong alignment on ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity");
static_assert(sizeof(ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity) == 0x000260, "Wrong size on ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity, Hit) == 0x000000, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity::Hit' has a wrong offset!");
static_assert(offsetof(ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity, Intensity) == 0x000088, "Member 'ShotgunDragonProjectile_C_GetIncendiaryEffectIntensity::Intensity' has a wrong offset!");
