#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShotgunFlechetteProjectile

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShotgunFlechetteProjectile.ShotgunFlechetteProjectile_C.GetBulletDamageDropoffRate
// 0x000C (0x000C - 0x0000)
struct ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBulletDamageDropoffRate_Result;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate) == 0x000004, "Wrong alignment on ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate");
static_assert(sizeof(ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate) == 0x00000C, "Wrong size on ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate");
static_assert(offsetof(ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate, Result) == 0x000000, "Member 'ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate::Result' has a wrong offset!");
static_assert(offsetof(ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate, CallFunc_GetBulletDamageDropoffRate_Result) == 0x000004, "Member 'ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate::CallFunc_GetBulletDamageDropoffRate_Result' has a wrong offset!");
static_assert(offsetof(ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'ShotgunFlechetteProjectile_C_GetBulletDamageDropoffRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function ShotgunFlechetteProjectile.ShotgunFlechetteProjectile_C.SetDamageDropoffScale
// 0x0004 (0x0004 - 0x0000)
struct ShotgunFlechetteProjectile_C_SetDamageDropoffScale final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShotgunFlechetteProjectile_C_SetDamageDropoffScale) == 0x000004, "Wrong alignment on ShotgunFlechetteProjectile_C_SetDamageDropoffScale");
static_assert(sizeof(ShotgunFlechetteProjectile_C_SetDamageDropoffScale) == 0x000004, "Wrong size on ShotgunFlechetteProjectile_C_SetDamageDropoffScale");
static_assert(offsetof(ShotgunFlechetteProjectile_C_SetDamageDropoffScale, Scale) == 0x000000, "Member 'ShotgunFlechetteProjectile_C_SetDamageDropoffScale::Scale' has a wrong offset!");

}

