#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_CyborgAssassin_QuickShot

#include "Basic.hpp"


namespace SDK::Params
{

// Function SKILL_CyborgAssassin_QuickShot.SKILL_CyborgAssassin_QuickShot_C.OnActivateSkill
// 0x0020 (0x0020 - 0x0000)
struct SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActivateSkill_Result;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill) == 0x000008, "Wrong alignment on SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill");
static_assert(sizeof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill) == 0x000020, "Wrong size on SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill");
static_assert(offsetof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill, Result) == 0x000000, "Member 'SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill, CallFunc_GetSkillPawn_SkillPawn) == 0x000008, "Member 'SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill, CallFunc_OnActivateSkill_Result) == 0x000010, "Member 'SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill::CallFunc_OnActivateSkill_Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill, CallFunc_ApplyMod_ReturnValue) == 0x000018, "Member 'SKILL_CyborgAssassin_QuickShot_C_OnActivateSkill::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");

}

