#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_CyborgWarrior_ActivateShield

#include "Basic.hpp"

#include "STRUCT_EnemyStats_structs.hpp"


namespace SDK::Params
{

// Function SKILL_CyborgWarrior_ActivateShield.SKILL_CyborgWarrior_ActivateShield_C.OnActivateSkill
// 0x0078 (0x0078 - 0x0000)
struct SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActivateSkill_Result;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EnemyStats                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill) == 0x000008, "Wrong alignment on SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill");
static_assert(sizeof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill) == 0x000078, "Wrong size on SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, Result) == 0x000000, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_GetSkillPawn_SkillPawn) == 0x000008, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_GetSkillPawn_SkillPawn_1) == 0x000010, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_GetSkillPawn_SkillPawn_1' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_ApplyMod_ReturnValue) == 0x000018, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_OnActivateSkill_Result) == 0x000020, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_OnActivateSkill_Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000074, "Member 'SKILL_CyborgWarrior_ActivateShield_C_OnActivateSkill::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

