#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_Diego_v1_Recharge

#include "Basic.hpp"

#include "AttributeSystem_structs.hpp"
#include "Skill_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SKILL_Diego_v1_Recharge.SKILL_Diego_v1_Recharge_C
// 0x0460 (0x04F0 - 0x0090)
class USKILL_Diego_v1_Recharge_C final : public USkill_C
{
public:
	struct FAttribModApplyData                    PlasmaApplyData;                                   // 0x0090(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    InstantEnergyBoostApplyData;                       // 0x0130(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    RechargeShieldEfficiencyApplyData;                 // 0x01D0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    RechargeShieldApplyData;                           // 0x0270(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    PersistentShieldApplyData;                         // 0x0310(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    HealthRegenApplyData;                              // 0x03B0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAttribModApplyData                    EnergyRegenApplyData;                              // 0x0450(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnActivateSkill(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SKILL_Diego_v1_Recharge_C">();
	}
	static class USKILL_Diego_v1_Recharge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USKILL_Diego_v1_Recharge_C>();
	}
};
static_assert(alignof(USKILL_Diego_v1_Recharge_C) == 0x000008, "Wrong alignment on USKILL_Diego_v1_Recharge_C");
static_assert(sizeof(USKILL_Diego_v1_Recharge_C) == 0x0004F0, "Wrong size on USKILL_Diego_v1_Recharge_C");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, PlasmaApplyData) == 0x000090, "Member 'USKILL_Diego_v1_Recharge_C::PlasmaApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, InstantEnergyBoostApplyData) == 0x000130, "Member 'USKILL_Diego_v1_Recharge_C::InstantEnergyBoostApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, RechargeShieldEfficiencyApplyData) == 0x0001D0, "Member 'USKILL_Diego_v1_Recharge_C::RechargeShieldEfficiencyApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, RechargeShieldApplyData) == 0x000270, "Member 'USKILL_Diego_v1_Recharge_C::RechargeShieldApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, PersistentShieldApplyData) == 0x000310, "Member 'USKILL_Diego_v1_Recharge_C::PersistentShieldApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, HealthRegenApplyData) == 0x0003B0, "Member 'USKILL_Diego_v1_Recharge_C::HealthRegenApplyData' has a wrong offset!");
static_assert(offsetof(USKILL_Diego_v1_Recharge_C, EnergyRegenApplyData) == 0x000450, "Member 'USKILL_Diego_v1_Recharge_C::EnergyRegenApplyData' has a wrong offset!");

}

