#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_RepairBot_FlameAttackLeft

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SKILL_RepairBot_FlameAttackLeft.SKILL_RepairBot_FlameAttackLeft_C.ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft
// 0x0060 (0x0060 - 0x0000)
struct SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft) == 0x000008, "Wrong alignment on SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft");
static_assert(sizeof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft) == 0x000060, "Wrong size on SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, EntryPoint) == 0x000000, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::EntryPoint' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, CallFunc_GetSkillPawn_SkillPawn) == 0x000008, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, K2Node_CustomEvent_Loaded) == 0x000010, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, Temp_object_Variable) == 0x000018, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, K2Node_DynamicCast_AsNiagara_System) == 0x000020, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, CallFunc_Array_Get_Item) == 0x00002C, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000058, "Member 'SKILL_RepairBot_FlameAttackLeft_C_ExecuteUbergraph_SKILL_RepairBot_FlameAttackLeft::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function SKILL_RepairBot_FlameAttackLeft.SKILL_RepairBot_FlameAttackLeft_C.OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C
// 0x0008 (0x0008 - 0x0000)
struct SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C) == 0x000008, "Wrong alignment on SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C");
static_assert(sizeof(SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C) == 0x000008, "Wrong size on SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C, Loaded) == 0x000000, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnLoaded_9F3B9FB9471F5B9DC88EE38F0B4D9D2C::Loaded' has a wrong offset!");

// Function SKILL_RepairBot_FlameAttackLeft.SKILL_RepairBot_FlameAttackLeft_C.OnActivateSkill
// 0x0030 (0x0030 - 0x0000)
struct SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateAngleOffset_AngleOffset;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScaledEnemyDamage_DamageValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill) == 0x000008, "Wrong alignment on SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill");
static_assert(sizeof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill) == 0x000030, "Wrong size on SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, Result) == 0x000000, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_CalculateAngleOffset_AngleOffset) == 0x000004, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_CalculateAngleOffset_AngleOffset' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_GetSkillPawn_SkillPawn) == 0x000010, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_GetScaledEnemyDamage_DamageValue) == 0x000018, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_GetScaledEnemyDamage_DamageValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000024, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000028, "Member 'SKILL_RepairBot_FlameAttackLeft_C_OnActivateSkill::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function SKILL_RepairBot_FlameAttackLeft.SKILL_RepairBot_FlameAttackLeft_C.EVENT_FireShot
// 0x00E0 (0x00E0 - 0x0000)
struct SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot final
{
public:
	struct FVector                                SpawnDirection;                                    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation;                                     // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BarreltSocketName;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABulletProjectile_Base_C*               CallFunc_SpawnBulletWithWeightedRandomDamage_Result; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetBarrelTransform_Transform;             // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot) == 0x000010, "Wrong alignment on SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot");
static_assert(sizeof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot) == 0x0000E0, "Wrong size on SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, SpawnDirection) == 0x000000, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::SpawnDirection' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, SpawnLocation) == 0x00000C, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::SpawnLocation' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, BarreltSocketName) == 0x000018, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::BarreltSocketName' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, Damage) == 0x000020, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::Damage' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, Temp_int_Variable) == 0x000024, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_SpawnBulletWithWeightedRandomDamage_Result) == 0x000030, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_SpawnBulletWithWeightedRandomDamage_Result' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_GetBarrelTransform_Transform) == 0x000060, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_GetBarrelTransform_Transform' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_BreakTransform_Location) == 0x000090, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_BreakTransform_Rotation) == 0x00009C, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_Array_Get_Item) == 0x0000B4, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_GetRightVector_ReturnValue) == 0x0000BC, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_GetForwardVector_ReturnValue) == 0x0000C8, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000D4, "Member 'SKILL_RepairBot_FlameAttackLeft_C_EVENT_FireShot::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");

// Function SKILL_RepairBot_FlameAttackLeft.SKILL_RepairBot_FlameAttackLeft_C.CalculateAngleOffset
// 0x00C8 (0x00C8 - 0x0000)
struct SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset final
{
public:
	float                                         AngleOffset;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelForwardDirection;                            // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionToTarget;                                 // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignedAngleBetweenOnPlane_ReturnValue;    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_1;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset) == 0x000008, "Wrong alignment on SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset");
static_assert(sizeof(SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset) == 0x0000C8, "Wrong size on SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset, AngleOffset) == 0x000000, "Member 'SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset::AngleOffset' has a wrong offset!");
static_assert(offsetof(SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset, BarrelForwardDirection) == 0x000004, "Member 'SKILL_RepairBot_FlameAttackLeft_C_CalculateAngleOffset::BarrelForwardDirection' has a wrong offset!");
