#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_Security2Bot_EnergyBlast

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "LevelVoxelization_structs.hpp"


namespace SDK::Params
{

// Function SKILL_Security2Bot_EnergyBlast.SKILL_Security2Bot_EnergyBlast_C.OnActivateSkill
// 0x0002 (0x0002 - 0x0000)
struct SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActivateSkill_Result;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill) == 0x000001, "Wrong alignment on SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill");
static_assert(sizeof(SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill) == 0x000002, "Wrong size on SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill, Result) == 0x000000, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill, CallFunc_OnActivateSkill_Result) == 0x000001, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnActivateSkill::CallFunc_OnActivateSkill_Result' has a wrong offset!");

// Function SKILL_Security2Bot_EnergyBlast.SKILL_Security2Bot_EnergyBlast_C.OnDeactivateSkill
// 0x0260 (0x0260 - 0x0000)
struct SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribModApplyData                    DamageMod;                                         // 0x0008(0x00A0)(Edit, BlueprintVisible)
	float                                         IntersectTime;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  HitHacker;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x00C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamEndLocation;                                   // 0x00CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamDirection;                                     // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x00E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamStartLocation;                                 // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue; // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVoxelNavAgentComponent*>        K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoxelNavAgentTraceResult>      CallFunc_GetNavigationAgentsUsingSphereTrace_ReturnValue; // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVoxelNavAgentTraceResult              CallFunc_Array_Get_Item;                           // 0x0190(0x0010)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_1;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScaledEnemyDamage_DamageValue;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_2;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_ImpactData_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_3;                 // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_4;                 // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_5;                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnDeactivateSkill_Result;                 // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill) == 0x000008, "Wrong alignment on SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill");
static_assert(sizeof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill) == 0x000260, "Wrong size on SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, Result) == 0x000000, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, DamageMod) == 0x000008, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::DamageMod' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, IntersectTime) == 0x0000A8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::IntersectTime' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, HitHacker) == 0x0000B0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::HitHacker' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, GameInstance) == 0x0000B8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::GameInstance' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, ImpactPoint) == 0x0000C0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::ImpactPoint' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, BeamEndLocation) == 0x0000CC, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::BeamEndLocation' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, BeamDirection) == 0x0000D8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::BeamDirection' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, TargetLocation) == 0x0000E4, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::TargetLocation' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, BeamStartLocation) == 0x0000F0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::BeamStartLocation' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, Temp_int_Array_Index_Variable) == 0x0000FC, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000100, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue) == 0x00010C, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_HasUnobstructedPropagationPathBetweenPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_MakeArray_Array) == 0x000110, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000120, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetGameInstance_ReturnValue) == 0x000130, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000138, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_DynamicCast_AsGI_Single_Player) == 0x000148, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Add_VectorVector_ReturnValue) == 0x000154, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn) == 0x000160, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_MakeArray_Array_1) == 0x000168, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, Temp_int_Loop_Counter_Variable) == 0x000178, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetNavigationAgentsUsingSphereTrace_ReturnValue) == 0x000180, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetNavigationAgentsUsingSphereTrace_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Array_Get_Item) == 0x000190, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetOwner_ReturnValue) == 0x0001A8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Add_IntInt_ReturnValue) == 0x0001B0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x0001B8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn_1) == 0x0001C8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetScaledEnemyDamage_DamageValue) == 0x0001D0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetScaledEnemyDamage_DamageValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001D4, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn_2) == 0x0001D8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn_2' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_SpawnObject_ReturnValue) == 0x0001E0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn_3) == 0x0001E8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn_3' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_ApplyMod_ReturnValue) == 0x0001F0, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0001F8, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000204, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000210, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Normal_ReturnValue) == 0x00021C, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn_4) == 0x000228, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn_4' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSkillPawn_SkillPawn_5) == 0x000230, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSkillPawn_SkillPawn_5' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetSocketLocation_ReturnValue) == 0x000238, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_GetTarget_Target) == 0x000248, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_Get_Target_Location_Location) == 0x000250, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_Get_Target_Location_Location' has a wrong offset!");
static_assert(offsetof(SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill, CallFunc_OnDeactivateSkill_Result) == 0x00025C, "Member 'SKILL_Security2Bot_EnergyBlast_C_OnDeactivateSkill::CallFunc_OnDeactivateSkill_Result' has a wrong offset!");

}

