#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_CyberBully_LaunchHoming

#include "Basic.hpp"


namespace SDK::Params
{

// Function SKILL_CyberBully_LaunchHoming.SKILL_CyberBully_LaunchHoming_C.OnActivateSkill
// 0x0020 (0x0020 - 0x0000)
struct SKILL_CyberBully_LaunchHoming_C_OnActivateSkill final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_CyberBully_C*                     K2Node_DynamicCast_AsPAWN_Cyber_Bully;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill) == 0x000008, "Wrong alignment on SKILL_CyberBully_LaunchHoming_C_OnActivateSkill");
static_assert(sizeof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill) == 0x000020, "Wrong size on SKILL_CyberBully_LaunchHoming_C_OnActivateSkill");
static_assert(offsetof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill, Result) == 0x000000, "Member 'SKILL_CyberBully_LaunchHoming_C_OnActivateSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill, CallFunc_GetSkillPawn_SkillPawn) == 0x000008, "Member 'SKILL_CyberBully_LaunchHoming_C_OnActivateSkill::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill, K2Node_DynamicCast_AsPAWN_Cyber_Bully) == 0x000010, "Member 'SKILL_CyberBully_LaunchHoming_C_OnActivateSkill::K2Node_DynamicCast_AsPAWN_Cyber_Bully' has a wrong offset!");
static_assert(offsetof(SKILL_CyberBully_LaunchHoming_C_OnActivateSkill, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SKILL_CyberBully_LaunchHoming_C_OnActivateSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

