#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_ShootHomingMissile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.LaunchProjectile
// 0x0003 (0x0003 - 0x0000)
struct SKILL_ShootHomingMissile_C_LaunchProjectile final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_LaunchProjectile) == 0x000001, "Wrong alignment on SKILL_ShootHomingMissile_C_LaunchProjectile");
static_assert(sizeof(SKILL_ShootHomingMissile_C_LaunchProjectile) == 0x000003, "Wrong size on SKILL_ShootHomingMissile_C_LaunchProjectile");
static_assert(offsetof(SKILL_ShootHomingMissile_C_LaunchProjectile, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_LaunchProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_LaunchProjectile, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'SKILL_ShootHomingMissile_C_LaunchProjectile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_LaunchProjectile, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'SKILL_ShootHomingMissile_C_LaunchProjectile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.OnProjectileLaunched
// 0x0028 (0x0028 - 0x0000)
struct SKILL_ShootHomingMissile_C_OnProjectileLaunched final
{
public:
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APROJECTILE_HomingMissile_C*            K2Node_DynamicCast_AsPROJECTILE_Homing_Missile;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_OnProjectileLaunched) == 0x000008, "Wrong alignment on SKILL_ShootHomingMissile_C_OnProjectileLaunched");
static_assert(sizeof(SKILL_ShootHomingMissile_C_OnProjectileLaunched) == 0x000028, "Wrong size on SKILL_ShootHomingMissile_C_OnProjectileLaunched");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnProjectileLaunched, CallFunc_GetSkillPawn_SkillPawn) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_OnProjectileLaunched::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnProjectileLaunched, CallFunc_GetTarget_Target) == 0x000008, "Member 'SKILL_ShootHomingMissile_C_OnProjectileLaunched::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnProjectileLaunched, K2Node_DynamicCast_AsPROJECTILE_Homing_Missile) == 0x000010, "Member 'SKILL_ShootHomingMissile_C_OnProjectileLaunched::K2Node_DynamicCast_AsPROJECTILE_Homing_Missile' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnProjectileLaunched, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SKILL_ShootHomingMissile_C_OnProjectileLaunched::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnProjectileLaunched, CallFunc_Get_Target_Location_Location) == 0x00001C, "Member 'SKILL_ShootHomingMissile_C_OnProjectileLaunched::CallFunc_Get_Target_Location_Location' has a wrong offset!");

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.OnAttachProjectileToBarrel
// 0x0008 (0x0008 - 0x0000)
struct SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel final
{
public:
	class FName                                   BarrelSocketName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel) == 0x000004, "Wrong alignment on SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel");
static_assert(sizeof(SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel) == 0x000008, "Wrong size on SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel, BarrelSocketName) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_OnAttachProjectileToBarrel::BarrelSocketName' has a wrong offset!");

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.GetBarrelTransform
// 0x01A0 (0x01A0 - 0x0000)
struct SKILL_ShootHomingMissile_C_GetBarrelTransform final
{
public:
	class FName                                   BarrelName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              PortOffset;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PortIndex;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BaseTransform;                                     // 0x0050(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetBarrelTransform_Transform;             // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPortOffsetFromIndex_Result;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_GetBarrelTransform) == 0x000010, "Wrong alignment on SKILL_ShootHomingMissile_C_GetBarrelTransform");
static_assert(sizeof(SKILL_ShootHomingMissile_C_GetBarrelTransform) == 0x0001A0, "Wrong size on SKILL_ShootHomingMissile_C_GetBarrelTransform");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, BarrelName) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::BarrelName' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, Transform) == 0x000010, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::Transform' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, PortOffset) == 0x000040, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::PortOffset' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, PortIndex) == 0x000048, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::PortIndex' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, BaseTransform) == 0x000050, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::BaseTransform' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_GetBarrelTransform_Transform) == 0x000080, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_GetBarrelTransform_Transform' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Rotation) == 0x0000BC, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakVector_X) == 0x0000D4, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakVector_Z) == 0x0000DC, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_GetPortOffsetFromIndex_Result) == 0x0000E0, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_GetPortOffsetFromIndex_Result' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakVector2D_X) == 0x0000E8, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakVector2D_Y) == 0x0000EC, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000F0, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Location_1) == 0x0000F8, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Rotation_1) == 0x000104, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_BreakTransform_Scale_1) == 0x000110, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_GetUpVector_ReturnValue) == 0x00011C, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Map_Find_Value) == 0x000128, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Map_Find_ReturnValue) == 0x00012C, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_GetRightVector_ReturnValue) == 0x00013C, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000148, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Add_VectorVector_ReturnValue) == 0x000154, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000160, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetBarrelTransform, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'SKILL_ShootHomingMissile_C_GetBarrelTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.OnCycleBarrel
// 0x0038 (0x0038 - 0x0000)
struct SKILL_ShootHomingMissile_C_OnCycleBarrel final
{
public:
	int32                                         CandidatePortIndex;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastPortIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BarrelSocketName;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLastBarrelSocketName_Result;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_OnCycleBarrel) == 0x000004, "Wrong alignment on SKILL_ShootHomingMissile_C_OnCycleBarrel");
static_assert(sizeof(SKILL_ShootHomingMissile_C_OnCycleBarrel) == 0x000038, "Wrong size on SKILL_ShootHomingMissile_C_OnCycleBarrel");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CandidatePortIndex) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CandidatePortIndex' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, LastPortIndex) == 0x000004, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::LastPortIndex' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, BarrelSocketName) == 0x000008, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::BarrelSocketName' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, Temp_int_Variable) == 0x000014, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00001C, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_GetLastBarrelSocketName_Result) == 0x000020, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_GetLastBarrelSocketName_Result' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_Map_Find_Value) == 0x000030, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_OnCycleBarrel, CallFunc_Map_Find_ReturnValue) == 0x000034, "Member 'SKILL_ShootHomingMissile_C_OnCycleBarrel::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function SKILL_ShootHomingMissile.SKILL_ShootHomingMissile_C.GetPortOffsetFromIndex
// 0x0020 (0x0020 - 0x0000)
struct SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex final
{
public:
	int32                                         PortIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Result;                                            // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sign;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Axis;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex) == 0x000004, "Wrong alignment on SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex");
static_assert(sizeof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex) == 0x000020, "Wrong size on SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, PortIndex) == 0x000000, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::PortIndex' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, Result) == 0x000004, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::Result' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, Sign) == 0x00000C, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::Sign' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, Value) == 0x000010, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::Value' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, Axis) == 0x000014, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::Axis' has a wrong offset!");
static_assert(offsetof(SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex, CallFunc_Array_Get_Item) == 0x000018, "Member 'SKILL_ShootHomingMissile_C_GetPortOffsetFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");

}

