#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_HitScan

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SKILL_HitScan.SKILL_HitScan_C.TryUseSkill
// 0x0010 (0x0010 - 0x0000)
struct SKILL_HitScan_C_TryUseSkill final
{
public:
	class UCharacterAction_C*                     Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     CallFunc_TryUseSkill_Result;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_HitScan_C_TryUseSkill) == 0x000008, "Wrong alignment on SKILL_HitScan_C_TryUseSkill");
static_assert(sizeof(SKILL_HitScan_C_TryUseSkill) == 0x000010, "Wrong size on SKILL_HitScan_C_TryUseSkill");
static_assert(offsetof(SKILL_HitScan_C_TryUseSkill, Result) == 0x000000, "Member 'SKILL_HitScan_C_TryUseSkill::Result' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_TryUseSkill, CallFunc_TryUseSkill_Result) == 0x000008, "Member 'SKILL_HitScan_C_TryUseSkill::CallFunc_TryUseSkill_Result' has a wrong offset!");

// Function SKILL_HitScan.SKILL_HitScan_C.PerformDamageLineTrace
// 0x09B8 (0x09B8 - 0x0000)
struct SKILL_HitScan_C_PerformDamageLineTrace final
{
public:
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    DamageMod;                                         // 0x0028(0x00A0)(Edit, BlueprintVisible)
	float                                         Accuracy;                                          // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpreadAngle;                                    // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDamage;                                     // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class APAWN_SystemShockCharacter_C*>     CollidedShieldCharacters;                          // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UAttribManagerComponent*                AttribManager;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ImpactData;                                        // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0140(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactPoint;                                       // 0x01C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RayTargetLocation;                                 // 0x01D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RayDirection;                                      // 0x01E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x01EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SkillTargetLocation;                               // 0x01F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNamedInteger                          K2Node_MakeStruct_NamedInteger;                    // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ReferenceParm)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0238(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_1;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShootFromSocket_Result;                // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_2;                 // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance;       // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetReflectionVector_ReturnValue;          // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance_1;     // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_3;                 // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x03E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character_1; // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0483(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x04F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_4;            // 0x0505(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_4;         // 0x0506(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_507[0x1];                                      // 0x0507(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_4;                    // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_4;                // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_4;                // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_4;             // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_4;                  // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_4;            // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_4;                 // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_4;                // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_4;            // 0x0550(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_4;             // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_4;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_4;            // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_4;               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_4;              // 0x056C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_4;                // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_4;                 // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetScaledEnemyDamage_DamageValue;         // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x05A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAccuracyAdjustedRandomTargetDirection_AdjustedTargetDirection; // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBarrelLocation_StartLocation;          // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBestAimTargetLocation_BestTargetLocation; // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_5;                 // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_GetSkillPawn_SkillPawn_6;                 // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x05F0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_DamageCharacterShieldsAlongRay_BlockingHit; // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_DamageCharacterShieldsAlongRay_HitResult; // 0x0604(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_5;            // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_5;         // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68E[0x2];                                      // 0x068E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_5;                    // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_5;                // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_5;                // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_5;             // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_5;                  // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_5;            // 0x06BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_5;                 // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_5;                // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_5;            // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_5;             // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_5;                 // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_5;            // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_5;               // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_5;              // 0x06F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_5;                // 0x0700(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_6;            // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_6;         // 0x070D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70E[0x2];                                      // 0x070E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_6;                    // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_6;                // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_6;                // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_6;             // 0x0724(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_6;                  // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_6;            // 0x073C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_6;                 // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_6;                // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_6;            // 0x0758(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_6;             // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_6;                 // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_6;            // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_6;               // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_6;              // 0x0774(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_6;                // 0x0780(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x078C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_7;            // 0x0815(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_7;         // 0x0816(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_817[0x1];                                      // 0x0817(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_7;                    // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_7;                // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_7;                // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_7;             // 0x082C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_7;                  // 0x0838(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_7;            // 0x0844(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_7;                 // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_7;                // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_7;            // 0x0860(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_7;             // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_7;                 // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_7;            // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_7;               // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_7;              // 0x087C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_7;                // 0x0888(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateImpactEffects_Success;              // 0x0894(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_895[0x3];                                      // 0x0895(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_ImpactEffectResults            CallFunc_CreateImpactEffects_Results;              // 0x0898(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x08B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x08BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x08C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0x4];                                      // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_ImpactData_C*                      CallFunc_SpawnObject_ReturnValue;                  // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x08E0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit_1;               // 0x08F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue_1;          // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribManagerComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0980(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  CallFunc_ApplyDamageMod_OutDamageInstance;         // 0x0988(0x0028)()
	class UAttribMod*                             CallFunc_ApplyDamageMod_ReturnValue;               // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_HitScan_C_PerformDamageLineTrace) == 0x000008, "Wrong alignment on SKILL_HitScan_C_PerformDamageLineTrace");
static_assert(sizeof(SKILL_HitScan_C_PerformDamageLineTrace) == 0x0009B8, "Wrong size on SKILL_HitScan_C_PerformDamageLineTrace");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, DamageInstance) == 0x000000, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::DamageInstance' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, DamageMod) == 0x000028, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::DamageMod' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, Accuracy) == 0x0000C8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::Accuracy' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, MaxSpreadAngle) == 0x0000CC, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::MaxSpreadAngle' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CurrentDamage) == 0x0000D0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CurrentDamage' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CollidedShieldCharacters) == 0x0000D8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CollidedShieldCharacters' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, AttribManager) == 0x000128, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::AttribManager' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, ImpactData) == 0x000130, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::ImpactData' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, HitActor) == 0x000138, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::HitActor' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, Hit) == 0x000140, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::Hit' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, ImpactPoint) == 0x0001C8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::ImpactPoint' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, RayTargetLocation) == 0x0001D4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::RayTargetLocation' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, RayDirection) == 0x0001E0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::RayDirection' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, BarrelLocation) == 0x0001EC, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::BarrelLocation' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, SkillTargetLocation) == 0x0001F8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::SkillTargetLocation' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_IsValid_ReturnValue) == 0x000204, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_IsValid_ReturnValue_1) == 0x000205, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_MakeStruct_NamedInteger) == 0x000208, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_MakeStruct_NamedInteger' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetSkillPawn_SkillPawn) == 0x000218, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetSkillPawn_SkillPawn' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_MakeArray_Array) == 0x000220, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetTarget_Target) == 0x000230, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_MakeStruct_STRUCT_EffectParams) == 0x000238, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_MakeStruct_STRUCT_EffectParams' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bBlockingHit) == 0x000268, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bInitialOverlap) == 0x000269, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Time) == 0x00026C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Distance) == 0x000270, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Location) == 0x000274, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ImpactPoint) == 0x000280, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Normal) == 0x00028C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ImpactNormal) == 0x000298, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_PhysMat) == 0x0002A8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitActor) == 0x0002B0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitComponent) == 0x0002B8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitBoneName) == 0x0002C0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitItem) == 0x0002C8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ElementIndex) == 0x0002CC, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_FaceIndex) == 0x0002D0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_TraceStart) == 0x0002D4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_TraceEnd) == 0x0002E0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x0002F0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetSkillPawn_SkillPawn_1) == 0x000300, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetSkillPawn_SkillPawn_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_CanShootFromSocket_Result) == 0x000308, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_CanShootFromSocket_Result' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetSkillPawn_SkillPawn_2) == 0x000310, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetSkillPawn_SkillPawn_2' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000318, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_Ease_ReturnValue) == 0x00031C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetAttribValue_ReturnValue) == 0x000320, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000324, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetMaxCombatTraceDistance_Distance) == 0x000328, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetMaxCombatTraceDistance_Distance' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00032C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_Add_VectorVector_ReturnValue) == 0x000338, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000344, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000345, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Time_1) == 0x000348, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Distance_1) == 0x00034C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Location_1) == 0x000350, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ImpactPoint_1) == 0x00035C, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Normal_1) == 0x000368, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000374, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_PhysMat_1) == 0x000380, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitActor_1) == 0x000388, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitComponent_1) == 0x000390, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitBoneName_1) == 0x000398, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_HitItem_1) == 0x0003A0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_ElementIndex_1) == 0x0003A4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_FaceIndex_1) == 0x0003A8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_TraceStart_1) == 0x0003AC, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003B8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetReflectionVector_ReturnValue) == 0x0003C4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetReflectionVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, Temp_bool_Variable) == 0x0003D0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetMaxCombatTraceDistance_Distance_1) == 0x0003D4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetMaxCombatTraceDistance_Distance_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_GetSkillPawn_SkillPawn_3) == 0x0003D8, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_GetSkillPawn_SkillPawn_3' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, K2Node_MakeArray_Array_1) == 0x0003E0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0003F0, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0003F1, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(SKILL_HitScan_C_PerformDamageLineTrace, CallFunc_BreakHitResult_Time_2) == 0x0003F4, "Member 'SKILL_HitScan_C_PerformDamageLineTrace::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
