#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKILL_CyborgWarrior_EnergyProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SKILL_CyborgWarrior_EnergyProjectile.SKILL_CyborgWarrior_EnergyProjectile_C.GetBulletSpawnParameters
// 0x0044 (0x0044 - 0x0000)
struct SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters final
{
public:
	int32                                         BarrelIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBulletSpawnParameters_SocketName;      // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBulletSpawnParameters_Location;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBulletSpawnParameters_Direction;       // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters) == 0x000004, "Wrong alignment on SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters");
static_assert(sizeof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters) == 0x000044, "Wrong size on SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, BarrelIndex) == 0x000000, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::BarrelIndex' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, SocketName) == 0x000004, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::SocketName' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, Location) == 0x00000C, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::Location' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, Direction) == 0x000018, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::Direction' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, CallFunc_GetBulletSpawnParameters_SocketName) == 0x000024, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::CallFunc_GetBulletSpawnParameters_SocketName' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, CallFunc_GetBulletSpawnParameters_Location) == 0x00002C, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::CallFunc_GetBulletSpawnParameters_Location' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters, CallFunc_GetBulletSpawnParameters_Direction) == 0x000038, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_GetBulletSpawnParameters::CallFunc_GetBulletSpawnParameters_Direction' has a wrong offset!");

// Function SKILL_CyborgWarrior_EnergyProjectile.SKILL_CyborgWarrior_EnergyProjectile_C.SpawnBullet
// 0x0040 (0x0040 - 0x0000)
struct SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABulletProjectile_Base_C*               Result;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABulletProjectile_Base_C*               CallFunc_SpawnBullet_Result;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_WrapIntUpperbound_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet) == 0x000008, "Wrong alignment on SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet");
static_assert(sizeof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet) == 0x000040, "Wrong size on SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, SocketName) == 0x000000, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::SocketName' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, Location) == 0x000008, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::Location' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, Direction) == 0x000014, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::Direction' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, Result) == 0x000020, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, CallFunc_SpawnBullet_Result) == 0x000028, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::CallFunc_SpawnBullet_Result' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet, CallFunc_WrapIntUpperbound_ReturnValue) == 0x000038, "Member 'SKILL_CyborgWarrior_EnergyProjectile_C_SpawnBullet::CallFunc_WrapIntUpperbound_ReturnValue' has a wrong offset!");

}

