#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmallBulletProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SmallBulletProjectile.SmallBulletProjectile_C.SetBulletTracerColor
// 0x0010 (0x0010 - 0x0000)
struct SmallBulletProjectile_C_SetBulletTracerColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SmallBulletProjectile_C_SetBulletTracerColor) == 0x000004, "Wrong alignment on SmallBulletProjectile_C_SetBulletTracerColor");
static_assert(sizeof(SmallBulletProjectile_C_SetBulletTracerColor) == 0x000010, "Wrong size on SmallBulletProjectile_C_SetBulletTracerColor");
static_assert(offsetof(SmallBulletProjectile_C_SetBulletTracerColor, Color) == 0x000000, "Member 'SmallBulletProjectile_C_SetBulletTracerColor::Color' has a wrong offset!");

// Function SmallBulletProjectile.SmallBulletProjectile_C.UpdateTracerColor
// 0x0001 (0x0001 - 0x0000)
struct SmallBulletProjectile_C_UpdateTracerColor final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallBulletProjectile_C_UpdateTracerColor) == 0x000001, "Wrong alignment on SmallBulletProjectile_C_UpdateTracerColor");
static_assert(sizeof(SmallBulletProjectile_C_UpdateTracerColor) == 0x000001, "Wrong size on SmallBulletProjectile_C_UpdateTracerColor");
static_assert(offsetof(SmallBulletProjectile_C_UpdateTracerColor, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SmallBulletProjectile_C_UpdateTracerColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SmallBulletProjectile.SmallBulletProjectile_C.SpawnTracerEffects
// 0x0008 (0x0008 - 0x0000)
struct SmallBulletProjectile_C_SpawnTracerEffects final
{
public:
	class UNiagaraSystem*                         TracerSystem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SmallBulletProjectile_C_SpawnTracerEffects) == 0x000008, "Wrong alignment on SmallBulletProjectile_C_SpawnTracerEffects");
static_assert(sizeof(SmallBulletProjectile_C_SpawnTracerEffects) == 0x000008, "Wrong size on SmallBulletProjectile_C_SpawnTracerEffects");
static_assert(offsetof(SmallBulletProjectile_C_SpawnTracerEffects, TracerSystem) == 0x000000, "Member 'SmallBulletProjectile_C_SpawnTracerEffects::TracerSystem' has a wrong offset!");

// Function SmallBulletProjectile.SmallBulletProjectile_C.SetDamageDropoffScale
// 0x0004 (0x0004 - 0x0000)
struct SmallBulletProjectile_C_SetDamageDropoffScale final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SmallBulletProjectile_C_SetDamageDropoffScale) == 0x000004, "Wrong alignment on SmallBulletProjectile_C_SetDamageDropoffScale");
static_assert(sizeof(SmallBulletProjectile_C_SetDamageDropoffScale) == 0x000004, "Wrong size on SmallBulletProjectile_C_SetDamageDropoffScale");
static_assert(offsetof(SmallBulletProjectile_C_SetDamageDropoffScale, Scale) == 0x000000, "Member 'SmallBulletProjectile_C_SetDamageDropoffScale::Scale' has a wrong offset!");

// Function SmallBulletProjectile.SmallBulletProjectile_C.GetBulletDamageDropoffRate
// 0x000C (0x000C - 0x0000)
struct SmallBulletProjectile_C_GetBulletDamageDropoffRate final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBulletDamageDropoffRate_Result;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SmallBulletProjectile_C_GetBulletDamageDropoffRate) == 0x000004, "Wrong alignment on SmallBulletProjectile_C_GetBulletDamageDropoffRate");
static_assert(sizeof(SmallBulletProjectile_C_GetBulletDamageDropoffRate) == 0x00000C, "Wrong size on SmallBulletProjectile_C_GetBulletDamageDropoffRate");
static_assert(offsetof(SmallBulletProjectile_C_GetBulletDamageDropoffRate, Result) == 0x000000, "Member 'SmallBulletProjectile_C_GetBulletDamageDropoffRate::Result' has a wrong offset!");
static_assert(offsetof(SmallBulletProjectile_C_GetBulletDamageDropoffRate, CallFunc_GetBulletDamageDropoffRate_Result) == 0x000004, "Member 'SmallBulletProjectile_C_GetBulletDamageDropoffRate::CallFunc_GetBulletDamageDropoffRate_Result' has a wrong offset!");
static_assert(offsetof(SmallBulletProjectile_C_GetBulletDamageDropoffRate, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'SmallBulletProjectile_C_GetBulletDamageDropoffRate::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

