#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamingSaveGameSystem

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct StreamingSaveGameSystem.StreamingSaveGameActorParams
// 0x0018 (0x0018 - 0x0000)
struct FStreamingSaveGameActorParams final
{
public:
	uint8                                         bSaveActorTransform : 1;                           // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSaveComponentTransforms : 1;                      // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSavePhysics : 1;                                  // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSavePoses : 1;                                    // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSaveMeshes : 1;                                   // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSaveCustomPrimitiveData : 1;                      // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSavePhysicalAnimationData : 1;                    // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSaveCharacterMovement : 1;                        // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSaveCharacterSize : 1;                            // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SaveComponentNames;                                // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStreamingSaveGameActorParams) == 0x000008, "Wrong alignment on FStreamingSaveGameActorParams");
static_assert(sizeof(FStreamingSaveGameActorParams) == 0x000018, "Wrong size on FStreamingSaveGameActorParams");
static_assert(offsetof(FStreamingSaveGameActorParams, SaveComponentNames) == 0x000008, "Member 'FStreamingSaveGameActorParams::SaveComponentNames' has a wrong offset!");

// ScriptStruct StreamingSaveGameSystem.StreamingSaveGameComponentParams
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FStreamingSaveGameComponentParams final
{
public:
	uint8                                         bSaveComponentTransform : 1;                       // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStreamingSaveGameComponentParams) == 0x000004, "Wrong alignment on FStreamingSaveGameComponentParams");
static_assert(sizeof(FStreamingSaveGameComponentParams) == 0x000004, "Wrong size on FStreamingSaveGameComponentParams");

}

