#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DynaDamageElement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_LimbStrength_structs.hpp"
#include "STRUCT_LimbSpawnEffect_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DynaDamageElement.STRUCT_DynaDamageElement
// 0x0068 (0x0068 - 0x0000)
struct FSTRUCT_DynaDamageElement final
{
public:
	class FName                                   RootBone_2_C5B969CF410EB1427A8B5E894D6067E1;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RootOffset_33_5FFA33EA44A5E38309E4AFB44BF14914;    // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_17_088132D244336054AECFDCBD2F0CE20F;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LimbStrength                             Health_20_007B2E7948D7B985AA04FE90CF5A6B93;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeathblowOnly_32_DDC2D8E84720ABD68CFEF4B9ED4CE2E8; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPseudoLimb_40_320429D5439EE9F710D2169ED6EE1FD0;  // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SourceShowIDs_44_F473586D46D1C35977CF30BADACAD84F; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 SourceHideIDs_45_AEE331A1465FEFEFCCBB28A7ADDFC35D; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 InitialHideIDs_49_81A6014E4A5A25BEFE77F282F645EF97; // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTRUCT_LimbSpawnEffect>        DestroyedEffects_37_53ED6E1042295A23C9535A90287F3145; // 0x0050(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	float                                         DamageBonusAfterActivation_43_3F58139A458C131691A201B581CBFA95; // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_DynaDamageElement) == 0x000008, "Wrong alignment on FSTRUCT_DynaDamageElement");
static_assert(sizeof(FSTRUCT_DynaDamageElement) == 0x000068, "Wrong size on FSTRUCT_DynaDamageElement");
static_assert(offsetof(FSTRUCT_DynaDamageElement, RootBone_2_C5B969CF410EB1427A8B5E894D6067E1) == 0x000000, "Member 'FSTRUCT_DynaDamageElement::RootBone_2_C5B969CF410EB1427A8B5E894D6067E1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, RootOffset_33_5FFA33EA44A5E38309E4AFB44BF14914) == 0x000008, "Member 'FSTRUCT_DynaDamageElement::RootOffset_33_5FFA33EA44A5E38309E4AFB44BF14914' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, Radius_17_088132D244336054AECFDCBD2F0CE20F) == 0x000014, "Member 'FSTRUCT_DynaDamageElement::Radius_17_088132D244336054AECFDCBD2F0CE20F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, Health_20_007B2E7948D7B985AA04FE90CF5A6B93) == 0x000018, "Member 'FSTRUCT_DynaDamageElement::Health_20_007B2E7948D7B985AA04FE90CF5A6B93' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, DeathblowOnly_32_DDC2D8E84720ABD68CFEF4B9ED4CE2E8) == 0x000019, "Member 'FSTRUCT_DynaDamageElement::DeathblowOnly_32_DDC2D8E84720ABD68CFEF4B9ED4CE2E8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, IsPseudoLimb_40_320429D5439EE9F710D2169ED6EE1FD0) == 0x00001A, "Member 'FSTRUCT_DynaDamageElement::IsPseudoLimb_40_320429D5439EE9F710D2169ED6EE1FD0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, SourceShowIDs_44_F473586D46D1C35977CF30BADACAD84F) == 0x000020, "Member 'FSTRUCT_DynaDamageElement::SourceShowIDs_44_F473586D46D1C35977CF30BADACAD84F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, SourceHideIDs_45_AEE331A1465FEFEFCCBB28A7ADDFC35D) == 0x000030, "Member 'FSTRUCT_DynaDamageElement::SourceHideIDs_45_AEE331A1465FEFEFCCBB28A7ADDFC35D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, InitialHideIDs_49_81A6014E4A5A25BEFE77F282F645EF97) == 0x000040, "Member 'FSTRUCT_DynaDamageElement::InitialHideIDs_49_81A6014E4A5A25BEFE77F282F645EF97' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, DestroyedEffects_37_53ED6E1042295A23C9535A90287F3145) == 0x000050, "Member 'FSTRUCT_DynaDamageElement::DestroyedEffects_37_53ED6E1042295A23C9535A90287F3145' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DynaDamageElement, DamageBonusAfterActivation_43_3F58139A458C131691A201B581CBFA95) == 0x000060, "Member 'FSTRUCT_DynaDamageElement::DamageBonusAfterActivation_43_3F58139A458C131691A201B581CBFA95' has a wrong offset!");

}

