#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_CurrentReinforcementSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_CurrentReinforcementSettings.STRUCT_CurrentReinforcementSettings
// 0x0010 (0x0010 - 0x0000)
struct FSTRUCT_CurrentReinforcementSettings final
{
public:
	int32                                         StartSpawningAtPopulation_9_436BD2D348B97DCDEC8189949CA5830A; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalReinforcements_10_E978B76F41A3D655354FD987F3733734; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReinforcementDelay_13_8664F4494DF5D72CA6DF38B5AF001EE0; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadcountPerWave_12_B62373F540465210B7861C94127CF1C2; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_CurrentReinforcementSettings) == 0x000004, "Wrong alignment on FSTRUCT_CurrentReinforcementSettings");
static_assert(sizeof(FSTRUCT_CurrentReinforcementSettings) == 0x000010, "Wrong size on FSTRUCT_CurrentReinforcementSettings");
static_assert(offsetof(FSTRUCT_CurrentReinforcementSettings, StartSpawningAtPopulation_9_436BD2D348B97DCDEC8189949CA5830A) == 0x000000, "Member 'FSTRUCT_CurrentReinforcementSettings::StartSpawningAtPopulation_9_436BD2D348B97DCDEC8189949CA5830A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CurrentReinforcementSettings, TotalReinforcements_10_E978B76F41A3D655354FD987F3733734) == 0x000004, "Member 'FSTRUCT_CurrentReinforcementSettings::TotalReinforcements_10_E978B76F41A3D655354FD987F3733734' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CurrentReinforcementSettings, ReinforcementDelay_13_8664F4494DF5D72CA6DF38B5AF001EE0) == 0x000008, "Member 'FSTRUCT_CurrentReinforcementSettings::ReinforcementDelay_13_8664F4494DF5D72CA6DF38B5AF001EE0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CurrentReinforcementSettings, HeadcountPerWave_12_B62373F540465210B7861C94127CF1C2) == 0x00000C, "Member 'FSTRUCT_CurrentReinforcementSettings::HeadcountPerWave_12_B62373F540465210B7861C94127CF1C2' has a wrong offset!");

}

