#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_TraceInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_TraceInfo.STRUCT_TraceInfo
// 0x0010 (0x0010 - 0x0000)
struct FSTRUCT_TraceInfo final
{
public:
	struct FIntPoint                              Trace_2_A71A073842E4E0B8E6133A8D7D79D965;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UVMaterialGroupIndex_6_2FA1DFA04878A39A1FDAAAB58B26A142; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForward_9_B23DDAEC4E94193C6C00A08C0422582E;      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_TraceInfo) == 0x000004, "Wrong alignment on FSTRUCT_TraceInfo");
static_assert(sizeof(FSTRUCT_TraceInfo) == 0x000010, "Wrong size on FSTRUCT_TraceInfo");
static_assert(offsetof(FSTRUCT_TraceInfo, Trace_2_A71A073842E4E0B8E6133A8D7D79D965) == 0x000000, "Member 'FSTRUCT_TraceInfo::Trace_2_A71A073842E4E0B8E6133A8D7D79D965' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TraceInfo, UVMaterialGroupIndex_6_2FA1DFA04878A39A1FDAAAB58B26A142) == 0x000008, "Member 'FSTRUCT_TraceInfo::UVMaterialGroupIndex_6_2FA1DFA04878A39A1FDAAAB58B26A142' has a wrong offset!");
static_assert(offsetof(FSTRUCT_TraceInfo, IsForward_9_B23DDAEC4E94193C6C00A08C0422582E) == 0x00000C, "Member 'FSTRUCT_TraceInfo::IsForward_9_B23DDAEC4E94193C6C00A08C0422582E' has a wrong offset!");

}

