#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_ImpactParams

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_DecalTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_ImpactParams.STRUCT_ImpactParams
// 0x0058 (0x0058 - 0x0000)
struct FSTRUCT_ImpactParams final
{
public:
	TArray<EPhysicalSurface>                      PhysicalSurfaces_12_4EB66F4240D4C0F0A3B739AF0AEE187F; // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class USoundCue>               SoundCue_67_E6E51C89432DE08793E3DC8F1753C655;      // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UNiagaraSystem*                         ParticleSystem_80_9C64BA914BCD6095DA2FC8ADDCD5B0DF; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ParticleRotation_22_572A8F5D4D94B984DECBE78B60EF9EB9; // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ImpactReflectRatio_48_0BF0F02742283C4CB70578B984B42FA5; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_DecalTypes                               DecalType_79_06CEDD044D202E3D04FC7CB61F3DC602;     // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_ImpactParams) == 0x000008, "Wrong alignment on FSTRUCT_ImpactParams");
static_assert(sizeof(FSTRUCT_ImpactParams) == 0x000058, "Wrong size on FSTRUCT_ImpactParams");
static_assert(offsetof(FSTRUCT_ImpactParams, PhysicalSurfaces_12_4EB66F4240D4C0F0A3B739AF0AEE187F) == 0x000000, "Member 'FSTRUCT_ImpactParams::PhysicalSurfaces_12_4EB66F4240D4C0F0A3B739AF0AEE187F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ImpactParams, SoundCue_67_E6E51C89432DE08793E3DC8F1753C655) == 0x000010, "Member 'FSTRUCT_ImpactParams::SoundCue_67_E6E51C89432DE08793E3DC8F1753C655' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ImpactParams, ParticleSystem_80_9C64BA914BCD6095DA2FC8ADDCD5B0DF) == 0x000038, "Member 'FSTRUCT_ImpactParams::ParticleSystem_80_9C64BA914BCD6095DA2FC8ADDCD5B0DF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ImpactParams, ParticleRotation_22_572A8F5D4D94B984DECBE78B60EF9EB9) == 0x000040, "Member 'FSTRUCT_ImpactParams::ParticleRotation_22_572A8F5D4D94B984DECBE78B60EF9EB9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ImpactParams, ImpactReflectRatio_48_0BF0F02742283C4CB70578B984B42FA5) == 0x00004C, "Member 'FSTRUCT_ImpactParams::ImpactReflectRatio_48_0BF0F02742283C4CB70578B984B42FA5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ImpactParams, DecalType_79_06CEDD044D202E3D04FC7CB61F3DC602) == 0x000050, "Member 'FSTRUCT_ImpactParams::DecalType_79_06CEDD044D202E3D04FC7CB61F3DC602' has a wrong offset!");

}

