#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_CharacterActionParams

#include "Basic.hpp"

#include "ENUM_ActionPriority_structs.hpp"
#include "CoreGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_CharacterActionParams.STRUCT_CharacterActionParams
// 0x0020 (0x0020 - 0x0000)
struct FSTRUCT_CharacterActionParams final
{
public:
	class UAnimMontage*                           Montage_2_19DD09094595EEEDE32C7DBC2E29F7A6;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ActionPriority                           Priority_5_EF8427E44A4E6B12F0BCB29D1C2A2705;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Timestamp_8_AA39D45441BBC45AA0CDAD8CF2569D32;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLatentEventHandle                     EventHandle_18_99B403AC407B481CC330748E4F281C72;   // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(FSTRUCT_CharacterActionParams) == 0x000008, "Wrong alignment on FSTRUCT_CharacterActionParams");
static_assert(sizeof(FSTRUCT_CharacterActionParams) == 0x000020, "Wrong size on FSTRUCT_CharacterActionParams");
static_assert(offsetof(FSTRUCT_CharacterActionParams, Montage_2_19DD09094595EEEDE32C7DBC2E29F7A6) == 0x000000, "Member 'FSTRUCT_CharacterActionParams::Montage_2_19DD09094595EEEDE32C7DBC2E29F7A6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterActionParams, Priority_5_EF8427E44A4E6B12F0BCB29D1C2A2705) == 0x000008, "Member 'FSTRUCT_CharacterActionParams::Priority_5_EF8427E44A4E6B12F0BCB29D1C2A2705' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterActionParams, Timestamp_8_AA39D45441BBC45AA0CDAD8CF2569D32) == 0x00000C, "Member 'FSTRUCT_CharacterActionParams::Timestamp_8_AA39D45441BBC45AA0CDAD8CF2569D32' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterActionParams, EventHandle_18_99B403AC407B481CC330748E4F281C72) == 0x000010, "Member 'FSTRUCT_CharacterActionParams::EventHandle_18_99B403AC407B481CC330748E4F281C72' has a wrong offset!");

}

