#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DefaultSkillComboParams

#include "Basic.hpp"

#include "ENUM_SkillType_structs.hpp"
#include "ENUM_PreferredCombatStyle_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DefaultSkillComboParams.STRUCT_DefaultSkillComboParams
// 0x0030 (0x0030 - 0x0000)
struct FSTRUCT_DefaultSkillComboParams final
{
public:
	class UBehaviorTree*                          BehaviorTree_5_492BACA44FA7F61CA2C3F6BF2A99743C;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SkillType                                Type_2_E09611AA49DAC0EA944DDF9F39D98476;           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_PreferredCombatStyle                     CombatStyle_39_8369F2FA4ABB884E9F203497C0C65639;   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cooldown_8_DBEF4ED94C63E18DA447F2B913F014EC;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomExtraCooldown_21_06EADB05460222A37452169C53FBE86B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Weight_47_B7363E9A47847E8F1DB4E493E6C48843;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range_Min_25_4562725C42AAB89B3017138CAD020757;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Range_Max_27_71E4B3014FB74CFEA25DE793A4C23A93;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CustomRequirement_56_CA3CC94F41DB0836621F6883D76DFCEE; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboGroup_44_5F2808E74B02018A9D3E0D8FB3737274;    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ComboGroupCooldown_46_1EB602194E05CB234052A1B7E76698F2; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_DefaultSkillComboParams) == 0x000008, "Wrong alignment on FSTRUCT_DefaultSkillComboParams");
static_assert(sizeof(FSTRUCT_DefaultSkillComboParams) == 0x000030, "Wrong size on FSTRUCT_DefaultSkillComboParams");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, BehaviorTree_5_492BACA44FA7F61CA2C3F6BF2A99743C) == 0x000000, "Member 'FSTRUCT_DefaultSkillComboParams::BehaviorTree_5_492BACA44FA7F61CA2C3F6BF2A99743C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, Type_2_E09611AA49DAC0EA944DDF9F39D98476) == 0x000008, "Member 'FSTRUCT_DefaultSkillComboParams::Type_2_E09611AA49DAC0EA944DDF9F39D98476' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, CombatStyle_39_8369F2FA4ABB884E9F203497C0C65639) == 0x000009, "Member 'FSTRUCT_DefaultSkillComboParams::CombatStyle_39_8369F2FA4ABB884E9F203497C0C65639' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, Cooldown_8_DBEF4ED94C63E18DA447F2B913F014EC) == 0x00000C, "Member 'FSTRUCT_DefaultSkillComboParams::Cooldown_8_DBEF4ED94C63E18DA447F2B913F014EC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, RandomExtraCooldown_21_06EADB05460222A37452169C53FBE86B) == 0x000010, "Member 'FSTRUCT_DefaultSkillComboParams::RandomExtraCooldown_21_06EADB05460222A37452169C53FBE86B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, Weight_47_B7363E9A47847E8F1DB4E493E6C48843) == 0x000014, "Member 'FSTRUCT_DefaultSkillComboParams::Weight_47_B7363E9A47847E8F1DB4E493E6C48843' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, Range_Min_25_4562725C42AAB89B3017138CAD020757) == 0x000018, "Member 'FSTRUCT_DefaultSkillComboParams::Range_Min_25_4562725C42AAB89B3017138CAD020757' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, Range_Max_27_71E4B3014FB74CFEA25DE793A4C23A93) == 0x00001C, "Member 'FSTRUCT_DefaultSkillComboParams::Range_Max_27_71E4B3014FB74CFEA25DE793A4C23A93' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, CustomRequirement_56_CA3CC94F41DB0836621F6883D76DFCEE) == 0x000020, "Member 'FSTRUCT_DefaultSkillComboParams::CustomRequirement_56_CA3CC94F41DB0836621F6883D76DFCEE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, ComboGroup_44_5F2808E74B02018A9D3E0D8FB3737274) == 0x000028, "Member 'FSTRUCT_DefaultSkillComboParams::ComboGroup_44_5F2808E74B02018A9D3E0D8FB3737274' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DefaultSkillComboParams, ComboGroupCooldown_46_1EB602194E05CB234052A1B7E76698F2) == 0x00002C, "Member 'FSTRUCT_DefaultSkillComboParams::ComboGroupCooldown_46_1EB602194E05CB234052A1B7E76698F2' has a wrong offset!");

}

