#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_EnemyStats

#include "Basic.hpp"

#include "ENUM_EnemyType_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_EnemyStats.STRUCT_EnemyStats
// 0x0048 (0x0048 - 0x0000)
struct FSTRUCT_EnemyStats final
{
public:
	class FText                                   EnemyName_58_80A38A0949664980964B9C80469E19A8;     // 0x0000(0x0018)(Edit, BlueprintVisible)
	ENUM_EnemyType                                EnemyType_22_DC21C6C3424EBAEA0756A0939E126916;     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Health_10_7F4C48144BA71483CE3F6DB2243B515B;        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Armor_11_8B44C35444DFE65B25E4D19FC95276E6;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Energy_49_AB60E1B644EF4F43BD989A805FCE0FB4;        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shield_52_D1A58288476802FA28EB92AA420B0FD8;        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Threat_61_2D14C09D4DDE1E626E54E9AE23956227;        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StrongRangedDamage_45_95EB6A264AE33B89358A73A5D111A0A0; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeakRangedDamage_46_C237D75541CA37C7726ABEAB21DF1598; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StrongMeleeDamage_42_D1BC26CC48A645098595F48C36B21B09; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeakMeleeDamage_41_CE5993AD44ECA0E3A7302BAF3AFF0323; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExplosiveDamage_44_D6AB35D8406BD1A7157A81A24C17282D; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_EnemyStats) == 0x000008, "Wrong alignment on FSTRUCT_EnemyStats");
static_assert(sizeof(FSTRUCT_EnemyStats) == 0x000048, "Wrong size on FSTRUCT_EnemyStats");
static_assert(offsetof(FSTRUCT_EnemyStats, EnemyName_58_80A38A0949664980964B9C80469E19A8) == 0x000000, "Member 'FSTRUCT_EnemyStats::EnemyName_58_80A38A0949664980964B9C80469E19A8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, EnemyType_22_DC21C6C3424EBAEA0756A0939E126916) == 0x000018, "Member 'FSTRUCT_EnemyStats::EnemyType_22_DC21C6C3424EBAEA0756A0939E126916' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, Health_10_7F4C48144BA71483CE3F6DB2243B515B) == 0x00001C, "Member 'FSTRUCT_EnemyStats::Health_10_7F4C48144BA71483CE3F6DB2243B515B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, Armor_11_8B44C35444DFE65B25E4D19FC95276E6) == 0x000020, "Member 'FSTRUCT_EnemyStats::Armor_11_8B44C35444DFE65B25E4D19FC95276E6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, Energy_49_AB60E1B644EF4F43BD989A805FCE0FB4) == 0x000024, "Member 'FSTRUCT_EnemyStats::Energy_49_AB60E1B644EF4F43BD989A805FCE0FB4' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, Shield_52_D1A58288476802FA28EB92AA420B0FD8) == 0x000028, "Member 'FSTRUCT_EnemyStats::Shield_52_D1A58288476802FA28EB92AA420B0FD8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, Threat_61_2D14C09D4DDE1E626E54E9AE23956227) == 0x00002C, "Member 'FSTRUCT_EnemyStats::Threat_61_2D14C09D4DDE1E626E54E9AE23956227' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, StrongRangedDamage_45_95EB6A264AE33B89358A73A5D111A0A0) == 0x000030, "Member 'FSTRUCT_EnemyStats::StrongRangedDamage_45_95EB6A264AE33B89358A73A5D111A0A0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, WeakRangedDamage_46_C237D75541CA37C7726ABEAB21DF1598) == 0x000034, "Member 'FSTRUCT_EnemyStats::WeakRangedDamage_46_C237D75541CA37C7726ABEAB21DF1598' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, StrongMeleeDamage_42_D1BC26CC48A645098595F48C36B21B09) == 0x000038, "Member 'FSTRUCT_EnemyStats::StrongMeleeDamage_42_D1BC26CC48A645098595F48C36B21B09' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, WeakMeleeDamage_41_CE5993AD44ECA0E3A7302BAF3AFF0323) == 0x00003C, "Member 'FSTRUCT_EnemyStats::WeakMeleeDamage_41_CE5993AD44ECA0E3A7302BAF3AFF0323' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyStats, ExplosiveDamage_44_D6AB35D8406BD1A7157A81A24C17282D) == 0x000040, "Member 'FSTRUCT_EnemyStats::ExplosiveDamage_44_D6AB35D8406BD1A7157A81A24C17282D' has a wrong offset!");

}

