#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_LevelAtmosphereSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_LevelAtmosphereSettings.STRUCT_LevelAtmosphereSettings
// 0x0024 (0x0024 - 0x0000)
struct FSTRUCT_LevelAtmosphereSettings final
{
public:
	struct FLinearColor                           SunColor_2_23B274F04C22548BB39F6FB3D6FC6C54;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AmbientColor_6_1E75BDDA4F960645A99FF1AD19444C21;   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SunIntensity_9_BA86CE7E4B20B2B891AD228EAF81D7A3;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_LevelAtmosphereSettings) == 0x000004, "Wrong alignment on FSTRUCT_LevelAtmosphereSettings");
static_assert(sizeof(FSTRUCT_LevelAtmosphereSettings) == 0x000024, "Wrong size on FSTRUCT_LevelAtmosphereSettings");
static_assert(offsetof(FSTRUCT_LevelAtmosphereSettings, SunColor_2_23B274F04C22548BB39F6FB3D6FC6C54) == 0x000000, "Member 'FSTRUCT_LevelAtmosphereSettings::SunColor_2_23B274F04C22548BB39F6FB3D6FC6C54' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LevelAtmosphereSettings, AmbientColor_6_1E75BDDA4F960645A99FF1AD19444C21) == 0x000010, "Member 'FSTRUCT_LevelAtmosphereSettings::AmbientColor_6_1E75BDDA4F960645A99FF1AD19444C21' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LevelAtmosphereSettings, SunIntensity_9_BA86CE7E4B20B2B891AD228EAF81D7A3) == 0x000020, "Member 'FSTRUCT_LevelAtmosphereSettings::SunIntensity_9_BA86CE7E4B20B2B891AD228EAF81D7A3' has a wrong offset!");

}

