#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_EnemyRespawnData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_EnemyRespawnData.STRUCT_EnemyRespawnData
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_EnemyRespawnData final
{
public:
	class FString                                 EnemyClassName_21_DA71E2E347DE09C9F489728E67FC5E2B; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, HasGetValueTypeHash)
	float                                         NextSpawnTimestamp_22_9A33495E46A74B3A9AF9EAACD0FF0C85; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnCount_9_E63C98BF45B15D93C75BA291AD1B7303;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_EnemyRespawnData) == 0x000008, "Wrong alignment on FSTRUCT_EnemyRespawnData");
static_assert(sizeof(FSTRUCT_EnemyRespawnData) == 0x000018, "Wrong size on FSTRUCT_EnemyRespawnData");
static_assert(offsetof(FSTRUCT_EnemyRespawnData, EnemyClassName_21_DA71E2E347DE09C9F489728E67FC5E2B) == 0x000000, "Member 'FSTRUCT_EnemyRespawnData::EnemyClassName_21_DA71E2E347DE09C9F489728E67FC5E2B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyRespawnData, NextSpawnTimestamp_22_9A33495E46A74B3A9AF9EAACD0FF0C85) == 0x000010, "Member 'FSTRUCT_EnemyRespawnData::NextSpawnTimestamp_22_9A33495E46A74B3A9AF9EAACD0FF0C85' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyRespawnData, SpawnCount_9_E63C98BF45B15D93C75BA291AD1B7303) == 0x000014, "Member 'FSTRUCT_EnemyRespawnData::SpawnCount_9_E63C98BF45B15D93C75BA291AD1B7303' has a wrong offset!");

}

