#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_SubtitleToDisplay

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_SubtitleToDisplay.STRUCT_SubtitleToDisplay
// 0x0028 (0x0028 - 0x0000)
struct FSTRUCT_SubtitleToDisplay final
{
public:
	class FString                                 SubtitleLine_2_53CA137447D761B4FE4C53B436F6D559;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         TimeToDisplay_5_47DE7D054A76151F3B007F9A72062666;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InterruptSpeaker_8_277845D74F93C19745D449A9ABE2AB16; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_SubtitleToDisplay) == 0x000008, "Wrong alignment on FSTRUCT_SubtitleToDisplay");
static_assert(sizeof(FSTRUCT_SubtitleToDisplay) == 0x000028, "Wrong size on FSTRUCT_SubtitleToDisplay");
static_assert(offsetof(FSTRUCT_SubtitleToDisplay, SubtitleLine_2_53CA137447D761B4FE4C53B436F6D559) == 0x000000, "Member 'FSTRUCT_SubtitleToDisplay::SubtitleLine_2_53CA137447D761B4FE4C53B436F6D559' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SubtitleToDisplay, TimeToDisplay_5_47DE7D054A76151F3B007F9A72062666) == 0x000010, "Member 'FSTRUCT_SubtitleToDisplay::TimeToDisplay_5_47DE7D054A76151F3B007F9A72062666' has a wrong offset!");
static_assert(offsetof(FSTRUCT_SubtitleToDisplay, InterruptSpeaker_8_277845D74F93C19745D449A9ABE2AB16) == 0x000018, "Member 'FSTRUCT_SubtitleToDisplay::InterruptSpeaker_8_277845D74F93C19745D449A9ABE2AB16' has a wrong offset!");

}

