#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MusicCue_Layer

#include "Basic.hpp"

#include "ENUM_IntensityThresholds_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MusicCue_Layer.STRUCT_MusicCue_Layer
// 0x0038 (0x0038 - 0x0000)
struct FSTRUCT_MusicCue_Layer final
{
public:
	class FName                                   LayerName_17_66FCEF4A474ECD06C6A28588437DF168;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreMinusdelayMeasures_10_D59ECC864E5E6DAC568B9B80542FC90E; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetriggerTimemeasures_7_8D5CB8494F18114D3BCEC5A26128009F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChanceToPlay_20_0F40EB394488DED038A0BEAF5C8347CA;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeMultiplier_24_6E56106A4A835D0AB84BE6BE0478684E; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_IntensityThresholds                      RequiredExploreIntensityThreshold_32_9923DD19406C7969677605AEA0480983; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RequiredCombatIntensityThreshold_37_F78B22D345DBB4433E973EA8C7596C6E; // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldApplyFadeIn_14_D9F131584EF4B6700AEE26A2EA58CA2D; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundWave*>                     Segments_3_614984A44EF87D6C72DD658F11CAA084;       // 0x0028(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FSTRUCT_MusicCue_Layer) == 0x000008, "Wrong alignment on FSTRUCT_MusicCue_Layer");
static_assert(sizeof(FSTRUCT_MusicCue_Layer) == 0x000038, "Wrong size on FSTRUCT_MusicCue_Layer");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, LayerName_17_66FCEF4A474ECD06C6A28588437DF168) == 0x000000, "Member 'FSTRUCT_MusicCue_Layer::LayerName_17_66FCEF4A474ECD06C6A28588437DF168' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, PreMinusdelayMeasures_10_D59ECC864E5E6DAC568B9B80542FC90E) == 0x000008, "Member 'FSTRUCT_MusicCue_Layer::PreMinusdelayMeasures_10_D59ECC864E5E6DAC568B9B80542FC90E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, RetriggerTimemeasures_7_8D5CB8494F18114D3BCEC5A26128009F) == 0x00000C, "Member 'FSTRUCT_MusicCue_Layer::RetriggerTimemeasures_7_8D5CB8494F18114D3BCEC5A26128009F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, ChanceToPlay_20_0F40EB394488DED038A0BEAF5C8347CA) == 0x000010, "Member 'FSTRUCT_MusicCue_Layer::ChanceToPlay_20_0F40EB394488DED038A0BEAF5C8347CA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, VolumeMultiplier_24_6E56106A4A835D0AB84BE6BE0478684E) == 0x000014, "Member 'FSTRUCT_MusicCue_Layer::VolumeMultiplier_24_6E56106A4A835D0AB84BE6BE0478684E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, RequiredExploreIntensityThreshold_32_9923DD19406C7969677605AEA0480983) == 0x000018, "Member 'FSTRUCT_MusicCue_Layer::RequiredExploreIntensityThreshold_32_9923DD19406C7969677605AEA0480983' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, RequiredCombatIntensityThreshold_37_F78B22D345DBB4433E973EA8C7596C6E) == 0x00001C, "Member 'FSTRUCT_MusicCue_Layer::RequiredCombatIntensityThreshold_37_F78B22D345DBB4433E973EA8C7596C6E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, bShouldApplyFadeIn_14_D9F131584EF4B6700AEE26A2EA58CA2D) == 0x000024, "Member 'FSTRUCT_MusicCue_Layer::bShouldApplyFadeIn_14_D9F131584EF4B6700AEE26A2EA58CA2D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MusicCue_Layer, Segments_3_614984A44EF87D6C72DD658F11CAA084) == 0x000028, "Member 'FSTRUCT_MusicCue_Layer::Segments_3_614984A44EF87D6C72DD658F11CAA084' has a wrong offset!");

}

