#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_AnimatedLimb

#include "Basic.hpp"

#include "ENUM_LimbType_structs.hpp"
#include "ENUM_Axis_structs.hpp"
#include "ENUM_LeftRightCenter_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_AnimatedLimb.STRUCT_AnimatedLimb
// 0x0024 (0x0024 - 0x0000)
struct FSTRUCT_AnimatedLimb final
{
public:
	class FName                                   RootBone_14_161634A04B31B72F09B4D5836B0D4654;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LimbType                                 LimbType_2_042A79724747372A4F6B729636FE7FD3;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LeftRightCenter                          Orientation_5_BEE875BF45183B74A4E8D0849BBA2F4A;    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DamageBonusPercent_15_7CBCEF754FBB0AFB049A5AB936F48892; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArmorBonusPercent_17_5EB643654E12D48521320999CEA29FCE; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Axis                                     BoneForwardAxis_36_211EE7874C70260BE2B6A98D72091C07; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SignedForwardAngle_47_294068AA4EF68388F7F0918D9D9241BC; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RearDamageBonusPercent_45_A612F08446B1B1081625AFBA0E28BC8D; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RearArmorBonusPercent_46_BE23A2CA4FC83416427A71BDC3AF7B06; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_AnimatedLimb) == 0x000004, "Wrong alignment on FSTRUCT_AnimatedLimb");
static_assert(sizeof(FSTRUCT_AnimatedLimb) == 0x000024, "Wrong size on FSTRUCT_AnimatedLimb");
static_assert(offsetof(FSTRUCT_AnimatedLimb, RootBone_14_161634A04B31B72F09B4D5836B0D4654) == 0x000000, "Member 'FSTRUCT_AnimatedLimb::RootBone_14_161634A04B31B72F09B4D5836B0D4654' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, LimbType_2_042A79724747372A4F6B729636FE7FD3) == 0x000008, "Member 'FSTRUCT_AnimatedLimb::LimbType_2_042A79724747372A4F6B729636FE7FD3' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, Orientation_5_BEE875BF45183B74A4E8D0849BBA2F4A) == 0x000009, "Member 'FSTRUCT_AnimatedLimb::Orientation_5_BEE875BF45183B74A4E8D0849BBA2F4A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, DamageBonusPercent_15_7CBCEF754FBB0AFB049A5AB936F48892) == 0x00000C, "Member 'FSTRUCT_AnimatedLimb::DamageBonusPercent_15_7CBCEF754FBB0AFB049A5AB936F48892' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, ArmorBonusPercent_17_5EB643654E12D48521320999CEA29FCE) == 0x000010, "Member 'FSTRUCT_AnimatedLimb::ArmorBonusPercent_17_5EB643654E12D48521320999CEA29FCE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, BoneForwardAxis_36_211EE7874C70260BE2B6A98D72091C07) == 0x000014, "Member 'FSTRUCT_AnimatedLimb::BoneForwardAxis_36_211EE7874C70260BE2B6A98D72091C07' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, SignedForwardAngle_47_294068AA4EF68388F7F0918D9D9241BC) == 0x000018, "Member 'FSTRUCT_AnimatedLimb::SignedForwardAngle_47_294068AA4EF68388F7F0918D9D9241BC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, RearDamageBonusPercent_45_A612F08446B1B1081625AFBA0E28BC8D) == 0x00001C, "Member 'FSTRUCT_AnimatedLimb::RearDamageBonusPercent_45_A612F08446B1B1081625AFBA0E28BC8D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AnimatedLimb, RearArmorBonusPercent_46_BE23A2CA4FC83416427A71BDC3AF7B06) == 0x000020, "Member 'FSTRUCT_AnimatedLimb::RearArmorBonusPercent_46_BE23A2CA4FC83416427A71BDC3AF7B06' has a wrong offset!");

}

