#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_EnemyReinforcementSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_EnemyReinforcementSettings.STRUCT_EnemyReinforcementSettings
// 0x0098 (0x0098 - 0x0000)
struct FSTRUCT_EnemyReinforcementSettings final
{
public:
	TSoftClassPtr<class UClass>                   EnemyClass_69_8C78E2B5469B732AE72367AB67C9E8D0;    // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FIntVector                             StartSpawningAtPopulation_31_D97AADE04CCA5AE076C3758B961EDC81; // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             TotalReinforcements_40_50A8EF9B49E03135C0778EBD63C1D7F6; // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             ReinforcementDelay_70_8A5161734D5297C2E356358419AAA591; // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             HeadcountPerWave_51_FBD01DB94287C684387E10A22F1154E5; // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ModifierQuest_59_CA67A02B4D313BACE47DB9BFC64081B6; // 0x0058(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FIntVector                             QuestStartSpawningAtPopulation_68_4C0C553D48014CC9E5DE37B8C6E840C8; // 0x0068(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             QuestTotalReinforcements_55_97AB2FEA481CB585E001608372FB5ABA; // 0x0074(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             QuestReinforcementDelay_71_28E2B015486D13EA4766BA99DA0B30AD; // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             QuestHeadcountPerWave_52_455520434D91FC476B892C8600C09EEA; // 0x008C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_EnemyReinforcementSettings) == 0x000008, "Wrong alignment on FSTRUCT_EnemyReinforcementSettings");
static_assert(sizeof(FSTRUCT_EnemyReinforcementSettings) == 0x000098, "Wrong size on FSTRUCT_EnemyReinforcementSettings");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, EnemyClass_69_8C78E2B5469B732AE72367AB67C9E8D0) == 0x000000, "Member 'FSTRUCT_EnemyReinforcementSettings::EnemyClass_69_8C78E2B5469B732AE72367AB67C9E8D0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, StartSpawningAtPopulation_31_D97AADE04CCA5AE076C3758B961EDC81) == 0x000028, "Member 'FSTRUCT_EnemyReinforcementSettings::StartSpawningAtPopulation_31_D97AADE04CCA5AE076C3758B961EDC81' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, TotalReinforcements_40_50A8EF9B49E03135C0778EBD63C1D7F6) == 0x000034, "Member 'FSTRUCT_EnemyReinforcementSettings::TotalReinforcements_40_50A8EF9B49E03135C0778EBD63C1D7F6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, ReinforcementDelay_70_8A5161734D5297C2E356358419AAA591) == 0x000040, "Member 'FSTRUCT_EnemyReinforcementSettings::ReinforcementDelay_70_8A5161734D5297C2E356358419AAA591' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, HeadcountPerWave_51_FBD01DB94287C684387E10A22F1154E5) == 0x00004C, "Member 'FSTRUCT_EnemyReinforcementSettings::HeadcountPerWave_51_FBD01DB94287C684387E10A22F1154E5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, ModifierQuest_59_CA67A02B4D313BACE47DB9BFC64081B6) == 0x000058, "Member 'FSTRUCT_EnemyReinforcementSettings::ModifierQuest_59_CA67A02B4D313BACE47DB9BFC64081B6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, QuestStartSpawningAtPopulation_68_4C0C553D48014CC9E5DE37B8C6E840C8) == 0x000068, "Member 'FSTRUCT_EnemyReinforcementSettings::QuestStartSpawningAtPopulation_68_4C0C553D48014CC9E5DE37B8C6E840C8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, QuestTotalReinforcements_55_97AB2FEA481CB585E001608372FB5ABA) == 0x000074, "Member 'FSTRUCT_EnemyReinforcementSettings::QuestTotalReinforcements_55_97AB2FEA481CB585E001608372FB5ABA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, QuestReinforcementDelay_71_28E2B015486D13EA4766BA99DA0B30AD) == 0x000080, "Member 'FSTRUCT_EnemyReinforcementSettings::QuestReinforcementDelay_71_28E2B015486D13EA4766BA99DA0B30AD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyReinforcementSettings, QuestHeadcountPerWave_52_455520434D91FC476B892C8600C09EEA) == 0x00008C, "Member 'FSTRUCT_EnemyReinforcementSettings::QuestHeadcountPerWave_52_455520434D91FC476B892C8600C09EEA' has a wrong offset!");

}

