#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_UserTintOption

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_UserTintOption.STRUCT_UserTintOption
// 0x0148 (0x0148 - 0x0000)
struct FSTRUCT_UserTintOption final
{
public:
	class FText                                   DisplayName_8_AF851B0F4D20F660BA56FCA2FB1EA53D;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           TintBackground0_17_07A88DF04B09EA56FE04058AE12376E1; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintBackground1_16_C003B5E64491B3B5A3794293A82E9969; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintHighlight0_18_D138EC974B861470A178C697A5C9E2EA; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TintHighlight1_20_BD4AE67742650E14FD8BB2B361A2343D; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconQuestMarker_97_AFA8AABE42B80B5E5B6344A0244CC36A; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconHealingUtility_88_2771A0A1497AFABF5D1178B29D77622C; // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconPowerUtility_89_707B9C9849BC8E2237C9318F312AC295; // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconPuzzle_90_25877D8140E16B2F7506779AE7F79111; // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconCyberspace_91_06F504494F5442A6B35ACA8800826BB4; // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconItem_92_8AD74B404C405D68A248C89FEFAD6B87;   // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconElevator_93_82B429F445868482143691BD8B413865; // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconSecurity_94_ADFE5C0D4CF2151A7B01E6BBFDF7689B; // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconEnemy_84_09FC49C640B3A452638942B4C2CF0240;  // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconVendor_95_387970C040773038BDA3609E309FF1AB; // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapDoor_110_9D72FE3A4FFF157070001293396106A5;      // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconUserMarkerA_104_44E1A2A044D9927DAF294182AD4F1F10; // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconUserMarkerB_106_D0C7401543FF2AF2C3C159850D421907; // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconUserMarkerC_107_4522F75942F80AE0067513AD1F50079C; // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MapIconUserMarkerD_109_5570D7934505BD8DAA0651AEDC931B9E; // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_UserTintOption) == 0x000008, "Wrong alignment on FSTRUCT_UserTintOption");
static_assert(sizeof(FSTRUCT_UserTintOption) == 0x000148, "Wrong size on FSTRUCT_UserTintOption");
static_assert(offsetof(FSTRUCT_UserTintOption, DisplayName_8_AF851B0F4D20F660BA56FCA2FB1EA53D) == 0x000000, "Member 'FSTRUCT_UserTintOption::DisplayName_8_AF851B0F4D20F660BA56FCA2FB1EA53D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, TintBackground0_17_07A88DF04B09EA56FE04058AE12376E1) == 0x000018, "Member 'FSTRUCT_UserTintOption::TintBackground0_17_07A88DF04B09EA56FE04058AE12376E1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, TintBackground1_16_C003B5E64491B3B5A3794293A82E9969) == 0x000028, "Member 'FSTRUCT_UserTintOption::TintBackground1_16_C003B5E64491B3B5A3794293A82E9969' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, TintHighlight0_18_D138EC974B861470A178C697A5C9E2EA) == 0x000038, "Member 'FSTRUCT_UserTintOption::TintHighlight0_18_D138EC974B861470A178C697A5C9E2EA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, TintHighlight1_20_BD4AE67742650E14FD8BB2B361A2343D) == 0x000048, "Member 'FSTRUCT_UserTintOption::TintHighlight1_20_BD4AE67742650E14FD8BB2B361A2343D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconQuestMarker_97_AFA8AABE42B80B5E5B6344A0244CC36A) == 0x000058, "Member 'FSTRUCT_UserTintOption::MapIconQuestMarker_97_AFA8AABE42B80B5E5B6344A0244CC36A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconHealingUtility_88_2771A0A1497AFABF5D1178B29D77622C) == 0x000068, "Member 'FSTRUCT_UserTintOption::MapIconHealingUtility_88_2771A0A1497AFABF5D1178B29D77622C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconPowerUtility_89_707B9C9849BC8E2237C9318F312AC295) == 0x000078, "Member 'FSTRUCT_UserTintOption::MapIconPowerUtility_89_707B9C9849BC8E2237C9318F312AC295' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconPuzzle_90_25877D8140E16B2F7506779AE7F79111) == 0x000088, "Member 'FSTRUCT_UserTintOption::MapIconPuzzle_90_25877D8140E16B2F7506779AE7F79111' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconCyberspace_91_06F504494F5442A6B35ACA8800826BB4) == 0x000098, "Member 'FSTRUCT_UserTintOption::MapIconCyberspace_91_06F504494F5442A6B35ACA8800826BB4' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconItem_92_8AD74B404C405D68A248C89FEFAD6B87) == 0x0000A8, "Member 'FSTRUCT_UserTintOption::MapIconItem_92_8AD74B404C405D68A248C89FEFAD6B87' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconElevator_93_82B429F445868482143691BD8B413865) == 0x0000B8, "Member 'FSTRUCT_UserTintOption::MapIconElevator_93_82B429F445868482143691BD8B413865' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconSecurity_94_ADFE5C0D4CF2151A7B01E6BBFDF7689B) == 0x0000C8, "Member 'FSTRUCT_UserTintOption::MapIconSecurity_94_ADFE5C0D4CF2151A7B01E6BBFDF7689B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconEnemy_84_09FC49C640B3A452638942B4C2CF0240) == 0x0000D8, "Member 'FSTRUCT_UserTintOption::MapIconEnemy_84_09FC49C640B3A452638942B4C2CF0240' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconVendor_95_387970C040773038BDA3609E309FF1AB) == 0x0000E8, "Member 'FSTRUCT_UserTintOption::MapIconVendor_95_387970C040773038BDA3609E309FF1AB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapDoor_110_9D72FE3A4FFF157070001293396106A5) == 0x0000F8, "Member 'FSTRUCT_UserTintOption::MapDoor_110_9D72FE3A4FFF157070001293396106A5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconUserMarkerA_104_44E1A2A044D9927DAF294182AD4F1F10) == 0x000108, "Member 'FSTRUCT_UserTintOption::MapIconUserMarkerA_104_44E1A2A044D9927DAF294182AD4F1F10' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconUserMarkerB_106_D0C7401543FF2AF2C3C159850D421907) == 0x000118, "Member 'FSTRUCT_UserTintOption::MapIconUserMarkerB_106_D0C7401543FF2AF2C3C159850D421907' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconUserMarkerC_107_4522F75942F80AE0067513AD1F50079C) == 0x000128, "Member 'FSTRUCT_UserTintOption::MapIconUserMarkerC_107_4522F75942F80AE0067513AD1F50079C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_UserTintOption, MapIconUserMarkerD_109_5570D7934505BD8DAA0651AEDC931B9E) == 0x000138, "Member 'FSTRUCT_UserTintOption::MapIconUserMarkerD_109_5570D7934505BD8DAA0651AEDC931B9E' has a wrong offset!");

}

