#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DialogueCaptionObject

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DialogueCaptionObject.STRUCT_DialogueCaptionObject
// 0x0050 (0x0050 - 0x0000)
struct FSTRUCT_DialogueCaptionObject final
{
public:
	TSoftObjectPtr<class USoundCue>               AudioCue_8_7CBEFCBC42735CE221F6E58AC42C8D91;       // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Speaker_2_9495013443BB17A002B42FBBE4A4615A;        // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   Transcription_5_3A59581D482DCECB649CA3A55D5372F5;  // 0x0038(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FSTRUCT_DialogueCaptionObject) == 0x000008, "Wrong alignment on FSTRUCT_DialogueCaptionObject");
static_assert(sizeof(FSTRUCT_DialogueCaptionObject) == 0x000050, "Wrong size on FSTRUCT_DialogueCaptionObject");
static_assert(offsetof(FSTRUCT_DialogueCaptionObject, AudioCue_8_7CBEFCBC42735CE221F6E58AC42C8D91) == 0x000000, "Member 'FSTRUCT_DialogueCaptionObject::AudioCue_8_7CBEFCBC42735CE221F6E58AC42C8D91' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DialogueCaptionObject, Speaker_2_9495013443BB17A002B42FBBE4A4615A) == 0x000028, "Member 'FSTRUCT_DialogueCaptionObject::Speaker_2_9495013443BB17A002B42FBBE4A4615A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DialogueCaptionObject, Transcription_5_3A59581D482DCECB649CA3A55D5372F5) == 0x000038, "Member 'FSTRUCT_DialogueCaptionObject::Transcription_5_3A59581D482DCECB649CA3A55D5372F5' has a wrong offset!");

}

