#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_CharacterLoadoutSettings

#include "Basic.hpp"

#include "STRUCT_SoftItemParams_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_CharacterLoadoutSettings.STRUCT_CharacterLoadoutSettings
// 0x0030 (0x0030 - 0x0000)
struct FSTRUCT_CharacterLoadoutSettings final
{
public:
	bool                                          FullVitals_17_C17927134BACFEC2690B7AB305DBF530;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTRUCT_SoftItemParams>         Items_14_7E77AB4743F0776AC2DDD9A123FB80F7;         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Quests_21_E2778A3C4A3AB81ACFA244AD25BB2F90;        // 0x0018(0x0010)(Edit, BlueprintVisible)
	class FName                                   MoveToMap_24_0C77D9544C4B12D84836CB8BE29FFB89;     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_CharacterLoadoutSettings) == 0x000008, "Wrong alignment on FSTRUCT_CharacterLoadoutSettings");
static_assert(sizeof(FSTRUCT_CharacterLoadoutSettings) == 0x000030, "Wrong size on FSTRUCT_CharacterLoadoutSettings");
static_assert(offsetof(FSTRUCT_CharacterLoadoutSettings, FullVitals_17_C17927134BACFEC2690B7AB305DBF530) == 0x000000, "Member 'FSTRUCT_CharacterLoadoutSettings::FullVitals_17_C17927134BACFEC2690B7AB305DBF530' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterLoadoutSettings, Items_14_7E77AB4743F0776AC2DDD9A123FB80F7) == 0x000008, "Member 'FSTRUCT_CharacterLoadoutSettings::Items_14_7E77AB4743F0776AC2DDD9A123FB80F7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterLoadoutSettings, Quests_21_E2778A3C4A3AB81ACFA244AD25BB2F90) == 0x000018, "Member 'FSTRUCT_CharacterLoadoutSettings::Quests_21_E2778A3C4A3AB81ACFA244AD25BB2F90' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterLoadoutSettings, MoveToMap_24_0C77D9544C4B12D84836CB8BE29FFB89) == 0x000028, "Member 'FSTRUCT_CharacterLoadoutSettings::MoveToMap_24_0C77D9544C4B12D84836CB8BE29FFB89' has a wrong offset!");

}

