#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_ItemUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_ItemUI.STRUCT_ItemUI
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_ItemUI final
{
public:
	int32                                         SlotIndex_8_18709C8F4D5E5500AE1B319DB151616B;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              ItemSize_26_BAC96DFA48532652BC19A3A041A4C3D9;      // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SlottedItem_C*                  MeshWidget_12_2222CF7F4DDB0F952A955798642C89D9;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_ItemUI) == 0x000008, "Wrong alignment on FSTRUCT_ItemUI");
static_assert(sizeof(FSTRUCT_ItemUI) == 0x000018, "Wrong size on FSTRUCT_ItemUI");
static_assert(offsetof(FSTRUCT_ItemUI, SlotIndex_8_18709C8F4D5E5500AE1B319DB151616B) == 0x000000, "Member 'FSTRUCT_ItemUI::SlotIndex_8_18709C8F4D5E5500AE1B319DB151616B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ItemUI, ItemSize_26_BAC96DFA48532652BC19A3A041A4C3D9) == 0x000004, "Member 'FSTRUCT_ItemUI::ItemSize_26_BAC96DFA48532652BC19A3A041A4C3D9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_ItemUI, MeshWidget_12_2222CF7F4DDB0F952A955798642C89D9) == 0x000010, "Member 'FSTRUCT_ItemUI::MeshWidget_12_2222CF7F4DDB0F952A955798642C89D9' has a wrong offset!");

}

