#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_WirePuzzle_CellData

#include "Basic.hpp"

#include "ENUM_WirePuzzle_CellType_structs.hpp"
#include "STRUCT_TraceInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_WirePuzzle_CellData.STRUCT_WirePuzzle_CellData
// 0x0068 (0x0068 - 0x0000)
struct FSTRUCT_WirePuzzle_CellData final
{
public:
	ENUM_WirePuzzle_CellType                      CellType_14_774D9D9B43A6DD46A678CCAE25C09ACB;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CellMesh_17_96146DAB4B085C4489CF0CB5F3F23DE4;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlternate_41_9BD07B744AABCA28777DAC9D4D4584CB;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 InputSockets_7_3516A57647967CCA4F671EB4446D58BE;   // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 OutputSockets_10_B669BB5C47B1AB5D8B22D0AAC8CE8D98; // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FIntPoint>                      ThroughputSockets_21_EED48B96491D1827FB906396F9B287E7; // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 InitialPoweredOutputSockets_33_9C1BC6BD413F1CD93A67A4818342339A; // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTRUCT_TraceInfo>              TraceInfo_46_A47E83C543B5F465BDDF67B9801F9301;     // 0x0058(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FSTRUCT_WirePuzzle_CellData) == 0x000008, "Wrong alignment on FSTRUCT_WirePuzzle_CellData");
static_assert(sizeof(FSTRUCT_WirePuzzle_CellData) == 0x000068, "Wrong size on FSTRUCT_WirePuzzle_CellData");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, CellType_14_774D9D9B43A6DD46A678CCAE25C09ACB) == 0x000000, "Member 'FSTRUCT_WirePuzzle_CellData::CellType_14_774D9D9B43A6DD46A678CCAE25C09ACB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, CellMesh_17_96146DAB4B085C4489CF0CB5F3F23DE4) == 0x000008, "Member 'FSTRUCT_WirePuzzle_CellData::CellMesh_17_96146DAB4B085C4489CF0CB5F3F23DE4' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, IsAlternate_41_9BD07B744AABCA28777DAC9D4D4584CB) == 0x000010, "Member 'FSTRUCT_WirePuzzle_CellData::IsAlternate_41_9BD07B744AABCA28777DAC9D4D4584CB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, InputSockets_7_3516A57647967CCA4F671EB4446D58BE) == 0x000018, "Member 'FSTRUCT_WirePuzzle_CellData::InputSockets_7_3516A57647967CCA4F671EB4446D58BE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, OutputSockets_10_B669BB5C47B1AB5D8B22D0AAC8CE8D98) == 0x000028, "Member 'FSTRUCT_WirePuzzle_CellData::OutputSockets_10_B669BB5C47B1AB5D8B22D0AAC8CE8D98' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, ThroughputSockets_21_EED48B96491D1827FB906396F9B287E7) == 0x000038, "Member 'FSTRUCT_WirePuzzle_CellData::ThroughputSockets_21_EED48B96491D1827FB906396F9B287E7' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, InitialPoweredOutputSockets_33_9C1BC6BD413F1CD93A67A4818342339A) == 0x000048, "Member 'FSTRUCT_WirePuzzle_CellData::InitialPoweredOutputSockets_33_9C1BC6BD413F1CD93A67A4818342339A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WirePuzzle_CellData, TraceInfo_46_A47E83C543B5F465BDDF67B9801F9301) == 0x000058, "Member 'FSTRUCT_WirePuzzle_CellData::TraceInfo_46_A47E83C543B5F465BDDF67B9801F9301' has a wrong offset!");

}

