#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_CombatDifficultySettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_CombatDifficultySettings.STRUCT_CombatDifficultySettings
// 0x0034 (0x0034 - 0x0000)
struct FSTRUCT_CombatDifficultySettings final
{
public:
	int32                                         EnemyDamagePercentage_12_EF83A3F14D693C057FB1D88D5F3359D2; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyHealthPercentage_13_5911054F4789F737E49F6AA5716436D3; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RoundHealthTo_9_3AC00E0C42D8B4C2351D43BC1852D72B;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyAlertnessPercentage_18_82BFC9314079669E2DAA5BA5225ABEDB; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyForgetTime_20_52F01BDC45BB4F3A05852590852DF228; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyHesitationPercentage_23_9DD959454CAC0DEDD38F058EFAA6FA5F; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyAccuracyPercentage_26_70948B38454FB74E918325831ECCD7CD; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SurpriseAccuracyDuration_31_A825DBC24B12414366EC888D0CDBB6C6; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnemyLootDropBonus_51_AD7919274D8F8E73FC53D2B8347BCADA; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxFallDamagePercentage_36_CFBD75734D3FE83DD4F8C993C861AB65; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RespawnHealthPercentage_39_AA75136F4062E00544231CBC14EAF82D; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecurityCameraDetectRange_44_8FDEA7BC4B513079BD78149915422DC5; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SecurityCameraAlertRange_41_2EDA41FF44D83B67128377AAF9423A65; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_CombatDifficultySettings) == 0x000004, "Wrong alignment on FSTRUCT_CombatDifficultySettings");
static_assert(sizeof(FSTRUCT_CombatDifficultySettings) == 0x000034, "Wrong size on FSTRUCT_CombatDifficultySettings");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyDamagePercentage_12_EF83A3F14D693C057FB1D88D5F3359D2) == 0x000000, "Member 'FSTRUCT_CombatDifficultySettings::EnemyDamagePercentage_12_EF83A3F14D693C057FB1D88D5F3359D2' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyHealthPercentage_13_5911054F4789F737E49F6AA5716436D3) == 0x000004, "Member 'FSTRUCT_CombatDifficultySettings::EnemyHealthPercentage_13_5911054F4789F737E49F6AA5716436D3' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, RoundHealthTo_9_3AC00E0C42D8B4C2351D43BC1852D72B) == 0x000008, "Member 'FSTRUCT_CombatDifficultySettings::RoundHealthTo_9_3AC00E0C42D8B4C2351D43BC1852D72B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyAlertnessPercentage_18_82BFC9314079669E2DAA5BA5225ABEDB) == 0x00000C, "Member 'FSTRUCT_CombatDifficultySettings::EnemyAlertnessPercentage_18_82BFC9314079669E2DAA5BA5225ABEDB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyForgetTime_20_52F01BDC45BB4F3A05852590852DF228) == 0x000010, "Member 'FSTRUCT_CombatDifficultySettings::EnemyForgetTime_20_52F01BDC45BB4F3A05852590852DF228' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyHesitationPercentage_23_9DD959454CAC0DEDD38F058EFAA6FA5F) == 0x000014, "Member 'FSTRUCT_CombatDifficultySettings::EnemyHesitationPercentage_23_9DD959454CAC0DEDD38F058EFAA6FA5F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyAccuracyPercentage_26_70948B38454FB74E918325831ECCD7CD) == 0x000018, "Member 'FSTRUCT_CombatDifficultySettings::EnemyAccuracyPercentage_26_70948B38454FB74E918325831ECCD7CD' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, SurpriseAccuracyDuration_31_A825DBC24B12414366EC888D0CDBB6C6) == 0x00001C, "Member 'FSTRUCT_CombatDifficultySettings::SurpriseAccuracyDuration_31_A825DBC24B12414366EC888D0CDBB6C6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, EnemyLootDropBonus_51_AD7919274D8F8E73FC53D2B8347BCADA) == 0x000020, "Member 'FSTRUCT_CombatDifficultySettings::EnemyLootDropBonus_51_AD7919274D8F8E73FC53D2B8347BCADA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, MaxFallDamagePercentage_36_CFBD75734D3FE83DD4F8C993C861AB65) == 0x000024, "Member 'FSTRUCT_CombatDifficultySettings::MaxFallDamagePercentage_36_CFBD75734D3FE83DD4F8C993C861AB65' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, RespawnHealthPercentage_39_AA75136F4062E00544231CBC14EAF82D) == 0x000028, "Member 'FSTRUCT_CombatDifficultySettings::RespawnHealthPercentage_39_AA75136F4062E00544231CBC14EAF82D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, SecurityCameraDetectRange_44_8FDEA7BC4B513079BD78149915422DC5) == 0x00002C, "Member 'FSTRUCT_CombatDifficultySettings::SecurityCameraDetectRange_44_8FDEA7BC4B513079BD78149915422DC5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CombatDifficultySettings, SecurityCameraAlertRange_41_2EDA41FF44D83B67128377AAF9423A65) == 0x000030, "Member 'FSTRUCT_CombatDifficultySettings::SecurityCameraAlertRange_41_2EDA41FF44D83B67128377AAF9423A65' has a wrong offset!");

}

