#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_LimbSpawnEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_LimbSpawnEffect.STRUCT_LimbSpawnEffect
// 0x0050 (0x0050 - 0x0000)
struct FSTRUCT_LimbSpawnEffect final
{
public:
	class UNiagaraSystem*                         ParticleSystem_15_D4B131354E35550299FF059AFC9B751D; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalOffset_6_205F5A1A45E37ABDED0CA787911D39BB;    // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FName                                   AlternateBone_13_C8BD6A1D44F8955ADABDAA990756E37E; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransferOnDismember_14_045088F140A8E653E549428B2DEA1B39; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_LimbSpawnEffect) == 0x000010, "Wrong alignment on FSTRUCT_LimbSpawnEffect");
static_assert(sizeof(FSTRUCT_LimbSpawnEffect) == 0x000050, "Wrong size on FSTRUCT_LimbSpawnEffect");
static_assert(offsetof(FSTRUCT_LimbSpawnEffect, ParticleSystem_15_D4B131354E35550299FF059AFC9B751D) == 0x000000, "Member 'FSTRUCT_LimbSpawnEffect::ParticleSystem_15_D4B131354E35550299FF059AFC9B751D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LimbSpawnEffect, LocalOffset_6_205F5A1A45E37ABDED0CA787911D39BB) == 0x000010, "Member 'FSTRUCT_LimbSpawnEffect::LocalOffset_6_205F5A1A45E37ABDED0CA787911D39BB' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LimbSpawnEffect, AlternateBone_13_C8BD6A1D44F8955ADABDAA990756E37E) == 0x000040, "Member 'FSTRUCT_LimbSpawnEffect::AlternateBone_13_C8BD6A1D44F8955ADABDAA990756E37E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LimbSpawnEffect, TransferOnDismember_14_045088F140A8E653E549428B2DEA1B39) == 0x000048, "Member 'FSTRUCT_LimbSpawnEffect::TransferOnDismember_14_045088F140A8E653E549428B2DEA1B39' has a wrong offset!");

}

