#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_HardwareFeature

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_HardwareFeature.STRUCT_HardwareFeature
// 0x0020 (0x0020 - 0x0000)
struct FSTRUCT_HardwareFeature final
{
public:
	class FText                                   UsageText_6_FFE6A87C450CB40CE61000A36FDA5281;      // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         EnergyCost_7_B16DBFF24058375958B8FB869E40BFA1;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnergyPerMinute_12_4B3366464303F6F7773FD0AF7F42B0F2; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_HardwareFeature) == 0x000008, "Wrong alignment on FSTRUCT_HardwareFeature");
static_assert(sizeof(FSTRUCT_HardwareFeature) == 0x000020, "Wrong size on FSTRUCT_HardwareFeature");
static_assert(offsetof(FSTRUCT_HardwareFeature, UsageText_6_FFE6A87C450CB40CE61000A36FDA5281) == 0x000000, "Member 'FSTRUCT_HardwareFeature::UsageText_6_FFE6A87C450CB40CE61000A36FDA5281' has a wrong offset!");
static_assert(offsetof(FSTRUCT_HardwareFeature, EnergyCost_7_B16DBFF24058375958B8FB869E40BFA1) == 0x000018, "Member 'FSTRUCT_HardwareFeature::EnergyCost_7_B16DBFF24058375958B8FB869E40BFA1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_HardwareFeature, IsEnergyPerMinute_12_4B3366464303F6F7773FD0AF7F42B0F2) == 0x00001C, "Member 'FSTRUCT_HardwareFeature::IsEnergyPerMinute_12_4B3366464303F6F7773FD0AF7F42B0F2' has a wrong offset!");

}

