#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MeshDescriptor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MeshDescriptor.STRUCT_MeshDescriptor
// 0x0048 (0x0048 - 0x0000)
struct FSTRUCT_MeshDescriptor final
{
public:
	TArray<TSoftObjectPtr<class UStaticMesh>>     Meshes_22_D888A2434DC7E1F433CE148CEDAA4B0B;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class UMaterialInterface>> Materials_21_67A7F29741FB50DB1143F7A6F9E519E0;     // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   DescriptionText_5_B253D4E7492A3C200FCD2C94098DEDA6; // 0x0020(0x0018)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    FlavorTextType_27_E34C5E784B9DA65600FE79BB8D95F339; // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FSTRUCT_MeshDescriptor) == 0x000008, "Wrong alignment on FSTRUCT_MeshDescriptor");
static_assert(sizeof(FSTRUCT_MeshDescriptor) == 0x000048, "Wrong size on FSTRUCT_MeshDescriptor");
static_assert(offsetof(FSTRUCT_MeshDescriptor, Meshes_22_D888A2434DC7E1F433CE148CEDAA4B0B) == 0x000000, "Member 'FSTRUCT_MeshDescriptor::Meshes_22_D888A2434DC7E1F433CE148CEDAA4B0B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MeshDescriptor, Materials_21_67A7F29741FB50DB1143F7A6F9E519E0) == 0x000010, "Member 'FSTRUCT_MeshDescriptor::Materials_21_67A7F29741FB50DB1143F7A6F9E519E0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MeshDescriptor, DescriptionText_5_B253D4E7492A3C200FCD2C94098DEDA6) == 0x000020, "Member 'FSTRUCT_MeshDescriptor::DescriptionText_5_B253D4E7492A3C200FCD2C94098DEDA6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MeshDescriptor, FlavorTextType_27_E34C5E784B9DA65600FE79BB8D95F339) == 0x000038, "Member 'FSTRUCT_MeshDescriptor::FlavorTextType_27_E34C5E784B9DA65600FE79BB8D95F339' has a wrong offset!");

}

