#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_InventoryBagParams

#include "Basic.hpp"

#include "ENUM_InventorySlotType_structs.hpp"
#include "ENUM_ItemType_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_InventoryBagParams.STRUCT_InventoryBagParams
// 0x0030 (0x0030 - 0x0000)
struct FSTRUCT_InventoryBagParams final
{
public:
	class FName                                   Name_16_475F797649F0272D7B86F8B5CD900692;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GridWidth_2_FB600AB2443508BE4F34E281F809BA80;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSlots_4_D9DA39A146C0397DFAE50FBE8D635470;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InventorySlotType                        SlotType_9_6045C333490FF8F821381E9E49EB71A6;       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENUM_ItemType>                         RequireItemTypes_17_734B648744671A92596DA0AE20BB46EE; // 0x0018(0x0010)(Edit, BlueprintVisible, SaveGame)
	bool                                          OverflowBag_27_D00CFEAD4BD4882E6759EC8728CAC75D;   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_InventoryBagParams) == 0x000008, "Wrong alignment on FSTRUCT_InventoryBagParams");
static_assert(sizeof(FSTRUCT_InventoryBagParams) == 0x000030, "Wrong size on FSTRUCT_InventoryBagParams");
static_assert(offsetof(FSTRUCT_InventoryBagParams, Name_16_475F797649F0272D7B86F8B5CD900692) == 0x000000, "Member 'FSTRUCT_InventoryBagParams::Name_16_475F797649F0272D7B86F8B5CD900692' has a wrong offset!");
static_assert(offsetof(FSTRUCT_InventoryBagParams, GridWidth_2_FB600AB2443508BE4F34E281F809BA80) == 0x000008, "Member 'FSTRUCT_InventoryBagParams::GridWidth_2_FB600AB2443508BE4F34E281F809BA80' has a wrong offset!");
static_assert(offsetof(FSTRUCT_InventoryBagParams, MaxSlots_4_D9DA39A146C0397DFAE50FBE8D635470) == 0x00000C, "Member 'FSTRUCT_InventoryBagParams::MaxSlots_4_D9DA39A146C0397DFAE50FBE8D635470' has a wrong offset!");
static_assert(offsetof(FSTRUCT_InventoryBagParams, SlotType_9_6045C333490FF8F821381E9E49EB71A6) == 0x000010, "Member 'FSTRUCT_InventoryBagParams::SlotType_9_6045C333490FF8F821381E9E49EB71A6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_InventoryBagParams, RequireItemTypes_17_734B648744671A92596DA0AE20BB46EE) == 0x000018, "Member 'FSTRUCT_InventoryBagParams::RequireItemTypes_17_734B648744671A92596DA0AE20BB46EE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_InventoryBagParams, OverflowBag_27_D00CFEAD4BD4882E6759EC8728CAC75D) == 0x000028, "Member 'FSTRUCT_InventoryBagParams::OverflowBag_27_D00CFEAD4BD4882E6759EC8728CAC75D' has a wrong offset!");

}

