#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_DismemberableLimb

#include "Basic.hpp"

#include "ENUM_LimbStrength_structs.hpp"
#include "STRUCT_LimbSpawnEffect_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_DismemberableLimb.STRUCT_DismemberableLimb
// 0x0098 (0x0098 - 0x0000)
struct FSTRUCT_DismemberableLimb final
{
public:
	class FName                                   RootBone_2_A7F7C33249C1E1174FB0518DE23A7789;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Order_56_E2B4F4F64EACCF0B31B5358966FF1323;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           SpawnLimbMesh_34_6543419E43636FBBA72259A241B89883; // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ENUM_LimbStrength                             LimbHealth_21_447C81D34DCAB9AD7B8B56B16B7A8D52;    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SourceShowIDs_39_E937BE2249C728D883204983CD390EB8; // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 SourceHideIDs_40_8AB49ED040C572D5A0B461954218FC00; // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 InitialHideIDs_62_FE1726D9456EA3E94158B2B01B3FE729; // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTRUCT_LimbSpawnEffect>        DismemberedParticleEffects_53_15ADFB9941B9BBB7E4D99CAD3CB3890D; // 0x0070(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSTRUCT_LimbSpawnEffect>        DestroyedParticleEffects_42_1EAA3C594B0C70B6CFD1898783D8A31C; // 0x0080(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          IsDestructible_22_4D662316495C02CAF16D1C81D031AFA9; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCleanBreak_64_D4D229B54050D78A04F6CF96F223ABAF;  // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_DismemberableLimb) == 0x000008, "Wrong alignment on FSTRUCT_DismemberableLimb");
static_assert(sizeof(FSTRUCT_DismemberableLimb) == 0x000098, "Wrong size on FSTRUCT_DismemberableLimb");
static_assert(offsetof(FSTRUCT_DismemberableLimb, RootBone_2_A7F7C33249C1E1174FB0518DE23A7789) == 0x000000, "Member 'FSTRUCT_DismemberableLimb::RootBone_2_A7F7C33249C1E1174FB0518DE23A7789' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, Order_56_E2B4F4F64EACCF0B31B5358966FF1323) == 0x000008, "Member 'FSTRUCT_DismemberableLimb::Order_56_E2B4F4F64EACCF0B31B5358966FF1323' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, SpawnLimbMesh_34_6543419E43636FBBA72259A241B89883) == 0x000010, "Member 'FSTRUCT_DismemberableLimb::SpawnLimbMesh_34_6543419E43636FBBA72259A241B89883' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, LimbHealth_21_447C81D34DCAB9AD7B8B56B16B7A8D52) == 0x000038, "Member 'FSTRUCT_DismemberableLimb::LimbHealth_21_447C81D34DCAB9AD7B8B56B16B7A8D52' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, SourceShowIDs_39_E937BE2249C728D883204983CD390EB8) == 0x000040, "Member 'FSTRUCT_DismemberableLimb::SourceShowIDs_39_E937BE2249C728D883204983CD390EB8' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, SourceHideIDs_40_8AB49ED040C572D5A0B461954218FC00) == 0x000050, "Member 'FSTRUCT_DismemberableLimb::SourceHideIDs_40_8AB49ED040C572D5A0B461954218FC00' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, InitialHideIDs_62_FE1726D9456EA3E94158B2B01B3FE729) == 0x000060, "Member 'FSTRUCT_DismemberableLimb::InitialHideIDs_62_FE1726D9456EA3E94158B2B01B3FE729' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, DismemberedParticleEffects_53_15ADFB9941B9BBB7E4D99CAD3CB3890D) == 0x000070, "Member 'FSTRUCT_DismemberableLimb::DismemberedParticleEffects_53_15ADFB9941B9BBB7E4D99CAD3CB3890D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, DestroyedParticleEffects_42_1EAA3C594B0C70B6CFD1898783D8A31C) == 0x000080, "Member 'FSTRUCT_DismemberableLimb::DestroyedParticleEffects_42_1EAA3C594B0C70B6CFD1898783D8A31C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, IsDestructible_22_4D662316495C02CAF16D1C81D031AFA9) == 0x000090, "Member 'FSTRUCT_DismemberableLimb::IsDestructible_22_4D662316495C02CAF16D1C81D031AFA9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_DismemberableLimb, IsCleanBreak_64_D4D229B54050D78A04F6CF96F223ABAF) == 0x000091, "Member 'FSTRUCT_DismemberableLimb::IsCleanBreak_64_D4D229B54050D78A04F6CF96F223ABAF' has a wrong offset!");

}

