#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_AsyncParticleParams

#include "Basic.hpp"

#include "CoreGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_AsyncParticleParams.STRUCT_AsyncParticleParams
// 0x00A0 (0x00A0 - 0x0000)
struct FSTRUCT_AsyncParticleParams final
{
public:
	TSoftObjectPtr<class USceneComponent>         AttachToComponent_25_630303C24FA706B5195003BA17B18B74; // 0x0000(0x0028)(Edit, BlueprintVisible, InstancedReference, HasGetValueTypeHash)
	class FName                                   SocketName_5_402E256E4BE5F033182578AD30BA404F;     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform_13_472A678A45EF5DBA0CF8D99EFC612F6F;     // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FSTRUCT_EffectParams                   EffectParameters_16_2D3DC05240B5766FD4A3D5AB455104AA; // 0x0060(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLatentObjectEventHandle               OnSpawnEvent_19_A48E7BDD4A64C87F87A1DCA9DC9E2357;  // 0x0090(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};
static_assert(alignof(FSTRUCT_AsyncParticleParams) == 0x000010, "Wrong alignment on FSTRUCT_AsyncParticleParams");
static_assert(sizeof(FSTRUCT_AsyncParticleParams) == 0x0000A0, "Wrong size on FSTRUCT_AsyncParticleParams");
static_assert(offsetof(FSTRUCT_AsyncParticleParams, AttachToComponent_25_630303C24FA706B5195003BA17B18B74) == 0x000000, "Member 'FSTRUCT_AsyncParticleParams::AttachToComponent_25_630303C24FA706B5195003BA17B18B74' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AsyncParticleParams, SocketName_5_402E256E4BE5F033182578AD30BA404F) == 0x000028, "Member 'FSTRUCT_AsyncParticleParams::SocketName_5_402E256E4BE5F033182578AD30BA404F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AsyncParticleParams, Transform_13_472A678A45EF5DBA0CF8D99EFC612F6F) == 0x000030, "Member 'FSTRUCT_AsyncParticleParams::Transform_13_472A678A45EF5DBA0CF8D99EFC612F6F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AsyncParticleParams, EffectParameters_16_2D3DC05240B5766FD4A3D5AB455104AA) == 0x000060, "Member 'FSTRUCT_AsyncParticleParams::EffectParameters_16_2D3DC05240B5766FD4A3D5AB455104AA' has a wrong offset!");
static_assert(offsetof(FSTRUCT_AsyncParticleParams, OnSpawnEvent_19_A48E7BDD4A64C87F87A1DCA9DC9E2357) == 0x000090, "Member 'FSTRUCT_AsyncParticleParams::OnSpawnEvent_19_A48E7BDD4A64C87F87A1DCA9DC9E2357' has a wrong offset!");

}

