#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MissionWaypointData

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MissionWaypointData.STRUCT_MissionWaypointData
// 0x0030 (0x0030 - 0x0000)
struct FSTRUCT_MissionWaypointData final
{
public:
	struct FDataTableRowHandle                    AvailableOnCompletion_3_AD2CE16843043D09475CAB9358FEE14F; // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableRowHandle                    InvalidateOnCompletion_5_B0B65205419E453EC9D953942F8D7423; // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableRowHandle                    TargetLevel_10_AEF1460D46F646DC51A1DA9D83B17177;   // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FSTRUCT_MissionWaypointData) == 0x000008, "Wrong alignment on FSTRUCT_MissionWaypointData");
static_assert(sizeof(FSTRUCT_MissionWaypointData) == 0x000030, "Wrong size on FSTRUCT_MissionWaypointData");
static_assert(offsetof(FSTRUCT_MissionWaypointData, AvailableOnCompletion_3_AD2CE16843043D09475CAB9358FEE14F) == 0x000000, "Member 'FSTRUCT_MissionWaypointData::AvailableOnCompletion_3_AD2CE16843043D09475CAB9358FEE14F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MissionWaypointData, InvalidateOnCompletion_5_B0B65205419E453EC9D953942F8D7423) == 0x000010, "Member 'FSTRUCT_MissionWaypointData::InvalidateOnCompletion_5_B0B65205419E453EC9D953942F8D7423' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MissionWaypointData, TargetLevel_10_AEF1460D46F646DC51A1DA9D83B17177) == 0x000020, "Member 'FSTRUCT_MissionWaypointData::TargetLevel_10_AEF1460D46F646DC51A1DA9D83B17177' has a wrong offset!");

}

