#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_HotbarCategorySettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_HotbarCategorySettings.STRUCT_HotbarCategorySettings
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_HotbarCategorySettings final
{
public:
	class UClass*                                 SlottableClass_2_9129F5DD453A31EF08A316BDAC6474D3; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExcludeClass_4_79EF2093452BFF07FD3796BEDFE23D3E;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotCount_7_4EC9C8C54233B4BCDE81EB94F96CCE06;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_HotbarCategorySettings) == 0x000008, "Wrong alignment on FSTRUCT_HotbarCategorySettings");
static_assert(sizeof(FSTRUCT_HotbarCategorySettings) == 0x000018, "Wrong size on FSTRUCT_HotbarCategorySettings");
static_assert(offsetof(FSTRUCT_HotbarCategorySettings, SlottableClass_2_9129F5DD453A31EF08A316BDAC6474D3) == 0x000000, "Member 'FSTRUCT_HotbarCategorySettings::SlottableClass_2_9129F5DD453A31EF08A316BDAC6474D3' has a wrong offset!");
static_assert(offsetof(FSTRUCT_HotbarCategorySettings, ExcludeClass_4_79EF2093452BFF07FD3796BEDFE23D3E) == 0x000008, "Member 'FSTRUCT_HotbarCategorySettings::ExcludeClass_4_79EF2093452BFF07FD3796BEDFE23D3E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_HotbarCategorySettings, SlotCount_7_4EC9C8C54233B4BCDE81EB94F96CCE06) == 0x000010, "Member 'FSTRUCT_HotbarCategorySettings::SlotCount_7_4EC9C8C54233B4BCDE81EB94F96CCE06' has a wrong offset!");

}

