#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_LevelMusicSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_LevelMusicSettings.STRUCT_LevelMusicSettings
// 0x0078 (0x0078 - 0x0000)
struct FSTRUCT_LevelMusicSettings final
{
public:
	TSoftClassPtr<class UClass>                   ExplorationMusic_22_A0FB1E3346C45AFBC4F796AD0526402B; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CombatMusic_18_C00557B046ECEE43CC9167AD34BBB0BE;   // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SneakMusic_17_051A273543A5181572EBE7A112D714B0;    // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_LevelMusicSettings) == 0x000008, "Wrong alignment on FSTRUCT_LevelMusicSettings");
static_assert(sizeof(FSTRUCT_LevelMusicSettings) == 0x000078, "Wrong size on FSTRUCT_LevelMusicSettings");
static_assert(offsetof(FSTRUCT_LevelMusicSettings, ExplorationMusic_22_A0FB1E3346C45AFBC4F796AD0526402B) == 0x000000, "Member 'FSTRUCT_LevelMusicSettings::ExplorationMusic_22_A0FB1E3346C45AFBC4F796AD0526402B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LevelMusicSettings, CombatMusic_18_C00557B046ECEE43CC9167AD34BBB0BE) == 0x000028, "Member 'FSTRUCT_LevelMusicSettings::CombatMusic_18_C00557B046ECEE43CC9167AD34BBB0BE' has a wrong offset!");
static_assert(offsetof(FSTRUCT_LevelMusicSettings, SneakMusic_17_051A273543A5181572EBE7A112D714B0) == 0x000050, "Member 'FSTRUCT_LevelMusicSettings::SneakMusic_17_051A273543A5181572EBE7A112D714B0' has a wrong offset!");

}

