#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_EnemyTemplate

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_EnemyTemplate.STRUCT_EnemyTemplate
// 0x000C (0x000C - 0x0000)
struct FSTRUCT_EnemyTemplate final
{
public:
	int32                                         ResistOrganic_2_363E23BB4630CDA6F67810A43E0916D0;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResistMagnetic_4_E6E968624F00230C00981AB2A9C2318C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlertnessPercentage_9_90EC51A44870712A9E5B79A44524A966; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_EnemyTemplate) == 0x000004, "Wrong alignment on FSTRUCT_EnemyTemplate");
static_assert(sizeof(FSTRUCT_EnemyTemplate) == 0x00000C, "Wrong size on FSTRUCT_EnemyTemplate");
static_assert(offsetof(FSTRUCT_EnemyTemplate, ResistOrganic_2_363E23BB4630CDA6F67810A43E0916D0) == 0x000000, "Member 'FSTRUCT_EnemyTemplate::ResistOrganic_2_363E23BB4630CDA6F67810A43E0916D0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyTemplate, ResistMagnetic_4_E6E968624F00230C00981AB2A9C2318C) == 0x000004, "Member 'FSTRUCT_EnemyTemplate::ResistMagnetic_4_E6E968624F00230C00981AB2A9C2318C' has a wrong offset!");
static_assert(offsetof(FSTRUCT_EnemyTemplate, AlertnessPercentage_9_90EC51A44870712A9E5B79A44524A966) == 0x000008, "Member 'FSTRUCT_EnemyTemplate::AlertnessPercentage_9_90EC51A44870712A9E5B79A44524A966' has a wrong offset!");

}

