#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_CharacterAudioParams

#include "Basic.hpp"

#include "ENUM_AudioVocalizationType_structs.hpp"
#include "ENUM_AudioFoleyType_structs.hpp"
#include "ENUM_AudioFootstepType_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_CharacterAudioParams.STRUCT_CharacterAudioParams
// 0x0003 (0x0003 - 0x0000)
struct FSTRUCT_CharacterAudioParams final
{
public:
	ENUM_AudioVocalizationType                    VocalizationType_7_7B08FC59420DF5437A73EFB0AC520FA0; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_AudioFootstepType                        FootstepType_2_128CFD264EBFA96FE96917B4DFD579EF;   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_AudioFoleyType                           FoleyType_8_CF09A6094910A1F00FE801B52673C498;      // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_CharacterAudioParams) == 0x000001, "Wrong alignment on FSTRUCT_CharacterAudioParams");
static_assert(sizeof(FSTRUCT_CharacterAudioParams) == 0x000003, "Wrong size on FSTRUCT_CharacterAudioParams");
static_assert(offsetof(FSTRUCT_CharacterAudioParams, VocalizationType_7_7B08FC59420DF5437A73EFB0AC520FA0) == 0x000000, "Member 'FSTRUCT_CharacterAudioParams::VocalizationType_7_7B08FC59420DF5437A73EFB0AC520FA0' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterAudioParams, FootstepType_2_128CFD264EBFA96FE96917B4DFD579EF) == 0x000001, "Member 'FSTRUCT_CharacterAudioParams::FootstepType_2_128CFD264EBFA96FE96917B4DFD579EF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_CharacterAudioParams, FoleyType_8_CF09A6094910A1F00FE801B52673C498) == 0x000002, "Member 'FSTRUCT_CharacterAudioParams::FoleyType_8_CF09A6094910A1F00FE801B52673C498' has a wrong offset!");

}

