#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_WeaponRecoilTemplate

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_WeaponRecoilTemplate.STRUCT_WeaponRecoilTemplate
// 0x0018 (0x0018 - 0x0000)
struct FSTRUCT_WeaponRecoilTemplate final
{
public:
	float                                         MaxSpreadHalfAngle_6_B95CAA024BB36D9A1B30A28BA6794F3D; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultSpreadPercentagePerAttack_15_D593DDCA4DACF83FC84D2A88D05DDFEC; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRecoilPitch_10_CF100FAD489505222731ABB645551D11; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultRecoilPercentagePerAttack_16_D49FF7FD4307FFB63DF130A7991A8E65; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultRecoilCorrectionDelay_20_0B4612D94CA777098423A89761C58E9A; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpreadCorrectionSpeed_23_8EC2FB1047AF97DA60D16C923010046E; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_WeaponRecoilTemplate) == 0x000004, "Wrong alignment on FSTRUCT_WeaponRecoilTemplate");
static_assert(sizeof(FSTRUCT_WeaponRecoilTemplate) == 0x000018, "Wrong size on FSTRUCT_WeaponRecoilTemplate");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, MaxSpreadHalfAngle_6_B95CAA024BB36D9A1B30A28BA6794F3D) == 0x000000, "Member 'FSTRUCT_WeaponRecoilTemplate::MaxSpreadHalfAngle_6_B95CAA024BB36D9A1B30A28BA6794F3D' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, DefaultSpreadPercentagePerAttack_15_D593DDCA4DACF83FC84D2A88D05DDFEC) == 0x000004, "Member 'FSTRUCT_WeaponRecoilTemplate::DefaultSpreadPercentagePerAttack_15_D593DDCA4DACF83FC84D2A88D05DDFEC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, MaxRecoilPitch_10_CF100FAD489505222731ABB645551D11) == 0x000008, "Member 'FSTRUCT_WeaponRecoilTemplate::MaxRecoilPitch_10_CF100FAD489505222731ABB645551D11' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, DefaultRecoilPercentagePerAttack_16_D49FF7FD4307FFB63DF130A7991A8E65) == 0x00000C, "Member 'FSTRUCT_WeaponRecoilTemplate::DefaultRecoilPercentagePerAttack_16_D49FF7FD4307FFB63DF130A7991A8E65' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, DefaultRecoilCorrectionDelay_20_0B4612D94CA777098423A89761C58E9A) == 0x000010, "Member 'FSTRUCT_WeaponRecoilTemplate::DefaultRecoilCorrectionDelay_20_0B4612D94CA777098423A89761C58E9A' has a wrong offset!");
static_assert(offsetof(FSTRUCT_WeaponRecoilTemplate, SpreadCorrectionSpeed_23_8EC2FB1047AF97DA60D16C923010046E) == 0x000014, "Member 'FSTRUCT_WeaponRecoilTemplate::SpreadCorrectionSpeed_23_8EC2FB1047AF97DA60D16C923010046E' has a wrong offset!");

}

