#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MissionDifficultySettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MissionDifficultySettings.STRUCT_MissionDifficultySettings
// 0x0008 (0x0008 - 0x0000)
struct FSTRUCT_MissionDifficultySettings final
{
public:
	int32                                         CountdownMinutes_7_DE8E51174209E351DD67E58A14C0A3EC; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOriginalRespawnMechanics_6_2A77260545C71ED7D7749C80580327E9; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanDropStoryItems_9_1DA5D7054F8429AE752234BE7E9F2F9B; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RandomizeKeycodes_11_F7F93A814634557461D1BA80E4BB1C13; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSTRUCT_MissionDifficultySettings) == 0x000004, "Wrong alignment on FSTRUCT_MissionDifficultySettings");
static_assert(sizeof(FSTRUCT_MissionDifficultySettings) == 0x000008, "Wrong size on FSTRUCT_MissionDifficultySettings");
static_assert(offsetof(FSTRUCT_MissionDifficultySettings, CountdownMinutes_7_DE8E51174209E351DD67E58A14C0A3EC) == 0x000000, "Member 'FSTRUCT_MissionDifficultySettings::CountdownMinutes_7_DE8E51174209E351DD67E58A14C0A3EC' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MissionDifficultySettings, UseOriginalRespawnMechanics_6_2A77260545C71ED7D7749C80580327E9) == 0x000004, "Member 'FSTRUCT_MissionDifficultySettings::UseOriginalRespawnMechanics_6_2A77260545C71ED7D7749C80580327E9' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MissionDifficultySettings, CanDropStoryItems_9_1DA5D7054F8429AE752234BE7E9F2F9B) == 0x000005, "Member 'FSTRUCT_MissionDifficultySettings::CanDropStoryItems_9_1DA5D7054F8429AE752234BE7E9F2F9B' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MissionDifficultySettings, RandomizeKeycodes_11_F7F93A814634557461D1BA80E4BB1C13) == 0x000006, "Member 'FSTRUCT_MissionDifficultySettings::RandomizeKeycodes_11_F7F93A814634557461D1BA80E4BB1C13' has a wrong offset!");

}

