#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MediaObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MediaObject.STRUCT_MediaObject
// 0x0080 (0x0080 - 0x0000)
struct FSTRUCT_MediaObject final
{
public:
	TSoftObjectPtr<class USoundCue>               AudioCue_26_7F2B07E447E33B01C0ED599D726CDA17;      // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Speaker_4_D424542A4A6DB7361A5FD389A6F73675;        // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   Subject_9_6DC3A64B450FF2D50757BB900EBE6B62;        // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   TranscriptionMessage_25_FDDDCB0A42704969906FCB9AD17B0EF5; // 0x0050(0x0018)(Edit, BlueprintVisible)
	struct FDateTime                              Date_20_4EE0A20A43B9579D90FC4A82CC173DAF;          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Level_29_00CFE57349BA786D99A807B326F6B56C;         // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FSTRUCT_MediaObject) == 0x000008, "Wrong alignment on FSTRUCT_MediaObject");
static_assert(sizeof(FSTRUCT_MediaObject) == 0x000080, "Wrong size on FSTRUCT_MediaObject");
static_assert(offsetof(FSTRUCT_MediaObject, AudioCue_26_7F2B07E447E33B01C0ED599D726CDA17) == 0x000000, "Member 'FSTRUCT_MediaObject::AudioCue_26_7F2B07E447E33B01C0ED599D726CDA17' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MediaObject, Speaker_4_D424542A4A6DB7361A5FD389A6F73675) == 0x000028, "Member 'FSTRUCT_MediaObject::Speaker_4_D424542A4A6DB7361A5FD389A6F73675' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MediaObject, Subject_9_6DC3A64B450FF2D50757BB900EBE6B62) == 0x000038, "Member 'FSTRUCT_MediaObject::Subject_9_6DC3A64B450FF2D50757BB900EBE6B62' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MediaObject, TranscriptionMessage_25_FDDDCB0A42704969906FCB9AD17B0EF5) == 0x000050, "Member 'FSTRUCT_MediaObject::TranscriptionMessage_25_FDDDCB0A42704969906FCB9AD17B0EF5' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MediaObject, Date_20_4EE0A20A43B9579D90FC4A82CC173DAF) == 0x000068, "Member 'FSTRUCT_MediaObject::Date_20_4EE0A20A43B9579D90FC4A82CC173DAF' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MediaObject, Level_29_00CFE57349BA786D99A807B326F6B56C) == 0x000070, "Member 'FSTRUCT_MediaObject::Level_29_00CFE57349BA786D99A807B326F6B56C' has a wrong offset!");

}

