#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_MoveControlParams

#include "Basic.hpp"

#include "ENUM_MoveControlType_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_LookControlType_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_MoveControlParams.STRUCT_MoveControlParams
// 0x0028 (0x0028 - 0x0000)
struct FSTRUCT_MoveControlParams final
{
public:
	ENUM_MoveControlType                          MoveControlType_26_4E32391240D169D1798603A004577E16; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveVector_27_008F67A0469192DA78CAA3A333E1637F;    // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LookControlType                          LookControlType_30_298EF40C42460D5D07D2A7A53FB71848; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookVector_33_F4FAE40F4CB7CB69732EBA9FAF813980;    // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InputScale_9_4C4B25A1427B667D64FCA087C5C11074;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseGravity_18_00669BFF469E2A436B43AB91AFAC15C1;    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseCollision_21_94A9C54C4C6F0693CE2AFD93C01E0181;  // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowMoveActions_38_CFEA4873498CFBA2348076AB2A026441; // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 MoveMode_24_E078B52542D711FAE4D32EBA0CEFE6B5;      // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_MoveControlParams) == 0x000004, "Wrong alignment on FSTRUCT_MoveControlParams");
static_assert(sizeof(FSTRUCT_MoveControlParams) == 0x000028, "Wrong size on FSTRUCT_MoveControlParams");
static_assert(offsetof(FSTRUCT_MoveControlParams, MoveControlType_26_4E32391240D169D1798603A004577E16) == 0x000000, "Member 'FSTRUCT_MoveControlParams::MoveControlType_26_4E32391240D169D1798603A004577E16' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, MoveVector_27_008F67A0469192DA78CAA3A333E1637F) == 0x000004, "Member 'FSTRUCT_MoveControlParams::MoveVector_27_008F67A0469192DA78CAA3A333E1637F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, LookControlType_30_298EF40C42460D5D07D2A7A53FB71848) == 0x000010, "Member 'FSTRUCT_MoveControlParams::LookControlType_30_298EF40C42460D5D07D2A7A53FB71848' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, LookVector_33_F4FAE40F4CB7CB69732EBA9FAF813980) == 0x000014, "Member 'FSTRUCT_MoveControlParams::LookVector_33_F4FAE40F4CB7CB69732EBA9FAF813980' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, InputScale_9_4C4B25A1427B667D64FCA087C5C11074) == 0x000020, "Member 'FSTRUCT_MoveControlParams::InputScale_9_4C4B25A1427B667D64FCA087C5C11074' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, UseGravity_18_00669BFF469E2A436B43AB91AFAC15C1) == 0x000024, "Member 'FSTRUCT_MoveControlParams::UseGravity_18_00669BFF469E2A436B43AB91AFAC15C1' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, UseCollision_21_94A9C54C4C6F0693CE2AFD93C01E0181) == 0x000025, "Member 'FSTRUCT_MoveControlParams::UseCollision_21_94A9C54C4C6F0693CE2AFD93C01E0181' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, AllowMoveActions_38_CFEA4873498CFBA2348076AB2A026441) == 0x000026, "Member 'FSTRUCT_MoveControlParams::AllowMoveActions_38_CFEA4873498CFBA2348076AB2A026441' has a wrong offset!");
static_assert(offsetof(FSTRUCT_MoveControlParams, MoveMode_24_E078B52542D711FAE4D32EBA0CEFE6B5) == 0x000027, "Member 'FSTRUCT_MoveControlParams::MoveMode_24_E078B52542D711FAE4D32EBA0CEFE6B5' has a wrong offset!");

}

