#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STRUCT_BadgeInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STRUCT_BadgeInfo.STRUCT_BadgeInfo
// 0x0060 (0x0060 - 0x0000)
struct FSTRUCT_BadgeInfo final
{
public:
	class FString                                 FirstName_27_5BAC5FA842AC64BBE8A1C8AE80FEB55F;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MiddleOrNickname_28_AED129464DBD0D3D71468B8445E781C6; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LastName_29_543948614C00E7C1673069AE25248640;      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Title_30_A97994CC4A779A5D778D91851D6D314E;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ETextGender                                   Gender_23_1F5368404C04A1A43CD23AB332638ED3;        // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AssociatedClass_17_35B9A1B14FC1950E89D2D9B980C4923E; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Notes_20_5293AB1F4704B41188DAC389E77B5720;         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSTRUCT_BadgeInfo) == 0x000008, "Wrong alignment on FSTRUCT_BadgeInfo");
static_assert(sizeof(FSTRUCT_BadgeInfo) == 0x000060, "Wrong size on FSTRUCT_BadgeInfo");
static_assert(offsetof(FSTRUCT_BadgeInfo, FirstName_27_5BAC5FA842AC64BBE8A1C8AE80FEB55F) == 0x000000, "Member 'FSTRUCT_BadgeInfo::FirstName_27_5BAC5FA842AC64BBE8A1C8AE80FEB55F' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, MiddleOrNickname_28_AED129464DBD0D3D71468B8445E781C6) == 0x000010, "Member 'FSTRUCT_BadgeInfo::MiddleOrNickname_28_AED129464DBD0D3D71468B8445E781C6' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, LastName_29_543948614C00E7C1673069AE25248640) == 0x000020, "Member 'FSTRUCT_BadgeInfo::LastName_29_543948614C00E7C1673069AE25248640' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, Title_30_A97994CC4A779A5D778D91851D6D314E) == 0x000030, "Member 'FSTRUCT_BadgeInfo::Title_30_A97994CC4A779A5D778D91851D6D314E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, Gender_23_1F5368404C04A1A43CD23AB332638ED3) == 0x000040, "Member 'FSTRUCT_BadgeInfo::Gender_23_1F5368404C04A1A43CD23AB332638ED3' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, AssociatedClass_17_35B9A1B14FC1950E89D2D9B980C4923E) == 0x000048, "Member 'FSTRUCT_BadgeInfo::AssociatedClass_17_35B9A1B14FC1950E89D2D9B980C4923E' has a wrong offset!");
static_assert(offsetof(FSTRUCT_BadgeInfo, Notes_20_5293AB1F4704B41188DAC389E77B5720) == 0x000050, "Member 'FSTRUCT_BadgeInfo::Notes_20_5293AB1F4704B41188DAC389E77B5720' has a wrong offset!");

}

