#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SystemReShock

#include "Basic.hpp"

#include "SystemReShock_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "LevelVoxelization_structs.hpp"


namespace SDK::Params
{

// Function SystemReShock.PerspectiveMeshWidget.ConvertToDynamicMaterialInstance
// 0x0010 (0x0010 - 0x0000)
struct PerspectiveMeshWidget_ConvertToDynamicMaterialInstance final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_ConvertToDynamicMaterialInstance) == 0x000008, "Wrong alignment on PerspectiveMeshWidget_ConvertToDynamicMaterialInstance");
static_assert(sizeof(PerspectiveMeshWidget_ConvertToDynamicMaterialInstance) == 0x000010, "Wrong size on PerspectiveMeshWidget_ConvertToDynamicMaterialInstance");
static_assert(offsetof(PerspectiveMeshWidget_ConvertToDynamicMaterialInstance, MaterialIndex) == 0x000000, "Member 'PerspectiveMeshWidget_ConvertToDynamicMaterialInstance::MaterialIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_ConvertToDynamicMaterialInstance, ReturnValue) == 0x000008, "Member 'PerspectiveMeshWidget_ConvertToDynamicMaterialInstance::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.SetMaterial
// 0x0010 (0x0010 - 0x0000)
struct PerspectiveMeshWidget_SetMaterial final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_SetMaterial) == 0x000008, "Wrong alignment on PerspectiveMeshWidget_SetMaterial");
static_assert(sizeof(PerspectiveMeshWidget_SetMaterial) == 0x000010, "Wrong size on PerspectiveMeshWidget_SetMaterial");
static_assert(offsetof(PerspectiveMeshWidget_SetMaterial, MaterialIndex) == 0x000000, "Member 'PerspectiveMeshWidget_SetMaterial::MaterialIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_SetMaterial, Material) == 0x000008, "Member 'PerspectiveMeshWidget_SetMaterial::Material' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.SetSurfaceBlendAmount
// 0x0004 (0x0004 - 0x0000)
struct PerspectiveMeshWidget_SetSurfaceBlendAmount final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_SetSurfaceBlendAmount) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_SetSurfaceBlendAmount");
static_assert(sizeof(PerspectiveMeshWidget_SetSurfaceBlendAmount) == 0x000004, "Wrong size on PerspectiveMeshWidget_SetSurfaceBlendAmount");
static_assert(offsetof(PerspectiveMeshWidget_SetSurfaceBlendAmount, Amount) == 0x000000, "Member 'PerspectiveMeshWidget_SetSurfaceBlendAmount::Amount' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.SetVertexColors
// 0x0004 (0x0004 - 0x0000)
struct PerspectiveMeshWidget_SetVertexColors final
{
public:
	struct FColor                                 NewColor;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_SetVertexColors) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_SetVertexColors");
static_assert(sizeof(PerspectiveMeshWidget_SetVertexColors) == 0x000004, "Wrong size on PerspectiveMeshWidget_SetVertexColors");
static_assert(offsetof(PerspectiveMeshWidget_SetVertexColors, NewColor) == 0x000000, "Member 'PerspectiveMeshWidget_SetVertexColors::NewColor' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetMaterial
// 0x0010 (0x0010 - 0x0000)
struct PerspectiveMeshWidget_GetMaterial final
{
public:
	int32                                         MaterialIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetMaterial) == 0x000008, "Wrong alignment on PerspectiveMeshWidget_GetMaterial");
static_assert(sizeof(PerspectiveMeshWidget_GetMaterial) == 0x000010, "Wrong size on PerspectiveMeshWidget_GetMaterial");
static_assert(offsetof(PerspectiveMeshWidget_GetMaterial, MaterialIndex) == 0x000000, "Member 'PerspectiveMeshWidget_GetMaterial::MaterialIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetMaterial, ReturnValue) == 0x000008, "Member 'PerspectiveMeshWidget_GetMaterial::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetNearestTriangleIndexToWindowPoint
// 0x0020 (0x0020 - 0x0000)
struct PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint final
{
public:
	int32                                         SubMeshIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WindowPoint;                                       // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutBarycentricCoords;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDistance;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint");
static_assert(sizeof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint) == 0x000020, "Wrong size on PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint, SubMeshIndex) == 0x000000, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint::SubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint, WindowPoint) == 0x000004, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint::WindowPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint, OutBarycentricCoords) == 0x00000C, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint::OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint, OutDistance) == 0x000018, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint::OutDistance' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint, ReturnValue) == 0x00001C, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetNearestTriangleIndexToWindowPointForAnyMesh
// 0x0020 (0x0020 - 0x0000)
struct PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh final
{
public:
	struct FVector2D                              WindowPoint;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSubMeshIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutBarycentricCoords;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDistance;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh");
static_assert(sizeof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh) == 0x000020, "Wrong size on PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh, WindowPoint) == 0x000000, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh::WindowPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh, OutSubMeshIndex) == 0x000008, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh::OutSubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh, OutBarycentricCoords) == 0x00000C, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh::OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh, OutDistance) == 0x000018, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh::OutDistance' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh, ReturnValue) == 0x00001C, "Member 'PerspectiveMeshWidget_GetNearestTriangleIndexToWindowPointForAnyMesh::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetProjectedWindowBounds
// 0x0014 (0x0014 - 0x0000)
struct PerspectiveMeshWidget_GetProjectedWindowBounds final
{
public:
	struct FBox2D                                 ReturnValue;                                       // 0x0000(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetProjectedWindowBounds) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetProjectedWindowBounds");
static_assert(sizeof(PerspectiveMeshWidget_GetProjectedWindowBounds) == 0x000014, "Wrong size on PerspectiveMeshWidget_GetProjectedWindowBounds");
static_assert(offsetof(PerspectiveMeshWidget_GetProjectedWindowBounds, ReturnValue) == 0x000000, "Member 'PerspectiveMeshWidget_GetProjectedWindowBounds::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetSubmeshCount
// 0x0004 (0x0004 - 0x0000)
struct PerspectiveMeshWidget_GetSubmeshCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetSubmeshCount) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetSubmeshCount");
static_assert(sizeof(PerspectiveMeshWidget_GetSubmeshCount) == 0x000004, "Wrong size on PerspectiveMeshWidget_GetSubmeshCount");
static_assert(offsetof(PerspectiveMeshWidget_GetSubmeshCount, ReturnValue) == 0x000000, "Member 'PerspectiveMeshWidget_GetSubmeshCount::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetSurfaceBlendAmount
// 0x0004 (0x0004 - 0x0000)
struct PerspectiveMeshWidget_GetSurfaceBlendAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetSurfaceBlendAmount) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetSurfaceBlendAmount");
static_assert(sizeof(PerspectiveMeshWidget_GetSurfaceBlendAmount) == 0x000004, "Wrong size on PerspectiveMeshWidget_GetSurfaceBlendAmount");
static_assert(offsetof(PerspectiveMeshWidget_GetSurfaceBlendAmount, ReturnValue) == 0x000000, "Member 'PerspectiveMeshWidget_GetSurfaceBlendAmount::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetTextureCoordinatesForTrianglePoint
// 0x0020 (0x0020 - 0x0000)
struct PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint final
{
public:
	int32                                         SubMeshIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriangleIndex;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TexCoordIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BarycentricCoords;                                 // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint");
static_assert(sizeof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint) == 0x000020, "Wrong size on PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint");
static_assert(offsetof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint, SubMeshIndex) == 0x000000, "Member 'PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint::SubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint, TriangleIndex) == 0x000004, "Member 'PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint::TriangleIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint, TexCoordIndex) == 0x000008, "Member 'PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint::TexCoordIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint, BarycentricCoords) == 0x00000C, "Member 'PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint::BarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint, ReturnValue) == 0x000018, "Member 'PerspectiveMeshWidget_GetTextureCoordinatesForTrianglePoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetTriangleIndexAtWindowPoint
// 0x001C (0x001C - 0x0000)
struct PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint final
{
public:
	int32                                         SubMeshIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WindowPoint;                                       // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutBarycentricCoords;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint");
static_assert(sizeof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint) == 0x00001C, "Wrong size on PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint, SubMeshIndex) == 0x000000, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint::SubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint, WindowPoint) == 0x000004, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint::WindowPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint, OutBarycentricCoords) == 0x00000C, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint::OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint, ReturnValue) == 0x000018, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetTriangleIndexAtWindowPointForAnyMesh
// 0x001C (0x001C - 0x0000)
struct PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh final
{
public:
	struct FVector2D                              WindowPoint;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSubMeshIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutBarycentricCoords;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh");
static_assert(sizeof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh) == 0x00001C, "Wrong size on PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh, WindowPoint) == 0x000000, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh::WindowPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh, OutSubMeshIndex) == 0x000008, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh::OutSubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh, OutBarycentricCoords) == 0x00000C, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh::OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh, ReturnValue) == 0x000018, "Member 'PerspectiveMeshWidget_GetTriangleIndexAtWindowPointForAnyMesh::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetUnprojectedTrianglePoint
// 0x001C (0x001C - 0x0000)
struct PerspectiveMeshWidget_GetUnprojectedTrianglePoint final
{
public:
	int32                                         SubMeshIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriangleIndex;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BarycentricCoords;                                 // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetUnprojectedTrianglePoint");
static_assert(sizeof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint) == 0x00001C, "Wrong size on PerspectiveMeshWidget_GetUnprojectedTrianglePoint");
static_assert(offsetof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint, SubMeshIndex) == 0x000000, "Member 'PerspectiveMeshWidget_GetUnprojectedTrianglePoint::SubMeshIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint, TriangleIndex) == 0x000004, "Member 'PerspectiveMeshWidget_GetUnprojectedTrianglePoint::TriangleIndex' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint, BarycentricCoords) == 0x000008, "Member 'PerspectiveMeshWidget_GetUnprojectedTrianglePoint::BarycentricCoords' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetUnprojectedTrianglePoint, ReturnValue) == 0x000014, "Member 'PerspectiveMeshWidget_GetUnprojectedTrianglePoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetWidgetOffsetFromWindowPoint
// 0x0014 (0x0014 - 0x0000)
struct PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint final
{
public:
	struct FVector2D                              WindowPoint;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WidgetOffset;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromCenter;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNearest;                                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint");
static_assert(sizeof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint) == 0x000014, "Wrong size on PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint");
static_assert(offsetof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint, WindowPoint) == 0x000000, "Member 'PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint::WindowPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint, WidgetOffset) == 0x000008, "Member 'PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint::WidgetOffset' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint, bFromCenter) == 0x000010, "Member 'PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint::bFromCenter' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint, bNearest) == 0x000011, "Member 'PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint::bNearest' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint, ReturnValue) == 0x000012, "Member 'PerspectiveMeshWidget_GetWidgetOffsetFromWindowPoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.PerspectiveMeshWidget.GetWindowPointFromScreenPoint
// 0x0010 (0x0010 - 0x0000)
struct PerspectiveMeshWidget_GetWindowPointFromScreenPoint final
{
public:
	struct FVector2D                              ScreenPoint;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerspectiveMeshWidget_GetWindowPointFromScreenPoint) == 0x000004, "Wrong alignment on PerspectiveMeshWidget_GetWindowPointFromScreenPoint");
static_assert(sizeof(PerspectiveMeshWidget_GetWindowPointFromScreenPoint) == 0x000010, "Wrong size on PerspectiveMeshWidget_GetWindowPointFromScreenPoint");
static_assert(offsetof(PerspectiveMeshWidget_GetWindowPointFromScreenPoint, ScreenPoint) == 0x000000, "Member 'PerspectiveMeshWidget_GetWindowPointFromScreenPoint::ScreenPoint' has a wrong offset!");
static_assert(offsetof(PerspectiveMeshWidget_GetWindowPointFromScreenPoint, ReturnValue) == 0x000008, "Member 'PerspectiveMeshWidget_GetWindowPointFromScreenPoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.ConvertBorderToDynamicMaterialInstance
// 0x0010 (0x0010 - 0x0000)
struct GridMeshWidget_ConvertBorderToDynamicMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               OutCornerMaterial;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_ConvertBorderToDynamicMaterialInstance) == 0x000008, "Wrong alignment on GridMeshWidget_ConvertBorderToDynamicMaterialInstance");
static_assert(sizeof(GridMeshWidget_ConvertBorderToDynamicMaterialInstance) == 0x000010, "Wrong size on GridMeshWidget_ConvertBorderToDynamicMaterialInstance");
static_assert(offsetof(GridMeshWidget_ConvertBorderToDynamicMaterialInstance, OutCornerMaterial) == 0x000000, "Member 'GridMeshWidget_ConvertBorderToDynamicMaterialInstance::OutCornerMaterial' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_ConvertBorderToDynamicMaterialInstance, ReturnValue) == 0x000008, "Member 'GridMeshWidget_ConvertBorderToDynamicMaterialInstance::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetBorderColor
// 0x0004 (0x0004 - 0x0000)
struct GridMeshWidget_SetBorderColor final
{
public:
	struct FColor                                 Color_0;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetBorderColor) == 0x000004, "Wrong alignment on GridMeshWidget_SetBorderColor");
static_assert(sizeof(GridMeshWidget_SetBorderColor) == 0x000004, "Wrong size on GridMeshWidget_SetBorderColor");
static_assert(offsetof(GridMeshWidget_SetBorderColor, Color_0) == 0x000000, "Member 'GridMeshWidget_SetBorderColor::Color_0' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetCellSize
// 0x0008 (0x0008 - 0x0000)
struct GridMeshWidget_SetCellSize final
{
public:
	struct FIntPoint                              InCellSize;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetCellSize) == 0x000004, "Wrong alignment on GridMeshWidget_SetCellSize");
static_assert(sizeof(GridMeshWidget_SetCellSize) == 0x000008, "Wrong size on GridMeshWidget_SetCellSize");
static_assert(offsetof(GridMeshWidget_SetCellSize, InCellSize) == 0x000000, "Member 'GridMeshWidget_SetCellSize::InCellSize' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetCellUVDimensions
// 0x0008 (0x0008 - 0x0000)
struct GridMeshWidget_SetCellUVDimensions final
{
public:
	struct FVector2D                              InCellUVDimensions;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetCellUVDimensions) == 0x000004, "Wrong alignment on GridMeshWidget_SetCellUVDimensions");
static_assert(sizeof(GridMeshWidget_SetCellUVDimensions) == 0x000008, "Wrong size on GridMeshWidget_SetCellUVDimensions");
static_assert(offsetof(GridMeshWidget_SetCellUVDimensions, InCellUVDimensions) == 0x000000, "Member 'GridMeshWidget_SetCellUVDimensions::InCellUVDimensions' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetColor
// 0x0004 (0x0004 - 0x0000)
struct GridMeshWidget_SetColor final
{
public:
	struct FColor                                 Color_0;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetColor) == 0x000004, "Wrong alignment on GridMeshWidget_SetColor");
static_assert(sizeof(GridMeshWidget_SetColor) == 0x000004, "Wrong size on GridMeshWidget_SetColor");
static_assert(offsetof(GridMeshWidget_SetColor, Color_0) == 0x000000, "Member 'GridMeshWidget_SetColor::Color_0' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetFlipVerticalLayout
// 0x0001 (0x0001 - 0x0000)
struct GridMeshWidget_SetFlipVerticalLayout final
{
public:
	bool                                          bInFlipVerticalLayout;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetFlipVerticalLayout) == 0x000001, "Wrong alignment on GridMeshWidget_SetFlipVerticalLayout");
static_assert(sizeof(GridMeshWidget_SetFlipVerticalLayout) == 0x000001, "Wrong size on GridMeshWidget_SetFlipVerticalLayout");
static_assert(offsetof(GridMeshWidget_SetFlipVerticalLayout, bInFlipVerticalLayout) == 0x000000, "Member 'GridMeshWidget_SetFlipVerticalLayout::bInFlipVerticalLayout' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.SetGridSize
// 0x0008 (0x0008 - 0x0000)
struct GridMeshWidget_SetGridSize final
{
public:
	struct FIntPoint                              GridSize;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_SetGridSize) == 0x000004, "Wrong alignment on GridMeshWidget_SetGridSize");
static_assert(sizeof(GridMeshWidget_SetGridSize) == 0x000008, "Wrong size on GridMeshWidget_SetGridSize");
static_assert(offsetof(GridMeshWidget_SetGridSize, GridSize) == 0x000000, "Member 'GridMeshWidget_SetGridSize::GridSize' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetBorderSize
// 0x0004 (0x0004 - 0x0000)
struct GridMeshWidget_GetBorderSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_GetBorderSize) == 0x000004, "Wrong alignment on GridMeshWidget_GetBorderSize");
static_assert(sizeof(GridMeshWidget_GetBorderSize) == 0x000004, "Wrong size on GridMeshWidget_GetBorderSize");
static_assert(offsetof(GridMeshWidget_GetBorderSize, ReturnValue) == 0x000000, "Member 'GridMeshWidget_GetBorderSize::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetDoubleBorderSize
// 0x0004 (0x0004 - 0x0000)
struct GridMeshWidget_GetDoubleBorderSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_GetDoubleBorderSize) == 0x000004, "Wrong alignment on GridMeshWidget_GetDoubleBorderSize");
static_assert(sizeof(GridMeshWidget_GetDoubleBorderSize) == 0x000004, "Wrong size on GridMeshWidget_GetDoubleBorderSize");
static_assert(offsetof(GridMeshWidget_GetDoubleBorderSize, ReturnValue) == 0x000000, "Member 'GridMeshWidget_GetDoubleBorderSize::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetGridCoordinatesFromWindowPoint
// 0x001C (0x001C - 0x0000)
struct GridMeshWidget_GetGridCoordinatesFromWindowPoint final
{
public:
	struct FVector2D                              WindowPoint;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CursorGridOffset;                                  // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              GridCoords;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GridMeshWidget_GetGridCoordinatesFromWindowPoint) == 0x000004, "Wrong alignment on GridMeshWidget_GetGridCoordinatesFromWindowPoint");
static_assert(sizeof(GridMeshWidget_GetGridCoordinatesFromWindowPoint) == 0x00001C, "Wrong size on GridMeshWidget_GetGridCoordinatesFromWindowPoint");
static_assert(offsetof(GridMeshWidget_GetGridCoordinatesFromWindowPoint, WindowPoint) == 0x000000, "Member 'GridMeshWidget_GetGridCoordinatesFromWindowPoint::WindowPoint' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetGridCoordinatesFromWindowPoint, CursorGridOffset) == 0x000008, "Member 'GridMeshWidget_GetGridCoordinatesFromWindowPoint::CursorGridOffset' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetGridCoordinatesFromWindowPoint, GridCoords) == 0x000010, "Member 'GridMeshWidget_GetGridCoordinatesFromWindowPoint::GridCoords' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetGridCoordinatesFromWindowPoint, ReturnValue) == 0x000018, "Member 'GridMeshWidget_GetGridCoordinatesFromWindowPoint::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetProjectedCellLocationFromGridCoordinates
// 0x001C (0x001C - 0x0000)
struct GridMeshWidget_GetProjectedCellLocationFromGridCoordinates final
{
public:
	struct FIntPoint                              GridCoords;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CursorGridOffset;                                  // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OutProjectedLocation;                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates) == 0x000004, "Wrong alignment on GridMeshWidget_GetProjectedCellLocationFromGridCoordinates");
static_assert(sizeof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates) == 0x00001C, "Wrong size on GridMeshWidget_GetProjectedCellLocationFromGridCoordinates");
static_assert(offsetof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates, GridCoords) == 0x000000, "Member 'GridMeshWidget_GetProjectedCellLocationFromGridCoordinates::GridCoords' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates, CursorGridOffset) == 0x000008, "Member 'GridMeshWidget_GetProjectedCellLocationFromGridCoordinates::CursorGridOffset' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates, OutProjectedLocation) == 0x000010, "Member 'GridMeshWidget_GetProjectedCellLocationFromGridCoordinates::OutProjectedLocation' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetProjectedCellLocationFromGridCoordinates, ReturnValue) == 0x000018, "Member 'GridMeshWidget_GetProjectedCellLocationFromGridCoordinates::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetWidgetOffsetFromGridCoordinates
// 0x0010 (0x0010 - 0x0000)
struct GridMeshWidget_GetWidgetOffsetFromGridCoordinates final
{
public:
	struct FIntPoint                              GridCoords;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_GetWidgetOffsetFromGridCoordinates) == 0x000004, "Wrong alignment on GridMeshWidget_GetWidgetOffsetFromGridCoordinates");
static_assert(sizeof(GridMeshWidget_GetWidgetOffsetFromGridCoordinates) == 0x000010, "Wrong size on GridMeshWidget_GetWidgetOffsetFromGridCoordinates");
static_assert(offsetof(GridMeshWidget_GetWidgetOffsetFromGridCoordinates, GridCoords) == 0x000000, "Member 'GridMeshWidget_GetWidgetOffsetFromGridCoordinates::GridCoords' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetWidgetOffsetFromGridCoordinates, ReturnValue) == 0x000008, "Member 'GridMeshWidget_GetWidgetOffsetFromGridCoordinates::ReturnValue' has a wrong offset!");

// Function SystemReShock.GridMeshWidget.GetWidgetSizeFromGridSize
// 0x0010 (0x0010 - 0x0000)
struct GridMeshWidget_GetWidgetSizeFromGridSize final
{
public:
	struct FIntPoint                              GridSize;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GridMeshWidget_GetWidgetSizeFromGridSize) == 0x000004, "Wrong alignment on GridMeshWidget_GetWidgetSizeFromGridSize");
static_assert(sizeof(GridMeshWidget_GetWidgetSizeFromGridSize) == 0x000010, "Wrong size on GridMeshWidget_GetWidgetSizeFromGridSize");
static_assert(offsetof(GridMeshWidget_GetWidgetSizeFromGridSize, GridSize) == 0x000000, "Member 'GridMeshWidget_GetWidgetSizeFromGridSize::GridSize' has a wrong offset!");
static_assert(offsetof(GridMeshWidget_GetWidgetSizeFromGridSize, ReturnValue) == 0x000008, "Member 'GridMeshWidget_GetWidgetSizeFromGridSize::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.OnActivateCell
// 0x0020 (0x0020 - 0x0000)
struct LifeSimulation_OnActivateCell final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LifeSimulation_OnActivateCell) == 0x000008, "Wrong alignment on LifeSimulation_OnActivateCell");
static_assert(sizeof(LifeSimulation_OnActivateCell) == 0x000020, "Wrong size on LifeSimulation_OnActivateCell");
static_assert(offsetof(LifeSimulation_OnActivateCell, WallLocation) == 0x000000, "Member 'LifeSimulation_OnActivateCell::WallLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_OnActivateCell, PrimitiveComponent) == 0x000010, "Member 'LifeSimulation_OnActivateCell::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(LifeSimulation_OnActivateCell, ReturnValue) == 0x000018, "Member 'LifeSimulation_OnActivateCell::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.OnDeactivateCell
// 0x0020 (0x0020 - 0x0000)
struct LifeSimulation_OnDeactivateCell final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LifeSimulation_OnDeactivateCell) == 0x000008, "Wrong alignment on LifeSimulation_OnDeactivateCell");
static_assert(sizeof(LifeSimulation_OnDeactivateCell) == 0x000020, "Wrong size on LifeSimulation_OnDeactivateCell");
static_assert(offsetof(LifeSimulation_OnDeactivateCell, WallLocation) == 0x000000, "Member 'LifeSimulation_OnDeactivateCell::WallLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_OnDeactivateCell, PrimitiveComponent) == 0x000010, "Member 'LifeSimulation_OnDeactivateCell::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(LifeSimulation_OnDeactivateCell, ReturnValue) == 0x000018, "Member 'LifeSimulation_OnDeactivateCell::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.ResetSimulation
// 0x0018 (0x0018 - 0x0000)
struct LifeSimulation_ResetSimulation final
{
public:
	class UBatchedLevelVoxelization*              InBatchedLevelVoxelization;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelVoxelizationData*                 InCurrentLevelData;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateCells;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LifeSimulation_ResetSimulation) == 0x000008, "Wrong alignment on LifeSimulation_ResetSimulation");
static_assert(sizeof(LifeSimulation_ResetSimulation) == 0x000018, "Wrong size on LifeSimulation_ResetSimulation");
static_assert(offsetof(LifeSimulation_ResetSimulation, InBatchedLevelVoxelization) == 0x000000, "Member 'LifeSimulation_ResetSimulation::InBatchedLevelVoxelization' has a wrong offset!");
static_assert(offsetof(LifeSimulation_ResetSimulation, InCurrentLevelData) == 0x000008, "Member 'LifeSimulation_ResetSimulation::InCurrentLevelData' has a wrong offset!");
static_assert(offsetof(LifeSimulation_ResetSimulation, bDeactivateCells) == 0x000010, "Member 'LifeSimulation_ResetSimulation::bDeactivateCells' has a wrong offset!");

// Function SystemReShock.LifeSimulation.TryActivateCellAtLocation
// 0x0018 (0x0018 - 0x0000)
struct LifeSimulation_TryActivateCellAtLocation final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinLifetime;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LifeSimulation_TryActivateCellAtLocation) == 0x000004, "Wrong alignment on LifeSimulation_TryActivateCellAtLocation");
static_assert(sizeof(LifeSimulation_TryActivateCellAtLocation) == 0x000018, "Wrong size on LifeSimulation_TryActivateCellAtLocation");
static_assert(offsetof(LifeSimulation_TryActivateCellAtLocation, WallLocation) == 0x000000, "Member 'LifeSimulation_TryActivateCellAtLocation::WallLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_TryActivateCellAtLocation, MinLifetime) == 0x000010, "Member 'LifeSimulation_TryActivateCellAtLocation::MinLifetime' has a wrong offset!");
static_assert(offsetof(LifeSimulation_TryActivateCellAtLocation, ReturnValue) == 0x000014, "Member 'LifeSimulation_TryActivateCellAtLocation::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.UpdateSimulation
// 0x0010 (0x0010 - 0x0000)
struct LifeSimulation_UpdateSimulation final
{
public:
	struct FIntVector                             ObserverLocation;                                  // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_UpdateSimulation) == 0x000004, "Wrong alignment on LifeSimulation_UpdateSimulation");
static_assert(sizeof(LifeSimulation_UpdateSimulation) == 0x000010, "Wrong size on LifeSimulation_UpdateSimulation");
static_assert(offsetof(LifeSimulation_UpdateSimulation, ObserverLocation) == 0x000000, "Member 'LifeSimulation_UpdateSimulation::ObserverLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_UpdateSimulation, DeltaSeconds) == 0x00000C, "Member 'LifeSimulation_UpdateSimulation::DeltaSeconds' has a wrong offset!");

// Function SystemReShock.LifeSimulation.GetCellLifetimeRemaining
// 0x0014 (0x0014 - 0x0000)
struct LifeSimulation_GetCellLifetimeRemaining final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_GetCellLifetimeRemaining) == 0x000004, "Wrong alignment on LifeSimulation_GetCellLifetimeRemaining");
static_assert(sizeof(LifeSimulation_GetCellLifetimeRemaining) == 0x000014, "Wrong size on LifeSimulation_GetCellLifetimeRemaining");
static_assert(offsetof(LifeSimulation_GetCellLifetimeRemaining, WallLocation) == 0x000000, "Member 'LifeSimulation_GetCellLifetimeRemaining::WallLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetCellLifetimeRemaining, ReturnValue) == 0x000010, "Member 'LifeSimulation_GetCellLifetimeRemaining::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.GetCellLocationsWithNeighbors
// 0x0010 (0x0010 - 0x0000)
struct LifeSimulation_GetCellLocationsWithNeighbors final
{
public:
	TArray<struct FVoxelWallLocation>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_GetCellLocationsWithNeighbors) == 0x000008, "Wrong alignment on LifeSimulation_GetCellLocationsWithNeighbors");
static_assert(sizeof(LifeSimulation_GetCellLocationsWithNeighbors) == 0x000010, "Wrong size on LifeSimulation_GetCellLocationsWithNeighbors");
static_assert(offsetof(LifeSimulation_GetCellLocationsWithNeighbors, ReturnValue) == 0x000000, "Member 'LifeSimulation_GetCellLocationsWithNeighbors::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.GetCellNeighborCount
// 0x0014 (0x0014 - 0x0000)
struct LifeSimulation_GetCellNeighborCount final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_GetCellNeighborCount) == 0x000004, "Wrong alignment on LifeSimulation_GetCellNeighborCount");
static_assert(sizeof(LifeSimulation_GetCellNeighborCount) == 0x000014, "Wrong size on LifeSimulation_GetCellNeighborCount");
static_assert(offsetof(LifeSimulation_GetCellNeighborCount, WallLocation) == 0x000000, "Member 'LifeSimulation_GetCellNeighborCount::WallLocation' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetCellNeighborCount, ReturnValue) == 0x000010, "Member 'LifeSimulation_GetCellNeighborCount::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.GetIslandWorldBoundingBoxes
// 0x0028 (0x0028 - 0x0000)
struct LifeSimulation_GetIslandWorldBoundingBoxes final
{
public:
	class UBatchedLevelVoxelization*              BatchedLevelVoxelization;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LevelOffset;                                       // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyActiveIslands;                                // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBox>                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_GetIslandWorldBoundingBoxes) == 0x000008, "Wrong alignment on LifeSimulation_GetIslandWorldBoundingBoxes");
static_assert(sizeof(LifeSimulation_GetIslandWorldBoundingBoxes) == 0x000028, "Wrong size on LifeSimulation_GetIslandWorldBoundingBoxes");
static_assert(offsetof(LifeSimulation_GetIslandWorldBoundingBoxes, BatchedLevelVoxelization) == 0x000000, "Member 'LifeSimulation_GetIslandWorldBoundingBoxes::BatchedLevelVoxelization' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetIslandWorldBoundingBoxes, LevelOffset) == 0x000008, "Member 'LifeSimulation_GetIslandWorldBoundingBoxes::LevelOffset' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetIslandWorldBoundingBoxes, bOnlyActiveIslands) == 0x000014, "Member 'LifeSimulation_GetIslandWorldBoundingBoxes::bOnlyActiveIslands' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetIslandWorldBoundingBoxes, ReturnValue) == 0x000018, "Member 'LifeSimulation_GetIslandWorldBoundingBoxes::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.GetWallComponentByIndex
// 0x0010 (0x0010 - 0x0000)
struct LifeSimulation_GetWallComponentByIndex final
{
public:
	int32                                         ComponentIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LifeSimulation_GetWallComponentByIndex) == 0x000008, "Wrong alignment on LifeSimulation_GetWallComponentByIndex");
static_assert(sizeof(LifeSimulation_GetWallComponentByIndex) == 0x000010, "Wrong size on LifeSimulation_GetWallComponentByIndex");
static_assert(offsetof(LifeSimulation_GetWallComponentByIndex, ComponentIndex) == 0x000000, "Member 'LifeSimulation_GetWallComponentByIndex::ComponentIndex' has a wrong offset!");
static_assert(offsetof(LifeSimulation_GetWallComponentByIndex, ReturnValue) == 0x000008, "Member 'LifeSimulation_GetWallComponentByIndex::ReturnValue' has a wrong offset!");

// Function SystemReShock.LifeSimulation.IsCellActive
// 0x0014 (0x0014 - 0x0000)
struct LifeSimulation_IsCellActive final
{
public:
	struct FVoxelWallLocation                     WallLocation;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LifeSimulation_IsCellActive) == 0x000004, "Wrong alignment on LifeSimulation_IsCellActive");
