#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v2_Maneuver_RangedAttackPosition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_DefaultSkillComboParams_structs.hpp"


namespace SDK::Params
{

// Function TASK_Diego_v2_Maneuver_RangedAttackPosition.TASK_Diego_v2_Maneuver_RangedAttackPosition_C.ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition
// 0x0120 (0x0120 - 0x0000)
struct TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WeightByAngleFromViewpoint_ReturnValue;   // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPredictedTargetLocation_PredictedLocation; // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_FilterByVisibilityToPoint_ReturnValue;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetComboByBehaviorTree_ComboIndex;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_DefaultSkillComboParams        CallFunc_Array_Get_Item;                           // 0x0088(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATriggerVolume*>                 CallFunc_GetBossVolumesWithTag_Results;            // 0x00C0(0x0010)(ReferenceParm)
	class ATriggerVolume*                         CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetPawn_Result;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATRAP_BossEncounter_C*                  CallFunc_GetBossEncounterTrap_Result;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition) == 0x000008, "Wrong alignment on TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition");
static_assert(sizeof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition) == 0x000120, "Wrong size on TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, EntryPoint) == 0x000000, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000028, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x000054, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_WeightByAngleFromViewpoint_ReturnValue) == 0x000056, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_WeightByAngleFromViewpoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetTarget_Target) == 0x000058, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetPredictedTargetLocation_PredictedLocation) == 0x000060, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetPredictedTargetLocation_PredictedLocation' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_MakeArray_Array) == 0x000070, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_FilterByVisibilityToPoint_ReturnValue) == 0x000080, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_FilterByVisibilityToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetComboByBehaviorTree_ComboIndex) == 0x000084, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetComboByBehaviorTree_ComboIndex' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_Array_Get_Item) == 0x000088, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_FTrunc_ReturnValue) == 0x0000B8, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetBossVolumesWithTag_Results) == 0x0000C0, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetBossVolumesWithTag_Results' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_FTrunc_ReturnValue_1) == 0x0000D8, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetActorBounds_Origin) == 0x0000DC, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetActorBounds_BoxExtent) == 0x0000E8, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x0000F4, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x0000F5, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetTargetPawn_Result) == 0x0000F8, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetTargetPawn_Result' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetGameInstance_ReturnValue) == 0x000100, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_DynamicCast_AsGI_Single_Player) == 0x000108, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition, CallFunc_GetBossEncounterTrap_Result) == 0x000118, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition::CallFunc_GetBossEncounterTrap_Result' has a wrong offset!");

// Function TASK_Diego_v2_Maneuver_RangedAttackPosition.TASK_Diego_v2_Maneuver_RangedAttackPosition_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Diego_v2_Maneuver_RangedAttackPosition_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

