#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetNiagaraComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_SetNiagaraComponent.TASK_SetNiagaraComponent_C
// 0x0048 (0x00F0 - 0x00A8)
class UTASK_SetNiagaraComponent_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UNiagaraSystem>          SystemAsset;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   ComponentTag;                                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerActor;                                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_SetNiagaraComponent(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_SetNiagaraComponent_C">();
	}
	static class UTASK_SetNiagaraComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_SetNiagaraComponent_C>();
	}
};
static_assert(alignof(UTASK_SetNiagaraComponent_C) == 0x000008, "Wrong alignment on UTASK_SetNiagaraComponent_C");
static_assert(sizeof(UTASK_SetNiagaraComponent_C) == 0x0000F0, "Wrong size on UTASK_SetNiagaraComponent_C");
static_assert(offsetof(UTASK_SetNiagaraComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_SetNiagaraComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_SetNiagaraComponent_C, SystemAsset) == 0x0000B0, "Member 'UTASK_SetNiagaraComponent_C::SystemAsset' has a wrong offset!");
static_assert(offsetof(UTASK_SetNiagaraComponent_C, ComponentTag) == 0x0000D8, "Member 'UTASK_SetNiagaraComponent_C::ComponentTag' has a wrong offset!");
static_assert(offsetof(UTASK_SetNiagaraComponent_C, OwnerActor) == 0x0000E0, "Member 'UTASK_SetNiagaraComponent_C::OwnerActor' has a wrong offset!");
static_assert(offsetof(UTASK_SetNiagaraComponent_C, NiagaraSystem) == 0x0000E8, "Member 'UTASK_SetNiagaraComponent_C::NiagaraSystem' has a wrong offset!");

}

