#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_CyberBully_ReceiveBullorang

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TASK_CyberBully_ReceiveBullorang.TASK_CyberBully_ReceiveBullorang_C.ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang
// 0x0038 (0x0038 - 0x0000)
struct TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_CyberBully_C*                     K2Node_DynamicCast_AsPAWN_Cyber_Bully;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang) == 0x000008, "Wrong alignment on TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang");
static_assert(sizeof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang) == 0x000038, "Wrong size on TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, EntryPoint) == 0x000000, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, K2Node_Event_OwnerController) == 0x000018, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, K2Node_Event_ControlledPawn) == 0x000020, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, K2Node_DynamicCast_AsPAWN_Cyber_Bully) == 0x000028, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::K2Node_DynamicCast_AsPAWN_Cyber_Bully' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'TASK_CyberBully_ReceiveBullorang_C_ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TASK_CyberBully_ReceiveBullorang.TASK_CyberBully_ReceiveBullorang_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_CyberBully_ReceiveBullorang_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_CyberBully_ReceiveBullorang.TASK_CyberBully_ReceiveBullorang_C.EVENT_OnBullorangReceived
// 0x0050 (0x0050 - 0x0000)
struct TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Result;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived) == 0x000008, "Wrong alignment on TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived");
static_assert(sizeof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived) == 0x000050, "Wrong size on TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, CallFunc_ForceBeginAction_Action) == 0x000030, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, CallFunc_GetMontage_Result) == 0x000038, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::CallFunc_GetMontage_Result' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_OnBullorangReceived::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function TASK_CyberBully_ReceiveBullorang.TASK_CyberBully_ReceiveBullorang_C.EVENT_SetIdleOverride
// 0x0028 (0x0028 - 0x0000)
struct TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIdleOverrideSequence_Result;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride) == 0x000008, "Wrong alignment on TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride");
static_assert(sizeof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride) == 0x000028, "Wrong size on TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000010, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride, CallFunc_SetIdleOverrideSequence_Result) == 0x000021, "Member 'TASK_CyberBully_ReceiveBullorang_C_EVENT_SetIdleOverride::CallFunc_SetIdleOverrideSequence_Result' has a wrong offset!");

}

