#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v2_Maneuver_RangedAttackPosition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TASK_Maneuver_Base_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Diego_v2_Maneuver_RangedAttackPosition.TASK_Diego_v2_Maneuver_RangedAttackPosition_C
// 0x0040 (0x0108 - 0x00C8)
class UTASK_Diego_v2_Maneuver_RangedAttackPosition_C final : public UTASK_Maneuver_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TASK_Diego_v2_Maneuver_RangedAttackPosition_C; // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TargetLocation;                                    // 0x00D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceLocation;                                    // 0x00DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           TargetPawn;                                        // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATRAP_BossEncounter_C*                  BossEncounter;                                     // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerVolume*                         ManeuverVolume;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinDistance;                                       // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDistance;                                       // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Diego_v2_Maneuver_RangedAttackPosition(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Diego_v2_Maneuver_RangedAttackPosition_C">();
	}
	static class UTASK_Diego_v2_Maneuver_RangedAttackPosition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Diego_v2_Maneuver_RangedAttackPosition_C>();
	}
};
static_assert(alignof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C) == 0x000008, "Wrong alignment on UTASK_Diego_v2_Maneuver_RangedAttackPosition_C");
static_assert(sizeof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C) == 0x000108, "Wrong size on UTASK_Diego_v2_Maneuver_RangedAttackPosition_C");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, UberGraphFrame_TASK_Diego_v2_Maneuver_RangedAttackPosition_C) == 0x0000C8, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::UberGraphFrame_TASK_Diego_v2_Maneuver_RangedAttackPosition_C' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, TargetLocation) == 0x0000D0, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, SourceLocation) == 0x0000DC, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::SourceLocation' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, TargetPawn) == 0x0000E8, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::TargetPawn' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, BossEncounter) == 0x0000F0, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::BossEncounter' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, ManeuverVolume) == 0x0000F8, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::ManeuverVolume' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, MinDistance) == 0x000100, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::MinDistance' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v2_Maneuver_RangedAttackPosition_C, MaxDistance) == 0x000104, "Member 'UTASK_Diego_v2_Maneuver_RangedAttackPosition_C::MaxDistance' has a wrong offset!");

}

