#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v1_ActivateTeleportFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_InnerOuter_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Diego_v1_ActivateTeleportFX.TASK_Diego_v1_ActivateTeleportFX_C
// 0x0020 (0x00C8 - 0x00A8)
class UTASK_Diego_v1_ActivateTeleportFX_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_InnerOuter                               TeleportType;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      TeleportSystem;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InnerOuter                               Teleport_Type;                                     // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Diego_v1_ActivateTeleportFX_C">();
	}
	static class UTASK_Diego_v1_ActivateTeleportFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Diego_v1_ActivateTeleportFX_C>();
	}
};
static_assert(alignof(UTASK_Diego_v1_ActivateTeleportFX_C) == 0x000008, "Wrong alignment on UTASK_Diego_v1_ActivateTeleportFX_C");
static_assert(sizeof(UTASK_Diego_v1_ActivateTeleportFX_C) == 0x0000C8, "Wrong size on UTASK_Diego_v1_ActivateTeleportFX_C");
static_assert(offsetof(UTASK_Diego_v1_ActivateTeleportFX_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_Diego_v1_ActivateTeleportFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_ActivateTeleportFX_C, TeleportType) == 0x0000B0, "Member 'UTASK_Diego_v1_ActivateTeleportFX_C::TeleportType' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_ActivateTeleportFX_C, TeleportSystem) == 0x0000B8, "Member 'UTASK_Diego_v1_ActivateTeleportFX_C::TeleportSystem' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_ActivateTeleportFX_C, Teleport_Type) == 0x0000C0, "Member 'UTASK_Diego_v1_ActivateTeleportFX_C::Teleport_Type' has a wrong offset!");

}

