#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformFidgetAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_PerformFidgetAction.TASK_PerformFidgetAction_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_PerformFidgetAction_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     FidgetAction;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_PerformFidgetAction(int32 EntryPoint);
	void OnActionEnded();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_PerformFidgetAction_C">();
	}
	static class UTASK_PerformFidgetAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_PerformFidgetAction_C>();
	}
};
static_assert(alignof(UTASK_PerformFidgetAction_C) == 0x000008, "Wrong alignment on UTASK_PerformFidgetAction_C");
static_assert(sizeof(UTASK_PerformFidgetAction_C) == 0x0000C0, "Wrong size on UTASK_PerformFidgetAction_C");
static_assert(offsetof(UTASK_PerformFidgetAction_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_PerformFidgetAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_PerformFidgetAction_C, EnemyPawn) == 0x0000B0, "Member 'UTASK_PerformFidgetAction_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_PerformFidgetAction_C, FidgetAction) == 0x0000B8, "Member 'UTASK_PerformFidgetAction_C::FidgetAction' has a wrong offset!");

}

