#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SelectComboByType

#include "Basic.hpp"

#include "ENUM_SkillType_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_TargetAssignmentType_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_SelectComboByType.TASK_SelectComboByType_C
// 0x0028 (0x00D0 - 0x00A8)
class UTASK_SelectComboByType_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_SkillType                                ComboType;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TargetAssignmentType                     TargetType;                                        // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyPreferredStyle;                                // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTreeComponent*                 BehaviorTree;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_SelectComboByType(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_SelectComboByType_C">();
	}
	static class UTASK_SelectComboByType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_SelectComboByType_C>();
	}
};
static_assert(alignof(UTASK_SelectComboByType_C) == 0x000008, "Wrong alignment on UTASK_SelectComboByType_C");
static_assert(sizeof(UTASK_SelectComboByType_C) == 0x0000D0, "Wrong size on UTASK_SelectComboByType_C");
static_assert(offsetof(UTASK_SelectComboByType_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_SelectComboByType_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_SelectComboByType_C, ComboType) == 0x0000B0, "Member 'UTASK_SelectComboByType_C::ComboType' has a wrong offset!");
static_assert(offsetof(UTASK_SelectComboByType_C, EnemyPawn) == 0x0000B8, "Member 'UTASK_SelectComboByType_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_SelectComboByType_C, TargetType) == 0x0000C0, "Member 'UTASK_SelectComboByType_C::TargetType' has a wrong offset!");
static_assert(offsetof(UTASK_SelectComboByType_C, OnlyPreferredStyle) == 0x0000C1, "Member 'UTASK_SelectComboByType_C::OnlyPreferredStyle' has a wrong offset!");
static_assert(offsetof(UTASK_SelectComboByType_C, BehaviorTree) == 0x0000C8, "Member 'UTASK_SelectComboByType_C::BehaviorTree' has a wrong offset!");

}

