#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_LBC_AssignDynamicBehavior

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_LBC_AssignDynamicBehavior.TASK_LBC_AssignDynamicBehavior_C.ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior
// 0x0068 (0x0068 - 0x0000)
struct TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          K2Node_DynamicCast_AsBehavior_Tree;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalBehaviorComponent_C*              CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior) == 0x000008, "Wrong alignment on TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior");
static_assert(sizeof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior) == 0x000068, "Wrong size on TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, EntryPoint) == 0x000000, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, Temp_object_Variable) == 0x000018, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_DynamicCast_AsBehavior_Tree) == 0x000020, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_DynamicCast_AsBehavior_Tree' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_Event_OwnerController) == 0x000030, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_Event_ControlledPawn) == 0x000038, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000040, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior, CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent) == 0x000060, "Member 'TASK_LBC_AssignDynamicBehavior_C_ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior::CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent' has a wrong offset!");

// Function TASK_LBC_AssignDynamicBehavior.TASK_LBC_AssignDynamicBehavior_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_LBC_AssignDynamicBehavior_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_LBC_AssignDynamicBehavior.TASK_LBC_AssignDynamicBehavior_C.OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7
// 0x0008 (0x0008 - 0x0000)
struct TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7) == 0x000008, "Wrong alignment on TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7");
static_assert(sizeof(TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7) == 0x000008, "Wrong size on TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7");
static_assert(offsetof(TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7, Loaded) == 0x000000, "Member 'TASK_LBC_AssignDynamicBehavior_C_OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7::Loaded' has a wrong offset!");

}

