#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_TargetCopy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_TargetAssignmentType_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_TargetCopy.TASK_TargetCopy_C
// 0x0020 (0x00C8 - 0x00A8)
class UTASK_TargetCopy_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          Pawn;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TargetAssignmentType                     SourceTarget;                                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CopyToNav;                                         // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CopyToBody;                                        // 0x00BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CopyToHead;                                        // 0x00BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CopyToSkill;                                       // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_TargetCopy(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_TargetCopy_C">();
	}
	static class UTASK_TargetCopy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_TargetCopy_C>();
	}
};
static_assert(alignof(UTASK_TargetCopy_C) == 0x000008, "Wrong alignment on UTASK_TargetCopy_C");
static_assert(sizeof(UTASK_TargetCopy_C) == 0x0000C8, "Wrong size on UTASK_TargetCopy_C");
static_assert(offsetof(UTASK_TargetCopy_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_TargetCopy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, Pawn) == 0x0000B0, "Member 'UTASK_TargetCopy_C::Pawn' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, SourceTarget) == 0x0000B8, "Member 'UTASK_TargetCopy_C::SourceTarget' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, CopyToNav) == 0x0000B9, "Member 'UTASK_TargetCopy_C::CopyToNav' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, CopyToBody) == 0x0000BA, "Member 'UTASK_TargetCopy_C::CopyToBody' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, CopyToHead) == 0x0000BB, "Member 'UTASK_TargetCopy_C::CopyToHead' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, CopyToSkill) == 0x0000BC, "Member 'UTASK_TargetCopy_C::CopyToSkill' has a wrong offset!");
static_assert(offsetof(UTASK_TargetCopy_C, Target) == 0x0000C0, "Member 'UTASK_TargetCopy_C::Target' has a wrong offset!");

}

