#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetNiagaraComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_SetNiagaraComponent.TASK_SetNiagaraComponent_C.ExecuteUbergraph_TASK_SetNiagaraComponent
// 0x0090 (0x0090 - 0x0000)
struct TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              CallFunc_GetComponentsByTag_ReturnValue;           // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent) == 0x000008, "Wrong alignment on TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent");
static_assert(sizeof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent) == 0x000090, "Wrong size on TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, EntryPoint) == 0x000000, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, Temp_int_Array_Index_Variable) == 0x000014, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_GetComponentsByTag_ReturnValue) == 0x000020, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, Temp_object_Variable) == 0x000030, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_Array_Get_Item) == 0x000038, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_DynamicCast_AsNiagara_System) == 0x000040, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000051, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_Event_OwnerController) == 0x000058, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_Event_ControlledPawn) == 0x000060, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000078, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_DynamicCast_AsNiagara_System_1) == 0x000080, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_DynamicCast_AsNiagara_System_1' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'TASK_SetNiagaraComponent_C_ExecuteUbergraph_TASK_SetNiagaraComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TASK_SetNiagaraComponent.TASK_SetNiagaraComponent_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_SetNiagaraComponent_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_SetNiagaraComponent_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_SetNiagaraComponent_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_SetNiagaraComponent_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_SetNiagaraComponent_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_SetNiagaraComponent_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetNiagaraComponent_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_SetNiagaraComponent_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_SetNiagaraComponent.TASK_SetNiagaraComponent_C.OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E
// 0x0008 (0x0008 - 0x0000)
struct TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E) == 0x000008, "Wrong alignment on TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E");
static_assert(sizeof(TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E) == 0x000008, "Wrong size on TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E");
static_assert(offsetof(TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E, Loaded) == 0x000000, "Member 'TASK_SetNiagaraComponent_C_OnLoaded_8E78A97940DDB2602CDACA8FFBC58F2E::Loaded' has a wrong offset!");

}

