#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v1_Maneuver_CombatTeleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TASK_Maneuver_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Diego_v1_Maneuver_CombatTeleport.TASK_Diego_v1_Maneuver_CombatTeleport_C
// 0x0030 (0x00F8 - 0x00C8)
class UTASK_Diego_v1_Maneuver_CombatTeleport_C final : public UTASK_Maneuver_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TASK_Diego_v1_Maneuver_CombatTeleport_C; // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_SystemShockCharacter_C*           TargetPawn;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerVolume*                         ManeuverVolume;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinDistance;                                       // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDistance;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Diego_v1_Maneuver_CombatTeleport_C">();
	}
	static class UTASK_Diego_v1_Maneuver_CombatTeleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Diego_v1_Maneuver_CombatTeleport_C>();
	}
};
static_assert(alignof(UTASK_Diego_v1_Maneuver_CombatTeleport_C) == 0x000008, "Wrong alignment on UTASK_Diego_v1_Maneuver_CombatTeleport_C");
static_assert(sizeof(UTASK_Diego_v1_Maneuver_CombatTeleport_C) == 0x0000F8, "Wrong size on UTASK_Diego_v1_Maneuver_CombatTeleport_C");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, UberGraphFrame_TASK_Diego_v1_Maneuver_CombatTeleport_C) == 0x0000C8, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::UberGraphFrame_TASK_Diego_v1_Maneuver_CombatTeleport_C' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, TargetPawn) == 0x0000D0, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::TargetPawn' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, TargetLocation) == 0x0000D8, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, ManeuverVolume) == 0x0000E8, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::ManeuverVolume' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, MinDistance) == 0x0000F0, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::MinDistance' has a wrong offset!");
static_assert(offsetof(UTASK_Diego_v1_Maneuver_CombatTeleport_C, MaxDistance) == 0x0000F4, "Member 'UTASK_Diego_v1_Maneuver_CombatTeleport_C::MaxDistance' has a wrong offset!");

}

