#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformFidgetAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_PerformFidgetAction.TASK_PerformFidgetAction_C.ExecuteUbergraph_TASK_PerformFidgetAction
// 0x0090 (0x0090 - 0x0000)
struct TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_Array_Get_Item;                           // 0x0030(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_TryBeginAction_Action;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CanBeginAction_Result;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction) == 0x000008, "Wrong alignment on TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction");
static_assert(sizeof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction) == 0x000090, "Wrong size on TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, EntryPoint) == 0x000000, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_RandomInteger_ReturnValue) == 0x000028, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_Array_Get_Item) == 0x000030, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000058, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_DynamicCast_AsAnim_Montage) == 0x000060, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_TryBeginAction_Action) == 0x000070, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_TryBeginAction_Action' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction, CallFunc_CanBeginAction_Result) == 0x000088, "Member 'TASK_PerformFidgetAction_C_ExecuteUbergraph_TASK_PerformFidgetAction::CallFunc_CanBeginAction_Result' has a wrong offset!");

// Function TASK_PerformFidgetAction.TASK_PerformFidgetAction_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_PerformFidgetAction_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformFidgetAction_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_PerformFidgetAction_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_PerformFidgetAction_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_PerformFidgetAction_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_PerformFidgetAction_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_PerformFidgetAction_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformFidgetAction_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_PerformFidgetAction_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

