#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetPredictedTargetLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_TargetAssignmentType_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_SetPredictedTargetLocation.TASK_SetPredictedTargetLocation_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_SetPredictedTargetLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          Pawn;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeIntoTheFuture;                                 // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TargetAssignmentType                     TargetAssignmentType;                              // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_SetPredictedTargetLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void SetPredictedTargetLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_SetPredictedTargetLocation_C">();
	}
	static class UTASK_SetPredictedTargetLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_SetPredictedTargetLocation_C>();
	}
};
static_assert(alignof(UTASK_SetPredictedTargetLocation_C) == 0x000008, "Wrong alignment on UTASK_SetPredictedTargetLocation_C");
static_assert(sizeof(UTASK_SetPredictedTargetLocation_C) == 0x0000C0, "Wrong size on UTASK_SetPredictedTargetLocation_C");
static_assert(offsetof(UTASK_SetPredictedTargetLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_SetPredictedTargetLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_SetPredictedTargetLocation_C, Pawn) == 0x0000B0, "Member 'UTASK_SetPredictedTargetLocation_C::Pawn' has a wrong offset!");
static_assert(offsetof(UTASK_SetPredictedTargetLocation_C, TimeIntoTheFuture) == 0x0000B8, "Member 'UTASK_SetPredictedTargetLocation_C::TimeIntoTheFuture' has a wrong offset!");
static_assert(offsetof(UTASK_SetPredictedTargetLocation_C, TargetAssignmentType) == 0x0000BC, "Member 'UTASK_SetPredictedTargetLocation_C::TargetAssignmentType' has a wrong offset!");

}

