#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_CyberBully_ReceiveBullorang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_CyberBully_ReceiveBullorang.TASK_CyberBully_ReceiveBullorang_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_CyberBully_ReceiveBullorang_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_CyberBully_C*                     CyberBullyPawn;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ReceiveBullorangMontage;                           // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_CyberBully_ReceiveBullorang(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void EVENT_OnActionEnded();
	void EVENT_OnBullorangReceived();
	void EVENT_SetIdleOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_CyberBully_ReceiveBullorang_C">();
	}
	static class UTASK_CyberBully_ReceiveBullorang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_CyberBully_ReceiveBullorang_C>();
	}
};
static_assert(alignof(UTASK_CyberBully_ReceiveBullorang_C) == 0x000008, "Wrong alignment on UTASK_CyberBully_ReceiveBullorang_C");
static_assert(sizeof(UTASK_CyberBully_ReceiveBullorang_C) == 0x0000C0, "Wrong size on UTASK_CyberBully_ReceiveBullorang_C");
static_assert(offsetof(UTASK_CyberBully_ReceiveBullorang_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_CyberBully_ReceiveBullorang_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_CyberBully_ReceiveBullorang_C, CyberBullyPawn) == 0x0000B0, "Member 'UTASK_CyberBully_ReceiveBullorang_C::CyberBullyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_CyberBully_ReceiveBullorang_C, ReceiveBullorangMontage) == 0x0000B8, "Member 'UTASK_CyberBully_ReceiveBullorang_C::ReceiveBullorangMontage' has a wrong offset!");

}

