#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformStaggerAction

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TASK_PerformStaggerAction.TASK_PerformStaggerAction_C.ExecuteUbergraph_TASK_PerformStaggerAction
// 0x00F0 (0x00F0 - 0x0000)
struct TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_Array_Random_OutItem;                     // 0x0060(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Result;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIdleOverrideSequence_Result;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction) == 0x000008, "Wrong alignment on TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction");
static_assert(sizeof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction) == 0x0000F0, "Wrong size on TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, EntryPoint) == 0x000000, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, Temp_object_Variable) == 0x000008, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_AsAnim_Montage) == 0x000010, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_Event_OwnerController) == 0x000040, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_Event_ControlledPawn) == 0x000048, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000050, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_Array_Random_OutItem) == 0x000060, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_Array_Random_OutIndex) == 0x000088, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_ForceBeginAction_Action) == 0x000098, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_GetMontage_Result) == 0x0000A0, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_GetMontage_Result' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_GetPlayLength_ReturnValue) == 0x0000A8, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B0, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B8, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_GetAnimInstance_ReturnValue) == 0x0000D0, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x0000D8, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction, CallFunc_SetIdleOverrideSequence_Result) == 0x0000E9, "Member 'TASK_PerformStaggerAction_C_ExecuteUbergraph_TASK_PerformStaggerAction::CallFunc_SetIdleOverrideSequence_Result' has a wrong offset!");

// Function TASK_PerformStaggerAction.TASK_PerformStaggerAction_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_PerformStaggerAction_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStaggerAction_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_PerformStaggerAction_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_PerformStaggerAction_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_PerformStaggerAction_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_PerformStaggerAction_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_PerformStaggerAction_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformStaggerAction_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_PerformStaggerAction_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_PerformStaggerAction.TASK_PerformStaggerAction_C.OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B
// 0x0008 (0x0008 - 0x0000)
struct TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B) == 0x000008, "Wrong alignment on TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B");
static_assert(sizeof(TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B) == 0x000008, "Wrong size on TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B");
static_assert(offsetof(TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B, Loaded) == 0x000000, "Member 'TASK_PerformStaggerAction_C_OnLoaded_A257CF4C488CD54011BDE5BBCDA7165B::Loaded' has a wrong offset!");

}

