#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Vocalize_Bark

#include "Basic.hpp"

#include "ENUM_EnemyBark_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Vocalize_Bark.TASK_Vocalize_Bark_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_Vocalize_Bark_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_EnemyBark                                BarkTemplate;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          Pawn;                                              // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Vocalize_Bark(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Vocalize_Bark_C">();
	}
	static class UTASK_Vocalize_Bark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Vocalize_Bark_C>();
	}
};
static_assert(alignof(UTASK_Vocalize_Bark_C) == 0x000008, "Wrong alignment on UTASK_Vocalize_Bark_C");
static_assert(sizeof(UTASK_Vocalize_Bark_C) == 0x0000C0, "Wrong size on UTASK_Vocalize_Bark_C");
static_assert(offsetof(UTASK_Vocalize_Bark_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_Vocalize_Bark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_Vocalize_Bark_C, BarkTemplate) == 0x0000B0, "Member 'UTASK_Vocalize_Bark_C::BarkTemplate' has a wrong offset!");
static_assert(offsetof(UTASK_Vocalize_Bark_C, Pawn) == 0x0000B8, "Member 'UTASK_Vocalize_Bark_C::Pawn' has a wrong offset!");

}

