#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_TriggerComboCooldown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_TriggerComboCooldown.TASK_TriggerComboCooldown_C
// 0x0020 (0x00C8 - 0x00A8)
class UTASK_TriggerComboCooldown_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBehaviorTree*                          ComboToTrigger;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_SkillManager_C*                   SkillManager;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TASK_TriggerComboCooldown(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_TriggerComboCooldown_C">();
	}
	static class UTASK_TriggerComboCooldown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_TriggerComboCooldown_C>();
	}
};
static_assert(alignof(UTASK_TriggerComboCooldown_C) == 0x000008, "Wrong alignment on UTASK_TriggerComboCooldown_C");
static_assert(sizeof(UTASK_TriggerComboCooldown_C) == 0x0000C8, "Wrong size on UTASK_TriggerComboCooldown_C");
static_assert(offsetof(UTASK_TriggerComboCooldown_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_TriggerComboCooldown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_TriggerComboCooldown_C, ComboToTrigger) == 0x0000B0, "Member 'UTASK_TriggerComboCooldown_C::ComboToTrigger' has a wrong offset!");
static_assert(offsetof(UTASK_TriggerComboCooldown_C, SkillManager) == 0x0000B8, "Member 'UTASK_TriggerComboCooldown_C::SkillManager' has a wrong offset!");
static_assert(offsetof(UTASK_TriggerComboCooldown_C, Success) == 0x0000C0, "Member 'UTASK_TriggerComboCooldown_C::Success' has a wrong offset!");

}

