#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_CyborgAssassin_SetLaserEnabled

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_CyborgAssassin_SetLaserEnabled.TASK_CyborgAssassin_SetLaserEnabled_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_CyborgAssassin_SetLaserEnabled_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LaserEnabled;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_CyborgAssassin_C*                 AssassinPawn;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_CyborgAssassin_SetLaserEnabled(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_CyborgAssassin_SetLaserEnabled_C">();
	}
	static class UTASK_CyborgAssassin_SetLaserEnabled_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_CyborgAssassin_SetLaserEnabled_C>();
	}
};
static_assert(alignof(UTASK_CyborgAssassin_SetLaserEnabled_C) == 0x000008, "Wrong alignment on UTASK_CyborgAssassin_SetLaserEnabled_C");
static_assert(sizeof(UTASK_CyborgAssassin_SetLaserEnabled_C) == 0x0000C0, "Wrong size on UTASK_CyborgAssassin_SetLaserEnabled_C");
static_assert(offsetof(UTASK_CyborgAssassin_SetLaserEnabled_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_CyborgAssassin_SetLaserEnabled_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_CyborgAssassin_SetLaserEnabled_C, LaserEnabled) == 0x0000B0, "Member 'UTASK_CyborgAssassin_SetLaserEnabled_C::LaserEnabled' has a wrong offset!");
static_assert(offsetof(UTASK_CyborgAssassin_SetLaserEnabled_C, AssassinPawn) == 0x0000B8, "Member 'UTASK_CyborgAssassin_SetLaserEnabled_C::AssassinPawn' has a wrong offset!");

}

