#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v1_ActivateTeleportFX

#include "Basic.hpp"

#include "ENUM_InnerOuter_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_Diego_v1_ActivateTeleportFX.TASK_Diego_v1_ActivateTeleportFX_C.ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX
// 0x0070 (0x0070 - 0x0000)
struct TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InnerOuter                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_DiegoV2_C*                        K2Node_DynamicCast_AsPAWN_Diego_V2;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_DiegoV3_C*                        K2Node_DynamicCast_AsPAWN_Diego_V3;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Diego_v1_C*                       K2Node_DynamicCast_AsPAWN_Diego_V_1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX) == 0x000008, "Wrong alignment on TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX");
static_assert(sizeof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX) == 0x000070, "Wrong size on TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, EntryPoint) == 0x000000, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, Temp_byte_Variable) == 0x000004, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, Temp_object_Variable) == 0x000008, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, Temp_object_Variable_1) == 0x000010, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_Event_OwnerController) == 0x000018, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_Event_ControlledPawn) == 0x000020, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_AsPAWN_Diego_V2) == 0x000028, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_AsPAWN_Diego_V2' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_AsPAWN_Diego_V3) == 0x000038, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_AsPAWN_Diego_V3' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_AsPAWN_Diego_V_1) == 0x000048, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_AsPAWN_Diego_V_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, K2Node_Select_Default) == 0x000058, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ExecuteUbergraph_TASK_Diego_v1_ActivateTeleportFX::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function TASK_Diego_v1_ActivateTeleportFX.TASK_Diego_v1_ActivateTeleportFX_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Diego_v1_ActivateTeleportFX_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

