#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Cyber_Maneuver_AttackPosition

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_Cyber_Maneuver_AttackPosition.TASK_Cyber_Maneuver_AttackPosition_C.ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition
// 0x0108 (0x0108 - 0x0000)
struct TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetPawn_Result;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPredictedTargetLocation_PredictedLocation; // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_FilterByVisibilityToPoint_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAttackComboRange_MaxRange;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMinAttackComboRange_MinRange;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByAngleFromViewpoint_ReturnValue;   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WeightByDistanceFromObstacles_ReturnValue; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition) == 0x000008, "Wrong alignment on TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition");
static_assert(sizeof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition) == 0x000108, "Wrong size on TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, EntryPoint) == 0x000000, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000004, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_GetTargetPawn_Result) == 0x000008, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_GetTargetPawn_Result' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_GetTarget_Target) == 0x000010, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_GetPredictedTargetLocation_PredictedLocation) == 0x000018, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_GetPredictedTargetLocation_PredictedLocation' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000028, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00003C, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_Vector_GetAbs_ReturnValue) == 0x000064, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_Vector_GetAbs_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_BreakVector_X) == 0x000070, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_BreakVector_Y) == 0x000074, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_BreakVector_Z) == 0x000078, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FMax_ReturnValue) == 0x00007C, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x000080, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FMax_ReturnValue_1) == 0x000084, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FMax_ReturnValue_2) == 0x00008C, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x00009C, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, K2Node_MakeArray_Array) == 0x0000A0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FilterByVisibilityToPoint_ReturnValue) == 0x0000B0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FilterByVisibilityToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B4, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_GetMaxAttackComboRange_MaxRange) == 0x0000C0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_GetMaxAttackComboRange_MaxRange' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000C4, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FTrunc_ReturnValue) == 0x0000D0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_Normal_ReturnValue) == 0x0000D4, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_GetMinAttackComboRange_MinRange) == 0x0000E0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_GetMinAttackComboRange_MinRange' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_WeightByAngleFromViewpoint_ReturnValue) == 0x0000E4, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_WeightByAngleFromViewpoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_FTrunc_ReturnValue_1) == 0x0000E8, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, K2Node_Event_OwnerController) == 0x0000F0, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, K2Node_Event_ControlledPawn) == 0x0000F8, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x000100, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition, CallFunc_WeightByDistanceFromObstacles_ReturnValue) == 0x000101, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ExecuteUbergraph_TASK_Cyber_Maneuver_AttackPosition::CallFunc_WeightByDistanceFromObstacles_ReturnValue' has a wrong offset!");

// Function TASK_Cyber_Maneuver_AttackPosition.TASK_Cyber_Maneuver_AttackPosition_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Cyber_Maneuver_AttackPosition_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

