#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_AssignInitialBehavior

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_AssignInitialBehavior.TASK_AssignInitialBehavior_C.ExecuteUbergraph_TASK_AssignInitialBehavior
// 0x0028 (0x0028 - 0x0000)
struct TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior) == 0x000008, "Wrong alignment on TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior");
static_assert(sizeof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior) == 0x000028, "Wrong size on TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, EntryPoint) == 0x000000, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000004, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_AssignInitialBehavior_C_ExecuteUbergraph_TASK_AssignInitialBehavior::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TASK_AssignInitialBehavior.TASK_AssignInitialBehavior_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_AssignInitialBehavior_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_AssignInitialBehavior_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_AssignInitialBehavior_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_AssignInitialBehavior_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_AssignInitialBehavior_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_AssignInitialBehavior_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_AssignInitialBehavior_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_AssignInitialBehavior_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

