#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Maneuver_AttackPosition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TASK_Maneuver_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelVoxelization_structs.hpp"
#include "ENUM_PreferredCombatStyle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Maneuver_AttackPosition.TASK_Maneuver_AttackPosition_C
// 0x0038 (0x0100 - 0x00C8)
class UTASK_Maneuver_AttackPosition_C final : public UTASK_Maneuver_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TASK_Maneuver_AttackPosition_C;     // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TargetLocation;                                    // 0x00D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StayNearFloor;                                     // 0x00DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SourceLocation;                                    // 0x00E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           TargetPawn;                                        // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OverrideMaxPathDistance;                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Maneuver_AttackPosition(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Maneuver_AttackPosition_C">();
	}
	static class UTASK_Maneuver_AttackPosition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Maneuver_AttackPosition_C>();
	}
};
static_assert(alignof(UTASK_Maneuver_AttackPosition_C) == 0x000008, "Wrong alignment on UTASK_Maneuver_AttackPosition_C");
static_assert(sizeof(UTASK_Maneuver_AttackPosition_C) == 0x000100, "Wrong size on UTASK_Maneuver_AttackPosition_C");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, UberGraphFrame_TASK_Maneuver_AttackPosition_C) == 0x0000C8, "Member 'UTASK_Maneuver_AttackPosition_C::UberGraphFrame_TASK_Maneuver_AttackPosition_C' has a wrong offset!");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, TargetLocation) == 0x0000D0, "Member 'UTASK_Maneuver_AttackPosition_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, StayNearFloor) == 0x0000DC, "Member 'UTASK_Maneuver_AttackPosition_C::StayNearFloor' has a wrong offset!");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, SourceLocation) == 0x0000E0, "Member 'UTASK_Maneuver_AttackPosition_C::SourceLocation' has a wrong offset!");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, TargetPawn) == 0x0000F0, "Member 'UTASK_Maneuver_AttackPosition_C::TargetPawn' has a wrong offset!");
static_assert(offsetof(UTASK_Maneuver_AttackPosition_C, OverrideMaxPathDistance) == 0x0000F8, "Member 'UTASK_Maneuver_AttackPosition_C::OverrideMaxPathDistance' has a wrong offset!");

}

