#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetPredictedTargetLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_SetPredictedTargetLocation.TASK_SetPredictedTargetLocation_C.ExecuteUbergraph_TASK_SetPredictedTargetLocation
// 0x0028 (0x0028 - 0x0000)
struct TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation) == 0x000008, "Wrong alignment on TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation");
static_assert(sizeof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation) == 0x000028, "Wrong size on TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation, EntryPoint) == 0x000000, "Member 'TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_SetPredictedTargetLocation_C_ExecuteUbergraph_TASK_SetPredictedTargetLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TASK_SetPredictedTargetLocation.TASK_SetPredictedTargetLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_SetPredictedTargetLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_SetPredictedTargetLocation.TASK_SetPredictedTargetLocation_C.SetPredictedTargetLocation
// 0x0078 (0x0078 - 0x0000)
struct TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation final
{
public:
	class UOBJ_EnemyTarget_C*                     NewTarget;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PredictedLocation;                                 // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetDetectedPawn_Pawn;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation) == 0x000008, "Wrong alignment on TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation");
static_assert(sizeof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation) == 0x000078, "Wrong size on TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, NewTarget) == 0x000000, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::NewTarget' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, PredictedLocation) == 0x000008, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::PredictedLocation' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, Target) == 0x000018, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::Target' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_MakeLiteralByte_ReturnValue) == 0x000021, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_GetDetectedPawn_Pawn) == 0x000030, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_GetDetectedPawn_Pawn' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_GetVelocity_ReturnValue) == 0x000038, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation, CallFunc_GetTarget_Target) == 0x000070, "Member 'TASK_SetPredictedTargetLocation_C_SetPredictedTargetLocation::CallFunc_GetTarget_Target' has a wrong offset!");

}

