#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Maneuver_EscapeHazard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_Maneuver_EscapeHazard.TASK_Maneuver_EscapeHazard_C.ExecuteUbergraph_TASK_Maneuver_EscapeHazard
// 0x0060 (0x0060 - 0x0000)
struct TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetShockAgentLocation_Location;           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetShockAgentLocation_Location_1;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxElement_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromObstacles_ReturnValue; // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard) == 0x000008, "Wrong alignment on TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard");
static_assert(sizeof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard) == 0x000060, "Wrong size on TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, EntryPoint) == 0x000000, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_GetShockAgentLocation_Location) == 0x000004, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_GetShockAgentLocation_Location' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000010, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_GetShockAgentLocation_Location_1) == 0x000018, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_GetShockAgentLocation_Location_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x000034, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x000035, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_Not_PreBool_ReturnValue) == 0x000036, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, K2Node_Event_OwnerController) == 0x000038, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, K2Node_Event_ControlledPawn) == 0x000040, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x000049, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x00004C, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_GetMaxElement_ReturnValue) == 0x000058, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard, CallFunc_WeightByDistanceFromObstacles_ReturnValue) == 0x00005C, "Member 'TASK_Maneuver_EscapeHazard_C_ExecuteUbergraph_TASK_Maneuver_EscapeHazard::CallFunc_WeightByDistanceFromObstacles_ReturnValue' has a wrong offset!");

// Function TASK_Maneuver_EscapeHazard.TASK_Maneuver_EscapeHazard_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Maneuver_EscapeHazard_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

