#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v1_TeleportFade

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_Diego_v1_TeleportFade.TASK_Diego_v1_TeleportFade_C.ExecuteUbergraph_TASK_Diego_v1_TeleportFade
// 0x00D8 (0x00D8 - 0x0000)
struct TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetChildComponentsByClass_ReturnValue;    // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetChildComponentsByClass_ReturnValue_1;  // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue_1;       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade) == 0x000008, "Wrong alignment on TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade");
static_assert(sizeof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade) == 0x0000D8, "Wrong size on TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, EntryPoint) == 0x000000, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, Temp_int_Array_Index_Variable) == 0x000014, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Event_OwnerController_1) == 0x000018, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Event_OwnerController) == 0x000028, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Event_ControlledPawn) == 0x000030, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000040, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_DynamicCast_AsPAWN_Enemy_1) == 0x000050, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_DynamicCast_AsPAWN_Enemy_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_GetChildComponentsByClass_ReturnValue) == 0x000060, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_GetChildComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_GetChildComponentsByClass_ReturnValue_1) == 0x000078, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_GetChildComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Array_Get_Item) == 0x000090, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x0000A0, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B0, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, Temp_int_Array_Index_Variable_1) == 0x0000B4, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_FMin_ReturnValue) == 0x0000B8, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_GetPlayTimeInSeconds_ReturnValue_1) == 0x0000C8, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_GetPlayTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, Temp_bool_Variable) == 0x0000CC, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, CallFunc_Not_PreBool_ReturnValue) == 0x0000CD, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade, K2Node_Select_Default) == 0x0000D0, "Member 'TASK_Diego_v1_TeleportFade_C_ExecuteUbergraph_TASK_Diego_v1_TeleportFade::K2Node_Select_Default' has a wrong offset!");

// Function TASK_Diego_v1_TeleportFade.TASK_Diego_v1_TeleportFade_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct TASK_Diego_v1_TeleportFade_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_TeleportFade_C_ReceiveTickAI) == 0x000008, "Wrong alignment on TASK_Diego_v1_TeleportFade_C_ReceiveTickAI");
static_assert(sizeof(TASK_Diego_v1_TeleportFade_C_ReceiveTickAI) == 0x000018, "Wrong size on TASK_Diego_v1_TeleportFade_C_ReceiveTickAI");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'TASK_Diego_v1_TeleportFade_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'TASK_Diego_v1_TeleportFade_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'TASK_Diego_v1_TeleportFade_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function TASK_Diego_v1_TeleportFade.TASK_Diego_v1_TeleportFade_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Diego_v1_TeleportFade_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

