#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetAimTarget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_SetAimTarget.TASK_SetAimTarget_C.ExecuteUbergraph_TASK_SetAimTarget
// 0x0070 (0x0070 - 0x0000)
struct TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAimTarget_Result;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPredictedTargetLocation_PredictedLocation; // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget) == 0x000008, "Wrong alignment on TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget");
static_assert(sizeof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget) == 0x000070, "Wrong size on TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, EntryPoint) == 0x000000, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_GetTarget_Target) == 0x000028, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000040, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_SetAimTarget_Result) == 0x000051, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_SetAimTarget_Result' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_GetPredictedTargetLocation_PredictedLocation) == 0x000054, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_GetPredictedTargetLocation_PredictedLocation' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'TASK_SetAimTarget_C_ExecuteUbergraph_TASK_SetAimTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TASK_SetAimTarget.TASK_SetAimTarget_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_SetAimTarget_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_SetAimTarget_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_SetAimTarget_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_SetAimTarget_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_SetAimTarget_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_SetAimTarget_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_SetAimTarget_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_SetAimTarget_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_SetAimTarget_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

