#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_LBC_AssignDynamicBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_LBC_AssignDynamicBehavior.TASK_LBC_AssignDynamicBehavior_C
// 0x0020 (0x00C8 - 0x00A8)
class UTASK_LBC_AssignDynamicBehavior_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULocalBehaviorComponent_C*              LBC;                                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClearBehavior;                                     // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TASK_LBC_AssignDynamicBehavior(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnLoaded_9C19C68F4B5F67CF1C52CEA0546E5DC7(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_LBC_AssignDynamicBehavior_C">();
	}
	static class UTASK_LBC_AssignDynamicBehavior_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_LBC_AssignDynamicBehavior_C>();
	}
};
static_assert(alignof(UTASK_LBC_AssignDynamicBehavior_C) == 0x000008, "Wrong alignment on UTASK_LBC_AssignDynamicBehavior_C");
static_assert(sizeof(UTASK_LBC_AssignDynamicBehavior_C) == 0x0000C8, "Wrong size on UTASK_LBC_AssignDynamicBehavior_C");
static_assert(offsetof(UTASK_LBC_AssignDynamicBehavior_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_LBC_AssignDynamicBehavior_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_LBC_AssignDynamicBehavior_C, LBC) == 0x0000B0, "Member 'UTASK_LBC_AssignDynamicBehavior_C::LBC' has a wrong offset!");
static_assert(offsetof(UTASK_LBC_AssignDynamicBehavior_C, EnemyPawn) == 0x0000B8, "Member 'UTASK_LBC_AssignDynamicBehavior_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_LBC_AssignDynamicBehavior_C, ClearBehavior) == 0x0000C0, "Member 'UTASK_LBC_AssignDynamicBehavior_C::ClearBehavior' has a wrong offset!");

}

