#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_EQS_AssignTargetingLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_EQS_AssignTargetingLocation.TASK_EQS_AssignTargetingLocation_C.ExecuteUbergraph_TASK_EQS_AssignTargetingLocation
// 0x0060 (0x0060 - 0x0000)
struct TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetManeuverLocation_IsValid;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetManeuverLocation_Location;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation) == 0x000008, "Wrong alignment on TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation");
static_assert(sizeof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation) == 0x000060, "Wrong size on TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, EntryPoint) == 0x000000, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000038, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000040, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_GetManeuverLocation_IsValid) == 0x00004C, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_GetManeuverLocation_IsValid' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation, CallFunc_GetManeuverLocation_Location) == 0x000050, "Member 'TASK_EQS_AssignTargetingLocation_C_ExecuteUbergraph_TASK_EQS_AssignTargetingLocation::CallFunc_GetManeuverLocation_Location' has a wrong offset!");

// Function TASK_EQS_AssignTargetingLocation.TASK_EQS_AssignTargetingLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_EQS_AssignTargetingLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

