#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Cyber_CurveMovement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_Cyber_CurveMovement.TASK_Cyber_CurveMovement_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_Cyber_CurveMovement_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_CyberEnemy_C*                     CyberPawn;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTimestamp;                                    // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_Cyber_CurveMovement(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_Cyber_CurveMovement_C">();
	}
	static class UTASK_Cyber_CurveMovement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_Cyber_CurveMovement_C>();
	}
};
static_assert(alignof(UTASK_Cyber_CurveMovement_C) == 0x000008, "Wrong alignment on UTASK_Cyber_CurveMovement_C");
static_assert(sizeof(UTASK_Cyber_CurveMovement_C) == 0x0000C0, "Wrong size on UTASK_Cyber_CurveMovement_C");
static_assert(offsetof(UTASK_Cyber_CurveMovement_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_Cyber_CurveMovement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_Cyber_CurveMovement_C, CyberPawn) == 0x0000B0, "Member 'UTASK_Cyber_CurveMovement_C::CyberPawn' has a wrong offset!");
static_assert(offsetof(UTASK_Cyber_CurveMovement_C, StartTimestamp) == 0x0000B8, "Member 'UTASK_Cyber_CurveMovement_C::StartTimestamp' has a wrong offset!");

}

