#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformStunAction

#include "Basic.hpp"

#include "ENUM_EnterExit_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TASK_PerformStunAction.TASK_PerformStunAction_C.ExecuteUbergraph_TASK_PerformStunAction
// 0x0160 (0x0160 - 0x0000)
struct TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_EnterExit                                Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_EnterExit                                Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0080(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterAction_C*                     CallFunc_ForceBeginAction_Action;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultBlendOutTime_ReturnValue;       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_ANIM_Character_C> K2Node_DynamicCast_AsINTERF_ANIM_Character;        // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default_1;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStunnedSequence_Result;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence_1;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction) == 0x000008, "Wrong alignment on TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction");
static_assert(sizeof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction) == 0x000160, "Wrong size on TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, EntryPoint) == 0x000000, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, Temp_byte_Variable) == 0x000004, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, Temp_object_Variable) == 0x000020, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_AsAnim_Sequence) == 0x000028, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_AsAnim_Sequence' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, Temp_byte_Variable_1) == 0x000031, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, Temp_object_Variable_1) == 0x000048, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Event_OwnerController_1) == 0x000050, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Event_ControlledPawn_1) == 0x000058, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000060, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Select_Default) == 0x000080, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, Temp_object_Variable_2) == 0x0000B0, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_AsAnim_Montage) == 0x0000B8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_GetPlayLength_ReturnValue) == 0x0000C4, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_ForceBeginAction_Action) == 0x0000C8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_ForceBeginAction_Action' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_GetDefaultBlendOutTime_ReturnValue) == 0x0000D4, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_GetDefaultBlendOutTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000D8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000DC, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_FMin_ReturnValue) == 0x0000E0, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Event_OwnerController) == 0x0000F0, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Event_ControlledPawn) == 0x0000F8, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CreateDelegate_OutputDelegate_3) == 0x000100, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_GetAnimInstance_ReturnValue) == 0x000110, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_AsINTERF_ANIM_Character) == 0x000118, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_AsINTERF_ANIM_Character' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_Select_Default_1) == 0x000130, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_SetStunnedSequence_Result) == 0x000138, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_SetStunnedSequence_Result' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_Not_PreBool_ReturnValue) == 0x000139, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_IsValid_ReturnValue_1) == 0x00013A, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x00013B, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000140, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_AsAnim_Sequence_1) == 0x000148, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_AsAnim_Sequence_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_DynamicCast_bSuccess_4) == 0x000150, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000151, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction, K2Node_CustomEvent_Loaded_1) == 0x000158, "Member 'TASK_PerformStunAction_C_ExecuteUbergraph_TASK_PerformStunAction::K2Node_CustomEvent_Loaded_1' has a wrong offset!");

// Function TASK_PerformStunAction.TASK_PerformStunAction_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_PerformStunAction_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStunAction_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on TASK_PerformStunAction_C_ReceiveAbortAI");
static_assert(sizeof(TASK_PerformStunAction_C_ReceiveAbortAI) == 0x000010, "Wrong size on TASK_PerformStunAction_C_ReceiveAbortAI");
static_assert(offsetof(TASK_PerformStunAction_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'TASK_PerformStunAction_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'TASK_PerformStunAction_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function TASK_PerformStunAction.TASK_PerformStunAction_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_PerformStunAction_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStunAction_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_PerformStunAction_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_PerformStunAction_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_PerformStunAction_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_PerformStunAction_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_PerformStunAction_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_PerformStunAction_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_PerformStunAction_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_PerformStunAction.TASK_PerformStunAction_C.OnLoaded_DE53E1EC46C5F8176A16D29A4F799241
// 0x0008 (0x0008 - 0x0000)
struct TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241) == 0x000008, "Wrong alignment on TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241");
static_assert(sizeof(TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241) == 0x000008, "Wrong size on TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241");
static_assert(offsetof(TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241, Loaded) == 0x000000, "Member 'TASK_PerformStunAction_C_OnLoaded_DE53E1EC46C5F8176A16D29A4F799241::Loaded' has a wrong offset!");

// Function TASK_PerformStunAction.TASK_PerformStunAction_C.OnLoaded_A965060D4914BDB328086B8D7A7463B5
// 0x0008 (0x0008 - 0x0000)
struct TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5) == 0x000008, "Wrong alignment on TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5");
static_assert(sizeof(TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5) == 0x000008, "Wrong size on TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5");
static_assert(offsetof(TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5, Loaded) == 0x000000, "Member 'TASK_PerformStunAction_C_OnLoaded_A965060D4914BDB328086B8D7A7463B5::Loaded' has a wrong offset!");

}

