#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformStunAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_EnterExit_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_PerformStunAction.TASK_PerformStunAction_C
// 0x0030 (0x00D8 - 0x00A8)
class UTASK_PerformStunAction_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ENUM_EnterExit                                StunActionType;                                    // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           StunMontage;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StunLoop;                                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         MontageDuration;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSetStunnedSequence;                             // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TASK_PerformStunAction(int32 EntryPoint);
	void EnsureStunSequenceIsLoaded();
	void EnsureStunSequenceIsSet();
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void EVENT_SetStunSequence();
	void TryStartAction();
	void EVENT_OnActionFinished();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnLoaded_DE53E1EC46C5F8176A16D29A4F799241(class UObject* Loaded);
	void OnLoaded_A965060D4914BDB328086B8D7A7463B5(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_PerformStunAction_C">();
	}
	static class UTASK_PerformStunAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_PerformStunAction_C>();
	}
};
static_assert(alignof(UTASK_PerformStunAction_C) == 0x000008, "Wrong alignment on UTASK_PerformStunAction_C");
static_assert(sizeof(UTASK_PerformStunAction_C) == 0x0000D8, "Wrong size on UTASK_PerformStunAction_C");
static_assert(offsetof(UTASK_PerformStunAction_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_PerformStunAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, StunActionType) == 0x0000B0, "Member 'UTASK_PerformStunAction_C::StunActionType' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, EnemyPawn) == 0x0000B8, "Member 'UTASK_PerformStunAction_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, StunMontage) == 0x0000C0, "Member 'UTASK_PerformStunAction_C::StunMontage' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, StunLoop) == 0x0000C8, "Member 'UTASK_PerformStunAction_C::StunLoop' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, MontageDuration) == 0x0000D0, "Member 'UTASK_PerformStunAction_C::MontageDuration' has a wrong offset!");
static_assert(offsetof(UTASK_PerformStunAction_C, HasSetStunnedSequence) == 0x0000D4, "Member 'UTASK_PerformStunAction_C::HasSetStunnedSequence' has a wrong offset!");

}

