#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Maneuver_NearbyLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENUM_PreferredCombatStyle_structs.hpp"
#include "LevelVoxelization_structs.hpp"


namespace SDK::Params
{

// Function TASK_Maneuver_NearbyLocation.TASK_Maneuver_NearbyLocation_C.ExecuteUbergraph_TASK_Maneuver_NearbyLocation
// 0x0128 (0x0128 - 0x0000)
struct TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_PreferredCombatStyle                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetShockAgentLocation_Location;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetShockAgentLocation_Location_1;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByAngleFromViewpoint_ReturnValue;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_3;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPreferredRangeBias_Bias;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPreferredDistanceMinMax_PreferredDistance; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelSpatialQueryFuncType                    K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_4;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_5;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelSpatialQueryFuncType                    K2Node_Select_Default_1;                           // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Target_Location_Location;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxElement_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromObstacles_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FilterByVisibilityToPoint_ReturnValue;    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetShockAgentLocation_Location_2;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetCharacter_Character;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_2;                           // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue_1;  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation) == 0x000008, "Wrong alignment on TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation");
static_assert(sizeof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation) == 0x000128, "Wrong size on TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, EntryPoint) == 0x000000, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable) == 0x000004, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_bool_Variable) == 0x000005, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable_1) == 0x000006, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable_2) == 0x000007, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_bool_Variable_1) == 0x000008, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_Event_OwnerController) == 0x000010, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_Event_ControlledPawn) == 0x000018, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000020, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetShockAgentLocation_Location) == 0x000028, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetShockAgentLocation_Location' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x000034, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetShockAgentLocation_Location_1) == 0x000038, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetShockAgentLocation_Location_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetTarget_Target) == 0x000048, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x000060, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_Normal_ReturnValue) == 0x00007C, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_WeightByAngleFromViewpoint_ReturnValue) == 0x000088, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_WeightByAngleFromViewpoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable_3) == 0x000089, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetPreferredRangeBias_Bias) == 0x00008C, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetPreferredRangeBias_Bias' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetPreferredDistanceMinMax_PreferredDistance) == 0x000090, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetPreferredDistanceMinMax_PreferredDistance' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_BreakVector2D_X) == 0x000098, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_BreakVector2D_Y) == 0x00009C, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_Select_Default) == 0x0000A0, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_FFloor_ReturnValue) == 0x0000A4, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x0000A8, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_FCeil_ReturnValue) == 0x0000AC, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable_4) == 0x0000B0, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B1, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, Temp_byte_Variable_5) == 0x0000B2, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_Select_Default_1) == 0x0000B3, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x0000B4, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_Get_Target_Location_Location) == 0x0000C0, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_Get_Target_Location_Location' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetMaxElement_ReturnValue) == 0x0000CC, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetMaxElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_WeightByDistanceFromObstacles_ReturnValue) == 0x0000D0, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_WeightByDistanceFromObstacles_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_MakeArray_Array) == 0x0000D8, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E8, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_FilterByVisibilityToPoint_ReturnValue) == 0x0000F4, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_FilterByVisibilityToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetShockAgentLocation_Location_2) == 0x0000F8, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetShockAgentLocation_Location_2' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_GetTargetCharacter_Character) == 0x000108, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_GetTargetCharacter_Character' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000110, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, K2Node_Select_Default_2) == 0x000114, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation, CallFunc_WeightByDistanceFromPoint_ReturnValue_1) == 0x000120, "Member 'TASK_Maneuver_NearbyLocation_C_ExecuteUbergraph_TASK_Maneuver_NearbyLocation::CallFunc_WeightByDistanceFromPoint_ReturnValue_1' has a wrong offset!");

// Function TASK_Maneuver_NearbyLocation.TASK_Maneuver_NearbyLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Maneuver_NearbyLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

