#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_PerformSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_SkillWeight_structs.hpp"
#include "TASK_PerformActionBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_PerformSkill.TASK_PerformSkill_C
// 0x0020 (0x0100 - 0x00E0)
class UTASK_PerformSkill_C final : public UTASK_PerformActionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TASK_PerformSkill_C;                // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FSTRUCT_SkillWeight>            Skill;                                             // 0x00E8(0x0010)(Edit, BlueprintVisible)
	class USkill_C*                               SkillInUse;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_PerformSkill(int32 EntryPoint);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void StartAction(bool* Success, class UCharacterAction_C** Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_PerformSkill_C">();
	}
	static class UTASK_PerformSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_PerformSkill_C>();
	}
};
static_assert(alignof(UTASK_PerformSkill_C) == 0x000008, "Wrong alignment on UTASK_PerformSkill_C");
static_assert(sizeof(UTASK_PerformSkill_C) == 0x000100, "Wrong size on UTASK_PerformSkill_C");
static_assert(offsetof(UTASK_PerformSkill_C, UberGraphFrame_TASK_PerformSkill_C) == 0x0000E0, "Member 'UTASK_PerformSkill_C::UberGraphFrame_TASK_PerformSkill_C' has a wrong offset!");
static_assert(offsetof(UTASK_PerformSkill_C, Skill) == 0x0000E8, "Member 'UTASK_PerformSkill_C::Skill' has a wrong offset!");
static_assert(offsetof(UTASK_PerformSkill_C, SkillInUse) == 0x0000F8, "Member 'UTASK_PerformSkill_C::SkillInUse' has a wrong offset!");

}

