#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Beam_Base

#include "Basic.hpp"

#include "ENUM_TargetType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_MobileLaser_BeamState_structs.hpp"
#include "STRUCT_EnemyStats_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"


namespace SDK::Params
{

// Function TASK_Beam_Base.TASK_Beam_Base_C.ExecuteUbergraph_TASK_Beam_Base
// 0x0148 (0x0148 - 0x0000)
struct TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_UpdateBeamTurningOff_Progress;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateBeamTurningOn_Progress;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelAudioComponent*                   CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base");
static_assert(sizeof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base) == 0x000148, "Wrong size on TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, EntryPoint) == 0x000000, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_OwnerController_2) == 0x000020, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_ControlledPawn_2) == 0x000028, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_OwnerController_1) == 0x000030, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_ControlledPawn_1) == 0x000038, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000048, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_UpdateBeamTurningOff_Progress) == 0x000054, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_UpdateBeamTurningOff_Progress' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_UpdateBeamTurningOn_Progress) == 0x000058, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_UpdateBeamTurningOn_Progress' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_OwnerController) == 0x000060, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_Event_ControlledPawn) == 0x000068, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_GetTarget_Target) == 0x000070, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, Temp_object_Variable) == 0x000078, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_AsSound_Cue) == 0x000080, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_SwitchEnum_CmpSuccess) == 0x00009C, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000B0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CustomEvent_Loaded) == 0x0000B8, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, Temp_object_Variable_1) == 0x0000C8, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CustomEvent_Loaded_1) == 0x0000D0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_AsSound_Cue_1) == 0x0000D8, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_AsSound_Cue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0000E1, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue) == 0x0000E8, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1) == 0x0000F8, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_SpawnVoxelSoundAttachedFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000100, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_BooleanOR_ReturnValue) == 0x000101, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, Temp_object_Variable_2) == 0x000108, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Array_Get_Item) == 0x000110, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_AsNiagara_System) == 0x000118, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, K2Node_CustomEvent_Loaded_2) == 0x000128, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000138, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_IsValid_ReturnValue_1) == 0x000140, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base, CallFunc_Array_Add_ReturnValue) == 0x000144, "Member 'TASK_Beam_Base_C_ExecuteUbergraph_TASK_Beam_Base::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Beam_Base_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_ReceiveAbortAI");
static_assert(sizeof(TASK_Beam_Base_C_ReceiveAbortAI) == 0x000010, "Wrong size on TASK_Beam_Base_C_ReceiveAbortAI");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'TASK_Beam_Base_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'TASK_Beam_Base_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct TASK_Beam_Base_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_ReceiveTickAI) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_ReceiveTickAI");
static_assert(sizeof(TASK_Beam_Base_C_ReceiveTickAI) == 0x000018, "Wrong size on TASK_Beam_Base_C_ReceiveTickAI");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'TASK_Beam_Base_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'TASK_Beam_Base_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'TASK_Beam_Base_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Beam_Base_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Beam_Base_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Beam_Base_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Beam_Base_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Beam_Base_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.OnLoaded_286EF9BC405A135F062C60B5296EA148
// 0x0008 (0x0008 - 0x0000)
struct TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148");
static_assert(sizeof(TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148) == 0x000008, "Wrong size on TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148");
static_assert(offsetof(TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148, Loaded) == 0x000000, "Member 'TASK_Beam_Base_C_OnLoaded_286EF9BC405A135F062C60B5296EA148::Loaded' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.OnLoaded_41978D6946D489D9553419BA70B7D4FB
// 0x0008 (0x0008 - 0x0000)
struct TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB");
static_assert(sizeof(TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB) == 0x000008, "Wrong size on TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB");
static_assert(offsetof(TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB, Loaded) == 0x000000, "Member 'TASK_Beam_Base_C_OnLoaded_41978D6946D489D9553419BA70B7D4FB::Loaded' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C
// 0x0008 (0x0008 - 0x0000)
struct TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C");
static_assert(sizeof(TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C) == 0x000008, "Wrong size on TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C");
static_assert(offsetof(TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C, Loaded) == 0x000000, "Member 'TASK_Beam_Base_C_OnLoaded_B41A86A2415A41EBF1B52DA7FBFC0F8C::Loaded' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.GetDamageValue
// 0x0060 (0x0060 - 0x0000)
struct TASK_Beam_Base_C_GetDamageValue final
{
public:
	bool                                          IsSecondary;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DamageValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_EnemyStats                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_GetDamageValue) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_GetDamageValue");
static_assert(sizeof(TASK_Beam_Base_C_GetDamageValue) == 0x000060, "Wrong size on TASK_Beam_Base_C_GetDamageValue");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, IsSecondary) == 0x000000, "Member 'TASK_Beam_Base_C_GetDamageValue::IsSecondary' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, DamageValue) == 0x000004, "Member 'TASK_Beam_Base_C_GetDamageValue::DamageValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, Temp_bool_Variable) == 0x000008, "Member 'TASK_Beam_Base_C_GetDamageValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'TASK_Beam_Base_C_GetDamageValue::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'TASK_Beam_Base_C_GetDamageValue::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_GetDamageValue, K2Node_Select_Default) == 0x00005C, "Member 'TASK_Beam_Base_C_GetDamageValue::K2Node_Select_Default' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.BeamDamageTraceFromSockets
// 0x00D0 (0x00D0 - 0x0000)
struct TASK_Beam_Base_C_BeamDamageTraceFromSockets final
{
public:
	bool                                          IsSecondary;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     HitResults;                                        // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FHitResult>                     Hits;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BeamDamageTraceSingle_Result;             // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Beam_Base_C_BeamDamageTraceFromSockets) == 0x000008, "Wrong alignment on TASK_Beam_Base_C_BeamDamageTraceFromSockets");
static_assert(sizeof(TASK_Beam_Base_C_BeamDamageTraceFromSockets) == 0x0000D0, "Wrong size on TASK_Beam_Base_C_BeamDamageTraceFromSockets");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, IsSecondary) == 0x000000, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::IsSecondary' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, HitResults) == 0x000008, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::HitResults' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, Hits) == 0x000018, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::Hits' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, Temp_int_Array_Index_Variable) == 0x000028, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_Array_Get_Item) == 0x000038, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_BeamDamageTraceSingle_Result) == 0x000044, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_BeamDamageTraceSingle_Result' has a wrong offset!");
static_assert(offsetof(TASK_Beam_Base_C_BeamDamageTraceFromSockets, CallFunc_Array_Add_ReturnValue) == 0x0000CC, "Member 'TASK_Beam_Base_C_BeamDamageTraceFromSockets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function TASK_Beam_Base.TASK_Beam_Base_C.BeamDamageTraceSingle
// 0x0800 (0x0800 - 0x0000)
struct TASK_Beam_Base_C_BeamDamageTraceSingle final
{
public:
	bool                                          IsSecondary;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BeamSocket;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Result;                                            // 0x000C(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribManagerComponent*                HitAttribManager;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           HitCharacter;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class APAWN_SystemShockCharacter_C*>     CollidedShieldCharacters;                          // 0x00A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FHitResult                             Hit;                                               // 0x00F8(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FAttribModApplyData                    NewDamageMod;                                      // 0x0180(0x00A0)(Edit, BlueprintVisible)
	float                                         CurrentDamage;                                     // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamDirection;                                     // 0x0224(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x0230(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23E[0x2];                                      // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character_1; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BeamLineTrace_OutHit;                     // 0x035C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_BeamLineTrace_Direction;                  // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance;       // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance_1;     // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDamageValue_DamageValue;               // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x2];                                      // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0496(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_497[0x1];                                      // 0x0497(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DamageCharacterShieldsAlongRay_BlockingHit; // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51E[0x2];                                      // 0x051E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_DamageCharacterShieldsAlongRay_HitResult; // 0x0520(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_4;            // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_4;         // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA[0x2];                                      // 0x05AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_4;                    // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_4;                // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_4;                // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_4;             // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_4;                  // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_4;            // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_4;                 // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_4;                // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_4;            // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_4;             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_4;                 // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_4;            // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
