#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_LBC_UpdateArrivalState

#include "Basic.hpp"


namespace SDK::Params
{

// Function TASK_LBC_UpdateArrivalState.TASK_LBC_UpdateArrivalState_C.ExecuteUbergraph_TASK_LBC_UpdateArrivalState
// 0x0030 (0x0030 - 0x0000)
struct TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalBehaviorComponent_C*              CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState) == 0x000008, "Wrong alignment on TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState");
static_assert(sizeof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState) == 0x000030, "Wrong size on TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, EntryPoint) == 0x000000, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState, CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent) == 0x000028, "Member 'TASK_LBC_UpdateArrivalState_C_ExecuteUbergraph_TASK_LBC_UpdateArrivalState::CallFunc_GetLocalBehaviorComponent_LocalBehaviorComponent' has a wrong offset!");

// Function TASK_LBC_UpdateArrivalState.TASK_LBC_UpdateArrivalState_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_LBC_UpdateArrivalState_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

