#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Diego_v1_Maneuver_CombatTeleport

#include "Basic.hpp"

#include "LevelVoxelization_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_Diego_v1_Maneuver_CombatTeleport.TASK_Diego_v1_Maneuver_CombatTeleport_C.ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport
// 0x00B0 (0x00B0 - 0x0000)
struct TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoxelSpatialQueryFuncType                    Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_FilterByVisibilityToPoint_ReturnValue;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetTargetPawn_Result;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_EnemyTarget_C*                     CallFunc_GetTarget_Target;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPredictedTargetLocation_PredictedLocation; // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVoxelSpatialQueryFuncType                    K2Node_Select_Default;                             // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport) == 0x000008, "Wrong alignment on TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport");
static_assert(sizeof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport) == 0x0000B0, "Wrong size on TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, EntryPoint) == 0x000000, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_Square_ReturnValue) == 0x000004, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, Temp_bool_Variable) == 0x000008, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, Temp_byte_Variable) == 0x000009, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, Temp_byte_Variable_1) == 0x00000A, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, K2Node_Event_OwnerController) == 0x000010, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, K2Node_Event_ControlledPawn) == 0x000018, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000030, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x000038, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, K2Node_MakeArray_Array) == 0x000040, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_FilterByVisibilityToPoint_ReturnValue) == 0x000050, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_FilterByVisibilityToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_GetTargetPawn_Result) == 0x000058, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_GetTargetPawn_Result' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00006C, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_GetTarget_Target) == 0x000080, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_GetTarget_Target' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x000088, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_GetPredictedTargetLocation_PredictedLocation) == 0x00008C, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_GetPredictedTargetLocation_PredictedLocation' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_RandomBool_ReturnValue) == 0x000098, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00009C, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x0000A8, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000AC, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_BooleanOR_ReturnValue) == 0x0000AD, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, K2Node_Select_Default) == 0x0000AE, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x0000AF, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ExecuteUbergraph_TASK_Diego_v1_Maneuver_CombatTeleport::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");

// Function TASK_Diego_v1_Maneuver_CombatTeleport.TASK_Diego_v1_Maneuver_CombatTeleport_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Diego_v1_Maneuver_CombatTeleport_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

