#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_SetAimTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_TargetAssignmentType_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_SetAimTarget.TASK_SetAimTarget_C
// 0x0028 (0x00D0 - 0x00A8)
class UTASK_SetAimTarget_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsAimEnabled;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CopyAndFreezeLocation;                             // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictionTime;                                    // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TargetAssignmentType                     TargetSource;                                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOBJ_EnemyTarget_C*                     Target;                                            // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_SetAimTarget(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_SetAimTarget_C">();
	}
	static class UTASK_SetAimTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_SetAimTarget_C>();
	}
};
static_assert(alignof(UTASK_SetAimTarget_C) == 0x000008, "Wrong alignment on UTASK_SetAimTarget_C");
static_assert(sizeof(UTASK_SetAimTarget_C) == 0x0000D0, "Wrong size on UTASK_SetAimTarget_C");
static_assert(offsetof(UTASK_SetAimTarget_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_SetAimTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, IsAimEnabled) == 0x0000B0, "Member 'UTASK_SetAimTarget_C::IsAimEnabled' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, CopyAndFreezeLocation) == 0x0000B1, "Member 'UTASK_SetAimTarget_C::CopyAndFreezeLocation' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, PredictionTime) == 0x0000B4, "Member 'UTASK_SetAimTarget_C::PredictionTime' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, TargetSource) == 0x0000B8, "Member 'UTASK_SetAimTarget_C::TargetSource' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, EnemyPawn) == 0x0000C0, "Member 'UTASK_SetAimTarget_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_SetAimTarget_C, Target) == 0x0000C8, "Member 'UTASK_SetAimTarget_C::Target' has a wrong offset!");

}

