#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_Maneuver_Hide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TASK_Maneuver_Hide.TASK_Maneuver_Hide_C.ExecuteUbergraph_TASK_Maneuver_Hide
// 0x00C0 (0x00C0 - 0x0000)
struct TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoxelSpatialNavigationQuery*           CallFunc_CreateSpatialNavigationQuery_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddPathableVoxelsInBox_ReturnValue;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByAngleFromViewpoint_ReturnValue;   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeightByDistanceFromPoint_ReturnValue;    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult, TArray<struct FVector4>& WeightedWorldLocations)> K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_FilterByVisibilityToPoint_ReturnValue;    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteQueryInBackground_ReturnValue;     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide) == 0x000008, "Wrong alignment on TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide");
static_assert(sizeof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide) == 0x0000C0, "Wrong size on TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, EntryPoint) == 0x000000, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000010, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_CreateSpatialNavigationQuery_ReturnValue) == 0x000030, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_CreateSpatialNavigationQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_GetNavAgentLocation_ReturnValue) == 0x000038, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_GetNavAgentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_AddPathableVoxelsInBox_ReturnValue) == 0x000044, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_AddPathableVoxelsInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000054, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_WeightByAngleFromViewpoint_ReturnValue) == 0x00006C, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_WeightByAngleFromViewpoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_GetNavAgentLocation_ReturnValue_1) == 0x000070, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_GetNavAgentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, K2Node_Event_OwnerController) == 0x000080, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, K2Node_Event_ControlledPawn) == 0x000088, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_WeightByDistanceFromPoint_ReturnValue) == 0x000090, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_WeightByDistanceFromPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, K2Node_MakeArray_Array) == 0x0000A8, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_FilterByVisibilityToPoint_ReturnValue) == 0x0000B8, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_FilterByVisibilityToPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_ExecuteQueryInBackground_ReturnValue) == 0x0000B9, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_ExecuteQueryInBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide, CallFunc_Not_PreBool_ReturnValue) == 0x0000BA, "Member 'TASK_Maneuver_Hide_C_ExecuteUbergraph_TASK_Maneuver_Hide::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TASK_Maneuver_Hide.TASK_Maneuver_Hide_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_Maneuver_Hide_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_Maneuver_Hide_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_Maneuver_Hide_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_Maneuver_Hide_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_Maneuver_Hide_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_Maneuver_Hide_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_Maneuver_Hide_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_Maneuver_Hide_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_Maneuver_Hide_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

