#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_MobileLaser_Beam_LongRange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TASK_Beam_Base_classes.hpp"
#include "ENUM_MobileLaser_BeamState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_MobileLaser_Beam_LongRange.TASK_MobileLaser_Beam_LongRange_C
// 0x0010 (0x0220 - 0x0210)
class UTASK_MobileLaser_Beam_LongRange_C final : public UTASK_Beam_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TASK_MobileLaser_Beam_LongRange_C;  // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LongRangeBeamDuration;                             // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBeamAimAngle;                                   // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_MobileLaser_Beam_LongRange(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void UpdateBeamOn(float DeltaSeconds);
	void UpdateBeamTurningOn(float DeltaSeconds, float* Progress);
	void SetBeamState(ENUM_MobileLaser_BeamState State);
	void GetBeamAimDirection(class FName BeamSocket, struct FVector* BeamAimDirection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_MobileLaser_Beam_LongRange_C">();
	}
	static class UTASK_MobileLaser_Beam_LongRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_MobileLaser_Beam_LongRange_C>();
	}
};
static_assert(alignof(UTASK_MobileLaser_Beam_LongRange_C) == 0x000008, "Wrong alignment on UTASK_MobileLaser_Beam_LongRange_C");
static_assert(sizeof(UTASK_MobileLaser_Beam_LongRange_C) == 0x000220, "Wrong size on UTASK_MobileLaser_Beam_LongRange_C");
static_assert(offsetof(UTASK_MobileLaser_Beam_LongRange_C, UberGraphFrame_TASK_MobileLaser_Beam_LongRange_C) == 0x000210, "Member 'UTASK_MobileLaser_Beam_LongRange_C::UberGraphFrame_TASK_MobileLaser_Beam_LongRange_C' has a wrong offset!");
static_assert(offsetof(UTASK_MobileLaser_Beam_LongRange_C, LongRangeBeamDuration) == 0x000218, "Member 'UTASK_MobileLaser_Beam_LongRange_C::LongRangeBeamDuration' has a wrong offset!");
static_assert(offsetof(UTASK_MobileLaser_Beam_LongRange_C, MaxBeamAimAngle) == 0x00021C, "Member 'UTASK_MobileLaser_Beam_LongRange_C::MaxBeamAimAngle' has a wrong offset!");

}

