#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_ForceEndCurrentAction

#include "Basic.hpp"

#include "ENUM_ActionPriority_structs.hpp"


namespace SDK::Params
{

// Function TASK_ForceEndCurrentAction.TASK_ForceEndCurrentAction_C.ExecuteUbergraph_TASK_ForceEndCurrentAction
// 0x0040 (0x0040 - 0x0000)
struct TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_GetCurrentAction_CurrentAction;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ActionPriority                           CallFunc_GetPriority_Result;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_GetCurrentAction_CurrentAction_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction) == 0x000008, "Wrong alignment on TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction");
static_assert(sizeof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction) == 0x000040, "Wrong size on TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, EntryPoint) == 0x000000, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, K2Node_Event_OwnerController) == 0x000008, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, K2Node_Event_ControlledPawn) == 0x000010, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000018, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, CallFunc_GetCurrentAction_CurrentAction) == 0x000028, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::CallFunc_GetCurrentAction_CurrentAction' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, CallFunc_GetPriority_Result) == 0x000030, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::CallFunc_GetPriority_Result' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000031, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction, CallFunc_GetCurrentAction_CurrentAction_1) == 0x000038, "Member 'TASK_ForceEndCurrentAction_C_ExecuteUbergraph_TASK_ForceEndCurrentAction::CallFunc_GetCurrentAction_CurrentAction_1' has a wrong offset!");

// Function TASK_ForceEndCurrentAction.TASK_ForceEndCurrentAction_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TASK_ForceEndCurrentAction_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TASK_ForceEndCurrentAction_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on TASK_ForceEndCurrentAction_C_ReceiveExecuteAI");
static_assert(sizeof(TASK_ForceEndCurrentAction_C_ReceiveExecuteAI) == 0x000010, "Wrong size on TASK_ForceEndCurrentAction_C_ReceiveExecuteAI");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'TASK_ForceEndCurrentAction_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(TASK_ForceEndCurrentAction_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'TASK_ForceEndCurrentAction_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

