#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_AssignInitialBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_AssignInitialBehavior.TASK_AssignInitialBehavior_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_AssignInitialBehavior_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           BehaviorTag;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_AssignInitialBehavior(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_AssignInitialBehavior_C">();
	}
	static class UTASK_AssignInitialBehavior_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_AssignInitialBehavior_C>();
	}
};
static_assert(alignof(UTASK_AssignInitialBehavior_C) == 0x000008, "Wrong alignment on UTASK_AssignInitialBehavior_C");
static_assert(sizeof(UTASK_AssignInitialBehavior_C) == 0x0000C0, "Wrong size on UTASK_AssignInitialBehavior_C");
static_assert(offsetof(UTASK_AssignInitialBehavior_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_AssignInitialBehavior_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_AssignInitialBehavior_C, EnemyPawn) == 0x0000B0, "Member 'UTASK_AssignInitialBehavior_C::EnemyPawn' has a wrong offset!");
static_assert(offsetof(UTASK_AssignInitialBehavior_C, BehaviorTag) == 0x0000B8, "Member 'UTASK_AssignInitialBehavior_C::BehaviorTag' has a wrong offset!");

}

