#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TASK_LBC_UpdateArrivalState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TASK_LBC_UpdateArrivalState.TASK_LBC_UpdateArrivalState_C
// 0x0018 (0x00C0 - 0x00A8)
class UTASK_LBC_UpdateArrivalState_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Reset;                                             // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalBehaviorComponent_C*              LBC;                                               // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TASK_LBC_UpdateArrivalState(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TASK_LBC_UpdateArrivalState_C">();
	}
	static class UTASK_LBC_UpdateArrivalState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTASK_LBC_UpdateArrivalState_C>();
	}
};
static_assert(alignof(UTASK_LBC_UpdateArrivalState_C) == 0x000008, "Wrong alignment on UTASK_LBC_UpdateArrivalState_C");
static_assert(sizeof(UTASK_LBC_UpdateArrivalState_C) == 0x0000C0, "Wrong size on UTASK_LBC_UpdateArrivalState_C");
static_assert(offsetof(UTASK_LBC_UpdateArrivalState_C, UberGraphFrame) == 0x0000A8, "Member 'UTASK_LBC_UpdateArrivalState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTASK_LBC_UpdateArrivalState_C, Reset) == 0x0000B0, "Member 'UTASK_LBC_UpdateArrivalState_C::Reset' has a wrong offset!");
static_assert(offsetof(UTASK_LBC_UpdateArrivalState_C, LBC) == 0x0000B8, "Member 'UTASK_LBC_UpdateArrivalState_C::LBC' has a wrong offset!");

}

