#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextTyper

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TextTyper.TextTyper_C
// 0x0020 (0x0048 - 0x0028)
class UTextTyper_C final : public UObject
{
public:
	class FText                                   TyperMessage;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TyperInterval;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         StartTimestamp;                                    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTextMessage(const class FText& Message, float GameTimeSeconds, bool* Result);
	void ResetMessage(bool* Result);
	void GetCurrentMessage(float GameTimeSeconds, class FText* Message);
	void HasMessage(bool* Result);
	void GetElapsedTime(float GameTimeSeconds, float* ElapsedSeconds);
	void GetTargetMessage(class FText* Message);
	void GetCurrentCharacterCount(float GameTimeSeconds, int32* Result);
	void GetMessageWithCharacterCount(int32 CharacterCount, class FText* Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextTyper_C">();
	}
	static class UTextTyper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextTyper_C>();
	}
};
static_assert(alignof(UTextTyper_C) == 0x000008, "Wrong alignment on UTextTyper_C");
static_assert(sizeof(UTextTyper_C) == 0x000048, "Wrong size on UTextTyper_C");
static_assert(offsetof(UTextTyper_C, TyperMessage) == 0x000028, "Member 'UTextTyper_C::TyperMessage' has a wrong offset!");
static_assert(offsetof(UTextTyper_C, TyperInterval) == 0x000040, "Member 'UTextTyper_C::TyperInterval' has a wrong offset!");
static_assert(offsetof(UTextTyper_C, StartTimestamp) == 0x000044, "Member 'UTextTyper_C::StartTimestamp' has a wrong offset!");

}

