#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TILE_Prefab_Pipe_Ceiling_Grate_Broken

#include "Basic.hpp"

#include "TILE_Prefab_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TILE_Prefab_Pipe_Ceiling_Grate_Broken.TILE_Prefab_Pipe_Ceiling_Grate_Broken_C
// 0x0018 (0x0248 - 0x0230)
class ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C final : public ATILE_Prefab_C
{
public:
	class UCOMP_VoxelAudio_C*                     COMP_VoxelAudio;                                   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Descriptor_C*                     COMP_Descriptor;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_SteamJetSmall;                                   // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TILE_Prefab_Pipe_Ceiling_Grate_Broken_C">();
	}
	static class ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C>();
	}
};
static_assert(alignof(ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C) == 0x000008, "Wrong alignment on ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C");
static_assert(sizeof(ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C) == 0x000248, "Wrong size on ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C, COMP_VoxelAudio) == 0x000230, "Member 'ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C::COMP_VoxelAudio' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C, COMP_Descriptor) == 0x000238, "Member 'ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C::COMP_Descriptor' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C, P_SteamJetSmall) == 0x000240, "Member 'ATILE_Prefab_Pipe_Ceiling_Grate_Broken_C::P_SteamJetSmall' has a wrong offset!");

}

