#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TILE_Prefab_Pipe_Ceiling_Light_Destroyed

#include "Basic.hpp"

#include "TILE_BrokenSingleLightPanel_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TILE_Prefab_Pipe_Ceiling_Light_Destroyed.TILE_Prefab_Pipe_Ceiling_Light_Destroyed_C
// 0x0050 (0x0300 - 0x02B0)
class ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C final : public ATILE_BrokenSingleLightPanel_C
{
public:
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_29;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_17;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_35;                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_02;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_39;                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_38;                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_09;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SK_BrokenGlass_Piece_010;                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BrokenGlass;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TILE_Prefab_Pipe_Ceiling_Light_Destroyed_C">();
	}
	static class ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C>();
	}
};
static_assert(alignof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C) == 0x000010, "Wrong alignment on ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C");
static_assert(sizeof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C) == 0x000300, "Wrong size on ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_29) == 0x0002B0, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_29' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_17) == 0x0002B8, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_17' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_35) == 0x0002C0, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_35' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_02) == 0x0002C8, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_02' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_39) == 0x0002D0, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_39' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_38) == 0x0002D8, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_38' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_09) == 0x0002E0, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_09' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, SK_BrokenGlass_Piece_010) == 0x0002E8, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::SK_BrokenGlass_Piece_010' has a wrong offset!");
static_assert(offsetof(ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C, BrokenGlass) == 0x0002F0, "Member 'ATILE_Prefab_Pipe_Ceiling_Light_Destroyed_C::BrokenGlass' has a wrong offset!");

}

