#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRACE_HeartVoltage

#include "Basic.hpp"


namespace SDK::Params
{

// Function TRACE_HeartVoltage.TRACE_HeartVoltage_C.ExecuteUbergraph_TRACE_HeartVoltage
// 0x0038 (0x0038 - 0x0000)
struct TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeSeriesTraceWidget*                 CallFunc_GetTimeSeriesTraceWidget_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    CallFunc_GetNeuralHUD_Result;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage) == 0x000008, "Wrong alignment on TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage");
static_assert(sizeof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage) == 0x000038, "Wrong size on TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, EntryPoint) == 0x000000, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::EntryPoint' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, CallFunc_GetTimeSeriesTraceWidget_ReturnValue) == 0x000008, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::CallFunc_GetTimeSeriesTraceWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000020, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage, CallFunc_GetNeuralHUD_Result) == 0x000030, "Member 'TRACE_HeartVoltage_C_ExecuteUbergraph_TRACE_HeartVoltage::CallFunc_GetNeuralHUD_Result' has a wrong offset!");

// Function TRACE_HeartVoltage.TRACE_HeartVoltage_C.K2_EvaluateFunction
// 0x0010 (0x0010 - 0x0000)
struct TRACE_HeartVoltage_C_K2_EvaluateFunction final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRACE_HeartVoltage_C_K2_EvaluateFunction) == 0x000004, "Wrong alignment on TRACE_HeartVoltage_C_K2_EvaluateFunction");
static_assert(sizeof(TRACE_HeartVoltage_C_K2_EvaluateFunction) == 0x000010, "Wrong size on TRACE_HeartVoltage_C_K2_EvaluateFunction");
static_assert(offsetof(TRACE_HeartVoltage_C_K2_EvaluateFunction, ReturnValue) == 0x000000, "Member 'TRACE_HeartVoltage_C_K2_EvaluateFunction::ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_K2_EvaluateFunction, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'TRACE_HeartVoltage_C_K2_EvaluateFunction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_K2_EvaluateFunction, CallFunc_FMax_ReturnValue) == 0x000008, "Member 'TRACE_HeartVoltage_C_K2_EvaluateFunction::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_HeartVoltage_C_K2_EvaluateFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'TRACE_HeartVoltage_C_K2_EvaluateFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

