#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRACE_ChiWave

#include "Basic.hpp"


namespace SDK::Params
{

// Function TRACE_ChiWave.TRACE_ChiWave_C.ExecuteUbergraph_TRACE_ChiWave
// 0x0040 (0x0040 - 0x0000)
struct TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeSeriesTraceWidget*                 CallFunc_GetTimeSeriesTraceWidget_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APAWN_SystemShockCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInitializedAttributes_ReturnValue;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave) == 0x000008, "Wrong alignment on TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave");
static_assert(sizeof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave) == 0x000040, "Wrong size on TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, EntryPoint) == 0x000000, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::EntryPoint' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, CallFunc_GetTimeSeriesTraceWidget_ReturnValue) == 0x000008, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::CallFunc_GetTimeSeriesTraceWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000030, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave, CallFunc_HasInitializedAttributes_ReturnValue) == 0x000039, "Member 'TRACE_ChiWave_C_ExecuteUbergraph_TRACE_ChiWave::CallFunc_HasInitializedAttributes_ReturnValue' has a wrong offset!");

// Function TRACE_ChiWave.TRACE_ChiWave_C.K2_EvaluateFunction
// 0x0010 (0x0010 - 0x0000)
struct TRACE_ChiWave_C_K2_EvaluateFunction final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRACE_ChiWave_C_K2_EvaluateFunction) == 0x000004, "Wrong alignment on TRACE_ChiWave_C_K2_EvaluateFunction");
static_assert(sizeof(TRACE_ChiWave_C_K2_EvaluateFunction) == 0x000010, "Wrong size on TRACE_ChiWave_C_K2_EvaluateFunction");
static_assert(offsetof(TRACE_ChiWave_C_K2_EvaluateFunction, ReturnValue) == 0x000000, "Member 'TRACE_ChiWave_C_K2_EvaluateFunction::ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_K2_EvaluateFunction, CallFunc_Sin_ReturnValue) == 0x000004, "Member 'TRACE_ChiWave_C_K2_EvaluateFunction::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_K2_EvaluateFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'TRACE_ChiWave_C_K2_EvaluateFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_K2_EvaluateFunction, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'TRACE_ChiWave_C_K2_EvaluateFunction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function TRACE_ChiWave.TRACE_ChiWave_C.SetFrequencyRatio
// 0x000C (0x000C - 0x0000)
struct TRACE_ChiWave_C_SetFrequencyRatio final
{
public:
	float                                         Ratio;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRACE_ChiWave_C_SetFrequencyRatio) == 0x000004, "Wrong alignment on TRACE_ChiWave_C_SetFrequencyRatio");
static_assert(sizeof(TRACE_ChiWave_C_SetFrequencyRatio) == 0x00000C, "Wrong size on TRACE_ChiWave_C_SetFrequencyRatio");
static_assert(offsetof(TRACE_ChiWave_C_SetFrequencyRatio, Ratio) == 0x000000, "Member 'TRACE_ChiWave_C_SetFrequencyRatio::Ratio' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_SetFrequencyRatio, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'TRACE_ChiWave_C_SetFrequencyRatio::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_SetFrequencyRatio, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'TRACE_ChiWave_C_SetFrequencyRatio::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function TRACE_ChiWave.TRACE_ChiWave_C.UpdateFrequency
// 0x001C (0x001C - 0x0000)
struct TRACE_ChiWave_C_UpdateFrequency final
{
public:
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRACE_ChiWave_C_UpdateFrequency) == 0x000004, "Wrong alignment on TRACE_ChiWave_C_UpdateFrequency");
static_assert(sizeof(TRACE_ChiWave_C_UpdateFrequency) == 0x00001C, "Wrong size on TRACE_ChiWave_C_UpdateFrequency");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_GetPI_ReturnValue) == 0x000000, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00000C, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000010, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_FInterpTo_ReturnValue) == 0x000014, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_UpdateFrequency, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'TRACE_ChiWave_C_UpdateFrequency::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function TRACE_ChiWave.TRACE_ChiWave_C.EVENT_OnCharacterInitialized
// 0x0030 (0x0030 - 0x0000)
struct TRACE_ChiWave_C_EVENT_OnCharacterInitialized final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        PsychosisAttribInstance;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetOrCreateAttribInstance_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrValue, float LastValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized) == 0x000008, "Wrong alignment on TRACE_ChiWave_C_EVENT_OnCharacterInitialized");
static_assert(sizeof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized) == 0x000030, "Wrong size on TRACE_ChiWave_C_EVENT_OnCharacterInitialized");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized, Character) == 0x000000, "Member 'TRACE_ChiWave_C_EVENT_OnCharacterInitialized::Character' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized, PsychosisAttribInstance) == 0x000008, "Member 'TRACE_ChiWave_C_EVENT_OnCharacterInitialized::PsychosisAttribInstance' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized, CallFunc_GetOrCreateAttribInstance_ReturnValue) == 0x000010, "Member 'TRACE_ChiWave_C_EVENT_OnCharacterInitialized::CallFunc_GetOrCreateAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized, CallFunc_GetValue_ReturnValue) == 0x000018, "Member 'TRACE_ChiWave_C_EVENT_OnCharacterInitialized::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnCharacterInitialized, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'TRACE_ChiWave_C_EVENT_OnCharacterInitialized::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function TRACE_ChiWave.TRACE_ChiWave_C.EVENT_OnPsychosisChanged
// 0x000C (0x000C - 0x0000)
struct TRACE_ChiWave_C_EVENT_OnPsychosisChanged final
{
public:
	float                                         CurrValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRACE_ChiWave_C_EVENT_OnPsychosisChanged) == 0x000004, "Wrong alignment on TRACE_ChiWave_C_EVENT_OnPsychosisChanged");
static_assert(sizeof(TRACE_ChiWave_C_EVENT_OnPsychosisChanged) == 0x00000C, "Wrong size on TRACE_ChiWave_C_EVENT_OnPsychosisChanged");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnPsychosisChanged, CurrValue) == 0x000000, "Member 'TRACE_ChiWave_C_EVENT_OnPsychosisChanged::CurrValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnPsychosisChanged, PrevValue) == 0x000004, "Member 'TRACE_ChiWave_C_EVENT_OnPsychosisChanged::PrevValue' has a wrong offset!");
static_assert(offsetof(TRACE_ChiWave_C_EVENT_OnPsychosisChanged, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'TRACE_ChiWave_C_EVENT_OnPsychosisChanged::CallFunc_Lerp_ReturnValue' has a wrong offset!");

}

