#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRAP_BossEncounter

#include "Basic.hpp"

#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.InitializeTrap
// 0x0001 (0x0001 - 0x0000)
struct TRAP_BossEncounter_C_InitializeTrap final
{
public:
	bool                                          CallFunc_TryBindSpawnEnemyDiedEvents_Result;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_InitializeTrap) == 0x000001, "Wrong alignment on TRAP_BossEncounter_C_InitializeTrap");
static_assert(sizeof(TRAP_BossEncounter_C_InitializeTrap) == 0x000001, "Wrong size on TRAP_BossEncounter_C_InitializeTrap");
static_assert(offsetof(TRAP_BossEncounter_C_InitializeTrap, CallFunc_TryBindSpawnEnemyDiedEvents_Result) == 0x000000, "Member 'TRAP_BossEncounter_C_InitializeTrap::CallFunc_TryBindSpawnEnemyDiedEvents_Result' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.OnSpringTrap
// 0x0088 (0x0088 - 0x0000)
struct TRAP_BossEncounter_C_OnSpringTrap final
{
public:
	class APAWN_Hacker_Simple_C*                  Hacker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          SpawnedEnemy;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_DetectionEvent_C*                  CallFunc_GetDetectionEvent_DetectionEvent;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryBindSpawnEnemyDiedEvents_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAttribMod*>                     CallFunc_ApplyMods_ReturnValue;                    // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemySpawnPoint_C*                     CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_SpawnEnemy_Enemy;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_OnSpringTrap) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_OnSpringTrap");
static_assert(sizeof(TRAP_BossEncounter_C_OnSpringTrap) == 0x000088, "Wrong size on TRAP_BossEncounter_C_OnSpringTrap");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, Hacker) == 0x000000, "Member 'TRAP_BossEncounter_C_OnSpringTrap::Hacker' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, SpawnedEnemy) == 0x000008, "Member 'TRAP_BossEncounter_C_OnSpringTrap::SpawnedEnemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'TRAP_BossEncounter_C_OnSpringTrap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'TRAP_BossEncounter_C_OnSpringTrap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'TRAP_BossEncounter_C_OnSpringTrap::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'TRAP_BossEncounter_C_OnSpringTrap::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_GetDetectionEvent_DetectionEvent) == 0x000030, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_GetDetectionEvent_DetectionEvent' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_TryBindSpawnEnemyDiedEvents_Result) == 0x000038, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_TryBindSpawnEnemyDiedEvents_Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_ApplyMods_ReturnValue) == 0x000040, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_ApplyMods_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Array_Get_Item) == 0x000058, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_SpawnEnemy_Enemy) == 0x000078, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_SpawnEnemy_Enemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnSpringTrap, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'TRAP_BossEncounter_C_OnSpringTrap::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.OnRemoveSpawnedEnemy
// 0x0030 (0x0030 - 0x0000)
struct TRAP_BossEncounter_C_OnRemoveSpawnedEnemy final
{
public:
	class APAWN_Enemy_C*                          Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class APAWN_SystemShockCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_OnRemoveSpawnedEnemy");
static_assert(sizeof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy) == 0x000030, "Wrong size on TRAP_BossEncounter_C_OnRemoveSpawnedEnemy");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, Enemy) == 0x000000, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::Enemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, CallFunc_Array_RemoveItem_ReturnValue) == 0x00002C, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnRemoveSpawnedEnemy, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002D, "Member 'TRAP_BossEncounter_C_OnRemoveSpawnedEnemy::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.OnEncounterFinished
// 0x0070 (0x0070 - 0x0000)
struct TRAP_BossEncounter_C_OnEncounterFinished final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(NoDestructor)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_Base_C*                       CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_OnEncounterFinished) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_OnEncounterFinished");
static_assert(sizeof(TRAP_BossEncounter_C_OnEncounterFinished) == 0x000070, "Wrong size on TRAP_BossEncounter_C_OnEncounterFinished");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, Temp_int_Array_Index_Variable) == 0x000008, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Array_Get_Item) == 0x000020, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_GetPlayerPawn_ReturnValue) == 0x000040, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000048, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_OnEncounterFinished, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'TRAP_BossEncounter_C_OnEncounterFinished::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.EVENT_OnSpawnedEnemyDied
// 0x0018 (0x0018 - 0x0000)
struct TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied");
static_assert(sizeof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied) == 0x000018, "Wrong size on TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied, Character) == 0x000000, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied::Character' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000008, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDied::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.TryBindSpawnEnemyDiedEvents
// 0x0068 (0x0068 - 0x0000)
struct TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AnyEventsBound;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CurrentEnemy;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APAWN_SystemShockCharacter_C* Character)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents");
static_assert(sizeof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents) == 0x000068, "Wrong size on TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, Result) == 0x000000, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, AnyEventsBound) == 0x000001, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::AnyEventsBound' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CurrentEnemy) == 0x000008, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CurrentEnemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000038, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_Array_Get_Item) == 0x000058, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'TRAP_BossEncounter_C_TryBindSpawnEnemyDiedEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.EVENT_OnSpawnedEnemyDestroyed
// 0x0018 (0x0018 - 0x0000)
struct TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          K2Node_DynamicCast_AsPAWN_Enemy;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed");
static_assert(sizeof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed) == 0x000018, "Wrong size on TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed, DestroyedActor) == 0x000000, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed::DestroyedActor' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed, K2Node_DynamicCast_AsPAWN_Enemy) == 0x000008, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed::K2Node_DynamicCast_AsPAWN_Enemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TRAP_BossEncounter_C_EVENT_OnSpawnedEnemyDestroyed::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.TryLockInteractBeforeEncounter
// 0x00B0 (0x00B0 - 0x0000)
struct TRAP_BossEncounter_C_TryLockInteractBeforeEncounter final
{
public:
	class AINTERACT_Base_C*                       Interact;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_GetInteractLocked_self_CastInput;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInteractLocked_Result;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInteractLocked_LockMessage;            // 0x0028(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_DoorBase_C*                   K2Node_DynamicCast_AsINTERACT_Door_Base;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_SetInteractLocked_self_CastInput;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInteractLocked_Result;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_ForceDoor_C*                  K2Node_DynamicCast_AsINTERACT_Force_Door;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0090(0x0020)(HasGetValueTypeHash)
};
static_assert(alignof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_TryLockInteractBeforeEncounter");
static_assert(sizeof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter) == 0x0000B0, "Wrong size on TRAP_BossEncounter_C_TryLockInteractBeforeEncounter");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, Interact) == 0x000000, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::Interact' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_GetInteractLocked_self_CastInput) == 0x000010, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_GetInteractLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_GetInteractLocked_Result) == 0x000020, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_GetInteractLocked_Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_GetInteractLocked_LockMessage) == 0x000028, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_GetInteractLocked_LockMessage' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, K2Node_DynamicCast_AsINTERACT_Door_Base) == 0x000048, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::K2Node_DynamicCast_AsINTERACT_Door_Base' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_Array_Contains_ReturnValue) == 0x000051, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_SetInteractLocked_self_CastInput) == 0x000058, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_SetInteractLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_SetInteractLocked_Result) == 0x000068, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_SetInteractLocked_Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_Not_PreBool_ReturnValue_1) == 0x000069, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, K2Node_DynamicCast_AsINTERACT_Force_Door) == 0x000070, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::K2Node_DynamicCast_AsINTERACT_Force_Door' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_TryInteract_self_CastInput) == 0x000080, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryLockInteractBeforeEncounter, CallFunc_TryInteract_InteractResults) == 0x000090, "Member 'TRAP_BossEncounter_C_TryLockInteractBeforeEncounter::CallFunc_TryInteract_InteractResults' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.TryUnlockInteractAfterEncounter
// 0x0078 (0x0078 - 0x0000)
struct TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter final
{
public:
	class AINTERACT_Base_C*                       Interact;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_DoorBase_C*                   K2Node_DynamicCast_AsINTERACT_Door_Base;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AINTERACT_ForceDoor_C*                  K2Node_DynamicCast_AsINTERACT_Force_Door;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_TryInteract_self_CastInput;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0040(0x0020)(HasGetValueTypeHash)
	TScriptInterface<class IINTERF_Interactable_C> CallFunc_SetInteractLocked_self_CastInput;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetInteractLocked_Result;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter");
static_assert(sizeof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter) == 0x000078, "Wrong size on TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, Interact) == 0x000000, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::Interact' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_Set_Remove_ReturnValue) == 0x000008, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, K2Node_DynamicCast_AsINTERACT_Door_Base) == 0x000010, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::K2Node_DynamicCast_AsINTERACT_Door_Base' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, K2Node_DynamicCast_AsINTERACT_Force_Door) == 0x000020, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::K2Node_DynamicCast_AsINTERACT_Force_Door' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_TryInteract_self_CastInput) == 0x000030, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_TryInteract_self_CastInput' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_TryInteract_InteractResults) == 0x000040, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_SetInteractLocked_self_CastInput) == 0x000060, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_SetInteractLocked_self_CastInput' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter, CallFunc_SetInteractLocked_Result) == 0x000070, "Member 'TRAP_BossEncounter_C_TryUnlockInteractAfterEncounter::CallFunc_SetInteractLocked_Result' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.UpdateCutsceneArmorMod
// 0x00E8 (0x00E8 - 0x0000)
struct TRAP_BossEncounter_C_UpdateCutsceneArmorMod final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribModApplyData                    SuperArmorMod;                                     // 0x0008(0x00A0)(Edit, BlueprintVisible)
	class APAWN_Enemy_C*                          CurrentEnemy;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExpireModsWithCategory_ReturnValue;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Enemy_C*                          CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_UpdateCutsceneArmorMod");
static_assert(sizeof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod) == 0x0000E8, "Wrong size on TRAP_BossEncounter_C_UpdateCutsceneArmorMod");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, State) == 0x000000, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::State' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, SuperArmorMod) == 0x000008, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::SuperArmorMod' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CurrentEnemy) == 0x0000A8, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CurrentEnemy' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_ExpireModsWithCategory_ReturnValue) == 0x0000C0, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_ExpireModsWithCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_ApplyMod_ReturnValue) == 0x0000C8, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_UpdateCutsceneArmorMod, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'TRAP_BossEncounter_C_UpdateCutsceneArmorMod::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.StartCutsceneCamera
// 0x0060 (0x0060 - 0x0000)
struct TRAP_BossEncounter_C_StartCutsceneCamera final
{
public:
	class APAWN_Hacker_Implant_C*                 HackerPawn;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Enemy_C*                          CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMOVECONTROL_Base_C* MoveControl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RegisterMoveControl_Result;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMOVECONTROL_BossCutscene_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_StartCutsceneCamera) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_StartCutsceneCamera");
static_assert(sizeof(TRAP_BossEncounter_C_StartCutsceneCamera) == 0x000060, "Wrong size on TRAP_BossEncounter_C_StartCutsceneCamera");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, HackerPawn) == 0x000000, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::HackerPawn' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_Array_Get_Item) == 0x000008, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_Add_VectorVector_ReturnValue) == 0x00001C, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_RegisterMoveControl_Result) == 0x000038, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_RegisterMoveControl_Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, CallFunc_GetPlayerPawn_ReturnValue) == 0x000048, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000050, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StartCutsceneCamera, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'TRAP_BossEncounter_C_StartCutsceneCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.StopCutsceneCamera
// 0x0020 (0x0020 - 0x0000)
struct TRAP_BossEncounter_C_StopCutsceneCamera final
{
public:
	class UMOVECONTROL_Base_C*                    MoveControl;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOV_Result;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRAP_BossEncounter_C_StopCutsceneCamera) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_StopCutsceneCamera");
static_assert(sizeof(TRAP_BossEncounter_C_StopCutsceneCamera) == 0x000020, "Wrong size on TRAP_BossEncounter_C_StopCutsceneCamera");
static_assert(offsetof(TRAP_BossEncounter_C_StopCutsceneCamera, MoveControl) == 0x000000, "Member 'TRAP_BossEncounter_C_StopCutsceneCamera::MoveControl' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StopCutsceneCamera, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'TRAP_BossEncounter_C_StopCutsceneCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StopCutsceneCamera, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'TRAP_BossEncounter_C_StopCutsceneCamera::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_StopCutsceneCamera, CallFunc_GetFOV_Result) == 0x000018, "Member 'TRAP_BossEncounter_C_StopCutsceneCamera::CallFunc_GetFOV_Result' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.HasSpawnedEnemy
// 0x0010 (0x0010 - 0x0000)
struct TRAP_BossEncounter_C_HasSpawnedEnemy final
{
public:
	class APAWN_Enemy_C*                          EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRAP_BossEncounter_C_HasSpawnedEnemy) == 0x000008, "Wrong alignment on TRAP_BossEncounter_C_HasSpawnedEnemy");
static_assert(sizeof(TRAP_BossEncounter_C_HasSpawnedEnemy) == 0x000010, "Wrong size on TRAP_BossEncounter_C_HasSpawnedEnemy");
static_assert(offsetof(TRAP_BossEncounter_C_HasSpawnedEnemy, EnemyPawn) == 0x000000, "Member 'TRAP_BossEncounter_C_HasSpawnedEnemy::EnemyPawn' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_HasSpawnedEnemy, Result) == 0x000008, "Member 'TRAP_BossEncounter_C_HasSpawnedEnemy::Result' has a wrong offset!");
static_assert(offsetof(TRAP_BossEncounter_C_HasSpawnedEnemy, CallFunc_Array_Contains_ReturnValue) == 0x000009, "Member 'TRAP_BossEncounter_C_HasSpawnedEnemy::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function TRAP_BossEncounter.TRAP_BossEncounter_C.GetBossVolumesWithTag
// 0x0050 (0x0050 - 0x0000)
struct TRAP_BossEncounter_C_GetBossVolumesWithTag final
{
public:
