#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_EmailVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Base_classes.hpp"
#include "ENUM_TriggerCondition_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TRIGGER_EmailVolume.TRIGGER_EmailVolume_C
// 0x0058 (0x0360 - 0x0308)
class ATRIGGER_EmailVolume_C final : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TRIGGER_EmailVolume_C;              // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          OverlapBox;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EmailClass;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmailDelayTime;                                    // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmailTriggerTimestamp;                             // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TriggerCondition                         TriggerCondition;                                  // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           EmailTimerHandle;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    RequiredQuest;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FDataTableRowHandle>            CompleteGameEvents;                                // 0x0350(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_TRIGGER_EmailVolume(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void TrySendEmailDelayed();
	void TrySendEmail(class APAWN_SystemShockCharacter_C* Character, float DelayTime);
	void BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void HasCompletedRequiredQuest(bool* Result);
	void EVENT_OnPlayerBagChanged(class UInventoryBag_C* Bag, int32 SlotIndex);
	void InitializeEmailTrigger();
	void EVENT_OnStoryQuestChanged(class FName QuestName, bool State);
	void TryTriggerFromOverlapEvent(class APAWN_Hacker_Simple_C* HackerPawn, bool BeginOverlap, bool* Result);
	void OnEndOverlap(class APAWN_SystemShockCharacter_C* Character);
	void TryCompleteGameEvents();
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TRIGGER_EmailVolume_C">();
	}
	static class ATRIGGER_EmailVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATRIGGER_EmailVolume_C>();
	}
};
static_assert(alignof(ATRIGGER_EmailVolume_C) == 0x000008, "Wrong alignment on ATRIGGER_EmailVolume_C");
static_assert(sizeof(ATRIGGER_EmailVolume_C) == 0x000360, "Wrong size on ATRIGGER_EmailVolume_C");
static_assert(offsetof(ATRIGGER_EmailVolume_C, UberGraphFrame_TRIGGER_EmailVolume_C) == 0x000308, "Member 'ATRIGGER_EmailVolume_C::UberGraphFrame_TRIGGER_EmailVolume_C' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, Billboard) == 0x000310, "Member 'ATRIGGER_EmailVolume_C::Billboard' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, OverlapBox) == 0x000318, "Member 'ATRIGGER_EmailVolume_C::OverlapBox' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, EmailClass) == 0x000320, "Member 'ATRIGGER_EmailVolume_C::EmailClass' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, EmailDelayTime) == 0x000328, "Member 'ATRIGGER_EmailVolume_C::EmailDelayTime' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, EmailTriggerTimestamp) == 0x00032C, "Member 'ATRIGGER_EmailVolume_C::EmailTriggerTimestamp' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, TriggerCondition) == 0x000330, "Member 'ATRIGGER_EmailVolume_C::TriggerCondition' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, EmailTimerHandle) == 0x000338, "Member 'ATRIGGER_EmailVolume_C::EmailTimerHandle' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, RequiredQuest) == 0x000340, "Member 'ATRIGGER_EmailVolume_C::RequiredQuest' has a wrong offset!");
static_assert(offsetof(ATRIGGER_EmailVolume_C, CompleteGameEvents) == 0x000350, "Member 'ATRIGGER_EmailVolume_C::CompleteGameEvents' has a wrong offset!");

}

