#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_PublicAddressSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "INTERACT_Base_classes.hpp"
#include "STRUCT_QuestSoundCue_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TRIGGER_PublicAddressSystem.TRIGGER_PublicAddressSystem_C
// 0x0040 (0x0348 - 0x0308)
class ATRIGGER_PublicAddressSystem_C final : public AINTERACT_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TRIGGER_PublicAddressSystem_C;      // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          OverlapBox;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableOverlaps;                                    // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TriggerOnce;                                       // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasBeenTriggered;                                  // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PublicAddressRadius;                               // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    DefaultMediaHandle;                                // 0x0328(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<struct FSTRUCT_QuestSoundCue>          StoryQuestSoundCues;                               // 0x0338(0x0010)(Edit, BlueprintVisible)

public:
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	void GetMediaToPlay(struct FDataTableRowHandle* MediaHandle);
	void TryInteract(class AActor* SourceActor, class UPrimitiveComponent* CursorPrimitive, ENUM_InteractionType InteractionType, struct FSTRUCT_InteractResults* InteractResults);
	void UserConstructionScript();
	void BndEvt__TRIGGER_PublicAddressSystem_OverlapBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_TRIGGER_PublicAddressSystem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TRIGGER_PublicAddressSystem_C">();
	}
	static class ATRIGGER_PublicAddressSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATRIGGER_PublicAddressSystem_C>();
	}
};
static_assert(alignof(ATRIGGER_PublicAddressSystem_C) == 0x000008, "Wrong alignment on ATRIGGER_PublicAddressSystem_C");
static_assert(sizeof(ATRIGGER_PublicAddressSystem_C) == 0x000348, "Wrong size on ATRIGGER_PublicAddressSystem_C");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, UberGraphFrame_TRIGGER_PublicAddressSystem_C) == 0x000308, "Member 'ATRIGGER_PublicAddressSystem_C::UberGraphFrame_TRIGGER_PublicAddressSystem_C' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, Billboard) == 0x000310, "Member 'ATRIGGER_PublicAddressSystem_C::Billboard' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, OverlapBox) == 0x000318, "Member 'ATRIGGER_PublicAddressSystem_C::OverlapBox' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, EnableOverlaps) == 0x000320, "Member 'ATRIGGER_PublicAddressSystem_C::EnableOverlaps' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, TriggerOnce) == 0x000321, "Member 'ATRIGGER_PublicAddressSystem_C::TriggerOnce' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, HasBeenTriggered) == 0x000322, "Member 'ATRIGGER_PublicAddressSystem_C::HasBeenTriggered' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, PublicAddressRadius) == 0x000324, "Member 'ATRIGGER_PublicAddressSystem_C::PublicAddressRadius' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, DefaultMediaHandle) == 0x000328, "Member 'ATRIGGER_PublicAddressSystem_C::DefaultMediaHandle' has a wrong offset!");
static_assert(offsetof(ATRIGGER_PublicAddressSystem_C, StoryQuestSoundCues) == 0x000338, "Member 'ATRIGGER_PublicAddressSystem_C::StoryQuestSoundCues' has a wrong offset!");

}

