#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_EmailVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StreamingSaveGameSystem_structs.hpp"
#include "ENUM_TriggerCondition_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"
#include "STRUCT_HardItemParams_structs.hpp"


namespace SDK::Params
{

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.ExecuteUbergraph_TRIGGER_EmailVolume
// 0x0198 (0x0198 - 0x0000)
struct TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_CustomEvent_Character;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayTime;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_HardItemParams                 K2Node_MakeStruct_STRUCT_HardItemParams;           // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrantItem_Result;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0040(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCount_Result;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryTriggerFromOverlapEvent_Result;        // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple_1;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryTriggerFromOverlapEvent_Result_1;      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerformingCyberspaceTransition_Result;  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple_2;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume");
static_assert(sizeof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume) == 0x000198, "Wrong size on TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, EntryPoint) == 0x000000, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_CustomEvent_Character) == 0x000008, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_CustomEvent_DelayTime) == 0x000010, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_CustomEvent_DelayTime' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_MakeStruct_STRUCT_HardItemParams) == 0x000018, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_MakeStruct_STRUCT_HardItemParams' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GetInventoryComponent_Inventory) == 0x000028, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GetInventoryComponent_Inventory_1) == 0x000030, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GetInventoryComponent_Inventory_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GrantItem_Result) == 0x000038, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GrantItem_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000040, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000050, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherActor) == 0x000058, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherComp) == 0x000060, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000068, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000070, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GetItemCount_Result) == 0x00007C, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Array_Contains_ReturnValue) == 0x000081, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_TryTriggerFromOverlapEvent_Result) == 0x000083, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_TryTriggerFromOverlapEvent_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000084, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Not_PreBool_ReturnValue_1) == 0x000085, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000088, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000090, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000098, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000A0, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000A4, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_ComponentBoundEvent_SweepResult) == 0x0000A8, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_AsPAWN_Hacker_Simple_1) == 0x000130, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_AsPAWN_Hacker_Simple_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_TryTriggerFromOverlapEvent_Result_1) == 0x000139, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_TryTriggerFromOverlapEvent_Result_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_Event_EndPlayReason) == 0x00013A, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013B, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_CreateDelegate_OutputDelegate) == 0x00013C, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000150, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000158, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_GetPlayerController_ReturnValue) == 0x000160, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_AsCON_Hacker) == 0x000168, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_K2_GetPawn_ReturnValue) == 0x000178, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_IsPerformingCyberspaceTransition_Result) == 0x000180, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_IsPerformingCyberspaceTransition_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_AsPAWN_Hacker_Simple_2) == 0x000188, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_AsPAWN_Hacker_Simple_2' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume, CallFunc_Not_PreBool_ReturnValue_2) == 0x000191, "Member 'TRIGGER_EmailVolume_C_ExecuteUbergraph_TRIGGER_EmailVolume::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TRIGGER_EmailVolume_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRIGGER_EmailVolume_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on TRIGGER_EmailVolume_C_ReceiveEndPlay");
static_assert(sizeof(TRIGGER_EmailVolume_C_ReceiveEndPlay) == 0x000001, "Wrong size on TRIGGER_EmailVolume_C_ReceiveEndPlay");
static_assert(offsetof(TRIGGER_EmailVolume_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'TRIGGER_EmailVolume_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.TrySendEmail
// 0x0010 (0x0010 - 0x0000)
struct TRIGGER_EmailVolume_C_TrySendEmail final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRIGGER_EmailVolume_C_TrySendEmail) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_TrySendEmail");
static_assert(sizeof(TRIGGER_EmailVolume_C_TrySendEmail) == 0x000010, "Wrong size on TRIGGER_EmailVolume_C_TrySendEmail");
static_assert(offsetof(TRIGGER_EmailVolume_C_TrySendEmail, Character) == 0x000000, "Member 'TRIGGER_EmailVolume_C_TrySendEmail::Character' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TrySendEmail, DelayTime) == 0x000008, "Member 'TRIGGER_EmailVolume_C_TrySendEmail::DelayTime' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'TRIGGER_EmailVolume_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.UserConstructionScript
// 0x0005 (0x0005 - 0x0000)
struct TRIGGER_EmailVolume_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGenerateOverlapEvents_ReturnValue;     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_EmailVolume_C_UserConstructionScript) == 0x000001, "Wrong alignment on TRIGGER_EmailVolume_C_UserConstructionScript");
static_assert(sizeof(TRIGGER_EmailVolume_C_UserConstructionScript) == 0x000005, "Wrong size on TRIGGER_EmailVolume_C_UserConstructionScript");
static_assert(offsetof(TRIGGER_EmailVolume_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'TRIGGER_EmailVolume_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000001, "Member 'TRIGGER_EmailVolume_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'TRIGGER_EmailVolume_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_UserConstructionScript, CallFunc_GetGenerateOverlapEvents_ReturnValue) == 0x000003, "Member 'TRIGGER_EmailVolume_C_UserConstructionScript::CallFunc_GetGenerateOverlapEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'TRIGGER_EmailVolume_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.TryInteract
// 0x01A0 (0x01A0 - 0x0000)
struct TRIGGER_EmailVolume_C_TryInteract final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CursorPrimitive;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InteractionType                          InteractionType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                InteractResults;                                   // 0x0018(0x0020)(Parm, OutParm, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AudioLogManager_C*                AudioLogManager;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults;          // 0x0058(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_1;        // 0x0078(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_2;        // 0x0098(0x0020)(HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_3;        // 0x00B8(0x0020)(HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_4;        // 0x00E0(0x0020)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character_1; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory;          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInventoryBag_C* Bag, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FSTRUCT_InteractResults                K2Node_MakeStruct_STRUCT_InteractResults_5;        // 0x0158(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayMedia_Result;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_AudioLogManager_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedRequiredQuest_Result;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventoryComponent_Inventory_1;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_Result;                      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_EmailVolume_C_TryInteract) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_TryInteract");
static_assert(sizeof(TRIGGER_EmailVolume_C_TryInteract) == 0x0001A0, "Wrong size on TRIGGER_EmailVolume_C_TryInteract");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, SourceActor) == 0x000000, "Member 'TRIGGER_EmailVolume_C_TryInteract::SourceActor' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CursorPrimitive) == 0x000008, "Member 'TRIGGER_EmailVolume_C_TryInteract::CursorPrimitive' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, InteractionType) == 0x000010, "Member 'TRIGGER_EmailVolume_C_TryInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, InteractResults) == 0x000018, "Member 'TRIGGER_EmailVolume_C_TryInteract::InteractResults' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, Character) == 0x000038, "Member 'TRIGGER_EmailVolume_C_TryInteract::Character' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, AudioLogManager) == 0x000040, "Member 'TRIGGER_EmailVolume_C_TryInteract::AudioLogManager' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000048, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults) == 0x000058, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_1) == 0x000078, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_2) == 0x000098, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_2' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_3) == 0x0000B8, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_3' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x0000D8, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_4) == 0x0000E0, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_4' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetPlayerPawn_ReturnValue) == 0x000100, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_AsPAWN_System_Shock_Character_1) == 0x000108, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_AsPAWN_System_Shock_Character_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000114, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetGameInstance_ReturnValue) == 0x000128, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_AsGI_Single_Player) == 0x000130, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetInventoryComponent_Inventory) == 0x000140, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetInventoryComponent_Inventory' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, K2Node_MakeStruct_STRUCT_InteractResults_5) == 0x000158, "Member 'TRIGGER_EmailVolume_C_TryInteract::K2Node_MakeStruct_STRUCT_InteractResults_5' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_CanPlayMedia_Result) == 0x000178, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_CanPlayMedia_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetComponentByClass_ReturnValue) == 0x000180, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_HasCompletedRequiredQuest_Result) == 0x000188, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_HasCompletedRequiredQuest_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetInventoryComponent_Inventory_1) == 0x000190, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetInventoryComponent_Inventory_1' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_GetItemCount_Result) == 0x000198, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_GetItemCount_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_TryInteract, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00019C, "Member 'TRIGGER_EmailVolume_C_TryInteract::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.HasCompletedRequiredQuest
// 0x0020 (0x0020 - 0x0000)
struct TRIGGER_EmailVolume_C_HasCompletedRequiredQuest final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedStoryQuest_Completed;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_HasCompletedRequiredQuest");
static_assert(sizeof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest) == 0x000020, "Wrong size on TRIGGER_EmailVolume_C_HasCompletedRequiredQuest");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, Result) == 0x000000, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, CallFunc_NotEqual_NameName_ReturnValue) == 0x000001, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, K2Node_DynamicCast_AsGI_Single_Player) == 0x000010, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_HasCompletedRequiredQuest, CallFunc_HasCompletedStoryQuest_Completed) == 0x000019, "Member 'TRIGGER_EmailVolume_C_HasCompletedRequiredQuest::CallFunc_HasCompletedStoryQuest_Completed' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.EVENT_OnPlayerBagChanged
// 0x0078 (0x0078 - 0x0000)
struct TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged final
{
public:
	class UInventoryBag_C*                        Bag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           SlotItem;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSlotItemType_Result;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Inventory_C*                      CallFunc_GetInventory_Inventory;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0048(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged");
static_assert(sizeof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged) == 0x000078, "Wrong size on TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, Bag) == 0x000000, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::Bag' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, SlotIndex) == 0x000008, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, SlotItem) == 0x000010, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::SlotItem' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_CanSlotItemType_Result) == 0x000018, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_CanSlotItemType_Result' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_GetInventory_Inventory) == 0x000020, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_GetInventory_Inventory' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, K2Node_DynamicCast_AsPAWN_System_Shock_Character) == 0x000030, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::K2Node_DynamicCast_AsPAWN_System_Shock_Character' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_GetObjectClass_ReturnValue) == 0x000040, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_TryInteract_InteractResults) == 0x000048, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000068, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged, CallFunc_GetSlotItem_Item) == 0x000070, "Member 'TRIGGER_EmailVolume_C_EVENT_OnPlayerBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");

// Function TRIGGER_EmailVolume.TRIGGER_EmailVolume_C.InitializeEmailTrigger
// 0x0050 (0x0050 - 0x0000)
struct TRIGGER_EmailVolume_C_InitializeEmailTrigger final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0028(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_EmailVolume_C_InitializeEmailTrigger) == 0x000008, "Wrong alignment on TRIGGER_EmailVolume_C_InitializeEmailTrigger");
static_assert(sizeof(TRIGGER_EmailVolume_C_InitializeEmailTrigger) == 0x000050, "Wrong size on TRIGGER_EmailVolume_C_InitializeEmailTrigger");
static_assert(offsetof(TRIGGER_EmailVolume_C_InitializeEmailTrigger, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'TRIGGER_EmailVolume_C_InitializeEmailTrigger::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
