#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_MusicVolume_Story

#include "Basic.hpp"

#include "STRUCT_MusicParams_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TRIGGER_MusicVolume_Story.TRIGGER_MusicVolume_Story_C.OnEnterVolume
// 0x0070 (0x0070 - 0x0000)
struct TRIGGER_MusicVolume_Story_C_OnEnterVolume final
{
public:
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     OutGameInstance;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UGI_SinglePlayer_C*                     CallFunc_OnEnterVolume_OutGameInstance;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_MusicParams                    K2Node_MakeStruct_STRUCT_MusicParams;              // 0x0038(0x0030)(HasGetValueTypeHash)
	class UBP_MusicCue_C*                         CallFunc_PlayStoryMusic_MusicCue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TRIGGER_MusicVolume_Story_C_OnEnterVolume) == 0x000008, "Wrong alignment on TRIGGER_MusicVolume_Story_C_OnEnterVolume");
static_assert(sizeof(TRIGGER_MusicVolume_Story_C_OnEnterVolume) == 0x000070, "Wrong size on TRIGGER_MusicVolume_Story_C_OnEnterVolume");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, GameInstance) == 0x000000, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::GameInstance' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, OutGameInstance) == 0x000008, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::OutGameInstance' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, CallFunc_OnEnterVolume_OutGameInstance) == 0x000020, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::CallFunc_OnEnterVolume_OutGameInstance' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, K2Node_MakeStruct_STRUCT_MusicParams) == 0x000038, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::K2Node_MakeStruct_STRUCT_MusicParams' has a wrong offset!");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_OnEnterVolume, CallFunc_PlayStoryMusic_MusicCue) == 0x000068, "Member 'TRIGGER_MusicVolume_Story_C_OnEnterVolume::CallFunc_PlayStoryMusic_MusicCue' has a wrong offset!");

// Function TRIGGER_MusicVolume_Story.TRIGGER_MusicVolume_Story_C.EVENT_OnPlayTimerEnded
// 0x0001 (0x0001 - 0x0000)
struct TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded) == 0x000001, "Wrong alignment on TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded");
static_assert(sizeof(TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded) == 0x000001, "Wrong size on TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded");
static_assert(offsetof(TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TRIGGER_MusicVolume_Story_C_EVENT_OnPlayTimerEnded::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

