#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_MusicVolume_Story

#include "Basic.hpp"

#include "TRIGGER_MusicVolume_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TRIGGER_MusicVolume_Story.TRIGGER_MusicVolume_Story_C
// 0x0040 (0x0280 - 0x0240)
class ATRIGGER_MusicVolume_Story_C final : public ATRIGGER_MusicVolume_C
{
public:
	TSoftClassPtr<class UClass>                   MusicCueClass;                                     // 0x0240(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UCurveFloat*                            FadeCurveOverride;                                 // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToPlay;                                        // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PlayTimer;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnEnterVolume(class UGI_SinglePlayer_C* GameInstance, class UGI_SinglePlayer_C** OutGameInstance);
	void EVENT_OnPlayTimerEnded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TRIGGER_MusicVolume_Story_C">();
	}
	static class ATRIGGER_MusicVolume_Story_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATRIGGER_MusicVolume_Story_C>();
	}
};
static_assert(alignof(ATRIGGER_MusicVolume_Story_C) == 0x000008, "Wrong alignment on ATRIGGER_MusicVolume_Story_C");
static_assert(sizeof(ATRIGGER_MusicVolume_Story_C) == 0x000280, "Wrong size on ATRIGGER_MusicVolume_Story_C");
static_assert(offsetof(ATRIGGER_MusicVolume_Story_C, MusicCueClass) == 0x000240, "Member 'ATRIGGER_MusicVolume_Story_C::MusicCueClass' has a wrong offset!");
static_assert(offsetof(ATRIGGER_MusicVolume_Story_C, FadeCurveOverride) == 0x000268, "Member 'ATRIGGER_MusicVolume_Story_C::FadeCurveOverride' has a wrong offset!");
static_assert(offsetof(ATRIGGER_MusicVolume_Story_C, TimeToPlay) == 0x000270, "Member 'ATRIGGER_MusicVolume_Story_C::TimeToPlay' has a wrong offset!");
static_assert(offsetof(ATRIGGER_MusicVolume_Story_C, PlayTimer) == 0x000278, "Member 'ATRIGGER_MusicVolume_Story_C::PlayTimer' has a wrong offset!");

}

