#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TRIGGER_GasVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TRIGGER_GasVolume.TRIGGER_GasVolume_C
// 0x0078 (0x0298 - 0x0220)
class ATRIGGER_GasVolume_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCOMP_VoxelCullablePropagator_C*        COMP_VoxelCullablePropagator;                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAttribDamageType*                      DamageType;                                        // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamagePerSecond;                                   // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnTimestamp;                                    // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasDuration;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasFastestTickrate;                                // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               GasLoopCue;                                        // 0x0248(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UFXSystemAsset>          GasSystem;                                         // 0x0270(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TRIGGER_GasVolume(int32 EntryPoint);
	void BndEvt__TRIGGER_GasVolume_COMP_VoxelCullablePropagator_K2Node_ComponentBoundEvent_0_PropagationDensityChangedSignature__DelegateSignature(class UVoxelNavAgentComponent* AgentComponent, uint8 MaxOverlapPropagationDensity);
	void ReceiveBeginPlay();
	void InitializeGasVolume(class UAttribDamageType* InDamageType, int32 InDamageValue, float InGasDuration);
	void TryBeginGasBehavior();
	void EVENT_BeginDissipatingGas();
	void EVENT_DestroyGasVolume();
	void UpdateGasAttribModOnCharacter(class APAWN_SystemShockCharacter_C* Character, float GasIntensity);
	bool ShouldSaveActor(struct FStreamingSaveGameActorParams* Params_0);
	bool ReceivePendingBodyTransforms(class USkeletalMeshComponent* SkeletalMeshComponent, const TArray<struct FTransform>& BodyTransforms);
	bool ReceivePendingCharacterVelocity(const struct FVector& Velocity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TRIGGER_GasVolume_C">();
	}
	static class ATRIGGER_GasVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATRIGGER_GasVolume_C>();
	}
};
static_assert(alignof(ATRIGGER_GasVolume_C) == 0x000008, "Wrong alignment on ATRIGGER_GasVolume_C");
static_assert(sizeof(ATRIGGER_GasVolume_C) == 0x000298, "Wrong size on ATRIGGER_GasVolume_C");
static_assert(offsetof(ATRIGGER_GasVolume_C, UberGraphFrame) == 0x000220, "Member 'ATRIGGER_GasVolume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, COMP_VoxelCullablePropagator) == 0x000228, "Member 'ATRIGGER_GasVolume_C::COMP_VoxelCullablePropagator' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, DamageType) == 0x000230, "Member 'ATRIGGER_GasVolume_C::DamageType' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, DamagePerSecond) == 0x000238, "Member 'ATRIGGER_GasVolume_C::DamagePerSecond' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, SpawnTimestamp) == 0x00023C, "Member 'ATRIGGER_GasVolume_C::SpawnTimestamp' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, GasDuration) == 0x000240, "Member 'ATRIGGER_GasVolume_C::GasDuration' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, GasFastestTickrate) == 0x000244, "Member 'ATRIGGER_GasVolume_C::GasFastestTickrate' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, GasLoopCue) == 0x000248, "Member 'ATRIGGER_GasVolume_C::GasLoopCue' has a wrong offset!");
static_assert(offsetof(ATRIGGER_GasVolume_C, GasSystem) == 0x000270, "Member 'ATRIGGER_GasVolume_C::GasSystem' has a wrong offset!");

}

