#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_MagPulse

#include "Basic.hpp"

#include "STRUCT_WeaponMode_structs.hpp"
#include "STRUCT_WeaponPropertyValue_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.ExecuteUbergraph_WEAPON_MagPulse
// 0x00F8 (0x00F8 - 0x0000)
struct WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect_1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System_1;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse");
static_assert(sizeof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse) == 0x0000F8, "Wrong size on WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, EntryPoint) == 0x000000, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CustomEvent_Loaded_4) == 0x000028, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, Temp_object_Variable) == 0x000040, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_AsAnim_Montage) == 0x000048, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CustomEvent_Loaded_3) == 0x000058, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, Temp_object_Variable_1) == 0x000060, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_AsForce_Feedback_Effect) == 0x000068, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_AsForce_Feedback_Effect' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CustomEvent_Loaded_2) == 0x000078, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, Temp_object_Variable_2) == 0x000080, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_AsForce_Feedback_Effect_1) == 0x000088, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_AsForce_Feedback_Effect_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CustomEvent_Loaded_1) == 0x000098, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, Temp_object_Variable_3) == 0x0000A0, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_AsNiagara_System) == 0x0000A8, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CustomEvent_Loaded) == 0x0000B8, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, Temp_object_Variable_4) == 0x0000C0, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_AsNiagara_System_1) == 0x0000C8, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_AsNiagara_System_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D4, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E4, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F4, "Member 'WEAPON_MagPulse_C_ExecuteUbergraph_WEAPON_MagPulse::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.OnLoaded_7905D5934213E96998D87D899A24F5F8
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8");
static_assert(sizeof(WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8) == 0x000008, "Wrong size on WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8");
static_assert(offsetof(WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8, Loaded) == 0x000000, "Member 'WEAPON_MagPulse_C_OnLoaded_7905D5934213E96998D87D899A24F5F8::Loaded' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A");
static_assert(sizeof(WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A) == 0x000008, "Wrong size on WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A");
static_assert(offsetof(WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A, Loaded) == 0x000000, "Member 'WEAPON_MagPulse_C_OnLoaded_DF0330F84AD5B08E45DD94A65F5DE16A::Loaded' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.OnLoaded_7AC8171242E08757C012A28D2888D2EE
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE");
static_assert(sizeof(WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE) == 0x000008, "Wrong size on WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE");
static_assert(offsetof(WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE, Loaded) == 0x000000, "Member 'WEAPON_MagPulse_C_OnLoaded_7AC8171242E08757C012A28D2888D2EE::Loaded' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.OnLoaded_7CE911E0462524EB72113185AFA826F0
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0");
static_assert(sizeof(WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0) == 0x000008, "Wrong size on WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0");
static_assert(offsetof(WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0, Loaded) == 0x000000, "Member 'WEAPON_MagPulse_C_OnLoaded_7CE911E0462524EB72113185AFA826F0::Loaded' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.OnLoaded_9B50D63949E067619A9920B4DD9E853D
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D");
static_assert(sizeof(WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D) == 0x000008, "Wrong size on WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D");
static_assert(offsetof(WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D, Loaded) == 0x000000, "Member 'WEAPON_MagPulse_C_OnLoaded_9B50D63949E067619A9920B4DD9E853D::Loaded' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.ApplyCharge
// 0x00E0 (0x00E0 - 0x0000)
struct WEAPON_MagPulse_C_ApplyCharge final
{
public:
	int32                                         EnergyInReserves;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttribModApplyData                    EnergyDrainApplyData;                              // 0x0008(0x00A0)(Edit, BlueprintVisible)
	class UCOMP_AttribManager_C*                  OwnerAttribManager;                                // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribMod*                             CallFunc_ApplyMod_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_ApplyCharge) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_ApplyCharge");
static_assert(sizeof(WEAPON_MagPulse_C_ApplyCharge) == 0x0000E0, "Wrong size on WEAPON_MagPulse_C_ApplyCharge");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, EnergyInReserves) == 0x000000, "Member 'WEAPON_MagPulse_C_ApplyCharge::EnergyInReserves' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, EnergyDrainApplyData) == 0x000008, "Member 'WEAPON_MagPulse_C_ApplyCharge::EnergyDrainApplyData' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, OwnerAttribManager) == 0x0000A8, "Member 'WEAPON_MagPulse_C_ApplyCharge::OwnerAttribManager' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000B0, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_GetAttribValue_ReturnValue) == 0x0000B4, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B8, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_FTrunc_ReturnValue) == 0x0000BC, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_ApplyMod_ReturnValue) == 0x0000C0, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_ApplyMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000C8, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_GetOwnerCharacter_Character) == 0x0000D0, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Min_ReturnValue) == 0x0000D8, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000DC, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DD, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ApplyCharge, CallFunc_Add_ByteByte_ReturnValue) == 0x0000DE, "Member 'WEAPON_MagPulse_C_ApplyCharge::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.ConsumeAmmo
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_MagPulse_C_ConsumeAmmo final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_ConsumeAmmo) == 0x000004, "Wrong alignment on WEAPON_MagPulse_C_ConsumeAmmo");
static_assert(sizeof(WEAPON_MagPulse_C_ConsumeAmmo) == 0x000008, "Wrong size on WEAPON_MagPulse_C_ConsumeAmmo");
static_assert(offsetof(WEAPON_MagPulse_C_ConsumeAmmo, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'WEAPON_MagPulse_C_ConsumeAmmo::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_ConsumeAmmo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'WEAPON_MagPulse_C_ConsumeAmmo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.TryCharge
// 0x0030 (0x0030 - 0x0000)
struct WEAPON_MagPulse_C_TryCharge final
{
public:
	class APAWN_SystemShockCharacter_C*           CharacterOwner;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttribValue_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoInMagazine_Ammo;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivatable_Result;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterAction_C*                     CallFunc_TryBeginAction_Action;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue_1;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_TryCharge) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_TryCharge");
static_assert(sizeof(WEAPON_MagPulse_C_TryCharge) == 0x000030, "Wrong size on WEAPON_MagPulse_C_TryCharge");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CharacterOwner) == 0x000000, "Member 'WEAPON_MagPulse_C_TryCharge::CharacterOwner' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_GetAttribValue_ReturnValue) == 0x000010, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_GetAttribValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_Less_ByteByte_ReturnValue) == 0x000015, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_GetAmmoInMagazine_Ammo) == 0x000018, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_GetAmmoInMagazine_Ammo' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_IsActivatable_Result) == 0x00001C, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_IsActivatable_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_TryBeginAction_Action) == 0x000020, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_TryBeginAction_Action' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_Less_ByteByte_ReturnValue_1) == 0x000028, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_Less_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCharge, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WEAPON_MagPulse_C_TryCharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.SetListenForActionFinished
// 0x0038 (0x0038 - 0x0000)
struct WEAPON_MagPulse_C_SetListenForActionFinished final
{
public:
	bool                                          ShouldListen;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharacterAction_C* Action)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCharacterAction_C* Action)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_SetListenForActionFinished) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_SetListenForActionFinished");
static_assert(sizeof(WEAPON_MagPulse_C_SetListenForActionFinished) == 0x000038, "Wrong size on WEAPON_MagPulse_C_SetListenForActionFinished");
static_assert(offsetof(WEAPON_MagPulse_C_SetListenForActionFinished, ShouldListen) == 0x000000, "Member 'WEAPON_MagPulse_C_SetListenForActionFinished::ShouldListen' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_SetListenForActionFinished, CallFunc_GetOwnerCharacter_Character) == 0x000008, "Member 'WEAPON_MagPulse_C_SetListenForActionFinished::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_SetListenForActionFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WEAPON_MagPulse_C_SetListenForActionFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_SetListenForActionFinished, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WEAPON_MagPulse_C_SetListenForActionFinished::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_SetListenForActionFinished, CallFunc_GetOwnerCharacter_Character_1) == 0x000030, "Member 'WEAPON_MagPulse_C_SetListenForActionFinished::CallFunc_GetOwnerCharacter_Character_1' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.EVENT_OnActionEnded
// 0x0018 (0x0018 - 0x0000)
struct WEAPON_MagPulse_C_EVENT_OnActionEnded final
{
public:
	class UCharacterAction_C*                     Action;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Result;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_EVENT_OnActionEnded) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_EVENT_OnActionEnded");
static_assert(sizeof(WEAPON_MagPulse_C_EVENT_OnActionEnded) == 0x000018, "Wrong size on WEAPON_MagPulse_C_EVENT_OnActionEnded");
static_assert(offsetof(WEAPON_MagPulse_C_EVENT_OnActionEnded, Action) == 0x000000, "Member 'WEAPON_MagPulse_C_EVENT_OnActionEnded::Action' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_EVENT_OnActionEnded, CallFunc_GetMontage_Result) == 0x000008, "Member 'WEAPON_MagPulse_C_EVENT_OnActionEnded::CallFunc_GetMontage_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_EVENT_OnActionEnded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WEAPON_MagPulse_C_EVENT_OnActionEnded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.SetCurrentChargeCount
// 0x0001 (0x0001 - 0x0000)
struct WEAPON_MagPulse_C_SetCurrentChargeCount final
{
public:
	uint8                                         Count_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_SetCurrentChargeCount) == 0x000001, "Wrong alignment on WEAPON_MagPulse_C_SetCurrentChargeCount");
static_assert(sizeof(WEAPON_MagPulse_C_SetCurrentChargeCount) == 0x000001, "Wrong size on WEAPON_MagPulse_C_SetCurrentChargeCount");
static_assert(offsetof(WEAPON_MagPulse_C_SetCurrentChargeCount, Count_0) == 0x000000, "Member 'WEAPON_MagPulse_C_SetCurrentChargeCount::Count_0' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.SetHasBarrelExtension
// 0x0001 (0x0001 - 0x0000)
struct WEAPON_MagPulse_C_SetHasBarrelExtension final
{
public:
	bool                                          State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_SetHasBarrelExtension) == 0x000001, "Wrong alignment on WEAPON_MagPulse_C_SetHasBarrelExtension");
static_assert(sizeof(WEAPON_MagPulse_C_SetHasBarrelExtension) == 0x000001, "Wrong size on WEAPON_MagPulse_C_SetHasBarrelExtension");
static_assert(offsetof(WEAPON_MagPulse_C_SetHasBarrelExtension, State) == 0x000000, "Member 'WEAPON_MagPulse_C_SetHasBarrelExtension::State' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.GetChargedMode
// 0x0340 (0x0340 - 0x0000)
struct WEAPON_MagPulse_C_GetChargedMode final
{
public:
	struct FSTRUCT_WeaponMode                     Mode;                                              // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FSTRUCT_WeaponMode                     Result;                                            // 0x0100(0x0100)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         SecondaryDamageIndex;                              // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     ModifiedMode;                                      // 0x0208(0x0100)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyIndexByType_ArrayIndex;  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_2;            // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_WeaponPropertyValue            K2Node_MakeStruct_STRUCT_WeaponPropertyValue;      // 0x0334(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_GetChargedMode) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_GetChargedMode");
static_assert(sizeof(WEAPON_MagPulse_C_GetChargedMode) == 0x000340, "Wrong size on WEAPON_MagPulse_C_GetChargedMode");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, Mode) == 0x000000, "Member 'WEAPON_MagPulse_C_GetChargedMode::Mode' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, Result) == 0x000100, "Member 'WEAPON_MagPulse_C_GetChargedMode::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, SecondaryDamageIndex) == 0x000200, "Member 'WEAPON_MagPulse_C_GetChargedMode::SecondaryDamageIndex' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, ModifiedMode) == 0x000208, "Member 'WEAPON_MagPulse_C_GetChargedMode::ModifiedMode' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_GetWeaponPropertyIndexByType_ArrayIndex) == 0x000308, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_GetWeaponPropertyIndexByType_ArrayIndex' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00030C, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Multiply_IntInt_ReturnValue) == 0x000310, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000314, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000318, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Add_IntInt_ReturnValue) == 0x00031C, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000320, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000324, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Greater_ByteByte_ReturnValue) == 0x000328, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Multiply_IntInt_ReturnValue_2) == 0x00032C, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Multiply_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, CallFunc_Add_IntInt_ReturnValue_1) == 0x000330, "Member 'WEAPON_MagPulse_C_GetChargedMode::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_GetChargedMode, K2Node_MakeStruct_STRUCT_WeaponPropertyValue) == 0x000334, "Member 'WEAPON_MagPulse_C_GetChargedMode::K2Node_MakeStruct_STRUCT_WeaponPropertyValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.UpdateWeaponEmissiveStrength
// 0x0030 (0x0030 - 0x0000)
struct WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength final
{
public:
	bool                                          Charged;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetWeaponMeshComponent_Result;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCustomPrimitiveDataFloat_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength");
static_assert(sizeof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength) == 0x000030, "Wrong size on WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, Charged) == 0x000000, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::Charged' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, Temp_bool_Variable) == 0x000001, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, Temp_float_Variable) == 0x000004, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, Temp_float_Variable_1) == 0x000008, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_GetWeaponMeshComponent_Result) == 0x000010, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_GetWeaponMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, K2Node_Select_Default) == 0x00001C, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_GetCustomPrimitiveDataFloat_ReturnValue) == 0x000020, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_GetCustomPrimitiveDataFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'WEAPON_MagPulse_C_UpdateWeaponEmissiveStrength::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.TryCreateLoopingChargeEffect
// 0x0030 (0x0030 - 0x0000)
struct WEAPON_MagPulse_C_TryCreateLoopingChargeEffect final
{
public:
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetWeaponMeshComponent_Result;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_TryCreateLoopingChargeEffect");
static_assert(sizeof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect) == 0x000030, "Wrong size on WEAPON_MagPulse_C_TryCreateLoopingChargeEffect");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_GetOwnerCharacter_Character) == 0x000000, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000008, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_GetWeaponMeshComponent_Result) == 0x000018, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_GetWeaponMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateLoopingChargeEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WEAPON_MagPulse_C_TryCreateLoopingChargeEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.TryStopLoopingChargeEffect
// 0x0001 (0x0001 - 0x0000)
struct WEAPON_MagPulse_C_TryStopLoopingChargeEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_TryStopLoopingChargeEffect) == 0x000001, "Wrong alignment on WEAPON_MagPulse_C_TryStopLoopingChargeEffect");
static_assert(sizeof(WEAPON_MagPulse_C_TryStopLoopingChargeEffect) == 0x000001, "Wrong size on WEAPON_MagPulse_C_TryStopLoopingChargeEffect");
static_assert(offsetof(WEAPON_MagPulse_C_TryStopLoopingChargeEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WEAPON_MagPulse_C_TryStopLoopingChargeEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.TryCreateHandSparkEffect
// 0x0020 (0x0020 - 0x0000)
struct WEAPON_MagPulse_C_TryCreateHandSparkEffect final
{
public:
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetActionMeshComponent_SkeletalMeshComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_TryCreateHandSparkEffect) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_TryCreateHandSparkEffect");
static_assert(sizeof(WEAPON_MagPulse_C_TryCreateHandSparkEffect) == 0x000020, "Wrong size on WEAPON_MagPulse_C_TryCreateHandSparkEffect");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateHandSparkEffect, CallFunc_GetOwnerCharacter_Character) == 0x000000, "Member 'WEAPON_MagPulse_C_TryCreateHandSparkEffect::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateHandSparkEffect, CallFunc_GetActionMeshComponent_SkeletalMeshComponent) == 0x000008, "Member 'WEAPON_MagPulse_C_TryCreateHandSparkEffect::CallFunc_GetActionMeshComponent_SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateHandSparkEffect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000010, "Member 'WEAPON_MagPulse_C_TryCreateHandSparkEffect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_TryCreateHandSparkEffect, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WEAPON_MagPulse_C_TryCreateHandSparkEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.CycleCurrentMode
// 0x0002 (0x0002 - 0x0000)
struct WEAPON_MagPulse_C_CycleCurrentMode final
{
public:
	bool                                          Previous;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_CycleCurrentMode) == 0x000001, "Wrong alignment on WEAPON_MagPulse_C_CycleCurrentMode");
static_assert(sizeof(WEAPON_MagPulse_C_CycleCurrentMode) == 0x000002, "Wrong size on WEAPON_MagPulse_C_CycleCurrentMode");
static_assert(offsetof(WEAPON_MagPulse_C_CycleCurrentMode, Previous) == 0x000000, "Member 'WEAPON_MagPulse_C_CycleCurrentMode::Previous' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CycleCurrentMode, Result) == 0x000001, "Member 'WEAPON_MagPulse_C_CycleCurrentMode::Result' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.CanRefillMagazine
// 0x0118 (0x0118 - 0x0000)
struct WEAPON_MagPulse_C_CanRefillMagazine final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoInMagazineAndChamber_Ammo;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSpareAmmo_Result;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0010(0x0100)(HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_MagPulse_C_CanRefillMagazine) == 0x000008, "Wrong alignment on WEAPON_MagPulse_C_CanRefillMagazine");
static_assert(sizeof(WEAPON_MagPulse_C_CanRefillMagazine) == 0x000118, "Wrong size on WEAPON_MagPulse_C_CanRefillMagazine");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, Result) == 0x000000, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, CallFunc_GetAmmoInMagazineAndChamber_Ammo) == 0x000004, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::CallFunc_GetAmmoInMagazineAndChamber_Ammo' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, CallFunc_HasSpareAmmo_Result) == 0x000008, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::CallFunc_HasSpareAmmo_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, CallFunc_GetCurrentMode_Mode) == 0x000010, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, CallFunc_GetWeaponPropertyValueByType_Value) == 0x000110, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(WEAPON_MagPulse_C_CanRefillMagazine, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'WEAPON_MagPulse_C_CanRefillMagazine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WEAPON_MagPulse.WEAPON_MagPulse_C.QueueReloading
// 0x0020 (0x0020 - 0x0000)
struct WEAPON_MagPulse_C_QueueReloading final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
