#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_RailGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WEAPON_RailGun.WEAPON_RailGun_C.ExecuteUbergraph_WEAPON_RailGun
// 0x01E8 (0x01E8 - 0x0000)
struct WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_2;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_3;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_4;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_5;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_6;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun");
static_assert(sizeof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun) == 0x0001E8, "Wrong size on WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, EntryPoint) == 0x000000, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_9) == 0x000048, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_9' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable) == 0x000060, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsAnim_Montage) == 0x000068, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_8) == 0x000078, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_1) == 0x000080, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000088, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_7) == 0x000098, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_2) == 0x0000A0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsNiagara_System) == 0x0000A8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_6) == 0x0000B8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_3) == 0x0000C0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue) == 0x0000C8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_5) == 0x0000D8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_4) == 0x0000E0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_1) == 0x0000E8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_4) == 0x0000F8, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_5) == 0x000100, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_2) == 0x000108, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_2' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_3) == 0x000118, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_6) == 0x000120, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_3) == 0x000128, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_3' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_6) == 0x000130, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_2) == 0x000138, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_7) == 0x000140, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_4) == 0x000148, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_4' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_7) == 0x000150, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded_1) == 0x000158, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_8) == 0x000160, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_5) == 0x000168, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_5' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CustomEvent_Loaded) == 0x000178, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, Temp_object_Variable_9) == 0x000180, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_AsSound_Cue_6) == 0x000188, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_AsSound_Cue_6' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_DynamicCast_bSuccess_9) == 0x000190, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_5) == 0x000194, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A4, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B4, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001C4, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001D4, "Member 'WEAPON_RailGun_C_ExecuteUbergraph_WEAPON_RailGun::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_5720FE574376ACD59DD48CAE01523587
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_5720FE574376ACD59DD48CAE01523587::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_8743A92249565054FE40349F7DA41F6B
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_8743A92249565054FE40349F7DA41F6B::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_E9FE140D4F405DCA7BCD9497199571BA
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_E9FE140D4F405DCA7BCD9497199571BA::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_4A73B99447DF07AACEF2F6A768C4B39A::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_01A2328B4439EFE397747EA95F5CF048
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_01A2328B4439EFE397747EA95F5CF048::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_9AA6C2524D1EB4CCC75E44A27E6C9798::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_C6FD450A44CCB16F84FB0B9A936A06CB::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_93B8DF1F43B0049ED402B9B57C3A1446::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_D7391D554DCE817853AC78A6A6BFBB87
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_D7391D554DCE817853AC78A6A6BFBB87::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C");
static_assert(sizeof(WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C) == 0x000008, "Wrong size on WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C");
static_assert(offsetof(WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C, Loaded) == 0x000000, "Member 'WEAPON_RailGun_C_OnLoaded_A4273C444AFB5C6132FEDD80D1E89B1C::Loaded' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.HasAmmoInMagazineOrChamber
// 0x0003 (0x0003 - 0x0000)
struct WEAPON_RailGun_C_HasAmmoInMagazineOrChamber final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFullyRecharged_Result;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAmmoInMagazineOrChamber_Result;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_HasAmmoInMagazineOrChamber) == 0x000001, "Wrong alignment on WEAPON_RailGun_C_HasAmmoInMagazineOrChamber");
static_assert(sizeof(WEAPON_RailGun_C_HasAmmoInMagazineOrChamber) == 0x000003, "Wrong size on WEAPON_RailGun_C_HasAmmoInMagazineOrChamber");
static_assert(offsetof(WEAPON_RailGun_C_HasAmmoInMagazineOrChamber, Result) == 0x000000, "Member 'WEAPON_RailGun_C_HasAmmoInMagazineOrChamber::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_HasAmmoInMagazineOrChamber, CallFunc_HasFullyRecharged_Result) == 0x000001, "Member 'WEAPON_RailGun_C_HasAmmoInMagazineOrChamber::CallFunc_HasFullyRecharged_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_HasAmmoInMagazineOrChamber, CallFunc_HasAmmoInMagazineOrChamber_Result) == 0x000002, "Member 'WEAPON_RailGun_C_HasAmmoInMagazineOrChamber::CallFunc_HasAmmoInMagazineOrChamber_Result' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetProjectileClass
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_GetProjectileClass final
{
public:
	class UClass*                                 Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetProjectileClass) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_GetProjectileClass");
static_assert(sizeof(WEAPON_RailGun_C_GetProjectileClass) == 0x000008, "Wrong size on WEAPON_RailGun_C_GetProjectileClass");
static_assert(offsetof(WEAPON_RailGun_C_GetProjectileClass, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetProjectileClass::Result' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.FireProjectile
// 0x0030 (0x0030 - 0x0000)
struct WEAPON_RailGun_C_FireProjectile final
{
public:
	class AActor*                                 FiredProjectile;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FireProjectile_FiredProjectile;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FireProjectile_Direction;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_FireProjectile) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_FireProjectile");
static_assert(sizeof(WEAPON_RailGun_C_FireProjectile) == 0x000030, "Wrong size on WEAPON_RailGun_C_FireProjectile");
static_assert(offsetof(WEAPON_RailGun_C_FireProjectile, FiredProjectile) == 0x000000, "Member 'WEAPON_RailGun_C_FireProjectile::FiredProjectile' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_FireProjectile, Direction) == 0x000008, "Member 'WEAPON_RailGun_C_FireProjectile::Direction' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_FireProjectile, CallFunc_FireProjectile_FiredProjectile) == 0x000018, "Member 'WEAPON_RailGun_C_FireProjectile::CallFunc_FireProjectile_FiredProjectile' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_FireProjectile, CallFunc_FireProjectile_Direction) == 0x000020, "Member 'WEAPON_RailGun_C_FireProjectile::CallFunc_FireProjectile_Direction' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.EjectShell
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_RailGun_C_EjectShell final
{
public:
	class UAudioComponent*                        CallFunc_PlayRailgunSoundCue_AudioComponent;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_EjectShell) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_EjectShell");
static_assert(sizeof(WEAPON_RailGun_C_EjectShell) == 0x000008, "Wrong size on WEAPON_RailGun_C_EjectShell");
static_assert(offsetof(WEAPON_RailGun_C_EjectShell, CallFunc_PlayRailgunSoundCue_AudioComponent) == 0x000000, "Member 'WEAPON_RailGun_C_EjectShell::CallFunc_PlayRailgunSoundCue_AudioComponent' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.HasFullyRecharged
// 0x000C (0x000C - 0x0000)
struct WEAPON_RailGun_C_HasFullyRecharged final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRechargeRatio_Result;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_HasFullyRecharged) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_HasFullyRecharged");
static_assert(sizeof(WEAPON_RailGun_C_HasFullyRecharged) == 0x00000C, "Wrong size on WEAPON_RailGun_C_HasFullyRecharged");
static_assert(offsetof(WEAPON_RailGun_C_HasFullyRecharged, Result) == 0x000000, "Member 'WEAPON_RailGun_C_HasFullyRecharged::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_HasFullyRecharged, CallFunc_GetRechargeRatio_Result) == 0x000004, "Member 'WEAPON_RailGun_C_HasFullyRecharged::CallFunc_GetRechargeRatio_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_HasFullyRecharged, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WEAPON_RailGun_C_HasFullyRecharged::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.OnWeaponBecameActivatable
// 0x0010 (0x0010 - 0x0000)
struct WEAPON_RailGun_C_OnWeaponBecameActivatable final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowImmediately;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_OnWeaponBecameActivatable) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_OnWeaponBecameActivatable");
static_assert(sizeof(WEAPON_RailGun_C_OnWeaponBecameActivatable) == 0x000010, "Wrong size on WEAPON_RailGun_C_OnWeaponBecameActivatable");
static_assert(offsetof(WEAPON_RailGun_C_OnWeaponBecameActivatable, Character) == 0x000000, "Member 'WEAPON_RailGun_C_OnWeaponBecameActivatable::Character' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_OnWeaponBecameActivatable, ShowImmediately) == 0x000008, "Member 'WEAPON_RailGun_C_OnWeaponBecameActivatable::ShowImmediately' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetRechargeRatio
// 0x0004 (0x0004 - 0x0000)
struct WEAPON_RailGun_C_GetRechargeRatio final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetRechargeRatio) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetRechargeRatio");
static_assert(sizeof(WEAPON_RailGun_C_GetRechargeRatio) == 0x000004, "Wrong size on WEAPON_RailGun_C_GetRechargeRatio");
static_assert(offsetof(WEAPON_RailGun_C_GetRechargeRatio, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetRechargeRatio::Result' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetCurrentRechargeRate
// 0x000C (0x000C - 0x0000)
struct WEAPON_RailGun_C_GetCurrentRechargeRate final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentRechargeDuration_Result;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetCurrentRechargeRate) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetCurrentRechargeRate");
static_assert(sizeof(WEAPON_RailGun_C_GetCurrentRechargeRate) == 0x00000C, "Wrong size on WEAPON_RailGun_C_GetCurrentRechargeRate");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeRate, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetCurrentRechargeRate::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeRate, CallFunc_GetCurrentRechargeDuration_Result) == 0x000004, "Member 'WEAPON_RailGun_C_GetCurrentRechargeRate::CallFunc_GetCurrentRechargeDuration_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeRate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'WEAPON_RailGun_C_GetCurrentRechargeRate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetCurrentRechargeDuration
// 0x000C (0x000C - 0x0000)
struct WEAPON_RailGun_C_GetCurrentRechargeDuration final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetCurrentRechargeDuration) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetCurrentRechargeDuration");
static_assert(sizeof(WEAPON_RailGun_C_GetCurrentRechargeDuration) == 0x00000C, "Wrong size on WEAPON_RailGun_C_GetCurrentRechargeDuration");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeDuration, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetCurrentRechargeDuration::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeDuration, Temp_bool_Variable) == 0x000004, "Member 'WEAPON_RailGun_C_GetCurrentRechargeDuration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentRechargeDuration, K2Node_Select_Default) == 0x000008, "Member 'WEAPON_RailGun_C_GetCurrentRechargeDuration::K2Node_Select_Default' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetElapsedTimeSinceFired
// 0x0010 (0x0010 - 0x0000)
struct WEAPON_RailGun_C_GetElapsedTimeSinceFired final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_GetElapsedTimeSinceFired) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetElapsedTimeSinceFired");
static_assert(sizeof(WEAPON_RailGun_C_GetElapsedTimeSinceFired) == 0x000010, "Wrong size on WEAPON_RailGun_C_GetElapsedTimeSinceFired");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeSinceFired, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetElapsedTimeSinceFired::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeSinceFired, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000004, "Member 'WEAPON_RailGun_C_GetElapsedTimeSinceFired::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeSinceFired, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'WEAPON_RailGun_C_GetElapsedTimeSinceFired::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeSinceFired, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'WEAPON_RailGun_C_GetElapsedTimeSinceFired::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetRechargeRatioRemaining
// 0x000C (0x000C - 0x0000)
struct WEAPON_RailGun_C_GetRechargeRatioRemaining final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRechargeRatio_Result;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetRechargeRatioRemaining) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetRechargeRatioRemaining");
static_assert(sizeof(WEAPON_RailGun_C_GetRechargeRatioRemaining) == 0x00000C, "Wrong size on WEAPON_RailGun_C_GetRechargeRatioRemaining");
static_assert(offsetof(WEAPON_RailGun_C_GetRechargeRatioRemaining, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetRechargeRatioRemaining::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetRechargeRatioRemaining, CallFunc_GetRechargeRatio_Result) == 0x000004, "Member 'WEAPON_RailGun_C_GetRechargeRatioRemaining::CallFunc_GetRechargeRatio_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetRechargeRatioRemaining, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'WEAPON_RailGun_C_GetRechargeRatioRemaining::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetElapsedTimeUntilFullyRecharged
// 0x0010 (0x0010 - 0x0000)
struct WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRechargeRatioRemaining_Result;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentRechargeDuration_Result;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged");
static_assert(sizeof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged) == 0x000010, "Wrong size on WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged, Result) == 0x000000, "Member 'WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged, CallFunc_GetRechargeRatioRemaining_Result) == 0x000004, "Member 'WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged::CallFunc_GetRechargeRatioRemaining_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged, CallFunc_GetCurrentRechargeDuration_Result) == 0x000008, "Member 'WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged::CallFunc_GetCurrentRechargeDuration_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'WEAPON_RailGun_C_GetElapsedTimeUntilFullyRecharged::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.GetCurrentChargeDamageBonus
// 0x0034 (0x0034 - 0x0000)
struct WEAPON_RailGun_C_GetCurrentChargeDamageBonus final
{
public:
	int32                                         DamageBonus;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ByteToFloat_ReturnValue_1;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus) == 0x000004, "Wrong alignment on WEAPON_RailGun_C_GetCurrentChargeDamageBonus");
static_assert(sizeof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus) == 0x000034, "Wrong size on WEAPON_RailGun_C_GetCurrentChargeDamageBonus");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, DamageBonus) == 0x000000, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::DamageBonus' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Conv_ByteToFloat_ReturnValue) == 0x000008, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Conv_ByteToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Conv_ByteToFloat_ReturnValue_1) == 0x000010, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Conv_ByteToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000018, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000028, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Round_ReturnValue) == 0x00002C, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_GetCurrentChargeDamageBonus, CallFunc_Min_ReturnValue) == 0x000030, "Member 'WEAPON_RailGun_C_GetCurrentChargeDamageBonus::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.ForceStartRechargeTimer
// 0x0018 (0x0018 - 0x0000)
struct WEAPON_RailGun_C_ForceStartRechargeTimer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_RailGun_C_ForceStartRechargeTimer) == 0x000008, "Wrong alignment on WEAPON_RailGun_C_ForceStartRechargeTimer");
static_assert(sizeof(WEAPON_RailGun_C_ForceStartRechargeTimer) == 0x000018, "Wrong size on WEAPON_RailGun_C_ForceStartRechargeTimer");
static_assert(offsetof(WEAPON_RailGun_C_ForceStartRechargeTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WEAPON_RailGun_C_ForceStartRechargeTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_ForceStartRechargeTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WEAPON_RailGun_C_ForceStartRechargeTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WEAPON_RailGun.WEAPON_RailGun_C.TryStartRechargeTimer
// 0x0004 (0x0004 - 0x0000)
struct WEAPON_RailGun_C_TryStartRechargeTimer final
{
public:
	bool                                          CallFunc_HasFullyRecharged_Result;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_RailGun_C_TryStartRechargeTimer) == 0x000001, "Wrong alignment on WEAPON_RailGun_C_TryStartRechargeTimer");
static_assert(sizeof(WEAPON_RailGun_C_TryStartRechargeTimer) == 0x000004, "Wrong size on WEAPON_RailGun_C_TryStartRechargeTimer");
static_assert(offsetof(WEAPON_RailGun_C_TryStartRechargeTimer, CallFunc_HasFullyRecharged_Result) == 0x000000, "Member 'WEAPON_RailGun_C_TryStartRechargeTimer::CallFunc_HasFullyRecharged_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_RailGun_C_TryStartRechargeTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WEAPON_RailGun_C_TryStartRechargeTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
