#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_ProximityMineManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WEAPON_ProximityMineManager.WEAPON_ProximityMineManager_C.LaunchExplosiveFromCamera
// 0x0040 (0x0040 - 0x0000)
struct WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera final
{
public:
	class UCameraComponent*                       CameraComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosiveProjectile_Base_C*            ExplosiveProjectile;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ExplosiveBase_C*                  RemovedExplosiveItem;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProximityMineProjectile_C*             K2Node_DynamicCast_AsProximity_Mine_Projectile;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetExplosivePhysicsComponent_PhysicsComponent; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera) == 0x000008, "Wrong alignment on WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera");
static_assert(sizeof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera) == 0x000040, "Wrong size on WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, CameraComponent) == 0x000000, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::CameraComponent' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, ExplosiveProjectile) == 0x000008, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::ExplosiveProjectile' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, RemovedExplosiveItem) == 0x000010, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::RemovedExplosiveItem' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, Speed) == 0x000018, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::Speed' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, K2Node_DynamicCast_AsProximity_Mine_Projectile) == 0x000028, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::K2Node_DynamicCast_AsProximity_Mine_Projectile' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera, CallFunc_GetExplosivePhysicsComponent_PhysicsComponent) == 0x000038, "Member 'WEAPON_ProximityMineManager_C_LaunchExplosiveFromCamera::CallFunc_GetExplosivePhysicsComponent_PhysicsComponent' has a wrong offset!");

}

