#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_PlasmaRifle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ITEM_EnergyWeapon_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WEAPON_PlasmaRifle.WEAPON_PlasmaRifle_C
// 0x0138 (0x0500 - 0x03C8)
class UWEAPON_PlasmaRifle_C final : public UITEM_EnergyWeapon_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WEAPON_PlasmaRifle_C;               // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UAnimMontage>            LoadCoreMontage;                                   // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            UnloadCoreMontage;                                 // 0x03F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            BoltDischargeMontage;                              // 0x0420(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CoreDischargeMontage;                              // 0x0448(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 EnergyBoltProjectile;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PlasmaChargeProjectile;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedLoadCoreMontage;                             // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedUnloadCoreMontage;                           // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedBoltDischargeMontage;                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedCoreDischargeMontage;                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCoreLoaded;                                      // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          NiagaraFX;                                         // 0x04A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UNiagaraSystem*                         CachedAttachedFX;                                  // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AttachedEffectsComponent;                          // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LoadCoreAnimMessage;                               // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 UnloadCoreAnimMessage;                             // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WEAPON_PlasmaRifle(int32 EntryPoint);
	void StreamWeaponAssets();
	void StreamWeaponMontages();
	void OnLoaded_64ED002C41245FED58C5A3B669098DA8(class UObject* Loaded);
	void OnLoaded_897F24074E104FBB6E4528A8E709F6FB(class UObject* Loaded);
	void OnLoaded_5C2A5B784F79044EB5468B9E5EE051BD(class UObject* Loaded);
	void OnLoaded_6A82DD424517CD77CFB98E93F354BD36(class UObject* Loaded);
	void OnLoaded_1F8561064BFACC4775B8629AC3F18BD3(class UObject* Loaded);
	void EnableDamage(bool* Result);
	void HasLoadedPlasmaCore(bool* Result);
	void HasSparePlasmaAmmo(bool* HasSpareAmmo);
	void IsLoadingOrUnloadingPlasmaCore(bool* Result);
	void FireProjectile(class UClass* ProjectileClass, bool HasKickback, class ABulletProjectile_Base_C** FiredBullet);
	void OnBecomeUnactivatable(bool* Result);
	void TrySetPlasmaCoreInChamber(bool InChamber, bool* Result);
	void SetCurrentMode(int32 Mode, bool* Result);
	void TryRemovePlasmaCoreInChamber(bool* Result);
	void GetDischargeMontage(class UAnimMontage** Montage);
	void GetWeaponModeDisplayName(int32 ModeIndex, bool ShortName, class FText* Result);
	void SetPlasmaCoreLoaded(bool State);
	void UpdateArmedState();
	void UpdateNiagaraFX(bool Destroy, bool SetMode);
	void OnUpdateHeat();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void OnWeaponBecameActivatable(class APAWN_SystemShockCharacter_C* Character, bool ShowImmediately);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WEAPON_PlasmaRifle_C">();
	}
	static class UWEAPON_PlasmaRifle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWEAPON_PlasmaRifle_C>();
	}
};
static_assert(alignof(UWEAPON_PlasmaRifle_C) == 0x000008, "Wrong alignment on UWEAPON_PlasmaRifle_C");
static_assert(sizeof(UWEAPON_PlasmaRifle_C) == 0x000500, "Wrong size on UWEAPON_PlasmaRifle_C");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, UberGraphFrame_WEAPON_PlasmaRifle_C) == 0x0003C8, "Member 'UWEAPON_PlasmaRifle_C::UberGraphFrame_WEAPON_PlasmaRifle_C' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, LoadCoreMontage) == 0x0003D0, "Member 'UWEAPON_PlasmaRifle_C::LoadCoreMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, UnloadCoreMontage) == 0x0003F8, "Member 'UWEAPON_PlasmaRifle_C::UnloadCoreMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, BoltDischargeMontage) == 0x000420, "Member 'UWEAPON_PlasmaRifle_C::BoltDischargeMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CoreDischargeMontage) == 0x000448, "Member 'UWEAPON_PlasmaRifle_C::CoreDischargeMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, EnergyBoltProjectile) == 0x000470, "Member 'UWEAPON_PlasmaRifle_C::EnergyBoltProjectile' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, PlasmaChargeProjectile) == 0x000478, "Member 'UWEAPON_PlasmaRifle_C::PlasmaChargeProjectile' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CachedLoadCoreMontage) == 0x000480, "Member 'UWEAPON_PlasmaRifle_C::CachedLoadCoreMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CachedUnloadCoreMontage) == 0x000488, "Member 'UWEAPON_PlasmaRifle_C::CachedUnloadCoreMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CachedBoltDischargeMontage) == 0x000490, "Member 'UWEAPON_PlasmaRifle_C::CachedBoltDischargeMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CachedCoreDischargeMontage) == 0x000498, "Member 'UWEAPON_PlasmaRifle_C::CachedCoreDischargeMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, IsCoreLoaded) == 0x0004A0, "Member 'UWEAPON_PlasmaRifle_C::IsCoreLoaded' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, NiagaraFX) == 0x0004A8, "Member 'UWEAPON_PlasmaRifle_C::NiagaraFX' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, CachedAttachedFX) == 0x0004D0, "Member 'UWEAPON_PlasmaRifle_C::CachedAttachedFX' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, AttachedEffectsComponent) == 0x0004D8, "Member 'UWEAPON_PlasmaRifle_C::AttachedEffectsComponent' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, LoadCoreAnimMessage) == 0x0004E0, "Member 'UWEAPON_PlasmaRifle_C::LoadCoreAnimMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_PlasmaRifle_C, UnloadCoreAnimMessage) == 0x0004F0, "Member 'UWEAPON_PlasmaRifle_C::UnloadCoreAnimMessage' has a wrong offset!");

}

