#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ITEM_ProjectileWeapon_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WEAPON_GrenadeLauncher.WEAPON_GrenadeLauncher_C
// 0x00B0 (0x0600 - 0x0550)
class UWEAPON_GrenadeLauncher_C final : public UITEM_ProjectileWeapon_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WEAPON_GrenadeLauncher_C;           // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   GrenadeAttachSocket;                               // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrenadeMeshComponent;                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AttachGrenadeMessage;                              // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FinishUnloadMessage;                               // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ReloadFromUnloadMontage;                           // 0x0588(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            EmptyChamberMontage;                               // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CachedProjectileClass;                             // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CachedExplosiveWeaponClass;                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedReloadFromUnloadMontage;                     // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedEmptyChamberMontage;                         // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GrenadeContactDamage;                              // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GrenadeLaunchSpeed;                                // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WEAPON_GrenadeLauncher(int32 EntryPoint);
	void StreamCurrentWeaponModeAssets();
	void StreamWeaponMontages();
	void OnLoaded_70EA00D24F1C36AA168656913D7F6686(TSubclassOf<class UObject> Loaded);
	void OnLoaded_85606C184D68C3CDCB63C6AD216B097D(class UObject* Loaded);
	void OnLoaded_3E72C7BC4FF60342E027CE9D949945DF(class UObject* Loaded);
	void FireProjectile(class AActor** FiredProjectile, struct FVector* Direction);
	void OnWeaponBecameActivatable(class APAWN_SystemShockCharacter_C* Character, bool ShowImmediately);
	void OnBecomeUnactivatable(bool* Result);
	void CreateGrenadeMeshComponent();
	void DestroyGrenadeMeshComponent();
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void QueueReloading();
	void QueueModeSwitch();
	void QueueReloadingFromUnload();
	void GetProjectileClass(class UClass** Result);
	void ShouldAutoReload(bool* Result);
	void SetGrenadeLaunchProperties(int32 ContactDamage, int32 LaunchSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WEAPON_GrenadeLauncher_C">();
	}
	static class UWEAPON_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWEAPON_GrenadeLauncher_C>();
	}
};
static_assert(alignof(UWEAPON_GrenadeLauncher_C) == 0x000008, "Wrong alignment on UWEAPON_GrenadeLauncher_C");
static_assert(sizeof(UWEAPON_GrenadeLauncher_C) == 0x000600, "Wrong size on UWEAPON_GrenadeLauncher_C");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, UberGraphFrame_WEAPON_GrenadeLauncher_C) == 0x000550, "Member 'UWEAPON_GrenadeLauncher_C::UberGraphFrame_WEAPON_GrenadeLauncher_C' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, GrenadeAttachSocket) == 0x000558, "Member 'UWEAPON_GrenadeLauncher_C::GrenadeAttachSocket' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, GrenadeMeshComponent) == 0x000560, "Member 'UWEAPON_GrenadeLauncher_C::GrenadeMeshComponent' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, AttachGrenadeMessage) == 0x000568, "Member 'UWEAPON_GrenadeLauncher_C::AttachGrenadeMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, FinishUnloadMessage) == 0x000578, "Member 'UWEAPON_GrenadeLauncher_C::FinishUnloadMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, ReloadFromUnloadMontage) == 0x000588, "Member 'UWEAPON_GrenadeLauncher_C::ReloadFromUnloadMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, EmptyChamberMontage) == 0x0005B0, "Member 'UWEAPON_GrenadeLauncher_C::EmptyChamberMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, CachedProjectileClass) == 0x0005D8, "Member 'UWEAPON_GrenadeLauncher_C::CachedProjectileClass' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, CachedExplosiveWeaponClass) == 0x0005E0, "Member 'UWEAPON_GrenadeLauncher_C::CachedExplosiveWeaponClass' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, CachedReloadFromUnloadMontage) == 0x0005E8, "Member 'UWEAPON_GrenadeLauncher_C::CachedReloadFromUnloadMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, CachedEmptyChamberMontage) == 0x0005F0, "Member 'UWEAPON_GrenadeLauncher_C::CachedEmptyChamberMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, GrenadeContactDamage) == 0x0005F8, "Member 'UWEAPON_GrenadeLauncher_C::GrenadeContactDamage' has a wrong offset!");
static_assert(offsetof(UWEAPON_GrenadeLauncher_C, GrenadeLaunchSpeed) == 0x0005FC, "Member 'UWEAPON_GrenadeLauncher_C::GrenadeLaunchSpeed' has a wrong offset!");

}

