#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_IonPulseRifle

#include "Basic.hpp"

#include "STRUCT_WeaponMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "ENUM_IonChargedBeamType_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"
#include "CoreGame_structs.hpp"


namespace SDK::Params
{

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.ExecuteUbergraph_WEAPON_IonPulseRifle
// 0x01E8 (0x01E8 - 0x0000)
struct WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_9;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_8;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_7;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_6;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue_1;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_6;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_7;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_8;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect_1;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_9;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   K2Node_DynamicCast_AsForce_Feedback_Effect_2;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle");
static_assert(sizeof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle) == 0x0001E8, "Wrong size on WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, EntryPoint) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_9) == 0x000048, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_9' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable) == 0x000060, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsAnim_Montage) == 0x000068, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_8) == 0x000078, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_8' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_1) == 0x000080, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000088, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_7) == 0x000098, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_7' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_2) == 0x0000A0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsSound_Cue) == 0x0000A8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_6) == 0x0000B8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_6' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_3) == 0x0000C0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsSound_Cue_1) == 0x0000C8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsSound_Cue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_5) == 0x0000D8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_4) == 0x0000E0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsAnim_Montage_2) == 0x0000E8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_4) == 0x0000F8, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_5) == 0x000100, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsAnim_Montage_3) == 0x000108, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_3) == 0x000118, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_6) == 0x000120, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsNiagara_System) == 0x000128, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsNiagara_System' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_6) == 0x000130, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_2) == 0x000138, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_7) == 0x000140, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsForce_Feedback_Effect) == 0x000148, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsForce_Feedback_Effect' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_7) == 0x000150, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded_1) == 0x000158, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_8) == 0x000160, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsForce_Feedback_Effect_1) == 0x000168, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsForce_Feedback_Effect_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CustomEvent_Loaded) == 0x000178, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, Temp_object_Variable_9) == 0x000180, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_AsForce_Feedback_Effect_2) == 0x000188, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_AsForce_Feedback_Effect_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_DynamicCast_bSuccess_9) == 0x000190, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_5) == 0x000194, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001A4, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B4, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001C4, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001D4, "Member 'WEAPON_IonPulseRifle_C_ExecuteUbergraph_WEAPON_IonPulseRifle::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_FF9E235148FC867D6DEB3BA47A521CE4::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_C9C6266F4695E530B12EE9891AFF049B
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_C9C6266F4695E530B12EE9891AFF049B::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_8EF3A359490A637DA4A310A4F7D96B09
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_8EF3A359490A637DA4A310A4F7D96B09::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_CD69C5494A86D5F07CAB9C8622D628DB::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_615E8328463F46FE8BB727A0EA83FCD9
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_615E8328463F46FE8BB727A0EA83FCD9::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_7C2F215149D6D7C6CFF9009641C41CC6::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_0588E56D4D1DCF9CCD4DD4B5FBFF5F20::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_76BD371E42A51692AA80A7A93DD7B834
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_76BD371E42A51692AA80A7A93DD7B834::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_6366B05B452B4B0F22FFFEB05DC9C551::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.OnLoaded_A152499A464E718E1950958E67FCF392
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392");
static_assert(sizeof(WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392) == 0x000008, "Wrong size on WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392");
static_assert(offsetof(WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392, Loaded) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_OnLoaded_A152499A464E718E1950958E67FCF392::Loaded' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.Activate
// 0x0118 (0x0118 - 0x0000)
struct WEAPON_IonPulseRifle_C_Activate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0010(0x0100)(HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Activate_Result;                          // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_Activate) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_Activate");
static_assert(sizeof(WEAPON_IonPulseRifle_C_Activate) == 0x000118, "Wrong size on WEAPON_IonPulseRifle_C_Activate");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, Character) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_Activate::Character' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, Result) == 0x000008, "Member 'WEAPON_IonPulseRifle_C_Activate::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, CallFunc_GetCurrentMode_Mode) == 0x000010, "Member 'WEAPON_IonPulseRifle_C_Activate::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, CallFunc_GetWeaponPropertyValueByType_Value) == 0x000110, "Member 'WEAPON_IonPulseRifle_C_Activate::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, CallFunc_Not_PreBool_ReturnValue) == 0x000114, "Member 'WEAPON_IonPulseRifle_C_Activate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, CallFunc_Greater_IntInt_ReturnValue) == 0x000115, "Member 'WEAPON_IonPulseRifle_C_Activate::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Activate, CallFunc_Activate_Result) == 0x000116, "Member 'WEAPON_IonPulseRifle_C_Activate::CallFunc_Activate_Result' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.Deactivate
// 0x01A0 (0x01A0 - 0x0000)
struct WEAPON_IonPulseRifle_C_Deactivate final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           MontageToPlay;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeProgress;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxChargeDuration;                                 // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedChargeTime;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           OwnerCharacter;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayTimeInSeconds_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0058(0x0100)(HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponPropertyValueByType_Value;       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FLatentEventHandle                     CallFunc_CreateEventHandle_ReturnValue;            // 0x0188(0x0010)(ContainsInstancedReference)
	bool                                          CallFunc_Deactivate_Result;                        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_Deactivate) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_Deactivate");
static_assert(sizeof(WEAPON_IonPulseRifle_C_Deactivate) == 0x0001A0, "Wrong size on WEAPON_IonPulseRifle_C_Deactivate");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Result) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, MontageToPlay) == 0x000008, "Member 'WEAPON_IonPulseRifle_C_Deactivate::MontageToPlay' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, ChargeProgress) == 0x000010, "Member 'WEAPON_IonPulseRifle_C_Deactivate::ChargeProgress' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, MaxChargeDuration) == 0x000014, "Member 'WEAPON_IonPulseRifle_C_Deactivate::MaxChargeDuration' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, ElapsedChargeTime) == 0x000018, "Member 'WEAPON_IonPulseRifle_C_Deactivate::ElapsedChargeTime' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, OwnerCharacter) == 0x000020, "Member 'WEAPON_IonPulseRifle_C_Deactivate::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_float_Variable) == 0x000028, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_float_Variable_1) == 0x00002C, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_bool_Variable) == 0x000030, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_float_Variable_2) == 0x000034, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_float_Variable_3) == 0x000038, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003D, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003E, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, K2Node_Select_Default) == 0x000040, "Member 'WEAPON_IonPulseRifle_C_Deactivate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, Temp_bool_Variable_1) == 0x000044, "Member 'WEAPON_IonPulseRifle_C_Deactivate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000045, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, K2Node_Select_Default_1) == 0x000048, "Member 'WEAPON_IonPulseRifle_C_Deactivate::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_GetPlayTimeInSeconds_ReturnValue) == 0x000050, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_GetPlayTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_GetCurrentMode_Mode) == 0x000058, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_GetCurrentMode_Mode' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000158, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_GetWeaponPropertyValueByType_Value) == 0x00015C, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_GetWeaponPropertyValueByType_Value' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000160, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000164, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000168, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_FClamp_ReturnValue) == 0x00016C, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_GetOwnerCharacter_Character) == 0x000170, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'WEAPON_IonPulseRifle_C_Deactivate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_CreateEventHandle_ReturnValue) == 0x000188, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_CreateEventHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_Deactivate, CallFunc_Deactivate_Result) == 0x000198, "Member 'WEAPON_IonPulseRifle_C_Deactivate::CallFunc_Deactivate_Result' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.UpdateEnergyEventBindings
// 0x0048 (0x0048 - 0x0000)
struct WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings final
{
public:
	bool                                          BindsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribInstance*                        CallFunc_GetAttribInstance_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings");
static_assert(sizeof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings) == 0x000048, "Wrong size on WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, BindsEnabled) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::BindsEnabled' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, CallFunc_GetOwnerCharacter_Character) == 0x000018, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, CallFunc_GetOwnerCharacter_Character_1) == 0x000020, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::CallFunc_GetOwnerCharacter_Character_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, CallFunc_GetAttribInstance_ReturnValue) == 0x000028, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::CallFunc_GetAttribInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, CallFunc_GetAttribInstance_ReturnValue_1) == 0x000030, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::CallFunc_GetAttribInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WEAPON_IonPulseRifle_C_UpdateEnergyEventBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.EVENT_OnEnergyDepleted
// 0x0003 (0x0003 - 0x0000)
struct WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Deactivate_Result;                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted) == 0x000001, "Wrong alignment on WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted");
static_assert(sizeof(WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted) == 0x000003, "Wrong size on WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted");
static_assert(offsetof(WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted, CallFunc_Less_IntInt_ReturnValue) == 0x000001, "Member 'WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted, CallFunc_Deactivate_Result) == 0x000002, "Member 'WEAPON_IonPulseRifle_C_EVENT_OnEnergyDepleted::CallFunc_Deactivate_Result' has a wrong offset!");

// Function WEAPON_IonPulseRifle.WEAPON_IonPulseRifle_C.CanActivate
// 0x0018 (0x0018 - 0x0000)
struct WEAPON_IonPulseRifle_C_CanActivate final
{
public:
	class APAWN_SystemShockCharacter_C*           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOwnerEnergy_CurrentEnergy;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOwnerEnergy_MaxEnergy;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivate_Result;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverheated_Result;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WEAPON_IonPulseRifle_C_CanActivate) == 0x000008, "Wrong alignment on WEAPON_IonPulseRifle_C_CanActivate");
static_assert(sizeof(WEAPON_IonPulseRifle_C_CanActivate) == 0x000018, "Wrong size on WEAPON_IonPulseRifle_C_CanActivate");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, Character) == 0x000000, "Member 'WEAPON_IonPulseRifle_C_CanActivate::Character' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, Result) == 0x000008, "Member 'WEAPON_IonPulseRifle_C_CanActivate::Result' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, CallFunc_GetOwnerEnergy_CurrentEnergy) == 0x00000C, "Member 'WEAPON_IonPulseRifle_C_CanActivate::CallFunc_GetOwnerEnergy_CurrentEnergy' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, CallFunc_GetOwnerEnergy_MaxEnergy) == 0x000010, "Member 'WEAPON_IonPulseRifle_C_CanActivate::CallFunc_GetOwnerEnergy_MaxEnergy' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, CallFunc_CanActivate_Result) == 0x000014, "Member 'WEAPON_IonPulseRifle_C_CanActivate::CallFunc_CanActivate_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'WEAPON_IonPulseRifle_C_CanActivate::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_IonPulseRifle_C_CanActivate, CallFunc_IsOverheated_Result) == 0x000016, "Member 'WEAPON_IonPulseRifle_C_CanActivate::CallFunc_IsOverheated_Result' has a wrong offset!");

