#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_Shotgun

#include "Basic.hpp"

#include "ENUM_ActionPriority_structs.hpp"
#include "Engine_structs.hpp"
#include "ITEM_ProjectileWeapon_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WEAPON_Shotgun.WEAPON_Shotgun_C
// 0x0138 (0x0688 - 0x0550)
class UWEAPON_Shotgun_C final : public UITEM_ProjectileWeapon_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WEAPON_Shotgun_C;                   // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UAnimMontage>            ReloadLoopMontage;                                 // 0x0558(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ReloadBackMontage;                                 // 0x0580(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ReloadEndMontage;                                  // 0x05A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ReloadEndDryMontage;                               // 0x05D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ReloadStartMessage;                                // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 RefillShellMessage;                                // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 RefillBackMessage;                                 // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasBarrelAttachment;                               // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasRoundInChamber;                                 // 0x0629(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            UnloadShellsMontage;                               // 0x0630(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAnimMontage*                           CachedReloadLoopMontage;                           // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedReloadBackMontage;                           // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedReloadEndMontage;                            // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedReloadEndDryMontage;                         // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CachedUnloadShellsMontage;                         // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ModeSwitchAfterReloadTimestamp;                    // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WEAPON_Shotgun(int32 EntryPoint);
	void StreamWeaponMontages();
	void OnLoaded_2183B74E4001A8A7130BAA9FB81C3BE0(class UObject* Loaded);
	void OnLoaded_DD526C064C5CF2A316E40594429A4869(class UObject* Loaded);
	void OnLoaded_95E300A34F4CEF7E181DB58C730C6BD8(class UObject* Loaded);
	void OnLoaded_CA58795345D1B066165266B901195175(class UObject* Loaded);
	void OnLoaded_CF8884BB47FBD87AAC4F75A03C8F08A6(class UObject* Loaded);
	void Activate(class APAWN_SystemShockCharacter_C* Character, bool* Result);
	void ReceiveAnimationMessage(const class FString& Message, bool* Result);
	void IsActivelyReloading(bool IncludeModeSwitch, bool* Result);
	void RefillShell();
	void EnableDamage(bool* Result);
	void FireProjectile(class AActor** FiredProjectile, struct FVector* Direction);
	void TryEmptyMagazine();
	void QueueModeSwitch();
	void SetCurrentMode(int32 Mode, bool* Result);
	void GetProjectileClass(class UClass** Result);
	void EVENT_OnModeSwitchAfterReloadEnd();
	void SetHasBarrelAttachment(bool State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WEAPON_Shotgun_C">();
	}
	static class UWEAPON_Shotgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWEAPON_Shotgun_C>();
	}
};
static_assert(alignof(UWEAPON_Shotgun_C) == 0x000008, "Wrong alignment on UWEAPON_Shotgun_C");
static_assert(sizeof(UWEAPON_Shotgun_C) == 0x000688, "Wrong size on UWEAPON_Shotgun_C");
static_assert(offsetof(UWEAPON_Shotgun_C, UberGraphFrame_WEAPON_Shotgun_C) == 0x000550, "Member 'UWEAPON_Shotgun_C::UberGraphFrame_WEAPON_Shotgun_C' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ReloadLoopMontage) == 0x000558, "Member 'UWEAPON_Shotgun_C::ReloadLoopMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ReloadBackMontage) == 0x000580, "Member 'UWEAPON_Shotgun_C::ReloadBackMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ReloadEndMontage) == 0x0005A8, "Member 'UWEAPON_Shotgun_C::ReloadEndMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ReloadEndDryMontage) == 0x0005D0, "Member 'UWEAPON_Shotgun_C::ReloadEndDryMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ReloadStartMessage) == 0x0005F8, "Member 'UWEAPON_Shotgun_C::ReloadStartMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, RefillShellMessage) == 0x000608, "Member 'UWEAPON_Shotgun_C::RefillShellMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, RefillBackMessage) == 0x000618, "Member 'UWEAPON_Shotgun_C::RefillBackMessage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, HasBarrelAttachment) == 0x000628, "Member 'UWEAPON_Shotgun_C::HasBarrelAttachment' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, HasRoundInChamber) == 0x000629, "Member 'UWEAPON_Shotgun_C::HasRoundInChamber' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, UnloadShellsMontage) == 0x000630, "Member 'UWEAPON_Shotgun_C::UnloadShellsMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, CachedReloadLoopMontage) == 0x000658, "Member 'UWEAPON_Shotgun_C::CachedReloadLoopMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, CachedReloadBackMontage) == 0x000660, "Member 'UWEAPON_Shotgun_C::CachedReloadBackMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, CachedReloadEndMontage) == 0x000668, "Member 'UWEAPON_Shotgun_C::CachedReloadEndMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, CachedReloadEndDryMontage) == 0x000670, "Member 'UWEAPON_Shotgun_C::CachedReloadEndDryMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, CachedUnloadShellsMontage) == 0x000678, "Member 'UWEAPON_Shotgun_C::CachedUnloadShellsMontage' has a wrong offset!");
static_assert(offsetof(UWEAPON_Shotgun_C, ModeSwitchAfterReloadTimestamp) == 0x000680, "Member 'UWEAPON_Shotgun_C::ModeSwitchAfterReloadTimestamp' has a wrong offset!");

}

