#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEAPON_SparqBeam

#include "Basic.hpp"

#include "STRUCT_EffectParams_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "STRUCT_WeaponMode_structs.hpp"
#include "NamedInteger_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STRUCT_ImpactEffectResults_structs.hpp"


namespace SDK::Params
{

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.ExecuteUbergraph_WEAPON_SparqBeam
// 0x0140 (0x0140 - 0x0000)
struct WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_5;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_4;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_3;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_4;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage_4;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_5;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetWeaponMeshComponent_Result;            // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam");
static_assert(sizeof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam) == 0x000140, "Wrong size on WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, EntryPoint) == 0x000000, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded_5) == 0x000028, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded_5' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable) == 0x000030, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsAnim_Montage) == 0x000038, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded_4) == 0x000048, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded_4' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable_1) == 0x000050, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsAnim_Montage_1) == 0x000058, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsAnim_Montage_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded_3) == 0x000068, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable_2) == 0x000070, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsAnim_Montage_2) == 0x000078, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsAnim_Montage_2' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded_2) == 0x000088, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable_3) == 0x000090, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsAnim_Montage_3) == 0x000098, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsAnim_Montage_3' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded_1) == 0x0000A8, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable_4) == 0x0000B0, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsAnim_Montage_4) == 0x0000B8, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsAnim_Montage_4' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CustomEvent_Loaded) == 0x0000C8, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, Temp_object_Variable_5) == 0x0000D0, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_AsSound_Cue) == 0x0000D8, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_DynamicCast_bSuccess_5) == 0x0000E0, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F4, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate_4) == 0x000104, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, K2Node_CreateDelegate_OutputDelegate_5) == 0x000114, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, CallFunc_GetWeaponMeshComponent_Result) == 0x000128, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::CallFunc_GetWeaponMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000138, "Member 'WEAPON_SparqBeam_C_ExecuteUbergraph_WEAPON_SparqBeam::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_26C27D2847CEA7CADE9D55B5540BD931
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_26C27D2847CEA7CADE9D55B5540BD931::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_A8D7EA4E4DADDC2F356841B8CBDFCAF7::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_9AA889644536F3FE47B3C5854042E0C7
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_9AA889644536F3FE47B3C5854042E0C7::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_4453E29C4EB8D6F53DE5CBA60EA23F92::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_ACAF3726483954630377248BA8760B43
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_ACAF3726483954630377248BA8760B43::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.OnLoaded_C7B0298B40951C0D5A4863980A72BA74
// 0x0008 (0x0008 - 0x0000)
struct WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74");
static_assert(sizeof(WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74) == 0x000008, "Wrong size on WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74");
static_assert(offsetof(WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74, Loaded) == 0x000000, "Member 'WEAPON_SparqBeam_C_OnLoaded_C7B0298B40951C0D5A4863980A72BA74::Loaded' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.PlayBeamParticleFX
// 0x0058 (0x0058 - 0x0000)
struct WEAPON_SparqBeam_C_PlayBeamParticleFX final
{
public:
	struct FVector                                HitPoint;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourcePoint;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModeIndex;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      ParticleSystemComponent;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BeamEffect;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetWeaponMeshComponent_Result;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WEAPON_SparqBeam_C_PlayBeamParticleFX) == 0x000008, "Wrong alignment on WEAPON_SparqBeam_C_PlayBeamParticleFX");
static_assert(sizeof(WEAPON_SparqBeam_C_PlayBeamParticleFX) == 0x000058, "Wrong size on WEAPON_SparqBeam_C_PlayBeamParticleFX");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, HitPoint) == 0x000000, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::HitPoint' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, SourcePoint) == 0x00000C, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::SourcePoint' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, ModeIndex) == 0x000018, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::ModeIndex' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, ParticleSystemComponent) == 0x000020, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::ParticleSystemComponent' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, BeamEffect) == 0x000028, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::BeamEffect' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, CallFunc_GetWeaponMeshComponent_Result) == 0x000038, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::CallFunc_GetWeaponMeshComponent_Result' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000040, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WEAPON_SparqBeam_C_PlayBeamParticleFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000050, "Member 'WEAPON_SparqBeam_C_PlayBeamParticleFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function WEAPON_SparqBeam.WEAPON_SparqBeam_C.FireBeam
// 0x0F10 (0x0F10 - 0x0000)
struct WEAPON_SparqBeam_C_FireBeam final
{
public:
	bool                                          IsDeathBlow;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	bool                                          WasCharacterAlive;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpactImpulseStrength;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttribDamageInstance                  DamageInstance;                                    // 0x0008(0x0028)(Edit, BlueprintVisible)
	struct FAttribModApplyData                    DamageMod;                                         // 0x0030(0x00A0)(Edit, BlueprintVisible)
	TSet<class APAWN_SystemShockCharacter_C*>     CollidedShieldCharacters;                          // 0x00D0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UObject*                                ImpactData;                                        // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAttribManagerComponent*                AttribManager;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           HitCharacter;                                      // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      PhysicalMaterial;                                  // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName;                                       // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0158(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactNormal;                                      // 0x01E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitPoint;                                          // 0x01EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RayDirection;                                      // 0x01F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BarrelLocation;                                    // 0x0204(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpreadDirection;                                   // 0x0210(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraDirection;                                   // 0x021C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x0228(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeamRadius;                                        // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           OwnerPawn;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character;  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0x1];                                      // 0x02D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_AttribManager_C*                  K2Node_DynamicCast_AsCOMP_Attrib_Manager;          // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDamageReceivedBound_ReturnValue;        // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance;       // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetReflectionVector_ReturnValue;          // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance_1;     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriangulateImpactLocation_HitSomething;   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TriangulateImpactLocation_HitResult;      // 0x03A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_TriangulateImpactLocation_TriangulatedDirection; // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance_2;     // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCombatTraceDistance_Distance_3;     // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_SystemShockCharacter_C*           K2Node_DynamicCast_AsPAWN_System_Shock_Character_1; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetWeaponMeshComponent_Result;            // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A[0x2];                                      // 0x050A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0598(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_4;            // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_4;         // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AA[0x2];                                      // 0x05AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_4;                    // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_4;                // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_4;                // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_4;             // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_4;                  // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_4;            // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_4;                 // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_4;                // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_4;            // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_4;             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_4;                 // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_4;            // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_4;               // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_4;              // 0x0614(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_4;                // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode;                      // 0x0630(0x0100)(HasGetValueTypeHash)
	struct FNamedInteger                          K2Node_MakeStruct_NamedInteger;                    // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNamedInteger>                  K2Node_MakeArray_Array_1;                          // 0x0740(0x0010)(ReferenceParm)
	struct FSTRUCT_EffectParams                   K2Node_MakeStruct_STRUCT_EffectParams;             // 0x0750(0x0030)(HasGetValueTypeHash)
	struct FSTRUCT_WeaponMode                     CallFunc_GetCurrentMode_Mode_1;                    // 0x0780(0x0100)(HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_5;            // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_5;         // 0x0881(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_882[0x2];                                      // 0x0882(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_5;                    // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_5;                // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_5;                // 0x088C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_5;             // 0x0898(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_5;                  // 0x08A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_5;            // 0x08B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_5;                 // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_5;                // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
