#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DebugListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuListItemBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DebugListItem.WIDGET_DebugListItem_C
// 0x0050 (0x0360 - 0x0310)
#pragma pack(push, 0x1)
class alignas(0x08) UWIDGET_DebugListItem_C : public UWIDGET_MenuListItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ActivateButtonReveal;                              // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMAGE_SelectedBackground;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Input;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SelectedBackground;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SettingNameLabel;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Button;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ConsoleCommand;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CloseMenuAfterActivate;                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideInShippingBuild;                               // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WIDGET_DebugListItem(int32 EntryPoint);
	void BndEvt__WIDGET_DebugListItem_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void TriggerConsoleCommand();
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void EVENT_OnMouseExit(const struct FPointerEvent& MouseEvent);
	void TriggerDebugFunction(bool* Handled);
	void InitializeMenuListItem(class UWIDGET_MenuListBase_C* ParentList, int32 Index_0);
	void SetVisbilityBasedOnBuildType();
	void ReceiveNavAccept(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DebugListItem_C">();
	}
	static class UWIDGET_DebugListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DebugListItem_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UWIDGET_DebugListItem_C) == 0x000008, "Wrong alignment on UWIDGET_DebugListItem_C");
static_assert(sizeof(UWIDGET_DebugListItem_C) == 0x000360, "Wrong size on UWIDGET_DebugListItem_C");
static_assert(offsetof(UWIDGET_DebugListItem_C, UberGraphFrame) == 0x000310, "Member 'UWIDGET_DebugListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, ActivateButtonReveal) == 0x000318, "Member 'UWIDGET_DebugListItem_C::ActivateButtonReveal' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, IMAGE_SelectedBackground) == 0x000320, "Member 'UWIDGET_DebugListItem_C::IMAGE_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, MESH_Input) == 0x000328, "Member 'UWIDGET_DebugListItem_C::MESH_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, MESH_SelectedBackground) == 0x000330, "Member 'UWIDGET_DebugListItem_C::MESH_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, TEXT_SettingNameLabel) == 0x000338, "Member 'UWIDGET_DebugListItem_C::TEXT_SettingNameLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, WIDGET_ButtonLegend_Button) == 0x000340, "Member 'UWIDGET_DebugListItem_C::WIDGET_ButtonLegend_Button' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, ConsoleCommand) == 0x000348, "Member 'UWIDGET_DebugListItem_C::ConsoleCommand' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, CloseMenuAfterActivate) == 0x000358, "Member 'UWIDGET_DebugListItem_C::CloseMenuAfterActivate' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugListItem_C, HideInShippingBuild) == 0x000359, "Member 'UWIDGET_DebugListItem_C::HideInShippingBuild' has a wrong offset!");

}

