#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SoftwareListItem

#include "Basic.hpp"

#include "ENUM_ItemType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SoftwareListItem.WIDGET_SoftwareListItem_C
// 0x0040 (0x02A0 - 0x0260)
class UWIDGET_SoftwareListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_BG;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Name;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Version;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowVersion;                                       // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           Item;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_SoftwareListItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void InitializeSoftwareListItem(class UWIDGET_PlayerHUD_C* HUD);
	void EVENT_OnCountChanged(class UITEM_Base_C* Item_0, int32 Count);
	void EVENT_OnBagChanged(int32 Slot_0);
	void FindBag(class UInventoryBag_C** Bag);
	void RefreshItemText();
	void FindItem(class UITEM_Base_C** Item_0);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SoftwareListItem_C">();
	}
	static class UWIDGET_SoftwareListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SoftwareListItem_C>();
	}
};
static_assert(alignof(UWIDGET_SoftwareListItem_C) == 0x000008, "Wrong alignment on UWIDGET_SoftwareListItem_C");
static_assert(sizeof(UWIDGET_SoftwareListItem_C) == 0x0002A0, "Wrong size on UWIDGET_SoftwareListItem_C");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SoftwareListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, MESH_BG) == 0x000268, "Member 'UWIDGET_SoftwareListItem_C::MESH_BG' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, TEXT_Name) == 0x000270, "Member 'UWIDGET_SoftwareListItem_C::TEXT_Name' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, TEXT_Version) == 0x000278, "Member 'UWIDGET_SoftwareListItem_C::TEXT_Version' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, ItemClass) == 0x000280, "Member 'UWIDGET_SoftwareListItem_C::ItemClass' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, ShowVersion) == 0x000288, "Member 'UWIDGET_SoftwareListItem_C::ShowVersion' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, PlayerHUD) == 0x000290, "Member 'UWIDGET_SoftwareListItem_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareListItem_C, Item) == 0x000298, "Member 'UWIDGET_SoftwareListItem_C::Item' has a wrong offset!");

}

