#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPTION_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Settings_Slider.WIDGET_Settings_Slider_C
// 0x0060 (0x0398 - 0x0338)
class UWIDGET_Settings_Slider_C : public UOPTION_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMAGE_SelectedBackground;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Input;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SelectedBackground;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SettingNameLabel;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Slider_C*                       WIDGET_Slider;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SliderDiscreteValues;                              // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderInitialValue;                                // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderValueMin;                                    // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SliderValueMax;                                    // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SliderPostfix;                                     // 0x0378(0x0018)(Edit, BlueprintVisible)
	int32                                         SliderFractionalDigits;                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NavIncrementAmount;                                // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Settings_Slider(int32 EntryPoint);
	void BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(float NewSliderValue, float NewAbsoluteValue);
	void PreConstruct(bool IsDesignTime);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseExit(const struct FPointerEvent& MouseEvent);
	void OnSliderValueChanged(float NewValue);
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void GetSlider(class UWIDGET_Slider_C** Result);
	void ReceiveNavLeft(bool InputState, bool* Result);
	void InitializeMenuListItem(class UWIDGET_MenuListBase_C* ParentList, int32 Index_0);
	void GetScaledCurrentSliderValue(float* Result);
	void ReceiveNavRight(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Settings_Slider_C">();
	}
	static class UWIDGET_Settings_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Settings_Slider_C>();
	}
};
static_assert(alignof(UWIDGET_Settings_Slider_C) == 0x000008, "Wrong alignment on UWIDGET_Settings_Slider_C");
static_assert(sizeof(UWIDGET_Settings_Slider_C) == 0x000398, "Wrong size on UWIDGET_Settings_Slider_C");
static_assert(offsetof(UWIDGET_Settings_Slider_C, UberGraphFrame) == 0x000338, "Member 'UWIDGET_Settings_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, IMAGE_SelectedBackground) == 0x000340, "Member 'UWIDGET_Settings_Slider_C::IMAGE_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, MESH_Input) == 0x000348, "Member 'UWIDGET_Settings_Slider_C::MESH_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, MESH_SelectedBackground) == 0x000350, "Member 'UWIDGET_Settings_Slider_C::MESH_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, TEXT_SettingNameLabel) == 0x000358, "Member 'UWIDGET_Settings_Slider_C::TEXT_SettingNameLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, WIDGET_Slider) == 0x000360, "Member 'UWIDGET_Settings_Slider_C::WIDGET_Slider' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderDiscreteValues) == 0x000368, "Member 'UWIDGET_Settings_Slider_C::SliderDiscreteValues' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderInitialValue) == 0x00036C, "Member 'UWIDGET_Settings_Slider_C::SliderInitialValue' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderValueMin) == 0x000370, "Member 'UWIDGET_Settings_Slider_C::SliderValueMin' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderValueMax) == 0x000374, "Member 'UWIDGET_Settings_Slider_C::SliderValueMax' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderPostfix) == 0x000378, "Member 'UWIDGET_Settings_Slider_C::SliderPostfix' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, SliderFractionalDigits) == 0x000390, "Member 'UWIDGET_Settings_Slider_C::SliderFractionalDigits' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_Slider_C, NavIncrementAmount) == 0x000394, "Member 'UWIDGET_Settings_Slider_C::NavIncrementAmount' has a wrong offset!");

}

