#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_InventoryDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "STRUCT_ItemDetailsIconParams_structs.hpp"
#include "ENUM_DoorState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.ExecuteUbergraph_WIDGET_InventoryDetails
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails) == 0x000048, "Wrong size on WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails, EntryPoint) == 0x000000, "Member 'WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails, K2Node_Event_MyGeometry) == 0x000004, "Member 'WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'WIDGET_InventoryDetails_C_ExecuteUbergraph_WIDGET_InventoryDetails::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_InventoryDetails_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryDetails_C_Tick) == 0x000004, "Wrong alignment on WIDGET_InventoryDetails_C_Tick");
static_assert(sizeof(WIDGET_InventoryDetails_C_Tick) == 0x00003C, "Wrong size on WIDGET_InventoryDetails_C_Tick");
static_assert(offsetof(WIDGET_InventoryDetails_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_InventoryDetails_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_InventoryDetails_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.EVENT_OnHoverItemChanged
// 0x0150 (0x0150 - 0x0000)
struct WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           PreviousItem;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModeCount;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentMode;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_UpdateItemDetailsRenderTarget_Result;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_ItemDetailsIconParams          CallFunc_UpdateItemDetailsRenderTarget_IconParams; // 0x0048(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_ProjectileWeapon_Base_C*          K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_ProjectileWeapon_Base_C*          K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldItemShowBars_Result;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldItemShowExtendedDescription_Result; // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldItemShowExtendedDescription_Result_1; // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_Result;                    // 0x00B8(0x0018)()
	bool                                          CallFunc_ShouldItemShowExtendedDescription_Result_2; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetInventoryItemDetailsClass_InventoryItemDetailsWidget; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_InventoryItemDetails_C> K2Node_DynamicCast_AsINTERF_Inventory_Item_Details; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAmmoDetails_ShowAmmo;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmmoDetails_CountInClip;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAmmoDetails_CountInInventory;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_InventoryItemDetails_C> K2Node_DynamicCast_AsINTERF_Inventory_Item_Details_1; // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InitializeItemDetails_Result;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0138(0x0018)()
};
static_assert(alignof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged");
static_assert(sizeof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged) == 0x000150, "Wrong size on WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, Item) == 0x000000, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, PreviousItem) == 0x000008, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::PreviousItem' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, ModeCount) == 0x000010, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::ModeCount' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CurrentMode) == 0x000014, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CurrentMode' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_UpdateItemDetailsRenderTarget_Result) == 0x000040, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_UpdateItemDetailsRenderTarget_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_UpdateItemDetailsRenderTarget_IconParams) == 0x000048, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_UpdateItemDetailsRenderTarget_IconParams' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base) == 0x000060, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00006C, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000070, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_MakeVector2D_ReturnValue) == 0x000074, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00008C, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base_1) == 0x000098, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_AsITEM_Projectile_Weapon_Base_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ShouldItemShowBars_Result) == 0x0000B0, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ShouldItemShowBars_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ShouldItemShowExtendedDescription_Result) == 0x0000B1, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ShouldItemShowExtendedDescription_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ShouldItemShowExtendedDescription_Result_1) == 0x0000B2, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ShouldItemShowExtendedDescription_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000B3, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetDescription_Result) == 0x0000B8, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetDescription_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ShouldItemShowExtendedDescription_Result_2) == 0x0000D0, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ShouldItemShowExtendedDescription_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetInventoryItemDetailsClass_InventoryItemDetailsWidget) == 0x0000D8, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetInventoryItemDetailsClass_InventoryItemDetailsWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, Temp_float_Variable) == 0x0000E0, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_IsValid_ReturnValue_1) == 0x0000E4, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_Not_PreBool_ReturnValue) == 0x0000E5, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1) == 0x0000E8, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, Temp_float_Variable_1) == 0x0000F0, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, Temp_bool_Variable) == 0x0000F4, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_AsINTERF_Inventory_Item_Details) == 0x0000F8, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_AsINTERF_Inventory_Item_Details' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_Select_Default) == 0x00010C, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetAmmoDetails_ShowAmmo) == 0x000110, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetAmmoDetails_ShowAmmo' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetAmmoDetails_CountInClip) == 0x000114, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetAmmoDetails_CountInClip' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_GetAmmoDetails_CountInInventory) == 0x000118, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_GetAmmoDetails_CountInInventory' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_AsINTERF_Inventory_Item_Details_1) == 0x000120, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_AsINTERF_Inventory_Item_Details_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_InitializeItemDetails_Result) == 0x000131, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_InitializeItemDetails_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged, CallFunc_TextToUpper_ReturnValue) == 0x000138, "Member 'WIDGET_InventoryDetails_C_EVENT_OnHoverItemChanged::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.InitializeInventoryItemDetails
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_InventoryDetails_C_InitializeInventoryItemDetails final
{
public:
	class UWIDGET_PlayerHUD_C*                    PlayerHUD_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UITEM_Base_C* NewItem)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryDetails_C_InitializeInventoryItemDetails) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_InitializeInventoryItemDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_InitializeInventoryItemDetails) == 0x000018, "Wrong size on WIDGET_InventoryDetails_C_InitializeInventoryItemDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_InitializeInventoryItemDetails, PlayerHUD_0) == 0x000000, "Member 'WIDGET_InventoryDetails_C_InitializeInventoryItemDetails::PlayerHUD_0' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_InitializeInventoryItemDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WIDGET_InventoryDetails_C_InitializeInventoryItemDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.OnShowInventoryItemDetails
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_InventoryDetails_C_OnShowInventoryItemDetails final
{
public:
	TDelegate<void(class UInventoryBag_C* Bag, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryDetails_C_OnShowInventoryItemDetails) == 0x000004, "Wrong alignment on WIDGET_InventoryDetails_C_OnShowInventoryItemDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_OnShowInventoryItemDetails) == 0x000010, "Wrong size on WIDGET_InventoryDetails_C_OnShowInventoryItemDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_OnShowInventoryItemDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WIDGET_InventoryDetails_C_OnShowInventoryItemDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.OnHideInventoryItemDetails
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_InventoryDetails_C_OnHideInventoryItemDetails final
{
public:
	TDelegate<void(class UInventoryBag_C* Bag, int32 SlotIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryDetails_C_OnHideInventoryItemDetails) == 0x000004, "Wrong alignment on WIDGET_InventoryDetails_C_OnHideInventoryItemDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_OnHideInventoryItemDetails) == 0x000010, "Wrong size on WIDGET_InventoryDetails_C_OnHideInventoryItemDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_OnHideInventoryItemDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WIDGET_InventoryDetails_C_OnHideInventoryItemDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.UpdateUpgradeIcon
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_InventoryDetails_C_UpdateUpgradeIcon final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_WeaponBase_C*                     K2Node_DynamicCast_AsITEM_Weapon_Base;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInstalledAnyModKits_Result;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_UpdateUpgradeIcon");
static_assert(sizeof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon) == 0x000018, "Wrong size on WIDGET_InventoryDetails_C_UpdateUpgradeIcon");
static_assert(offsetof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon, Item) == 0x000000, "Member 'WIDGET_InventoryDetails_C_UpdateUpgradeIcon::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon, K2Node_DynamicCast_AsITEM_Weapon_Base) == 0x000008, "Member 'WIDGET_InventoryDetails_C_UpdateUpgradeIcon::K2Node_DynamicCast_AsITEM_Weapon_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WIDGET_InventoryDetails_C_UpdateUpgradeIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_UpdateUpgradeIcon, CallFunc_HasInstalledAnyModKits_Result) == 0x000011, "Member 'WIDGET_InventoryDetails_C_UpdateUpgradeIcon::CallFunc_HasInstalledAnyModKits_Result' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.SetAmmoDetails
// 0x0078 (0x0078 - 0x0000)
struct WIDGET_InventoryDetails_C_SetAmmoDetails final
{
public:
	bool                                          ShowAmmo;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentMagazineCount;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InventoryCount;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(WIDGET_InventoryDetails_C_SetAmmoDetails) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_SetAmmoDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_SetAmmoDetails) == 0x000078, "Wrong size on WIDGET_InventoryDetails_C_SetAmmoDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, ShowAmmo) == 0x000000, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::ShowAmmo' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CurrentMagazineCount) == 0x000004, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CurrentMagazineCount' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, InventoryCount) == 0x000008, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::InventoryCount' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetAmmoDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WIDGET_InventoryDetails_C_SetAmmoDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.SetShowMoreDetails
// 0x0100 (0x0100 - 0x0000)
struct WIDGET_InventoryDetails_C_SetShowMoreDetails final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Instant;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowItemDetails;                                   // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                TargetState;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeInAnimation;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeRemaining;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                Temp_byte_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldItemShowExtendedDescription_Result; // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_DoorState                                K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_4;       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryDetails_C_SetShowMoreDetails) == 0x000008, "Wrong alignment on WIDGET_InventoryDetails_C_SetShowMoreDetails");
static_assert(sizeof(WIDGET_InventoryDetails_C_SetShowMoreDetails) == 0x000100, "Wrong size on WIDGET_InventoryDetails_C_SetShowMoreDetails");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Show) == 0x000000, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Show' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Instant) == 0x000001, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Instant' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, ShowItemDetails) == 0x000002, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::ShowItemDetails' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, TargetState) == 0x000003, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::TargetState' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, TimeInAnimation) == 0x000004, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::TimeInAnimation' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, TimeRemaining) == 0x000008, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::TimeRemaining' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Temp_byte_Variable) == 0x00000E, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00000F, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000010, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000011, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000012, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Temp_byte_Variable_1) == 0x000021, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_ShouldItemShowExtendedDescription_Result) == 0x000022, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_ShouldItemShowExtendedDescription_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Temp_bool_Variable) == 0x000024, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000025, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_Select_Default) == 0x000027, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, Temp_bool_Variable_1) == 0x000028, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_Select_Default_1) == 0x000030, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000038, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000040, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000044, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x000048, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00004C, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_IsVisible_ReturnValue) == 0x000054, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000068, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000098, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0000A0, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x0000B8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x0000C0, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0000C8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x0000D0, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationTimeRange_ReturnValue_1) == 0x0000E0, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationTimeRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GetGameTimeInSeconds_ReturnValue_4) == 0x0000E8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GetGameTimeInSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0000EC, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000F0, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_SetShowMoreDetails, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x0000F8, "Member 'WIDGET_InventoryDetails_C_SetShowMoreDetails::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.EVENT_OnFinishedDescriptionAnimation
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation final
{
public:
	bool                                          CallFunc_ShouldItemShowExtendedDescription_Result; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation) == 0x000001, "Wrong alignment on WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation");
static_assert(sizeof(WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation) == 0x000002, "Wrong size on WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation, CallFunc_ShouldItemShowExtendedDescription_Result) == 0x000000, "Member 'WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation::CallFunc_ShouldItemShowExtendedDescription_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WIDGET_InventoryDetails_C_EVENT_OnFinishedDescriptionAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryDetails.WIDGET_InventoryDetails_C.ShouldItemShowExtendedDescription
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_InventoryDetails_C_ShouldItemShowExtendedDescription final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ItemSubDetailsWidget;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IINTERF_InventoryItemDetails_C> K2Node_DynamicCast_AsINTERF_Inventory_Item_Details; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowExtendedDetails_Show;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetInventoryItemDetailsClass_InventoryItemDetailsWidget; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetSubDetailsWidgetByClass_Widget;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
