#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MouseOverDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MouseOverDetails.WIDGET_MouseOverDetails_C.ExecuteUbergraph_WIDGET_MouseOverDetails
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails) == 0x000008, "Wrong alignment on WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails");
static_assert(sizeof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails) == 0x000028, "Wrong size on WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails");
static_assert(offsetof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails, EntryPoint) == 0x000000, "Member 'WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails, CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial) == 0x000008, "Member 'WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails::CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails, CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails::CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WIDGET_MouseOverDetails_C_ExecuteUbergraph_WIDGET_MouseOverDetails::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_MouseOverDetails.WIDGET_MouseOverDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MouseOverDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MouseOverDetails_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_MouseOverDetails_C_PreConstruct");
static_assert(sizeof(WIDGET_MouseOverDetails_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_MouseOverDetails_C_PreConstruct");
static_assert(offsetof(WIDGET_MouseOverDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_MouseOverDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_MouseOverDetails.WIDGET_MouseOverDetails_C.SetMouseOverText
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_MouseOverDetails_C_SetMouseOverText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDimensionsForNewText_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MouseOverDetails_C_SetMouseOverText) == 0x000008, "Wrong alignment on WIDGET_MouseOverDetails_C_SetMouseOverText");
static_assert(sizeof(WIDGET_MouseOverDetails_C_SetMouseOverText) == 0x000050, "Wrong size on WIDGET_MouseOverDetails_C_SetMouseOverText");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, Text) == 0x000000, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::Text' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000020, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_GetDimensionsForNewText_ReturnValue) == 0x000028, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_GetDimensionsForNewText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_MakeVector2D_ReturnValue) == 0x00003C, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MouseOverDetails_C_SetMouseOverText, CallFunc_MakeVector2D_ReturnValue_1) == 0x000048, "Member 'WIDGET_MouseOverDetails_C_SetMouseOverText::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

