#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_AlertConfirmation

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_AlertConfirmation.WIDGET_AlertConfirmation_C.ExecuteUbergraph_WIDGET_AlertConfirmation
// 0x0158 (0x0158 - 0x0000)
struct WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_ComponentBoundEvent_Geometry_1;             // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_1;           // 0x0040(0x0070)()
	struct FGeometry                              K2Node_ComponentBoundEvent_Geometry;               // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x00E8(0x0070)()
};
static_assert(alignof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation) == 0x000008, "Wrong alignment on WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation");
static_assert(sizeof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation) == 0x000158, "Wrong size on WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, EntryPoint) == 0x000000, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, K2Node_ComponentBoundEvent_Geometry_1) == 0x000008, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::K2Node_ComponentBoundEvent_Geometry_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, K2Node_ComponentBoundEvent_InputEvent_1) == 0x000040, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::K2Node_ComponentBoundEvent_InputEvent_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, K2Node_ComponentBoundEvent_Geometry) == 0x0000B0, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::K2Node_ComponentBoundEvent_Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation, K2Node_ComponentBoundEvent_InputEvent) == 0x0000E8, "Member 'WIDGET_AlertConfirmation_C_ExecuteUbergraph_WIDGET_AlertConfirmation::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");

// Function WIDGET_AlertConfirmation.WIDGET_AlertConfirmation_C.BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InputEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x0000A8, "Wrong size on WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Geometry) == 0x000000, "Member 'WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, InputEvent) == 0x000038, "Member 'WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_AlertConfirmation.WIDGET_AlertConfirmation_C.BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InputEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x0000A8, "Wrong size on WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Geometry) == 0x000000, "Member 'WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, InputEvent) == 0x000038, "Member 'WIDGET_AlertConfirmation_C_BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_AlertConfirmation.WIDGET_AlertConfirmation_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_AlertConfirmation_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_AlertConfirmation_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_AlertConfirmation_C_PreConstruct");
static_assert(sizeof(WIDGET_AlertConfirmation_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_AlertConfirmation_C_PreConstruct");
static_assert(offsetof(WIDGET_AlertConfirmation_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_AlertConfirmation_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

