#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MediaReaderPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MediaReaderPanel.WIDGET_MediaReaderPanel_C
// 0x00A8 (0x0308 - 0x0260)
class UWIDGET_MediaReaderPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_AudioLog;                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_Email;                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_Note;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaInfoBg;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaPlayIcon;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Portrait;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Date;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LevelLabel;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_MessagePreview;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Sender;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Subject;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             VSCROLL_MediaPreview;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_BackButton;                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_PlayAudioButton;               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaPanel_C*                   MediaPanel;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              MAT_PlayIcon;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              MAT_StopIcon;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MediaReaderPanel(int32 EntryPoint);
	void BndEvt__WIDGET_MediaReaderPanel_WIDGET_ButtonLegend_Button_2_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MediaReaderPanel_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void Construct();
	void InitializeReaderPanel(class UWIDGET_PlayerHUD_C* PlayerHUD_0, class UWIDGET_MediaPanel_C* MediaPanel_0);
	void SetMediaReaderData(class UITEM_MediaBase_C* MediaItem_0);
	void SetMediaTypeIcon();
	void SetMediaPortrait(TSoftObjectPtr<class UTexture2D> PortraitTexture, int32 PortraitRowCount, int32 PortraitColumnCount, int32 PortraitFrameRate);
	void ToggleInteractivity(bool IsInteractive);
	void GetFormattedNoteText(const class FText& InputText, class FText* ResultText);
	void GetFormattedLogText(const class FText& InputText, class FText* ResultText);
	void UpdateMediaReaderPortrait();
	void PlayPreviewedMedia();
	void UpdateMediaPlayIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MediaReaderPanel_C">();
	}
	static class UWIDGET_MediaReaderPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MediaReaderPanel_C>();
	}
};
static_assert(alignof(UWIDGET_MediaReaderPanel_C) == 0x000008, "Wrong alignment on UWIDGET_MediaReaderPanel_C");
static_assert(sizeof(UWIDGET_MediaReaderPanel_C) == 0x000308, "Wrong size on UWIDGET_MediaReaderPanel_C");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MediaReaderPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_MediaCategoryIcon_AudioLog) == 0x000268, "Member 'UWIDGET_MediaReaderPanel_C::MESH_MediaCategoryIcon_AudioLog' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_MediaCategoryIcon_Email) == 0x000270, "Member 'UWIDGET_MediaReaderPanel_C::MESH_MediaCategoryIcon_Email' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_MediaCategoryIcon_Note) == 0x000278, "Member 'UWIDGET_MediaReaderPanel_C::MESH_MediaCategoryIcon_Note' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_MediaInfoBg) == 0x000280, "Member 'UWIDGET_MediaReaderPanel_C::MESH_MediaInfoBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_MediaPlayIcon) == 0x000288, "Member 'UWIDGET_MediaReaderPanel_C::MESH_MediaPlayIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MESH_Portrait) == 0x000290, "Member 'UWIDGET_MediaReaderPanel_C::MESH_Portrait' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, TEXT_Date) == 0x000298, "Member 'UWIDGET_MediaReaderPanel_C::TEXT_Date' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, TEXT_LevelLabel) == 0x0002A0, "Member 'UWIDGET_MediaReaderPanel_C::TEXT_LevelLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, TEXT_MessagePreview) == 0x0002A8, "Member 'UWIDGET_MediaReaderPanel_C::TEXT_MessagePreview' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, TEXT_Sender) == 0x0002B0, "Member 'UWIDGET_MediaReaderPanel_C::TEXT_Sender' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, TEXT_Subject) == 0x0002B8, "Member 'UWIDGET_MediaReaderPanel_C::TEXT_Subject' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, VSCROLL_MediaPreview) == 0x0002C0, "Member 'UWIDGET_MediaReaderPanel_C::VSCROLL_MediaPreview' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, WIDGET_ButtonLegend_BackButton) == 0x0002C8, "Member 'UWIDGET_MediaReaderPanel_C::WIDGET_ButtonLegend_BackButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, WIDGET_ButtonLegend_PlayAudioButton) == 0x0002D0, "Member 'UWIDGET_MediaReaderPanel_C::WIDGET_ButtonLegend_PlayAudioButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MaterialInstance) == 0x0002D8, "Member 'UWIDGET_MediaReaderPanel_C::MaterialInstance' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, PlayerHUD) == 0x0002E0, "Member 'UWIDGET_MediaReaderPanel_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MediaPanel) == 0x0002E8, "Member 'UWIDGET_MediaReaderPanel_C::MediaPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MediaItem) == 0x0002F0, "Member 'UWIDGET_MediaReaderPanel_C::MediaItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MAT_PlayIcon) == 0x0002F8, "Member 'UWIDGET_MediaReaderPanel_C::MAT_PlayIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaReaderPanel_C, MAT_StopIcon) == 0x000300, "Member 'UWIDGET_MediaReaderPanel_C::MAT_StopIcon' has a wrong offset!");

}

