#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_PlayerHUD

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_MFDTabCategory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_CursorMode_structs.hpp"
#include "ENUM_CardinalDirection_structs.hpp"
#include "ENUM_HotbarStyle_structs.hpp"
#include "Engine_structs.hpp"
#include "AttributeSystem_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "STRUCT_QueuedNotification_structs.hpp"
#include "ENUM_UpgradeResult_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.HoverItemChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature final
{
public:
	class UITEM_Base_C*                           NewItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature");
static_assert(sizeof(WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature) == 0x000008, "Wrong size on WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature");
static_assert(offsetof(WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature, NewItem) == 0x000000, "Member 'WIDGET_PlayerHUD_C_HoverItemChanged__DelegateSignature::NewItem' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.ExecuteUbergraph_WIDGET_PlayerHUD
// 0x01B0 (0x01B0 - 0x0000)
struct WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Interactable, class UPrimitiveComponent* Primitive, class FText Description)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextTyper_C*                           CallFunc_SpawnObject_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ENUM_InteractResultType FeedbackType, class FText FeedbackMessage)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class UElectrocardiogram*                     CallFunc_SpawnObject_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x00A8(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextTyper_C*                           CallFunc_SpawnObject_ReturnValue_2;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewSecurityLevel)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_HardwareButton_C*>       K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_HardwareButton_C*               CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_1;               // 0x0110(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_HUD_C>         CallFunc_InitializeSettingsForPlayerHUD_PlayerHUD_CastInput; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IINTERF_HUD_C>         CallFunc_InitilalizeSubtitleWidget_Player_HUD_CastInput; // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsUsingGamepad)>          K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD");
static_assert(sizeof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD) == 0x0001B0, "Wrong size on WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, EntryPoint) == 0x000000, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_Event_MyGeometry) == 0x000020, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000060, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000068, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_SpawnObject_ReturnValue) == 0x000088, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_SpawnObject_ReturnValue_1) == 0x0000A0, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetEmptyText_ReturnValue) == 0x0000A8, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetGameInstance_ReturnValue) == 0x0000C0, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_SpawnObject_ReturnValue_2) == 0x0000C8, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_AsGI_Single_Player) == 0x0000D0, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000DC, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_Array_Get_Item) == 0x000100, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetEmptyText_ReturnValue_1) == 0x000110, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetEmptyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_4) == 0x000128, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_5) == 0x000138, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000148, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_InitializeSettingsForPlayerHUD_PlayerHUD_CastInput) == 0x000150, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_InitializeSettingsForPlayerHUD_PlayerHUD_CastInput' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_InitilalizeSubtitleWidget_Player_HUD_CastInput) == 0x000160, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_InitilalizeSubtitleWidget_Player_HUD_CastInput' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_AsCON_Hacker) == 0x000188, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, CallFunc_GetGameInstance_ReturnValue_1) == 0x000198, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_AsGI_Single_Player_1) == 0x0001A0, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_AsGI_Single_Player_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD, K2Node_DynamicCast_bSuccess_3) == 0x0001A8, "Member 'WIDGET_PlayerHUD_C_ExecuteUbergraph_WIDGET_PlayerHUD::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_PlayerHUD_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_Tick) == 0x000004, "Wrong alignment on WIDGET_PlayerHUD_C_Tick");
static_assert(sizeof(WIDGET_PlayerHUD_C_Tick) == 0x00003C, "Wrong size on WIDGET_PlayerHUD_C_Tick");
static_assert(offsetof(WIDGET_PlayerHUD_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_PlayerHUD_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_PlayerHUD_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.EVENT_OnScanDataChanged
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged final
{
public:
	class UObject*                                Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Primitive;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0030(0x0018)()
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResetMessage_Result;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged");
static_assert(sizeof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged) == 0x000050, "Wrong size on WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, Interactable) == 0x000000, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::Interactable' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, Primitive) == 0x000008, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::Primitive' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, Description) == 0x000010, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::Description' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, CallFunc_GetEmptyText_ReturnValue) == 0x000030, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000048, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, CallFunc_NotEqual_TextText_ReturnValue) == 0x00004C, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged, CallFunc_ResetMessage_Result) == 0x00004D, "Member 'WIDGET_PlayerHUD_C_EVENT_OnScanDataChanged::CallFunc_ResetMessage_Result' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.CanDisplayDescription
// 0x0006 (0x0006 - 0x0000)
struct WIDGET_PlayerHUD_C_CanDisplayDescription final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_PlayerHUD_C_CanDisplayDescription) == 0x000001, "Wrong alignment on WIDGET_PlayerHUD_C_CanDisplayDescription");
static_assert(sizeof(WIDGET_PlayerHUD_C_CanDisplayDescription) == 0x000006, "Wrong size on WIDGET_PlayerHUD_C_CanDisplayDescription");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, Result) == 0x000000, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, CallFunc_IsFalling_ReturnValue) == 0x000003, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_CanDisplayDescription, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'WIDGET_PlayerHUD_C_CanDisplayDescription::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.EVENT_OnHealthChanged
// 0x001C (0x001C - 0x0000)
struct WIDGET_PlayerHUD_C_EVENT_OnHealthChanged final
{
public:
	float                                         Curr_Value;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Prev_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Value;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModApplyType                                 Apply_Type;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged) == 0x000004, "Wrong alignment on WIDGET_PlayerHUD_C_EVENT_OnHealthChanged");
static_assert(sizeof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged) == 0x00001C, "Wrong size on WIDGET_PlayerHUD_C_EVENT_OnHealthChanged");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, Curr_Value) == 0x000000, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::Curr_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, Prev_Value) == 0x000004, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::Prev_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, Max_Value) == 0x000008, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::Max_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, Apply_Type) == 0x00000C, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::Apply_Type' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnHealthChanged, CallFunc_FTrunc_ReturnValue_1) == 0x000018, "Member 'WIDGET_PlayerHUD_C_EVENT_OnHealthChanged::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.EVENT_OnEnergyChanged
// 0x001C (0x001C - 0x0000)
struct WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged final
{
public:
	float                                         Curr_Value;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Prev_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Value;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModApplyType                                 Apply_Type;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged) == 0x000004, "Wrong alignment on WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged");
static_assert(sizeof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged) == 0x00001C, "Wrong size on WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, Curr_Value) == 0x000000, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::Curr_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, Prev_Value) == 0x000004, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::Prev_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, Max_Value) == 0x000008, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::Max_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, Apply_Type) == 0x00000C, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::Apply_Type' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged, CallFunc_FTrunc_ReturnValue_1) == 0x000018, "Member 'WIDGET_PlayerHUD_C_EVENT_OnEnergyChanged::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.EVENT_OnStaminaChanged
// 0x001C (0x001C - 0x0000)
struct WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged final
{
public:
	float                                         Curr_Value;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Prev_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_Value;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModApplyType                                 Apply_Type;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged) == 0x000004, "Wrong alignment on WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged");
static_assert(sizeof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged) == 0x00001C, "Wrong size on WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, Curr_Value) == 0x000000, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::Curr_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, Prev_Value) == 0x000004, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::Prev_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, Max_Value) == 0x000008, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::Max_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, Apply_Type) == 0x00000C, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::Apply_Type' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000016, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'WIDGET_PlayerHUD_C_EVENT_OnStaminaChanged::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.EVENT_OnFeedbackDataChanged
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged final
{
public:
	ENUM_InteractResultType                       Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              CallFunc_GetDimensionsForNewText_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0028(0x0018)()
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTextMessage_Result;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged");
static_assert(sizeof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged) == 0x000050, "Wrong size on WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, Type) == 0x000000, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::Type' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, Message) == 0x000008, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::Message' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_GetDimensionsForNewText_ReturnValue) == 0x000020, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_GetDimensionsForNewText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_GetEmptyText_ReturnValue) == 0x000028, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_BreakVector2D_X) == 0x000040, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000048, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_NotEqual_TextText_ReturnValue) == 0x00004C, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_TextIsEmpty_ReturnValue) == 0x00004D, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_Not_PreBool_ReturnValue) == 0x00004E, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged, CallFunc_SetTextMessage_Result) == 0x00004F, "Member 'WIDGET_PlayerHUD_C_EVENT_OnFeedbackDataChanged::CallFunc_SetTextMessage_Result' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.UpdateScannerMessage
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_PlayerHUD_C_UpdateScannerMessage final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrentMessage_Message;                // 0x0008(0x0018)()
};
static_assert(alignof(WIDGET_PlayerHUD_C_UpdateScannerMessage) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_UpdateScannerMessage");
static_assert(sizeof(WIDGET_PlayerHUD_C_UpdateScannerMessage) == 0x000020, "Wrong size on WIDGET_PlayerHUD_C_UpdateScannerMessage");
static_assert(offsetof(WIDGET_PlayerHUD_C_UpdateScannerMessage, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'WIDGET_PlayerHUD_C_UpdateScannerMessage::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_UpdateScannerMessage, CallFunc_GetCurrentMessage_Message) == 0x000008, "Member 'WIDGET_PlayerHUD_C_UpdateScannerMessage::CallFunc_GetCurrentMessage_Message' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.GetAdjacentMultiFunctionDisplayTab
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab final
{
public:
	ENUM_MFDTabCategory                           Tab;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Previous;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_MFDTabCategory                           AdjacentTab;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_WrapIntLowerbound_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_WrapIntUpperbound_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab) == 0x000004, "Wrong alignment on WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab");
static_assert(sizeof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab) == 0x000028, "Wrong size on WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, Tab) == 0x000000, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::Tab' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, Previous) == 0x000001, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::Previous' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, AdjacentTab) == 0x000002, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::AdjacentTab' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, Temp_bool_Variable) == 0x000003, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, Temp_int_Variable) == 0x000008, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, Temp_int_Variable_1) == 0x00000C, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_MakeLiteralInt_ReturnValue) == 0x000010, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, K2Node_Select_Default) == 0x000014, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_WrapIntLowerbound_ReturnValue) == 0x00001C, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_WrapIntLowerbound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_WrapIntUpperbound_ReturnValue) == 0x000020, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_WrapIntUpperbound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab, CallFunc_GetValidValue_ReturnValue) == 0x000025, "Member 'WIDGET_PlayerHUD_C_GetAdjacentMultiFunctionDisplayTab::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.ShowMultiFunctionDisplayTab
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab final
{
public:
	ENUM_MFDTabCategory                           Tab;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBagUI_C*                      BagUI;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ToggleMultiFunctionDisplay_MainDisplayVisible; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab");
static_assert(sizeof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab) == 0x000018, "Wrong size on WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab");
static_assert(offsetof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab, Tab) == 0x000000, "Member 'WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab::Tab' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab, Visible) == 0x000001, "Member 'WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab::Visible' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab, BagUI) == 0x000008, "Member 'WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab::BagUI' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab, CallFunc_ToggleMultiFunctionDisplay_MainDisplayVisible) == 0x000011, "Member 'WIDGET_PlayerHUD_C_ShowMultiFunctionDisplayTab::CallFunc_ToggleMultiFunctionDisplay_MainDisplayVisible' has a wrong offset!");

// Function WIDGET_PlayerHUD.WIDGET_PlayerHUD_C.UpdateInputMode
// 0x00E8 (0x00E8 - 0x0000)
struct WIDGET_PlayerHUD_C_UpdateInputMode final
{
public:
	bool                                          IsMenu_Active;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableCursorTransition;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_WeaponBase_C*                     EquippedWeapon;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deactivate_Result;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_WeaponBase_C*                     CallFunc_GetEquippedWeapon_Weapon;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MainMenu_InGame_C*              CallFunc_GetMainMenuWidget_Result;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x006C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PlayerHUD_C_UpdateInputMode) == 0x000008, "Wrong alignment on WIDGET_PlayerHUD_C_UpdateInputMode");
static_assert(sizeof(WIDGET_PlayerHUD_C_UpdateInputMode) == 0x0000E8, "Wrong size on WIDGET_PlayerHUD_C_UpdateInputMode");
static_assert(offsetof(WIDGET_PlayerHUD_C_UpdateInputMode, IsMenu_Active) == 0x000000, "Member 'WIDGET_PlayerHUD_C_UpdateInputMode::IsMenu_Active' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_UpdateInputMode, EnableCursorTransition) == 0x000001, "Member 'WIDGET_PlayerHUD_C_UpdateInputMode::EnableCursorTransition' has a wrong offset!");
static_assert(offsetof(WIDGET_PlayerHUD_C_UpdateInputMode, EquippedWeapon) == 0x000008, "Member 'WIDGET_PlayerHUD_C_UpdateInputMode::EquippedWeapon' has a wrong offset!");
