#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_GamePigSplash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_GamePigSplash.WIDGET_GamePigSplash_C
// 0x0058 (0x02B8 - 0x0260)
class UWIDGET_GamePigSplash_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           GamePigPanel;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_GAMEPIG_LOGO;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_PIG;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_TRIOP;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_VMU;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_NotOnCompanyTime;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Trademark;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          StopUpdatingSplashScreen;                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTimeSeconds;                                // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToBeginFade;                                   // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeDuration;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AACTOR_GamePigSplashScreenManager_C*    SplashActor;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_GamePigSplash(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateSplashScreen();
	void ResetSplashScreen(class AACTOR_GamePigSplashScreenManager_C* GamePigSplashActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_GamePigSplash_C">();
	}
	static class UWIDGET_GamePigSplash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_GamePigSplash_C>();
	}
};
static_assert(alignof(UWIDGET_GamePigSplash_C) == 0x000008, "Wrong alignment on UWIDGET_GamePigSplash_C");
static_assert(sizeof(UWIDGET_GamePigSplash_C) == 0x0002B8, "Wrong size on UWIDGET_GamePigSplash_C");
static_assert(offsetof(UWIDGET_GamePigSplash_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_GamePigSplash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, GamePigPanel) == 0x000268, "Member 'UWIDGET_GamePigSplash_C::GamePigPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, IMAGE_GAMEPIG_LOGO) == 0x000270, "Member 'UWIDGET_GamePigSplash_C::IMAGE_GAMEPIG_LOGO' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, IMAGE_PIG) == 0x000278, "Member 'UWIDGET_GamePigSplash_C::IMAGE_PIG' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, IMAGE_TRIOP) == 0x000280, "Member 'UWIDGET_GamePigSplash_C::IMAGE_TRIOP' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, IMAGE_VMU) == 0x000288, "Member 'UWIDGET_GamePigSplash_C::IMAGE_VMU' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, TEXT_NotOnCompanyTime) == 0x000290, "Member 'UWIDGET_GamePigSplash_C::TEXT_NotOnCompanyTime' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, TEXT_Trademark) == 0x000298, "Member 'UWIDGET_GamePigSplash_C::TEXT_Trademark' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, StopUpdatingSplashScreen) == 0x0002A0, "Member 'UWIDGET_GamePigSplash_C::StopUpdatingSplashScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, ElapsedTimeSeconds) == 0x0002A4, "Member 'UWIDGET_GamePigSplash_C::ElapsedTimeSeconds' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, TimeToBeginFade) == 0x0002A8, "Member 'UWIDGET_GamePigSplash_C::TimeToBeginFade' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, FadeDuration) == 0x0002AC, "Member 'UWIDGET_GamePigSplash_C::FadeDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_GamePigSplash_C, SplashActor) == 0x0002B0, "Member 'UWIDGET_GamePigSplash_C::SplashActor' has a wrong offset!");

}

