#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_LoadingScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_LoadingScreen.WIDGET_LoadingScreen_C.ExecuteUbergraph_WIDGET_LoadingScreen
// 0x0044 (0x0044 - 0x0000)
struct WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen) == 0x000004, "Wrong alignment on WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen");
static_assert(sizeof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen) == 0x000044, "Wrong size on WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen");
static_assert(offsetof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen, EntryPoint) == 0x000000, "Member 'WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen, K2Node_Event_MyGeometry) == 0x000008, "Member 'WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WIDGET_LoadingScreen_C_ExecuteUbergraph_WIDGET_LoadingScreen::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WIDGET_LoadingScreen.WIDGET_LoadingScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_LoadingScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_LoadingScreen_C_Tick) == 0x000004, "Wrong alignment on WIDGET_LoadingScreen_C_Tick");
static_assert(sizeof(WIDGET_LoadingScreen_C_Tick) == 0x00003C, "Wrong size on WIDGET_LoadingScreen_C_Tick");
static_assert(offsetof(WIDGET_LoadingScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_LoadingScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_LoadingScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_LoadingScreen.WIDGET_LoadingScreen_C.UpdateFadeEffect
// 0x0014 (0x0014 - 0x0000)
struct WIDGET_LoadingScreen_C_UpdateFadeEffect final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_LoadingScreen_C_UpdateFadeEffect) == 0x000004, "Wrong alignment on WIDGET_LoadingScreen_C_UpdateFadeEffect");
static_assert(sizeof(WIDGET_LoadingScreen_C_UpdateFadeEffect) == 0x000014, "Wrong size on WIDGET_LoadingScreen_C_UpdateFadeEffect");
static_assert(offsetof(WIDGET_LoadingScreen_C_UpdateFadeEffect, DeltaTime) == 0x000000, "Member 'WIDGET_LoadingScreen_C_UpdateFadeEffect::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_UpdateFadeEffect, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WIDGET_LoadingScreen_C_UpdateFadeEffect::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_UpdateFadeEffect, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'WIDGET_LoadingScreen_C_UpdateFadeEffect::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_UpdateFadeEffect, CallFunc_FMin_ReturnValue) == 0x00000C, "Member 'WIDGET_LoadingScreen_C_UpdateFadeEffect::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_LoadingScreen_C_UpdateFadeEffect, CallFunc_Ease_ReturnValue) == 0x000010, "Member 'WIDGET_LoadingScreen_C_UpdateFadeEffect::CallFunc_Ease_ReturnValue' has a wrong offset!");

}

