#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenuButton

#include "Basic.hpp"

#include "ENUM_MeshColor_structs.hpp"
#include "Engine_structs.hpp"
#include "WIDGET_MenuListItemBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MainMenuButton.WIDGET_MainMenuButton_C
// 0x0070 (0x0380 - 0x0310)
class UWIDGET_MainMenuButton_C final : public UWIDGET_MenuListItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_OnMouseOver;                                  // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Indicator;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Input;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Backdrop;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Caption;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMainMenuButtonClicked;                           // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Caption;                                           // 0x0350(0x0018)(Edit, BlueprintVisible)
	bool                                          IsSelectedOLD;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexInListOLD;                                    // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                MainMenu;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                MeshColor;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void ExecuteUbergraph_WIDGET_MainMenuButton(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& InputEvent);
	void ResetButtonState();
	void SetSelected(bool Selected);
	void SetMainMenu(class UWidget* MainMenu_0);
	void ButtonClicked(const struct FPointerEvent& InputEvent);
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void ReceiveNavAccept(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MainMenuButton_C">();
	}
	static class UWIDGET_MainMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MainMenuButton_C>();
	}
};
static_assert(alignof(UWIDGET_MainMenuButton_C) == 0x000008, "Wrong alignment on UWIDGET_MainMenuButton_C");
static_assert(sizeof(UWIDGET_MainMenuButton_C) == 0x000380, "Wrong size on UWIDGET_MainMenuButton_C");
static_assert(offsetof(UWIDGET_MainMenuButton_C, UberGraphFrame) == 0x000310, "Member 'UWIDGET_MainMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, ANIM_OnMouseOver) == 0x000318, "Member 'UWIDGET_MainMenuButton_C::ANIM_OnMouseOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, MESH_Indicator) == 0x000320, "Member 'UWIDGET_MainMenuButton_C::MESH_Indicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, MESH_Input) == 0x000328, "Member 'UWIDGET_MainMenuButton_C::MESH_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, TEXT_Backdrop) == 0x000330, "Member 'UWIDGET_MainMenuButton_C::TEXT_Backdrop' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, TEXT_Caption) == 0x000338, "Member 'UWIDGET_MainMenuButton_C::TEXT_Caption' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, OnMainMenuButtonClicked) == 0x000340, "Member 'UWIDGET_MainMenuButton_C::OnMainMenuButtonClicked' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, Caption) == 0x000350, "Member 'UWIDGET_MainMenuButton_C::Caption' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, IsSelectedOLD) == 0x000368, "Member 'UWIDGET_MainMenuButton_C::IsSelectedOLD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, IndexInListOLD) == 0x00036C, "Member 'UWIDGET_MainMenuButton_C::IndexInListOLD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, MainMenu) == 0x000370, "Member 'UWIDGET_MainMenuButton_C::MainMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenuButton_C, MeshColor) == 0x000378, "Member 'UWIDGET_MainMenuButton_C::MeshColor' has a wrong offset!");

}

