#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_GameOverScreenList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C
// 0x0028 (0x02F0 - 0x02C8)
class UWIDGET_MainMenu_GameOverScreenList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VBOX_MenuItemList;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_Button_Continue;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_Button_LoadSave;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_Button_QuitToTitle;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList(int32 EntryPoint);
	void BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MainMenu_GameOverScreenList_C">();
	}
	static class UWIDGET_MainMenu_GameOverScreenList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MainMenu_GameOverScreenList_C>();
	}
};
static_assert(alignof(UWIDGET_MainMenu_GameOverScreenList_C) == 0x000008, "Wrong alignment on UWIDGET_MainMenu_GameOverScreenList_C");
static_assert(sizeof(UWIDGET_MainMenu_GameOverScreenList_C) == 0x0002F0, "Wrong size on UWIDGET_MainMenu_GameOverScreenList_C");
static_assert(offsetof(UWIDGET_MainMenu_GameOverScreenList_C, UberGraphFrame) == 0x0002C8, "Member 'UWIDGET_MainMenu_GameOverScreenList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_GameOverScreenList_C, VBOX_MenuItemList) == 0x0002D0, "Member 'UWIDGET_MainMenu_GameOverScreenList_C::VBOX_MenuItemList' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_GameOverScreenList_C, WIDGET_Button_Continue) == 0x0002D8, "Member 'UWIDGET_MainMenu_GameOverScreenList_C::WIDGET_Button_Continue' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_GameOverScreenList_C, WIDGET_Button_LoadSave) == 0x0002E0, "Member 'UWIDGET_MainMenu_GameOverScreenList_C::WIDGET_Button_LoadSave' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_GameOverScreenList_C, WIDGET_Button_QuitToTitle) == 0x0002E8, "Member 'UWIDGET_MainMenu_GameOverScreenList_C::WIDGET_Button_QuitToTitle' has a wrong offset!");

}

