#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_KeyElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Automap_KeyElement.WIDGET_Automap_KeyElement_C
// 0x0050 (0x02B0 - 0x0260)
class UWIDGET_Automap_KeyElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FilterMouseLeave;                                  // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FilterMouseEnter;                                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FilterToggled;                                     // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Icon;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_KeyName;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           KeyItem;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsMouseOver;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WIDGET_Automap_KeyElement(int32 EntryPoint);
	void Construct();
	void SetTexture(TSoftObjectPtr<class UTexture2D> SoftTexture);
	void GetDynamicIconMaterial(class UMaterialInstanceDynamic** DynamicMaterial_0);
	void GetShortAccessName(class FText* Text);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void UpdateMouseOverVisuals();
	void GetToolTipText(class FText* ToolTip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Automap_KeyElement_C">();
	}
	static class UWIDGET_Automap_KeyElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Automap_KeyElement_C>();
	}
};
static_assert(alignof(UWIDGET_Automap_KeyElement_C) == 0x000008, "Wrong alignment on UWIDGET_Automap_KeyElement_C");
static_assert(sizeof(UWIDGET_Automap_KeyElement_C) == 0x0002B0, "Wrong size on UWIDGET_Automap_KeyElement_C");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_Automap_KeyElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, FilterMouseLeave) == 0x000268, "Member 'UWIDGET_Automap_KeyElement_C::FilterMouseLeave' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, FilterMouseEnter) == 0x000270, "Member 'UWIDGET_Automap_KeyElement_C::FilterMouseEnter' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, FilterToggled) == 0x000278, "Member 'UWIDGET_Automap_KeyElement_C::FilterToggled' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, MESH_Background) == 0x000280, "Member 'UWIDGET_Automap_KeyElement_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, MESH_Icon) == 0x000288, "Member 'UWIDGET_Automap_KeyElement_C::MESH_Icon' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, TEXT_KeyName) == 0x000290, "Member 'UWIDGET_Automap_KeyElement_C::TEXT_KeyName' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, DynamicMaterial) == 0x000298, "Member 'UWIDGET_Automap_KeyElement_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, KeyItem) == 0x0002A0, "Member 'UWIDGET_Automap_KeyElement_C::KeyItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_KeyElement_C, IsMouseOver) == 0x0002A8, "Member 'UWIDGET_Automap_KeyElement_C::IsMouseOver' has a wrong offset!");

}

