#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MenuListItemBase

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C
// 0x00B0 (0x0310 - 0x0260)
class UWIDGET_MenuListItemBase_C : public UUserWidget
{
public:
	class FText                                   ItemName;                                          // 0x0260(0x0018)(Edit, BlueprintVisible)
	class FText                                   ItemDescription;                                   // 0x0278(0x0018)(Edit, BlueprintVisible)
	int32                                         IndexInList;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHighlighted;                                     // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListBase_C*                 ParentListWidget;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundCueHighlighted;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundCueActivated;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, bool>                     SupportedPlatforms;                                // 0x02B0(0x0050)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnHighlightedEvent;                                // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnHighlightedEvent__DelegateSignature();
	void InitializeMenuListItem(class UWIDGET_MenuListBase_C* ParentList, int32 Index_0);
	void OnMouseEntered();
	void OnMouseExited();
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void OnItemAccepted();
	void SetVisibilityBasedOnPlatform();
	void GetIsHighlighted(bool* Result);
	void ReceiveNavUp(bool InputState, bool* Result);
	void ReceiveNavDown(bool InputState, bool* Result);
	void ReceiveNavLeft(bool InputState, bool* Result);
	void ReceiveNavRight(bool InputState, bool* Result);
	void ReceiveNavAccept(bool InputState, bool* Result);
	void ReceiveNavBack(bool InputState, bool* Result);
	void ReceiveNavAlt1(bool InputState, bool* Result);
	void ReceiveNavAlt2(bool InputState, bool* Result);
	void ReceiveNavTabLeft(bool InputState, bool* Result);
	void ReceiveNavTabRight(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MenuListItemBase_C">();
	}
	static class UWIDGET_MenuListItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MenuListItemBase_C>();
	}
};
static_assert(alignof(UWIDGET_MenuListItemBase_C) == 0x000008, "Wrong alignment on UWIDGET_MenuListItemBase_C");
static_assert(sizeof(UWIDGET_MenuListItemBase_C) == 0x000310, "Wrong size on UWIDGET_MenuListItemBase_C");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, ItemName) == 0x000260, "Member 'UWIDGET_MenuListItemBase_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, ItemDescription) == 0x000278, "Member 'UWIDGET_MenuListItemBase_C::ItemDescription' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, IndexInList) == 0x000290, "Member 'UWIDGET_MenuListItemBase_C::IndexInList' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, IsHighlighted) == 0x000294, "Member 'UWIDGET_MenuListItemBase_C::IsHighlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, ParentListWidget) == 0x000298, "Member 'UWIDGET_MenuListItemBase_C::ParentListWidget' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, SoundCueHighlighted) == 0x0002A0, "Member 'UWIDGET_MenuListItemBase_C::SoundCueHighlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, SoundCueActivated) == 0x0002A8, "Member 'UWIDGET_MenuListItemBase_C::SoundCueActivated' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, SupportedPlatforms) == 0x0002B0, "Member 'UWIDGET_MenuListItemBase_C::SupportedPlatforms' has a wrong offset!");
static_assert(offsetof(UWIDGET_MenuListItemBase_C, OnHighlightedEvent) == 0x000300, "Member 'UWIDGET_MenuListItemBase_C::OnHighlightedEvent' has a wrong offset!");

}

