#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_InterfaceList

#include "Basic.hpp"

#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsMenu_InterfaceList.WIDGET_OptionsMenu_InterfaceList_C
// 0x0090 (0x0358 - 0x02C8)
class UWIDGET_OptionsMenu_InterfaceList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Interface_ControllerVibration_C* OPTION_Interface_ControllerVibration;              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_Dismemberment_C*      OPTION_Interface_Dismemberment;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_Gore_C*               OPTION_Interface_Gore;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_Headbob_C*            OPTION_Interface_Headbob;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_HotbarStyle_C*        OPTION_Interface_HotbarStyle;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_HUDColorTheme_C*      OPTION_Interface_HUDColorTheme;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_HUDCurvature_C*       OPTION_Interface_HUDCurvature;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_HUDOpacity_C*         OPTION_Interface_HUDOpacity;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_HUDTextSize_C*        OPTION_Interface_HUDTextSize;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_Language_C*           OPTION_Interface_Language;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_SoundEffectCaptions_C* OPTION_Interface_SoundEffectCaptions;              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_SoundEffectCaptionSize_C* OPTION_Interface_SoundEffectCaptionSize;           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_Subtitles_C*          OPTION_Interface_Subtitles;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Interface_SubtitleSize_C*       OPTION_Interface_SubtitleSize;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_OptionsMenuList;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Subtitles;               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_UI;                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsMenu_InterfaceList_C">();
	}
	static class UWIDGET_OptionsMenu_InterfaceList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsMenu_InterfaceList_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsMenu_InterfaceList_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsMenu_InterfaceList_C");
static_assert(sizeof(UWIDGET_OptionsMenu_InterfaceList_C) == 0x000358, "Wrong size on UWIDGET_OptionsMenu_InterfaceList_C");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_ControllerVibration) == 0x0002C8, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_ControllerVibration' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_Dismemberment) == 0x0002D0, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_Dismemberment' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_Gore) == 0x0002D8, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_Gore' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_Headbob) == 0x0002E0, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_Headbob' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_HotbarStyle) == 0x0002E8, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_HotbarStyle' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_HUDColorTheme) == 0x0002F0, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_HUDColorTheme' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_HUDCurvature) == 0x0002F8, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_HUDCurvature' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_HUDOpacity) == 0x000300, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_HUDOpacity' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_HUDTextSize) == 0x000308, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_HUDTextSize' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_Language) == 0x000310, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_Language' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_SoundEffectCaptions) == 0x000318, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_SoundEffectCaptions' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_SoundEffectCaptionSize) == 0x000320, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_SoundEffectCaptionSize' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_Subtitles) == 0x000328, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_Subtitles' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, OPTION_Interface_SubtitleSize) == 0x000330, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::OPTION_Interface_SubtitleSize' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, SCROLLBOX_OptionsMenuList) == 0x000338, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::SCROLLBOX_OptionsMenuList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, WIDGET_ListCategoryHeader) == 0x000340, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::WIDGET_ListCategoryHeader' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, WIDGET_ListCategoryHeader_Subtitles) == 0x000348, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::WIDGET_ListCategoryHeader_Subtitles' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_InterfaceList_C, WIDGET_ListCategoryHeader_UI) == 0x000350, "Member 'UWIDGET_OptionsMenu_InterfaceList_C::WIDGET_ListCategoryHeader_UI' has a wrong offset!");

}

