#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_CrashScreen

#include "Basic.hpp"

#include "ENUM_CrashState_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.ExecuteUbergraph_WIDGET_CrashScreen
// 0x0088 (0x0088 - 0x0000)
struct WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0018(0x0010)(ReferenceParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue_1; // 0x0068(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue_2; // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen");
static_assert(sizeof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen) == 0x000088, "Wrong size on WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, EntryPoint) == 0x000000, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000018, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, K2Node_Event_MyGeometry) == 0x000028, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, CallFunc_GetCharacterArrayFromString_ReturnValue_1) == 0x000068, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::CallFunc_GetCharacterArrayFromString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen, CallFunc_GetCharacterArrayFromString_ReturnValue_2) == 0x000078, "Member 'WIDGET_CrashScreen_C_ExecuteUbergraph_WIDGET_CrashScreen::CallFunc_GetCharacterArrayFromString_ReturnValue_2' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_CrashScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_Tick) == 0x000004, "Wrong alignment on WIDGET_CrashScreen_C_Tick");
static_assert(sizeof(WIDGET_CrashScreen_C_Tick) == 0x00003C, "Wrong size on WIDGET_CrashScreen_C_Tick");
static_assert(offsetof(WIDGET_CrashScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_CrashScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_CrashScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.UpdateScreenFlash
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_CrashScreen_C_UpdateScreenFlash final
{
public:
	float                                         StateProgress;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlashAmount;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakePulsatingValue_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_UpdateScreenFlash) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_UpdateScreenFlash");
static_assert(sizeof(WIDGET_CrashScreen_C_UpdateScreenFlash) == 0x000018, "Wrong size on WIDGET_CrashScreen_C_UpdateScreenFlash");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateScreenFlash, StateProgress) == 0x000000, "Member 'WIDGET_CrashScreen_C_UpdateScreenFlash::StateProgress' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateScreenFlash, FlashAmount) == 0x000004, "Member 'WIDGET_CrashScreen_C_UpdateScreenFlash::FlashAmount' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateScreenFlash, CallFunc_MakePulsatingValue_ReturnValue) == 0x000008, "Member 'WIDGET_CrashScreen_C_UpdateScreenFlash::CallFunc_MakePulsatingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateScreenFlash, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WIDGET_CrashScreen_C_UpdateScreenFlash::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.StartCrashSequence
// 0x00B8 (0x00B8 - 0x0000)
struct WIDGET_CrashScreen_C_StartCrashSequence final
{
public:
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_CrashScreen_C_StartCrashSequence) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_StartCrashSequence");
static_assert(sizeof(WIDGET_CrashScreen_C_StartCrashSequence) == 0x0000B8, "Wrong size on WIDGET_CrashScreen_C_StartCrashSequence");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000000, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, K2Node_MakeArray_Array) == 0x000088, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_StartCrashSequence, CallFunc_SetGamePaused_ReturnValue) == 0x0000B0, "Member 'WIDGET_CrashScreen_C_StartCrashSequence::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.SetCurrentState
// 0x0140 (0x0140 - 0x0000)
struct WIDGET_CrashScreen_C_SetCurrentState final
{
public:
	ENUM_CrashState                               State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0098(0x0088)()
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_CrashScreen_C_SetCurrentState) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_SetCurrentState");
static_assert(sizeof(WIDGET_CrashScreen_C_SetCurrentState) == 0x000140, "Wrong size on WIDGET_CrashScreen_C_SetCurrentState");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, State) == 0x000000, "Member 'WIDGET_CrashScreen_C_SetCurrentState::State' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WIDGET_CrashScreen_C_SetCurrentState::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, K2Node_MakeStruct_SlateBrush_1) == 0x000098, "Member 'WIDGET_CrashScreen_C_SetCurrentState::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_SetGamePaused_ReturnValue) == 0x000120, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000128, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000130, "Member 'WIDGET_CrashScreen_C_SetCurrentState::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_SetCurrentState, K2Node_SwitchEnum_CmpSuccess) == 0x000138, "Member 'WIDGET_CrashScreen_C_SetCurrentState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.TickCrashSequence
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_CrashScreen_C_TickCrashSequence final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_CrashState                               NextState;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StateProgress;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClampedDeltaTime;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_TickCrashSequence) == 0x000004, "Wrong alignment on WIDGET_CrashScreen_C_TickCrashSequence");
static_assert(sizeof(WIDGET_CrashScreen_C_TickCrashSequence) == 0x000030, "Wrong size on WIDGET_CrashScreen_C_TickCrashSequence");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, DeltaTime) == 0x000000, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, NextState) == 0x000004, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::NextState' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, StateProgress) == 0x000008, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::StateProgress' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, ClampedDeltaTime) == 0x00000C, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::ClampedDeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000014, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Add_ByteByte_ReturnValue) == 0x000019, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_GetValidValue_ReturnValue) == 0x00001A, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00001B, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, Temp_bool_Variable) == 0x00001C, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, K2Node_Select_Default) == 0x000020, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, K2Node_SwitchEnum_CmpSuccess) == 0x000024, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_TickCrashSequence, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'WIDGET_CrashScreen_C_TickCrashSequence::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.UpdateMemoryCorruptionText
// 0x01D8 (0x01D8 - 0x0000)
struct WIDGET_CrashScreen_C_UpdateMemoryCorruptionText final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewChar;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          UseCorruptionSymbols;                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Select_Default;                             // 0x0020(0x0010)(ReferenceParm)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E0(0x0018)()
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0148(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0160(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0018)()
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_UpdateMemoryCorruptionText");
static_assert(sizeof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText) == 0x0001D8, "Wrong size on WIDGET_CrashScreen_C_UpdateMemoryCorruptionText");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, DeltaTime) == 0x000000, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, NewChar) == 0x000008, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::NewChar' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, UseCorruptionSymbols) == 0x000018, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::UseCorruptionSymbols' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, Temp_bool_Variable) == 0x000019, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, Temp_int_Variable) == 0x00001C, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_Select_Default) == 0x000020, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000030, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_RandomInteger_ReturnValue) == 0x000038, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Array_Get_Item) == 0x000040, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_GetText_ReturnValue) == 0x000050, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E0, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_RandomFloat_ReturnValue) == 0x0000F8, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000140, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_GetText_ReturnValue_1) == 0x000148, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000160, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A0, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001D0, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateMemoryCorruptionText, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001D4, "Member 'WIDGET_CrashScreen_C_UpdateMemoryCorruptionText::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.ResetCrashFields
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_CrashScreen_C_ResetCrashFields final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_CrashScreen_C_ResetCrashFields) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_ResetCrashFields");
static_assert(sizeof(WIDGET_CrashScreen_C_ResetCrashFields) == 0x000020, "Wrong size on WIDGET_CrashScreen_C_ResetCrashFields");
static_assert(offsetof(WIDGET_CrashScreen_C_ResetCrashFields, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WIDGET_CrashScreen_C_ResetCrashFields::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_ResetCrashFields, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WIDGET_CrashScreen_C_ResetCrashFields::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.UpdateCrashLogText
// 0x0118 (0x0118 - 0x0000)
struct WIDGET_CrashScreen_C_UpdateCrashLogText final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_UpdateCrashLogText) == 0x000008, "Wrong alignment on WIDGET_CrashScreen_C_UpdateCrashLogText");
static_assert(sizeof(WIDGET_CrashScreen_C_UpdateCrashLogText) == 0x000118, "Wrong size on WIDGET_CrashScreen_C_UpdateCrashLogText");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, DeltaTime) == 0x000000, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, Temp_int_Variable) == 0x000004, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000020, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Array_Get_Item) == 0x000068, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00010C, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000110, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateCrashLogText, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'WIDGET_CrashScreen_C_UpdateCrashLogText::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_CrashScreen.WIDGET_CrashScreen_C.UpdateStandBy
// 0x000C (0x000C - 0x0000)
struct WIDGET_CrashScreen_C_UpdateStandBy final
{
public:
	float                                         CallFunc_MakePulsatingValue_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_CrashScreen_C_UpdateStandBy) == 0x000004, "Wrong alignment on WIDGET_CrashScreen_C_UpdateStandBy");
static_assert(sizeof(WIDGET_CrashScreen_C_UpdateStandBy) == 0x00000C, "Wrong size on WIDGET_CrashScreen_C_UpdateStandBy");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateStandBy, CallFunc_MakePulsatingValue_ReturnValue) == 0x000000, "Member 'WIDGET_CrashScreen_C_UpdateStandBy::CallFunc_MakePulsatingValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateStandBy, CallFunc_Round_ReturnValue) == 0x000004, "Member 'WIDGET_CrashScreen_C_UpdateStandBy::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_CrashScreen_C_UpdateStandBy, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'WIDGET_CrashScreen_C_UpdateStandBy::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

