#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_DeckElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Automap_DeckElement.WIDGET_Automap_DeckElement_C
// 0x0070 (0x02D0 - 0x0260)
class UWIDGET_Automap_DeckElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FilterMouseLeave;                                  // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FilterMouseEnter;                                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FilterToggled;                                     // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Icon;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_WaypointIcon;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_WaypointIndicator;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_DeckName;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 DeckSymbol;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         DeckIndex;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsDeckSelected;                                    // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsMouseOver;                                       // 0x02BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Automap_DeckList_C*             DeckListWidget;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Automap_DeckElement(int32 EntryPoint);
	void AsyncUpdateIconTexture();
	void Construct();
	void OnLoaded_02696D51441FD2B9E97221884D551CBC(class UObject* Loaded);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_MouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void UpdateVisualState();
	void GetActiveTextColor(struct FColor* Color);
	void GetInactiveTextColor(struct FColor* Color);
	void GetUnvisitedTextColor(struct FColor* Color);
	void GetHighlightedActiveTextColor(struct FColor* Color);
	void GetHighlightedInactiveTextColor(struct FColor* Color);
	void UpdateWaypointIconColor();
	void GetDynamicMaterial(class UMaterialInstanceDynamic** DynamicMaterial_0);
	void LoadScanData();
	void GetDeckRowName(class FName* DeckRow);
	void GetDeckDisplayName(class FText* DisplayName);
	void SetCurrentDeckSelected(bool IsSelected);
	void GetHighlightedUnvisitedTextColor(struct FColor* Color);
	void ShowMissionWaypointIcon(bool State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Automap_DeckElement_C">();
	}
	static class UWIDGET_Automap_DeckElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Automap_DeckElement_C>();
	}
};
static_assert(alignof(UWIDGET_Automap_DeckElement_C) == 0x000008, "Wrong alignment on UWIDGET_Automap_DeckElement_C");
static_assert(sizeof(UWIDGET_Automap_DeckElement_C) == 0x0002D0, "Wrong size on UWIDGET_Automap_DeckElement_C");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_Automap_DeckElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, FilterMouseLeave) == 0x000268, "Member 'UWIDGET_Automap_DeckElement_C::FilterMouseLeave' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, FilterMouseEnter) == 0x000270, "Member 'UWIDGET_Automap_DeckElement_C::FilterMouseEnter' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, FilterToggled) == 0x000278, "Member 'UWIDGET_Automap_DeckElement_C::FilterToggled' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, MESH_Background) == 0x000280, "Member 'UWIDGET_Automap_DeckElement_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, MESH_Icon) == 0x000288, "Member 'UWIDGET_Automap_DeckElement_C::MESH_Icon' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, MESH_WaypointIcon) == 0x000290, "Member 'UWIDGET_Automap_DeckElement_C::MESH_WaypointIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, PANEL_WaypointIndicator) == 0x000298, "Member 'UWIDGET_Automap_DeckElement_C::PANEL_WaypointIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, TEXT_DeckName) == 0x0002A0, "Member 'UWIDGET_Automap_DeckElement_C::TEXT_DeckName' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, DeckSymbol) == 0x0002A8, "Member 'UWIDGET_Automap_DeckElement_C::DeckSymbol' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, DeckIndex) == 0x0002B8, "Member 'UWIDGET_Automap_DeckElement_C::DeckIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, IsDeckSelected) == 0x0002BC, "Member 'UWIDGET_Automap_DeckElement_C::IsDeckSelected' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, IsMouseOver) == 0x0002BD, "Member 'UWIDGET_Automap_DeckElement_C::IsMouseOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, DynamicMaterial) == 0x0002C0, "Member 'UWIDGET_Automap_DeckElement_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_DeckElement_C, DeckListWidget) == 0x0002C8, "Member 'UWIDGET_Automap_DeckElement_C::DeckListWidget' has a wrong offset!");

}

