#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubMenu_Tab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.ExecuteUbergraph_WIDGET_SubMenu_Tab
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab) == 0x000004, "Wrong alignment on WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab) == 0x000008, "Wrong size on WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab, EntryPoint) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_SubMenu_Tab_C_ExecuteUbergraph_WIDGET_SubMenu_Tab::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SubMenu_Tab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_SubMenu_Tab_C_PreConstruct");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_SubMenu_Tab_C_PreConstruct");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.EVENT_OnClicked
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_SubMenu_Tab_C_EVENT_OnClicked final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_EVENT_OnClicked");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked) == 0x000218, "Wrong size on WIDGET_SubMenu_Tab_C_EVENT_OnClicked");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked, MyGeometry) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnClicked::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked, MouseEvent) == 0x000038, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnClicked::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked, ReturnValue) == 0x0000A8, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnClicked::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnClicked, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnClicked::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.SetIsSelected
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_SubMenu_Tab_C_SetIsSelected final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_SetIsSelected) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_SetIsSelected");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_SetIsSelected) == 0x000010, "Wrong size on WIDGET_SubMenu_Tab_C_SetIsSelected");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsSelected, Value) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_SetIsSelected::Value' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsSelected, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'WIDGET_SubMenu_Tab_C_SetIsSelected::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsSelected, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WIDGET_SubMenu_Tab_C_SetIsSelected::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.SetIsHighlighted
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_SubMenu_Tab_C_SetIsHighlighted final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_SetIsHighlighted) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_SetIsHighlighted) == 0x000010, "Wrong size on WIDGET_SubMenu_Tab_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsHighlighted, Value) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_SetIsHighlighted::Value' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsHighlighted, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'WIDGET_SubMenu_Tab_C_SetIsHighlighted::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetIsHighlighted, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WIDGET_SubMenu_Tab_C_SetIsHighlighted::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.EVENT_OnMouseExit
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit) == 0x000070, "Wrong size on WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit, MouseEvent) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_EVENT_OnMouseExit::MouseEvent' has a wrong offset!");

// Function WIDGET_SubMenu_Tab.WIDGET_SubMenu_Tab_C.SetPlatformIcon
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_SubMenu_Tab_C_SetPlatformIcon final
{
public:
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item_3;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item_4;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentPlatform_PC;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Xbox;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Playstation;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Switch;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Console;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubMenu_Tab_C_SetPlatformIcon) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Tab_C_SetPlatformIcon");
static_assert(sizeof(WIDGET_SubMenu_Tab_C_SetPlatformIcon) == 0x000050, "Wrong size on WIDGET_SubMenu_Tab_C_SetPlatformIcon");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000000, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_Array_Get_Item) == 0x000008, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, K2Node_SwitchString_CmpSuccess) == 0x000020, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_Array_Get_Item_3) == 0x000038, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_Array_Get_Item_4) == 0x000040, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetCurrentPlatform_PC) == 0x000048, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetCurrentPlatform_PC' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetCurrentPlatform_Xbox) == 0x000049, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetCurrentPlatform_Xbox' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetCurrentPlatform_Playstation) == 0x00004A, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetCurrentPlatform_Playstation' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetCurrentPlatform_Switch) == 0x00004B, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetCurrentPlatform_Switch' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, CallFunc_GetCurrentPlatform_Console) == 0x00004C, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::CallFunc_GetCurrentPlatform_Console' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Tab_C_SetPlatformIcon, K2Node_SwitchEnum_CmpSuccess) == 0x00004D, "Member 'WIDGET_SubMenu_Tab_C_SetPlatformIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

