#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenuButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenuButton_C_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.ExecuteUbergraph_WIDGET_MainMenuButton
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton) == 0x000004, "Wrong alignment on WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton");
static_assert(sizeof(WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton) == 0x000008, "Wrong size on WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton");
static_assert(offsetof(WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton, EntryPoint) == 0x000000, "Member 'WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_MainMenuButton_C_ExecuteUbergraph_WIDGET_MainMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MainMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_MainMenuButton_C_PreConstruct");
static_assert(sizeof(WIDGET_MainMenuButton_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_MainMenuButton_C_PreConstruct");
static_assert(offsetof(WIDGET_MainMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_MainMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.EVENT_OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WIDGET_MainMenuButton_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter) == 0x0000B0, "Wrong size on WIDGET_MainMenuButton_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter, CallFunc_IsHovered_ReturnValue) == 0x0000A8, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseEnter::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseEnter, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseEnter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.EVENT_OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WIDGET_MainMenuButton_C_EVENT_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_EVENT_OnMouseLeave");
static_assert(sizeof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave) == 0x000078, "Wrong size on WIDGET_MainMenuButton_C_EVENT_OnMouseLeave");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseLeave::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave, CallFunc_IsHovered_ReturnValue) == 0x000070, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseLeave::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseLeave::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseLeave, CallFunc_Not_PreBool_ReturnValue) == 0x000072, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseLeave::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.EVENT_OnMouseButtonDown
// 0x0238 (0x0238 - 0x0000)
struct WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InputEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	class UWIDGET_SplashScreen_Title_C*           K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title;   // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MainMenu_InGame_C*              K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game;     // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown");
static_assert(sizeof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown) == 0x000238, "Wrong size on WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, InputEvent) == 0x000038, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::InputEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title) == 0x000218, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game) == 0x000228, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, K2Node_DynamicCast_bSuccess_1) == 0x000230, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000231, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000232, "Member 'WIDGET_MainMenuButton_C_EVENT_OnMouseButtonDown::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.ResetButtonState
// 0x0014 (0x0014 - 0x0000)
struct WIDGET_MainMenuButton_C_ResetButtonState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color_1;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MainMenuButton_C_ResetButtonState) == 0x000004, "Wrong alignment on WIDGET_MainMenuButton_C_ResetButtonState");
static_assert(sizeof(WIDGET_MainMenuButton_C_ResetButtonState) == 0x000014, "Wrong size on WIDGET_MainMenuButton_C_ResetButtonState");
static_assert(offsetof(WIDGET_MainMenuButton_C_ResetButtonState, Temp_bool_Variable) == 0x000000, "Member 'WIDGET_MainMenuButton_C_ResetButtonState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ResetButtonState, K2Node_MakeStruct_Color) == 0x000004, "Member 'WIDGET_MainMenuButton_C_ResetButtonState::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ResetButtonState, CallFunc_GetMeshUIColor_Color) == 0x000008, "Member 'WIDGET_MainMenuButton_C_ResetButtonState::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ResetButtonState, K2Node_MakeStruct_Color_1) == 0x00000C, "Member 'WIDGET_MainMenuButton_C_ResetButtonState::K2Node_MakeStruct_Color_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ResetButtonState, K2Node_Select_Default) == 0x000010, "Member 'WIDGET_MainMenuButton_C_ResetButtonState::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.SetSelected
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MainMenuButton_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MainMenuButton_C_SetSelected) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_SetSelected");
static_assert(sizeof(WIDGET_MainMenuButton_C_SetSelected) == 0x000010, "Wrong size on WIDGET_MainMenuButton_C_SetSelected");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetSelected, Selected) == 0x000000, "Member 'WIDGET_MainMenuButton_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WIDGET_MainMenuButton_C_SetSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.SetMainMenu
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MainMenuButton_C_SetMainMenu final
{
public:
	class UWidget*                                MainMenu_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MainMenuButton_C_SetMainMenu) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_SetMainMenu");
static_assert(sizeof(WIDGET_MainMenuButton_C_SetMainMenu) == 0x000008, "Wrong size on WIDGET_MainMenuButton_C_SetMainMenu");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetMainMenu, MainMenu_0) == 0x000000, "Member 'WIDGET_MainMenuButton_C_SetMainMenu::MainMenu_0' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.ButtonClicked
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenuButton_C_ButtonClicked final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenuButton_C_ButtonClicked) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_ButtonClicked");
static_assert(sizeof(WIDGET_MainMenuButton_C_ButtonClicked) == 0x000070, "Wrong size on WIDGET_MainMenuButton_C_ButtonClicked");
static_assert(offsetof(WIDGET_MainMenuButton_C_ButtonClicked, InputEvent) == 0x000000, "Member 'WIDGET_MainMenuButton_C_ButtonClicked::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.SetIsHighlighted
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MainMenuButton_C_SetIsHighlighted final
{
public:
	bool                                          NewHighlightedState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceInstant;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MainMenuButton_C_SetIsHighlighted) == 0x000008, "Wrong alignment on WIDGET_MainMenuButton_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_MainMenuButton_C_SetIsHighlighted) == 0x000010, "Wrong size on WIDGET_MainMenuButton_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetIsHighlighted, NewHighlightedState) == 0x000000, "Member 'WIDGET_MainMenuButton_C_SetIsHighlighted::NewHighlightedState' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetIsHighlighted, ForceInstant) == 0x000001, "Member 'WIDGET_MainMenuButton_C_SetIsHighlighted::ForceInstant' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetIsHighlighted, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WIDGET_MainMenuButton_C_SetIsHighlighted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_SetIsHighlighted, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WIDGET_MainMenuButton_C_SetIsHighlighted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenuButton.WIDGET_MainMenuButton_C.ReceiveNavAccept
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MainMenuButton_C_ReceiveNavAccept final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenuButton_C_ReceiveNavAccept) == 0x000001, "Wrong alignment on WIDGET_MainMenuButton_C_ReceiveNavAccept");
static_assert(sizeof(WIDGET_MainMenuButton_C_ReceiveNavAccept) == 0x000002, "Wrong size on WIDGET_MainMenuButton_C_ReceiveNavAccept");
static_assert(offsetof(WIDGET_MainMenuButton_C_ReceiveNavAccept, InputState) == 0x000000, "Member 'WIDGET_MainMenuButton_C_ReceiveNavAccept::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenuButton_C_ReceiveNavAccept, Result) == 0x000001, "Member 'WIDGET_MainMenuButton_C_ReceiveNavAccept::Result' has a wrong offset!");

}

