#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SimplifiedHotbarCategoryModal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "ENUM_SimplifiedHotbarState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.InitializeSimplifiedHotbarModal
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal final
{
public:
	class UWIDGET_PlayerHUD_C*                    PlayerHUD_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal) == 0x000008, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal, PlayerHUD_0) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_InitializeSimplifiedHotbarModal::PlayerHUD_0' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.SetModalCategoryText
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0038(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0060(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0088(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText) == 0x0000A8, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, K2Node_MakeArray_Array) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, K2Node_MakeArray_Array_1) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, CallFunc_Format_ReturnValue) == 0x000020, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, CallFunc_Format_ReturnValue_1) == 0x000038, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, K2Node_MakeArray_Array_2) == 0x000050, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, CallFunc_Format_ReturnValue_2) == 0x000060, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, K2Node_MakeArray_Array_3) == 0x000078, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, CallFunc_Format_ReturnValue_3) == 0x000088, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetModalCategoryText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.ToggleModalVisiblity-Up
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp) == 0x000008, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.ToggleModalVisiblity-Left
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft) == 0x000008, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusLeft::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.ToggleModalVisiblity-Right
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight) == 0x000008, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisiblityMinusRight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.MoveSlotTo
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo) == 0x000018, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo, CallFunc_GetPosition_ReturnValue) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MoveSlotTo::CallFunc_GetPosition_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.ToggleModalVisibility
// 0x0038 (0x0038 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility final
{
public:
	ENUM_SimplifiedHotbarState                    HotbarCategoryState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility) == 0x000038, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, HotbarCategoryState) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::HotbarCategoryState' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Array_Get_Item) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Array_Get_Item_1) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000024, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000035, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_ToggleModalVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.CloseModal
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal) == 0x000020, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal, CallFunc_PlayAnimation_ReturnValue_2) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_CloseModal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.SelectCategoryHotbarSlot
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot final
{
public:
	int32                                         HotbarSlotIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot) == 0x000004, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot) == 0x000004, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot, HotbarSlotIndex) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SelectCategoryHotbarSlot::HotbarSlotIndex' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.AssignSlotNumber
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber) == 0x000020, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, CallFunc_Array_Get_Item) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_AssignSlotNumber::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.BindHotbarSlotToCategorySlots
// 0x0080 (0x0080 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item_2;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_HotbarSlot_C*                   K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_HotbarSlot_C*                   K2Node_Select_Default_1;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_HotbarSlot_C*                   K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots) == 0x000080, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Variable) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Variable_1) == 0x000004, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Variable_2) == 0x000014, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Get_Item_2) == 0x000040, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Array_Length_ReturnValue_2) == 0x00004C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x000051, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, K2Node_Select_Default) == 0x000058, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, K2Node_Select_Default_1) == 0x000060, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Less_IntInt_ReturnValue_2) == 0x00006C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, K2Node_SwitchEnum_CmpSuccess) == 0x000074, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots, K2Node_Select_Default_2) == 0x000078, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_BindHotbarSlotToCategorySlots::K2Node_Select_Default_2' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.MakeSimplifiedHotbarSlotsArray
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_SimplifiedHotbarSlot_C*> K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray) == 0x000030, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, CallFunc_Array_Get_Item) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray, K2Node_MakeArray_Array) == 0x000020, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_MakeSimplifiedHotbarSlotsArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.Handle Slot Selection
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         Simplified_HotbarSlot;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           SlotDestination;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Slot_New_Position;                                 // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection) == 0x000028, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection, Selected) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection::Selected' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection, Simplified_HotbarSlot) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection::Simplified_HotbarSlot' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection, SlotDestination) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection::SlotDestination' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection, Slot_New_Position) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Handle_Slot_Selection::Slot_New_Position' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.SetSelectedSlotLocations
// 0x0060 (0x0060 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations) == 0x000060, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Array_Get_Item) == 0x000010, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Array_Get_Item_1) == 0x00001C, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000028, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000030, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000048, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x000050, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_SetSelectedSlotLocations::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.Place Slot In
// 0x0098 (0x0098 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In final
{
public:
	class UWIDGET_SimplifiedHotbarSlot_C*         Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewPosition;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           NewParent;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ZOrder;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SizeToContent;                                     // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Alignment;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               Anchors;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0080(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In) == 0x000098, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, Widget) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::Widget' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, NewPosition) == 0x000008, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::NewPosition' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, NewParent) == 0x000018, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::NewParent' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, ZOrder) == 0x000020, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::ZOrder' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, SizeToContent) == 0x000024, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::SizeToContent' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, Alignment) == 0x000028, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::Alignment' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, Size) == 0x000030, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::Size' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, Position) == 0x000038, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::Position' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, Anchors) == 0x000040, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::Anchors' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_GetZOrder_ReturnValue) == 0x000058, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_AddChildToCanvas_ReturnValue) == 0x000060, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_GetAlignment_ReturnValue) == 0x000068, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_GetSize_ReturnValue) == 0x000070, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_GetPosition_ReturnValue) == 0x000078, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_GetAnchors_ReturnValue) == 0x000080, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000090, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_Place_Slot_In::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C.UpdateSlotAppearance
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance");
static_assert(sizeof(WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance) == 0x000020, "Wrong size on WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_SimplifiedHotbarCategoryModal_C_UpdateSlotAppearance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
