#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_HardwareDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_HardwareDetails.WIDGET_HardwareDetails_C
// 0x0050 (0x02B0 - 0x0260)
class UWIDGET_HardwareDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TabBottom;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TabTop;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Description;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Name;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Status_Details;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Version_Details;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 HardwareItemClass;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_HardwareDetails(int32 EntryPoint);
	void Construct();
	void EnableHardwareDetails(class UWIDGET_HardwareButton_C* HardwareButton);
	void UpdateHardwareText();
	void GetHardwareItem(class UITEM_HardwareBase_C** HardwareItem);
	void EVENT_OnBagChanged();
	void EVENT_OnHardwareStateChanged(bool Activated, bool MagLocked);
	void GetFormattedVersionHistory(class UITEM_HardwareBase_C* HardwareItem, class FText* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_HardwareDetails_C">();
	}
	static class UWIDGET_HardwareDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_HardwareDetails_C>();
	}
};
static_assert(alignof(UWIDGET_HardwareDetails_C) == 0x000008, "Wrong alignment on UWIDGET_HardwareDetails_C");
static_assert(sizeof(UWIDGET_HardwareDetails_C) == 0x0002B0, "Wrong size on UWIDGET_HardwareDetails_C");
static_assert(offsetof(UWIDGET_HardwareDetails_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_HardwareDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, Show) == 0x000268, "Member 'UWIDGET_HardwareDetails_C::Show' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, MESH_Background) == 0x000270, "Member 'UWIDGET_HardwareDetails_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, MESH_TabBottom) == 0x000278, "Member 'UWIDGET_HardwareDetails_C::MESH_TabBottom' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, MESH_TabTop) == 0x000280, "Member 'UWIDGET_HardwareDetails_C::MESH_TabTop' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, TEXT_Description) == 0x000288, "Member 'UWIDGET_HardwareDetails_C::TEXT_Description' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, TEXT_Name) == 0x000290, "Member 'UWIDGET_HardwareDetails_C::TEXT_Name' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, TEXT_Status_Details) == 0x000298, "Member 'UWIDGET_HardwareDetails_C::TEXT_Status_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, TEXT_Version_Details) == 0x0002A0, "Member 'UWIDGET_HardwareDetails_C::TEXT_Version_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_HardwareDetails_C, HardwareItemClass) == 0x0002A8, "Member 'UWIDGET_HardwareDetails_C::HardwareItemClass' has a wrong offset!");

}

