#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ListCategoryHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ListCategoryHeader.WIDGET_ListCategoryHeader_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_ListCategoryHeader_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_Underline;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_InputCategory;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0278(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WIDGET_ListCategoryHeader(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ListCategoryHeader_C">();
	}
	static class UWIDGET_ListCategoryHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ListCategoryHeader_C>();
	}
};
static_assert(alignof(UWIDGET_ListCategoryHeader_C) == 0x000008, "Wrong alignment on UWIDGET_ListCategoryHeader_C");
static_assert(sizeof(UWIDGET_ListCategoryHeader_C) == 0x000290, "Wrong size on UWIDGET_ListCategoryHeader_C");
static_assert(offsetof(UWIDGET_ListCategoryHeader_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_ListCategoryHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_ListCategoryHeader_C, IMG_Underline) == 0x000268, "Member 'UWIDGET_ListCategoryHeader_C::IMG_Underline' has a wrong offset!");
static_assert(offsetof(UWIDGET_ListCategoryHeader_C, TEXT_InputCategory) == 0x000270, "Member 'UWIDGET_ListCategoryHeader_C::TEXT_InputCategory' has a wrong offset!");
static_assert(offsetof(UWIDGET_ListCategoryHeader_C, HeaderText) == 0x000278, "Member 'UWIDGET_ListCategoryHeader_C::HeaderText' has a wrong offset!");

}

