#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_AutoMap

#include "Basic.hpp"

#include "STRUCT_UserTintOption_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "STRUCT_LevelInfo_structs.hpp"
#include "ENUM_CursorMode_structs.hpp"
#include "ENUM_CardinalDirection_structs.hpp"
#include "STRUCT_MissionWaypointData_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_ScannableRegionData_structs.hpp"
#include "InputCore_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.ExecuteUbergraph_WIDGET_AutoMap
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScannerEnabled_Result;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap");
static_assert(sizeof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap) == 0x000070, "Wrong size on WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, EntryPoint) == 0x000000, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, CallFunc_IsScannerEnabled_Result) == 0x00002C, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::CallFunc_IsScannerEnabled_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, K2Node_Event_MyGeometry) == 0x000030, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WIDGET_AutoMap_C_ExecuteUbergraph_WIDGET_AutoMap::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_AutoMap_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_Tick) == 0x000004, "Wrong alignment on WIDGET_AutoMap_C_Tick");
static_assert(sizeof(WIDGET_AutoMap_C_Tick) == 0x00003C, "Wrong size on WIDGET_AutoMap_C_Tick");
static_assert(offsetof(WIDGET_AutoMap_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_AutoMap_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_AutoMap_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.ReceiveMouseZoomInput
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_AutoMap_C_ReceiveMouseZoomInput final
{
public:
	float                                         ZoomDelta;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_AutoMap_C_ReceiveMouseZoomInput) == 0x000004, "Wrong alignment on WIDGET_AutoMap_C_ReceiveMouseZoomInput");
static_assert(sizeof(WIDGET_AutoMap_C_ReceiveMouseZoomInput) == 0x000008, "Wrong size on WIDGET_AutoMap_C_ReceiveMouseZoomInput");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveMouseZoomInput, ZoomDelta) == 0x000000, "Member 'WIDGET_AutoMap_C_ReceiveMouseZoomInput::ZoomDelta' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveMouseZoomInput, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WIDGET_AutoMap_C_ReceiveMouseZoomInput::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.UpdateAutoMapMousePanning
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_AutoMap_C_UpdateAutoMapMousePanning final
{
public:
	struct FVector2D                              PanDriftTexCoordDelta;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_UpdateAutoMapMousePanning) == 0x000004, "Wrong alignment on WIDGET_AutoMap_C_UpdateAutoMapMousePanning");
static_assert(sizeof(WIDGET_AutoMap_C_UpdateAutoMapMousePanning) == 0x000018, "Wrong size on WIDGET_AutoMap_C_UpdateAutoMapMousePanning");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMousePanning, PanDriftTexCoordDelta) == 0x000000, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMousePanning::PanDriftTexCoordDelta' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMousePanning, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000008, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMousePanning::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMousePanning, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000010, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMousePanning::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.ReceiveGamepadZoomInput
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_AutoMap_C_ReceiveGamepadZoomInput final
{
public:
	bool                                          ZoomIn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               CallFunc_GetCaptureComponent_CaptureComponent;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_ReceiveGamepadZoomInput");
static_assert(sizeof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput) == 0x000028, "Wrong size on WIDGET_AutoMap_C_ReceiveGamepadZoomInput");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, ZoomIn) == 0x000000, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::ZoomIn' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, Temp_bool_Variable) == 0x000001, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, Temp_float_Variable) == 0x000004, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, Temp_float_Variable_1) == 0x000008, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, K2Node_Select_Default) == 0x00000C, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, CallFunc_Ease_ReturnValue) == 0x000018, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ReceiveGamepadZoomInput, CallFunc_GetCaptureComponent_CaptureComponent) == 0x000020, "Member 'WIDGET_AutoMap_C_ReceiveGamepadZoomInput::CallFunc_GetCaptureComponent_CaptureComponent' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.UpdateAutoMapMouseZoom
// 0x0110 (0x0110 - 0x0000)
struct WIDGET_AutoMap_C_UpdateAutoMapMouseZoom final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidZoomTexCoords;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetZoomWorldLocation;                           // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceZoomWorldLocation;                           // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ZoomPositionTexCoord;                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               CallFunc_GetCaptureComponent_CaptureComponent;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldLocationFromTextureCoords_WorldLocation; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldLocationFromTextureCoords_WorldLocation_1; // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords; // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetTextureCoordsFromScreenPoint_TexCoords; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               CallFunc_GetCaptureComponent_CaptureComponent_1;   // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_UpdateAutoMapMouseZoom");
static_assert(sizeof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom) == 0x000110, "Wrong size on WIDGET_AutoMap_C_UpdateAutoMapMouseZoom");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, DeltaTime) == 0x000000, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, ValidZoomTexCoords) == 0x000004, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::ValidZoomTexCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, TargetZoomWorldLocation) == 0x000008, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::TargetZoomWorldLocation' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, SourceZoomWorldLocation) == 0x000014, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::SourceZoomWorldLocation' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, ZoomPositionTexCoord) == 0x000020, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::ZoomPositionTexCoord' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetCaptureComponent_CaptureComponent) == 0x000028, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetCaptureComponent_CaptureComponent' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_FInterpTo_ReturnValue) == 0x000030, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetWorldLocationFromTextureCoords_WorldLocation) == 0x000034, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetWorldLocationFromTextureCoords_WorldLocation' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetWorldLocationFromTextureCoords_WorldLocation_1) == 0x000050, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetWorldLocationFromTextureCoords_WorldLocation_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_K2_AddWorldOffset_SweepHitResult) == 0x00005C, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_K2_AddWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords) == 0x0000E4, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetTextureCoordsFromScreenPoint_TexCoords) == 0x0000E8, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetTextureCoordsFromScreenPoint_TexCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_Ease_ReturnValue) == 0x0000F0, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_GetCaptureComponent_CaptureComponent_1) == 0x0000F8, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_GetCaptureComponent_CaptureComponent_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000100, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_Add_FloatFloat_ReturnValue) == 0x000104, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_UpdateAutoMapMouseZoom, CallFunc_FClamp_ReturnValue) == 0x000108, "Member 'WIDGET_AutoMap_C_UpdateAutoMapMouseZoom::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.InitializeAutoMap
// 0x0040 (0x0040 - 0x0000)
struct WIDGET_AutoMap_C_InitializeAutoMap final
{
public:
	class UWIDGET_PlayerHUD_C*                    HUD;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StoryQuestName, bool Value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyByType_Difficulty;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_AutoMap_C_InitializeAutoMap) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_InitializeAutoMap");
static_assert(sizeof(WIDGET_AutoMap_C_InitializeAutoMap) == 0x000040, "Wrong size on WIDGET_AutoMap_C_InitializeAutoMap");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, HUD) == 0x000000, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::HUD' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, GameInstance) == 0x000008, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::GameInstance' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, CallFunc_GetDifficultyByType_Difficulty) == 0x000020, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::CallFunc_GetDifficultyByType_Difficulty' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, K2Node_DynamicCast_AsGI_Single_Player) == 0x000030, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_InitializeAutoMap, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WIDGET_AutoMap_C_InitializeAutoMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.SetAutoMapVisibility
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_AutoMap_C_SetAutoMapVisibility final
{
public:
	bool                                          Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     GameInstance;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentLevelName_Result;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScannerEnabled_Result;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_AutoMap_C_SetAutoMapVisibility) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_SetAutoMapVisibility");
static_assert(sizeof(WIDGET_AutoMap_C_SetAutoMapVisibility) == 0x000030, "Wrong size on WIDGET_AutoMap_C_SetAutoMapVisibility");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, Visibility_0) == 0x000000, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::Visibility_0' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, GameInstance) == 0x000008, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::GameInstance' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, CallFunc_GetCurrentLevelName_Result) == 0x000010, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::CallFunc_GetCurrentLevelName_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, K2Node_DynamicCast_AsGI_Single_Player) == 0x000020, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_SetAutoMapVisibility, CallFunc_IsScannerEnabled_Result) == 0x000029, "Member 'WIDGET_AutoMap_C_SetAutoMapVisibility::CallFunc_IsScannerEnabled_Result' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.GetCaptureComponent
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_AutoMap_C_GetCaptureComponent final
{
public:
	class USceneCaptureComponent2D*               CaptureComponent;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               CallFunc_GetSceneCaptureComponent_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_GetCaptureComponent) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_GetCaptureComponent");
static_assert(sizeof(WIDGET_AutoMap_C_GetCaptureComponent) == 0x000028, "Wrong size on WIDGET_AutoMap_C_GetCaptureComponent");
static_assert(offsetof(WIDGET_AutoMap_C_GetCaptureComponent, CaptureComponent) == 0x000000, "Member 'WIDGET_AutoMap_C_GetCaptureComponent::CaptureComponent' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_GetCaptureComponent, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'WIDGET_AutoMap_C_GetCaptureComponent::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_GetCaptureComponent, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000010, "Member 'WIDGET_AutoMap_C_GetCaptureComponent::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_GetCaptureComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WIDGET_AutoMap_C_GetCaptureComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_GetCaptureComponent, CallFunc_GetSceneCaptureComponent_ReturnValue) == 0x000020, "Member 'WIDGET_AutoMap_C_GetCaptureComponent::CallFunc_GetSceneCaptureComponent_ReturnValue' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.EVENT_OnMouseDown
// 0x0340 (0x0340 - 0x0000)
struct WIDGET_AutoMap_C_EVENT_OnMouseDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldPositionFromMousePosition_WorldLocation; // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0178(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0238(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1; // 0x0258(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1; // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetTextureCoordsFromScreenPoint_TexCoords; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0288(0x00B8)()
};
static_assert(alignof(WIDGET_AutoMap_C_EVENT_OnMouseDown) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_EVENT_OnMouseDown");
static_assert(sizeof(WIDGET_AutoMap_C_EVENT_OnMouseDown) == 0x000340, "Wrong size on WIDGET_AutoMap_C_EVENT_OnMouseDown");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, MyGeometry) == 0x000000, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, MouseEvent) == 0x000038, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, ReturnValue) == 0x0000A8, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000160, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_GetWorldPositionFromMousePosition_WorldLocation) == 0x000168, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_GetWorldPositionFromMousePosition_WorldLocation' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_Handled_ReturnValue) == 0x000178, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_Not_PreBool_ReturnValue) == 0x000230, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000238, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000250, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1) == 0x000258, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000270, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_BooleanOR_ReturnValue) == 0x000271, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1) == 0x000274, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords) == 0x00027C, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_GetTextureCoordsFromScreenPoint_TexCoords) == 0x000280, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_GetTextureCoordsFromScreenPoint_TexCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseDown, CallFunc_Unhandled_ReturnValue) == 0x000288, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.EVENT_OnMouseUp
// 0x0318 (0x0318 - 0x0000)
struct WIDGET_AutoMap_C_EVENT_OnMouseUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1; // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1; // 0x0240(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0258(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_AutoMap_C_EVENT_OnMouseUp) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_EVENT_OnMouseUp");
static_assert(sizeof(WIDGET_AutoMap_C_EVENT_OnMouseUp) == 0x000318, "Wrong size on WIDGET_AutoMap_C_EVENT_OnMouseUp");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, MyGeometry) == 0x000000, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, MouseEvent) == 0x000038, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, ReturnValue) == 0x0000A8, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000218, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_Not_PreBool_ReturnValue) == 0x000219, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1) == 0x00021A, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_Not_PreBool_ReturnValue_1) == 0x00021B, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_BooleanAND_ReturnValue) == 0x000238, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000239, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1) == 0x000240, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_Unhandled_ReturnValue) == 0x000258, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000310, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_BooleanOR_ReturnValue) == 0x000311, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnMouseUp, CallFunc_BooleanAND_ReturnValue_1) == 0x000312, "Member 'WIDGET_AutoMap_C_EVENT_OnMouseUp::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.EVENT_OnDragRegionMouseMove
// 0x04A8 (0x04A8 - 0x0000)
struct WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FVector2D                              CursorOffsetOnWidget;                              // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0220(0x00B8)()
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x02D8(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_GetWindowPointFromScreenPoint_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutSubMeshIndex; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutBarycentricCoords; // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_ReturnValue; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetUnprojectedTrianglePoint_ReturnValue;  // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords; // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetTextureCoordsFromScreenPoint_TexCoords; // 0x0324(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScannerEnabled_Result;                  // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0338(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_2;                    // 0x03F0(0x00B8)()
};
static_assert(alignof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove");
static_assert(sizeof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove) == 0x0004A8, "Wrong size on WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, MyGeometry) == 0x000000, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, MouseEvent) == 0x000038, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, ReturnValue) == 0x0000A8, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CursorOffsetOnWidget) == 0x000160, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CursorOffsetOnWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_Handled_ReturnValue_1) == 0x000220, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, K2Node_MakeStruct_DataTableRowHandle) == 0x0002D8, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetWindowPointFromScreenPoint_ReturnValue) == 0x0002E8, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetWindowPointFromScreenPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutSubMeshIndex) == 0x0002F0, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutSubMeshIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutBarycentricCoords) == 0x0002F4, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_ReturnValue) == 0x000300, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetTriangleIndexAtWindowPointForAnyMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetUnprojectedTrianglePoint_ReturnValue) == 0x000304, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetUnprojectedTrianglePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_BreakVector2D_X) == 0x00030C, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_BreakVector2D_Y) == 0x000310, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000314, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_MakeVector2D_ReturnValue) == 0x000318, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords) == 0x000320, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetTextureCoordsFromScreenPoint_ValidCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_GetTextureCoordsFromScreenPoint_TexCoords) == 0x000324, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_GetTextureCoordsFromScreenPoint_TexCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_IsScannerEnabled_Result) == 0x00032C, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_IsScannerEnabled_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000330, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_Unhandled_ReturnValue) == 0x000338, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove, CallFunc_Handled_ReturnValue_2) == 0x0003F0, "Member 'WIDGET_AutoMap_C_EVENT_OnDragRegionMouseMove::CallFunc_Handled_ReturnValue_2' has a wrong offset!");

// Function WIDGET_AutoMap.WIDGET_AutoMap_C.ResetMouseDetectorSize
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_AutoMap_C_ResetMouseDetectorSize final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_AutoMap_C_ResetMouseDetectorSize) == 0x000008, "Wrong alignment on WIDGET_AutoMap_C_ResetMouseDetectorSize");
static_assert(sizeof(WIDGET_AutoMap_C_ResetMouseDetectorSize) == 0x000048, "Wrong size on WIDGET_AutoMap_C_ResetMouseDetectorSize");
static_assert(offsetof(WIDGET_AutoMap_C_ResetMouseDetectorSize, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WIDGET_AutoMap_C_ResetMouseDetectorSize::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ResetMouseDetectorSize, CallFunc_GetSize_ReturnValue) == 0x000008, "Member 'WIDGET_AutoMap_C_ResetMouseDetectorSize::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_AutoMap_C_ResetMouseDetectorSize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'WIDGET_AutoMap_C_ResetMouseDetectorSize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
