#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuBase_classes.hpp"
#include "ENUM_OptionCategories_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsScreen.WIDGET_OptionsScreen_C
// 0x0088 (0x0390 - 0x0308)
class UWIDGET_OptionsScreen_C final : public UWIDGET_MenuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_ShowResetApplyButtons;                        // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_OpenOptionsSubscreen;                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_ApplyButton;                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_BackButton;                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_ResetToDefaults;               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsCategoryMenuList_C*      WIDGET_OptionsCategoryMenuList;                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsDescriptionBox_C*        WIDGET_OptionsDescriptionBox;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Audio_C*            WIDGET_OptionsMenu_Audio;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Controls_C*         WIDGET_OptionsMenu_Controls;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Display_C*          WIDGET_OptionsMenu_Display;                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Gameplay_C*         WIDGET_OptionsMenu_Gameplay;                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Graphics_C*         WIDGET_OptionsMenu_Graphics;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Interface_C*        WIDGET_OptionsMenu_Interface;                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USAVE_Settings_C*                       ShockSettings;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                MainMenu;                                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             HighlightedListItem;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_OptionsScreen(int32 EntryPoint);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Interface_K2Node_ComponentBoundEvent_15_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Audio_K2Node_ComponentBoundEvent_14_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Graphics_K2Node_ComponentBoundEvent_13_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Display_K2Node_ComponentBoundEvent_12_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Controls_K2Node_ComponentBoundEvent_11_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Gameplay_K2Node_ComponentBoundEvent_10_OnCanReset__DelegateSignature(bool CanReset);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Interface_K2Node_ComponentBoundEvent_9_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Graphics_K2Node_ComponentBoundEvent_8_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Gameplay_K2Node_ComponentBoundEvent_7_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Display_K2Node_ComponentBoundEvent_6_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Controls_K2Node_ComponentBoundEvent_5_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsMenu_Audio_K2Node_ComponentBoundEvent_4_OnCanApply__DelegateSignature(bool CanApply);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_ButtonLegend_ResetToDefaults_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_OptionsCategoryMenuList_K2Node_ComponentBoundEvent_2_OnOptionCategoryClicked__DelegateSignature(int32 OptionCategoryIndex);
	void BndEvt__WIDGET_OptionsScreen_WIDGET_ButtonLegend_ApplyButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void OnInitialized();
	void BndEvt__WIDGET_OptionsScreen_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void TriggerPageShiftLeft();
	void TriggerPageShiftRight();
	void SetHighlightedListItem(class UWIDGET_MenuListItemBase_C* ListItemWidget);
	void TryUpdateCategoryList();
	void TryOpenOptionSubMenu(ENUM_OptionCategories NewOptionCategory);
	void SetMainMenu(class UUserWidget* MainMenuWidget);
	void TryCloseSubMenu();
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);
	void InitializeMenu(class UWIDGET_MenuBase_C* ParentMenuWidget);
	void OnMenuOpen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsScreen_C">();
	}
	static class UWIDGET_OptionsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsScreen_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsScreen_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsScreen_C");
static_assert(sizeof(UWIDGET_OptionsScreen_C) == 0x000390, "Wrong size on UWIDGET_OptionsScreen_C");
static_assert(offsetof(UWIDGET_OptionsScreen_C, UberGraphFrame) == 0x000308, "Member 'UWIDGET_OptionsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, ANIM_ShowResetApplyButtons) == 0x000310, "Member 'UWIDGET_OptionsScreen_C::ANIM_ShowResetApplyButtons' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, ANIM_OpenOptionsSubscreen) == 0x000318, "Member 'UWIDGET_OptionsScreen_C::ANIM_OpenOptionsSubscreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_ButtonLegend_ApplyButton) == 0x000320, "Member 'UWIDGET_OptionsScreen_C::WIDGET_ButtonLegend_ApplyButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_ButtonLegend_BackButton) == 0x000328, "Member 'UWIDGET_OptionsScreen_C::WIDGET_ButtonLegend_BackButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_ButtonLegend_ResetToDefaults) == 0x000330, "Member 'UWIDGET_OptionsScreen_C::WIDGET_ButtonLegend_ResetToDefaults' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsCategoryMenuList) == 0x000338, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsCategoryMenuList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsDescriptionBox) == 0x000340, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsDescriptionBox' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Audio) == 0x000348, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Audio' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Controls) == 0x000350, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Controls' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Display) == 0x000358, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Display' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Gameplay) == 0x000360, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Gameplay' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Graphics) == 0x000368, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Graphics' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, WIDGET_OptionsMenu_Interface) == 0x000370, "Member 'UWIDGET_OptionsScreen_C::WIDGET_OptionsMenu_Interface' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, ShockSettings) == 0x000378, "Member 'UWIDGET_OptionsScreen_C::ShockSettings' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, MainMenu) == 0x000380, "Member 'UWIDGET_OptionsScreen_C::MainMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsScreen_C, HighlightedListItem) == 0x000388, "Member 'UWIDGET_OptionsScreen_C::HighlightedListItem' has a wrong offset!");

}

