#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_PageTab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_PageTab.WIDGET_PageTab_C.ExecuteUbergraph_WIDGET_PageTab
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab) == 0x000004, "Wrong alignment on WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab");
static_assert(sizeof(WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab) == 0x000004, "Wrong size on WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab");
static_assert(offsetof(WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab, EntryPoint) == 0x000000, "Member 'WIDGET_PageTab_C_ExecuteUbergraph_WIDGET_PageTab::EntryPoint' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.EVENT_OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WIDGET_PageTab_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_PageTab_C_EVENT_OnMouseEnter) == 0x0000B8, "Wrong size on WIDGET_PageTab_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_PageTab_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_PageTab_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseEnter, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'WIDGET_PageTab_C_EVENT_OnMouseEnter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseEnter, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B0, "Member 'WIDGET_PageTab_C_EVENT_OnMouseEnter::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.EVENT_OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WIDGET_PageTab_C_EVENT_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_EVENT_OnMouseLeave) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_EVENT_OnMouseLeave");
static_assert(sizeof(WIDGET_PageTab_C_EVENT_OnMouseLeave) == 0x000078, "Wrong size on WIDGET_PageTab_C_EVENT_OnMouseLeave");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WIDGET_PageTab_C_EVENT_OnMouseLeave::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseLeave, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WIDGET_PageTab_C_EVENT_OnMouseLeave::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.EVENT_OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_PageTab_C_EVENT_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_EVENT_OnMouseButtonDown");
static_assert(sizeof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown) == 0x000218, "Wrong size on WIDGET_PageTab_C_EVENT_OnMouseButtonDown");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WIDGET_PageTab_C_EVENT_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WIDGET_PageTab_C_EVENT_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WIDGET_PageTab_C_EVENT_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_PageTab_C_EVENT_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.SetSelected
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_PageTab_C_SetSelected final
{
public:
	bool                                          bShouldSelect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_SetSelected) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_SetSelected");
static_assert(sizeof(WIDGET_PageTab_C_SetSelected) == 0x000020, "Wrong size on WIDGET_PageTab_C_SetSelected");
static_assert(offsetof(WIDGET_PageTab_C_SetSelected, bShouldSelect) == 0x000000, "Member 'WIDGET_PageTab_C_SetSelected::bShouldSelect' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_SetSelected, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WIDGET_PageTab_C_SetSelected::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_SetSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000010, "Member 'WIDGET_PageTab_C_SetSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_SetSelected, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WIDGET_PageTab_C_SetSelected::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.UpdateTabColor
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_PageTab_C_UpdateTabColor final
{
public:
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_UpdateTabColor) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_UpdateTabColor");
static_assert(sizeof(WIDGET_PageTab_C_UpdateTabColor) == 0x000030, "Wrong size on WIDGET_PageTab_C_UpdateTabColor");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, MaterialInstance) == 0x000000, "Member 'WIDGET_PageTab_C_UpdateTabColor::MaterialInstance' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, Temp_bool_Variable) == 0x000008, "Member 'WIDGET_PageTab_C_UpdateTabColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, K2Node_MakeStruct_Color) == 0x00000C, "Member 'WIDGET_PageTab_C_UpdateTabColor::K2Node_MakeStruct_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WIDGET_PageTab_C_UpdateTabColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, CallFunc_GetMeshUIColor_Color) == 0x000014, "Member 'WIDGET_PageTab_C_UpdateTabColor::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WIDGET_PageTab_C_UpdateTabColor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'WIDGET_PageTab_C_UpdateTabColor::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'WIDGET_PageTab_C_UpdateTabColor::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_UpdateTabColor, K2Node_Select_Default) == 0x00002C, "Member 'WIDGET_PageTab_C_UpdateTabColor::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.InitializeTab
// 0x0060 (0x0060 - 0x0000)
struct WIDGET_PageTab_C_InitializeTab final
{
public:
	class APAWN_Hacker_Simple_C*                  PlayerHacker;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_FindItem_FoundItem;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_InitializeTab) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_InitializeTab");
static_assert(sizeof(WIDGET_PageTab_C_InitializeTab) == 0x000060, "Wrong size on WIDGET_PageTab_C_InitializeTab");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, PlayerHacker) == 0x000000, "Member 'WIDGET_PageTab_C_InitializeTab::PlayerHacker' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WIDGET_PageTab_C_InitializeTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_GetBagByType_Bag) == 0x000020, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_FindItem_FoundItem) == 0x000038, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_FindItem_FoundItem' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000040, "Member 'WIDGET_PageTab_C_InitializeTab::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WIDGET_PageTab_C_InitializeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_IsValidClass_ReturnValue) == 0x00004A, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_InitializeTab, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1) == 0x000058, "Member 'WIDGET_PageTab_C_InitializeTab::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function WIDGET_PageTab.WIDGET_PageTab_C.EVENT_OnHardwareBagChanged
// 0x0038 (0x0038 - 0x0000)
struct WIDGET_PageTab_C_EVENT_OnHardwareBagChanged final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           SlotItem;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged) == 0x000008, "Wrong alignment on WIDGET_PageTab_C_EVENT_OnHardwareBagChanged");
static_assert(sizeof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged) == 0x000038, "Wrong size on WIDGET_PageTab_C_EVENT_OnHardwareBagChanged");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, SlotIndex) == 0x000000, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, SlotItem) == 0x000008, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::SlotItem' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, CallFunc_ClassIsChildOf_ReturnValue) == 0x000029, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_PageTab_C_EVENT_OnHardwareBagChanged, CallFunc_GetSlotItem_Item) == 0x000030, "Member 'WIDGET_PageTab_C_EVENT_OnHardwareBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");

}

