#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_GameOverScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_GameOverScreen.WIDGET_GameOverScreen_C
// 0x0090 (0x02F0 - 0x0260)
class UWIDGET_GameOverScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_RevealGameOver;                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Darkener;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_SubScreenFadeBG;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_GameOverSubtitle;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CrosshairCursor_C*              WIDGET_CrosshairCursor;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenu_GameOverScreenList_C*  WIDGET_MainMenu_GameOverScreenList;                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveLoadMenu_C*                 WIDGET_SaveLoadMenu;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SkipCinematicMeter_C*           WIDGET_SkipCinematicMeter;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Subtitles_C*                    WIDGET_Subtitles;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStreamingSaveGameProfile*              ContinueSaveGameProfile;                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MenuSelectedIndex;                                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MenuItemCount;                                     // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                OpenedSubScreen;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          CON_Hacker_Ref;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PreviousMousePosition;                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_PlayerGhost_C*                    PAWNPlayerGhost;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequenceDirector*                 GameOverSequenceDirector;                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   NewVar_0;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_GameOverScreen(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__WIDGET_GameOverScreen_WIDGET_MainMenu_GameOverScreenList_K2Node_ComponentBoundEvent_3_OnMenuAction__DelegateSignature(const class FString& Message);
	void OnInitialized();
	void RefreshContinueAutosave();
	void SetDefaultStates();
	void OnGameOverRevealFinish();
	void ToggleCursor(bool CursorEnabled);
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);
	void ReturnFromSubScreen();
	void EVENT_OnUsingGamepadChanged(bool IsUsingGamepad);
	void EVENT_TrySkipSequence();
	void EVENT_CancelSkipSequence();
	void RevealGameOver();
	void EVENT_TriggerSkipSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_GameOverScreen_C">();
	}
	static class UWIDGET_GameOverScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_GameOverScreen_C>();
	}
};
static_assert(alignof(UWIDGET_GameOverScreen_C) == 0x000008, "Wrong alignment on UWIDGET_GameOverScreen_C");
static_assert(sizeof(UWIDGET_GameOverScreen_C) == 0x0002F0, "Wrong size on UWIDGET_GameOverScreen_C");
static_assert(offsetof(UWIDGET_GameOverScreen_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_GameOverScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, ANIM_RevealGameOver) == 0x000268, "Member 'UWIDGET_GameOverScreen_C::ANIM_RevealGameOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, IMG_Darkener) == 0x000270, "Member 'UWIDGET_GameOverScreen_C::IMG_Darkener' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, IMG_SubScreenFadeBG) == 0x000278, "Member 'UWIDGET_GameOverScreen_C::IMG_SubScreenFadeBG' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, TEXT_GameOverSubtitle) == 0x000280, "Member 'UWIDGET_GameOverScreen_C::TEXT_GameOverSubtitle' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, WIDGET_CrosshairCursor) == 0x000288, "Member 'UWIDGET_GameOverScreen_C::WIDGET_CrosshairCursor' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, WIDGET_MainMenu_GameOverScreenList) == 0x000290, "Member 'UWIDGET_GameOverScreen_C::WIDGET_MainMenu_GameOverScreenList' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, WIDGET_SaveLoadMenu) == 0x000298, "Member 'UWIDGET_GameOverScreen_C::WIDGET_SaveLoadMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, WIDGET_SkipCinematicMeter) == 0x0002A0, "Member 'UWIDGET_GameOverScreen_C::WIDGET_SkipCinematicMeter' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, WIDGET_Subtitles) == 0x0002A8, "Member 'UWIDGET_GameOverScreen_C::WIDGET_Subtitles' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, ContinueSaveGameProfile) == 0x0002B0, "Member 'UWIDGET_GameOverScreen_C::ContinueSaveGameProfile' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, MenuSelectedIndex) == 0x0002B8, "Member 'UWIDGET_GameOverScreen_C::MenuSelectedIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, MenuItemCount) == 0x0002BC, "Member 'UWIDGET_GameOverScreen_C::MenuItemCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, OpenedSubScreen) == 0x0002C0, "Member 'UWIDGET_GameOverScreen_C::OpenedSubScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, CON_Hacker_Ref) == 0x0002C8, "Member 'UWIDGET_GameOverScreen_C::CON_Hacker_Ref' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, PreviousMousePosition) == 0x0002D0, "Member 'UWIDGET_GameOverScreen_C::PreviousMousePosition' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, PAWNPlayerGhost) == 0x0002D8, "Member 'UWIDGET_GameOverScreen_C::PAWNPlayerGhost' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, GameOverSequenceDirector) == 0x0002E0, "Member 'UWIDGET_GameOverScreen_C::GameOverSequenceDirector' has a wrong offset!");
static_assert(offsetof(UWIDGET_GameOverScreen_C, NewVar_0) == 0x0002E8, "Member 'UWIDGET_GameOverScreen_C::NewVar_0' has a wrong offset!");

}

