#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_InGameList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuListBase_classes.hpp"
#include "ENUM_MainMenuSubScreens_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C
// 0x0068 (0x0330 - 0x02C8)
class UWIDGET_MainMenu_InGameList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           MainMenu_ItemsList;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DebugTrigger;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TriOp;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_MainMenu;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_LoadGame;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Options;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Quit;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_QuitToTitle;                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Resume;                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_SaveGame;                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMainMenuItemSelected;                            // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnMainMenuItemSelected__DelegateSignature(ENUM_MainMenuSubScreens Result, const struct FPointerEvent& InputEvent);
	void ExecuteUbergraph_WIDGET_MainMenu_InGameList(int32 EntryPoint);
	void Construct();
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void OnListClose();
	void OnListOpen();
	struct FEventReply EVENT_MouseDown_MeshDebugTrigger(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MainMenu_InGameList_C">();
	}
	static class UWIDGET_MainMenu_InGameList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MainMenu_InGameList_C>();
	}
};
static_assert(alignof(UWIDGET_MainMenu_InGameList_C) == 0x000008, "Wrong alignment on UWIDGET_MainMenu_InGameList_C");
static_assert(sizeof(UWIDGET_MainMenu_InGameList_C) == 0x000330, "Wrong size on UWIDGET_MainMenu_InGameList_C");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, UberGraphFrame) == 0x0002C8, "Member 'UWIDGET_MainMenu_InGameList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, MainMenu_ItemsList) == 0x0002D0, "Member 'UWIDGET_MainMenu_InGameList_C::MainMenu_ItemsList' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, MESH_DebugTrigger) == 0x0002D8, "Member 'UWIDGET_MainMenu_InGameList_C::MESH_DebugTrigger' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, MESH_TriOp) == 0x0002E0, "Member 'UWIDGET_MainMenu_InGameList_C::MESH_TriOp' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, PANEL_MainMenu) == 0x0002E8, "Member 'UWIDGET_MainMenu_InGameList_C::PANEL_MainMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_LoadGame) == 0x0002F0, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_LoadGame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_Options) == 0x0002F8, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_Options' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_Quit) == 0x000300, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_Quit' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_QuitToTitle) == 0x000308, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_QuitToTitle' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_Resume) == 0x000310, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_Resume' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, WIDGET_MainMenuButton_SaveGame) == 0x000318, "Member 'UWIDGET_MainMenu_InGameList_C::WIDGET_MainMenuButton_SaveGame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGameList_C, OnMainMenuItemSelected) == 0x000320, "Member 'UWIDGET_MainMenu_InGameList_C::OnMainMenuItemSelected' has a wrong offset!");

}

