#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_Waypoints

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_Automap_Waypoints.WIDGET_Automap_Waypoints_C.ExecuteUbergraph_WIDGET_Automap_Waypoints
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints) == 0x000004, "Wrong alignment on WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints");
static_assert(sizeof(WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints) == 0x000008, "Wrong size on WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints, EntryPoint) == 0x000000, "Member 'WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints, CallFunc_GetMeshUIColor_Color) == 0x000004, "Member 'WIDGET_Automap_Waypoints_C_ExecuteUbergraph_WIDGET_Automap_Waypoints::CallFunc_GetMeshUIColor_Color' has a wrong offset!");

// Function WIDGET_Automap_Waypoints.WIDGET_Automap_Waypoints_C.InitializeWaypoints
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Automap_Waypoints_C_InitializeWaypoints final
{
public:
	class UWIDGET_AutoMap_C*                      Automap_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Automap_Waypoints_C_InitializeWaypoints) == 0x000008, "Wrong alignment on WIDGET_Automap_Waypoints_C_InitializeWaypoints");
static_assert(sizeof(WIDGET_Automap_Waypoints_C_InitializeWaypoints) == 0x000008, "Wrong size on WIDGET_Automap_Waypoints_C_InitializeWaypoints");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_InitializeWaypoints, Automap_0) == 0x000000, "Member 'WIDGET_Automap_Waypoints_C_InitializeWaypoints::Automap_0' has a wrong offset!");

// Function WIDGET_Automap_Waypoints.WIDGET_Automap_Waypoints_C.SetActiveWaypointElement
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_Automap_Waypoints_C_SetActiveWaypointElement final
{
public:
	class UWIDGET_Automap_WaypointElement_C*      WaypointElement;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Automap_Waypoints_C_SetActiveWaypointElement) == 0x000008, "Wrong alignment on WIDGET_Automap_Waypoints_C_SetActiveWaypointElement");
static_assert(sizeof(WIDGET_Automap_Waypoints_C_SetActiveWaypointElement) == 0x000010, "Wrong size on WIDGET_Automap_Waypoints_C_SetActiveWaypointElement");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_SetActiveWaypointElement, WaypointElement) == 0x000000, "Member 'WIDGET_Automap_Waypoints_C_SetActiveWaypointElement::WaypointElement' has a wrong offset!");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_SetActiveWaypointElement, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WIDGET_Automap_Waypoints_C_SetActiveWaypointElement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_SetActiveWaypointElement, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WIDGET_Automap_Waypoints_C_SetActiveWaypointElement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WIDGET_Automap_Waypoints.WIDGET_Automap_Waypoints_C.ReceiveWaypointInput
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_Automap_Waypoints_C_ReceiveWaypointInput final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Automap_Waypoints_C_ReceiveWaypointInput) == 0x000004, "Wrong alignment on WIDGET_Automap_Waypoints_C_ReceiveWaypointInput");
static_assert(sizeof(WIDGET_Automap_Waypoints_C_ReceiveWaypointInput) == 0x000010, "Wrong size on WIDGET_Automap_Waypoints_C_ReceiveWaypointInput");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_ReceiveWaypointInput, WorldLocation) == 0x000000, "Member 'WIDGET_Automap_Waypoints_C_ReceiveWaypointInput::WorldLocation' has a wrong offset!");
static_assert(offsetof(WIDGET_Automap_Waypoints_C_ReceiveWaypointInput, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WIDGET_Automap_Waypoints_C_ReceiveWaypointInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

