#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_CyberspacePowerUp

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_CyberspacePowerUp.WIDGET_CyberspacePowerUp_C
// 0x0018 (0x0278 - 0x0260)
class UWIDGET_CyberspacePowerUp_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        GridMeshWidget_166;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESHMinusPowerupTimer;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESHMinusPowerupTimerBackplate;                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_CyberspacePowerUp_C">();
	}
	static class UWIDGET_CyberspacePowerUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_CyberspacePowerUp_C>();
	}
};
static_assert(alignof(UWIDGET_CyberspacePowerUp_C) == 0x000008, "Wrong alignment on UWIDGET_CyberspacePowerUp_C");
static_assert(sizeof(UWIDGET_CyberspacePowerUp_C) == 0x000278, "Wrong size on UWIDGET_CyberspacePowerUp_C");
static_assert(offsetof(UWIDGET_CyberspacePowerUp_C, GridMeshWidget_166) == 0x000260, "Member 'UWIDGET_CyberspacePowerUp_C::GridMeshWidget_166' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspacePowerUp_C, MESHMinusPowerupTimer) == 0x000268, "Member 'UWIDGET_CyberspacePowerUp_C::MESHMinusPowerupTimer' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspacePowerUp_C, MESHMinusPowerupTimerBackplate) == 0x000270, "Member 'UWIDGET_CyberspacePowerUp_C::MESHMinusPowerupTimerBackplate' has a wrong offset!");

}

