#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_InGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_MainMenuSubScreens_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_GameDifficulty_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MainMenu_InGame.WIDGET_MainMenu_InGame_C
// 0x0090 (0x02F0 - 0x0260)
class UWIDGET_MainMenu_InGame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_MainMenu_Dim;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_MainMenuAndDarkener_FadeOut;                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_MainMenuAndDarkener_FadeIn;                   // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CANVAS_CountdownTimer;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Darkener;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_MissionTimeCountdown;                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_DebugMenu_C*                    WIDGET_DebugMenu;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_DifficultyHexagonIcon_C*        WIDGET_DifficultyHexagonIcon;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenu_InGameList_C*          WIDGET_MainMenu_InGameList;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsScreen_C*                WIDGET_OptionsScreen;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_AlertConfirmation_C*            WIDGET_QuitToDesktop_AlertConfirmation;            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_AlertConfirmation_C*            WIDGET_QuitToTitle_AlertConfirmation;              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveLoadMenu_C*                 WIDGET_SaveLoadMenu;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SubMenu_Header_C*               WIDGET_SubMenu_Header;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            PlayerHUD;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMainMenuEnabled;                                 // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSubMenuOpen;                                     // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ENUM_MainMenuSubScreens                       MenuState;                                         // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                OpenedSubScreen;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MainMenu_InGame(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_DebugMenu_K2Node_ComponentBoundEvent_3_OnMenuClosed__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_DebugMenu_K2Node_ComponentBoundEvent_2_OnMenuOpened__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void OpenDebugMenu();
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_MainMenu_InGameList_K2Node_ComponentBoundEvent_8_OnMenuAction__DelegateSignature(const class FString& Message);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_SaveLoadMenu_K2Node_ComponentBoundEvent_7_OnMenuClosed__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_SaveLoadMenu_K2Node_ComponentBoundEvent_0_OnMenuOpened__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_OptionsScreen_K2Node_ComponentBoundEvent_6_OnSubMenuClosed__DelegateSignature(class UWIDGET_MenuBase_C* SubMenu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_OptionsScreen_K2Node_ComponentBoundEvent_5_OnSubMenuOpened__DelegateSignature(class UWIDGET_MenuBase_C* SubMenu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_OptionsScreen_K2Node_ComponentBoundEvent_4_OnMenuClosed__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_OptionsScreen_K2Node_ComponentBoundEvent_1_OnMenuOpened__DelegateSignature(class UWIDGET_MenuBase_C* Menu);
	void OnInitialized();
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_QuitToDesktop_AlertConfirmation_K2Node_ComponentBoundEvent_15_OnClickBack__DelegateSignature();
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_QuitToDesktop_AlertConfirmation_K2Node_ComponentBoundEvent_14_OnClickAccept__DelegateSignature();
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_QuitToDesktop_AlertConfirmation_K2Node_ComponentBoundEvent_13_OnClickBack__DelegateSignature();
	void BndEvt__WIDGET_MainMenu_InGame_WIDGET_QuitToDesktop_AlertConfirmation_K2Node_ComponentBoundEvent_12_OnClickAccept__DelegateSignature();
	void SetPlayerHUD(class UUserWidget* Widget);
	void ToggleMainMenu();
	void TrySetMainMenuEnabled(bool NewState, bool PlayAnimation_0, bool* Result);
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);
	void OpenQuitToTitleConfirmationModal();
	void CloseQuitToTitleConfirmationModal();
	void OpenQuitToDesktopConfirmationModal();
	void CloseQuitToDesktopConfirmationModal();
	void SetMenuDim(bool IsDimmed);
	void ReturnFromSubScreen();
	void RefreshLoadGameState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MainMenu_InGame_C">();
	}
	static class UWIDGET_MainMenu_InGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MainMenu_InGame_C>();
	}
};
static_assert(alignof(UWIDGET_MainMenu_InGame_C) == 0x000008, "Wrong alignment on UWIDGET_MainMenu_InGame_C");
static_assert(sizeof(UWIDGET_MainMenu_InGame_C) == 0x0002F0, "Wrong size on UWIDGET_MainMenu_InGame_C");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MainMenu_InGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, ANIM_MainMenu_Dim) == 0x000268, "Member 'UWIDGET_MainMenu_InGame_C::ANIM_MainMenu_Dim' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, ANIM_MainMenuAndDarkener_FadeOut) == 0x000270, "Member 'UWIDGET_MainMenu_InGame_C::ANIM_MainMenuAndDarkener_FadeOut' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, ANIM_MainMenuAndDarkener_FadeIn) == 0x000278, "Member 'UWIDGET_MainMenu_InGame_C::ANIM_MainMenuAndDarkener_FadeIn' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, CANVAS_CountdownTimer) == 0x000280, "Member 'UWIDGET_MainMenu_InGame_C::CANVAS_CountdownTimer' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, IMG_Darkener) == 0x000288, "Member 'UWIDGET_MainMenu_InGame_C::IMG_Darkener' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, TEXT_MissionTimeCountdown) == 0x000290, "Member 'UWIDGET_MainMenu_InGame_C::TEXT_MissionTimeCountdown' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_DebugMenu) == 0x000298, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_DebugMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_DifficultyHexagonIcon) == 0x0002A0, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_DifficultyHexagonIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_MainMenu_InGameList) == 0x0002A8, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_MainMenu_InGameList' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_OptionsScreen) == 0x0002B0, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_OptionsScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_QuitToDesktop_AlertConfirmation) == 0x0002B8, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_QuitToDesktop_AlertConfirmation' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_QuitToTitle_AlertConfirmation) == 0x0002C0, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_QuitToTitle_AlertConfirmation' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_SaveLoadMenu) == 0x0002C8, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_SaveLoadMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, WIDGET_SubMenu_Header) == 0x0002D0, "Member 'UWIDGET_MainMenu_InGame_C::WIDGET_SubMenu_Header' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, PlayerHUD) == 0x0002D8, "Member 'UWIDGET_MainMenu_InGame_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, IsMainMenuEnabled) == 0x0002E0, "Member 'UWIDGET_MainMenu_InGame_C::IsMainMenuEnabled' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, IsSubMenuOpen) == 0x0002E1, "Member 'UWIDGET_MainMenu_InGame_C::IsSubMenuOpen' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, MenuState) == 0x0002E2, "Member 'UWIDGET_MainMenu_InGame_C::MenuState' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_InGame_C, OpenedSubScreen) == 0x0002E8, "Member 'UWIDGET_MainMenu_InGame_C::OpenedSubScreen' has a wrong offset!");

}

