#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_TargetID_TargetStatus

#include "Basic.hpp"

#include "ENUM_MeshColor_structs.hpp"
#include "ENUM_TargetID_TargetStatus_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_TargetID_TargetStatus.WIDGET_TargetID_TargetStatus_C.EVENT_OnHackingProgressChanged
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged final
{
public:
	float                                         HackingProgress;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged) == 0x000008, "Wrong alignment on WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged");
static_assert(sizeof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged) == 0x000018, "Wrong size on WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged, HackingProgress) == 0x000000, "Member 'WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged::HackingProgress' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WIDGET_TargetID_TargetStatus_C_EVENT_OnHackingProgressChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_TargetID_TargetStatus.WIDGET_TargetID_TargetStatus_C.GetCurrentStatus
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_TargetID_TargetStatus_C_GetCurrentStatus final
{
public:
	ENUM_TargetID_TargetStatus                    Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_TargetID_TargetStatus_C_GetCurrentStatus) == 0x000001, "Wrong alignment on WIDGET_TargetID_TargetStatus_C_GetCurrentStatus");
static_assert(sizeof(WIDGET_TargetID_TargetStatus_C_GetCurrentStatus) == 0x000001, "Wrong size on WIDGET_TargetID_TargetStatus_C_GetCurrentStatus");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_GetCurrentStatus, Result) == 0x000000, "Member 'WIDGET_TargetID_TargetStatus_C_GetCurrentStatus::Result' has a wrong offset!");

// Function WIDGET_TargetID_TargetStatus.WIDGET_TargetID_TargetStatus_C.UpdateTargetStatus
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus final
{
public:
	ENUM_TargetID_TargetStatus                    TargetIDState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MeshColor                                Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TargetID_TargetStatus                    Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEnumText_TargetIDTargetStatus_EnumText; // 0x0010(0x0018)()
	ENUM_MeshColor                                K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus) == 0x000008, "Wrong alignment on WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus");
static_assert(sizeof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus) == 0x000050, "Wrong size on WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, TargetIDState) == 0x000000, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::TargetIDState' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Color) == 0x000004, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Color' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable) == 0x000008, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_1) == 0x000009, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_2) == 0x00000A, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_3) == 0x00000B, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_4) == 0x00000C, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_5) == 0x00000D, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_6) == 0x00000E, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, Temp_byte_Variable_7) == 0x00000F, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, CallFunc_GetEnumText_TargetIDTargetStatus_EnumText) == 0x000010, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::CallFunc_GetEnumText_TargetIDTargetStatus_EnumText' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, K2Node_Select_Default) == 0x000028, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, CallFunc_GetMeshUIColor_Color) == 0x00002C, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000030, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WIDGET_TargetID_TargetStatus_C_UpdateTargetStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_TargetID_TargetStatus.WIDGET_TargetID_TargetStatus_C.SetHackingEventBindings
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings final
{
public:
	class UHARDWARE_TargetIdentifier_Base_C*      TargetIdenfitierItem;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Progress)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings) == 0x000008, "Wrong alignment on WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings");
static_assert(sizeof(WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings) == 0x000018, "Wrong size on WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings, TargetIdenfitierItem) == 0x000000, "Member 'WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings::TargetIdenfitierItem' has a wrong offset!");
static_assert(offsetof(WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WIDGET_TargetID_TargetStatus_C_SetHackingEventBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

