#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DifficultyHexagonButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DifficultyHexagonButton.WIDGET_DifficultyHexagonButton_C
// 0x0070 (0x02D0 - 0x0260)
class UWIDGET_DifficultyHexagonButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMAGE_SettingHex_Plate;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_InputRegion;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Setting_Number;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Setting_Number_Selected;                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Highlighted;                                       // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_DifficultyHexagonLayout_C*      PARENT_HexagonLayout;                              // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Hovered;                                           // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HexagonNumber;                                     // 0x02A0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnSelectNewDifficulty;                             // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         IndexInList;                                       // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AudioVolumeMultiplier;                             // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSelectNewDifficulty__DelegateSignature(int32 IndexInList_0);
	void ExecuteUbergraph_WIDGET_DifficultyHexagonButton(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SelectedHandler();
	void SetSelected(bool Selected_0);
	void SetHighlighted(bool Highlighted_0);
	void HighlightedHandler();
	struct FEventReply EVENT_MouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetDisabled(bool Disabled_0);
	void OnDisabled();
	void EVENT_MouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetHovered(bool Hovered_0);
	void HoveredHandler();
	void EVENT_MouseExit(const struct FPointerEvent& MouseEvent);
	void SetIndexInList(int32 DifficultyHexIndex);
	void SetVolumeMultiplier(float Value);
	void UpdateNumber(const class FText& Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DifficultyHexagonButton_C">();
	}
	static class UWIDGET_DifficultyHexagonButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DifficultyHexagonButton_C>();
	}
};
static_assert(alignof(UWIDGET_DifficultyHexagonButton_C) == 0x000008, "Wrong alignment on UWIDGET_DifficultyHexagonButton_C");
static_assert(sizeof(UWIDGET_DifficultyHexagonButton_C) == 0x0002D0, "Wrong size on UWIDGET_DifficultyHexagonButton_C");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_DifficultyHexagonButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, IMAGE_SettingHex_Plate) == 0x000268, "Member 'UWIDGET_DifficultyHexagonButton_C::IMAGE_SettingHex_Plate' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, MESH_InputRegion) == 0x000270, "Member 'UWIDGET_DifficultyHexagonButton_C::MESH_InputRegion' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, TEXT_Setting_Number) == 0x000278, "Member 'UWIDGET_DifficultyHexagonButton_C::TEXT_Setting_Number' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, TEXT_Setting_Number_Selected) == 0x000280, "Member 'UWIDGET_DifficultyHexagonButton_C::TEXT_Setting_Number_Selected' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, Selected) == 0x000288, "Member 'UWIDGET_DifficultyHexagonButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, Highlighted) == 0x000289, "Member 'UWIDGET_DifficultyHexagonButton_C::Highlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, PARENT_HexagonLayout) == 0x000290, "Member 'UWIDGET_DifficultyHexagonButton_C::PARENT_HexagonLayout' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, Disabled) == 0x000298, "Member 'UWIDGET_DifficultyHexagonButton_C::Disabled' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, Hovered) == 0x000299, "Member 'UWIDGET_DifficultyHexagonButton_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, HexagonNumber) == 0x0002A0, "Member 'UWIDGET_DifficultyHexagonButton_C::HexagonNumber' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, OnSelectNewDifficulty) == 0x0002B8, "Member 'UWIDGET_DifficultyHexagonButton_C::OnSelectNewDifficulty' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, IndexInList) == 0x0002C8, "Member 'UWIDGET_DifficultyHexagonButton_C::IndexInList' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyHexagonButton_C, AudioVolumeMultiplier) == 0x0002CC, "Member 'UWIDGET_DifficultyHexagonButton_C::AudioVolumeMultiplier' has a wrong offset!");

}

