#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubDetails_Story

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_SubDetails_Story.WIDGET_SubDetails_Story_C.ExecuteUbergraph_WIDGET_SubDetails_Story
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story) == 0x000004, "Wrong alignment on WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story");
static_assert(sizeof(WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story) == 0x000004, "Wrong size on WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story");
static_assert(offsetof(WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story, EntryPoint) == 0x000000, "Member 'WIDGET_SubDetails_Story_C_ExecuteUbergraph_WIDGET_SubDetails_Story::EntryPoint' has a wrong offset!");

// Function WIDGET_SubDetails_Story.WIDGET_SubDetails_Story_C.GetAmmoDetails
// 0x000C (0x000C - 0x0000)
struct WIDGET_SubDetails_Story_C_GetAmmoDetails final
{
public:
	bool                                          ShowAmmo;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountInClip;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CountInInventory;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubDetails_Story_C_GetAmmoDetails) == 0x000004, "Wrong alignment on WIDGET_SubDetails_Story_C_GetAmmoDetails");
static_assert(sizeof(WIDGET_SubDetails_Story_C_GetAmmoDetails) == 0x00000C, "Wrong size on WIDGET_SubDetails_Story_C_GetAmmoDetails");
static_assert(offsetof(WIDGET_SubDetails_Story_C_GetAmmoDetails, ShowAmmo) == 0x000000, "Member 'WIDGET_SubDetails_Story_C_GetAmmoDetails::ShowAmmo' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_GetAmmoDetails, CountInClip) == 0x000004, "Member 'WIDGET_SubDetails_Story_C_GetAmmoDetails::CountInClip' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_GetAmmoDetails, CountInInventory) == 0x000008, "Member 'WIDGET_SubDetails_Story_C_GetAmmoDetails::CountInInventory' has a wrong offset!");

// Function WIDGET_SubDetails_Story.WIDGET_SubDetails_Story_C.InitializeItemDetails
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_SubDetails_Story_C_InitializeItemDetails final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_InventoryDetails_C*             InventoryDetails;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Story_Base_C*                     StoryItem;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubDetails_Story_C_InitializeItemDetails) == 0x000008, "Wrong alignment on WIDGET_SubDetails_Story_C_InitializeItemDetails");
static_assert(sizeof(WIDGET_SubDetails_Story_C_InitializeItemDetails) == 0x000028, "Wrong size on WIDGET_SubDetails_Story_C_InitializeItemDetails");
static_assert(offsetof(WIDGET_SubDetails_Story_C_InitializeItemDetails, Item) == 0x000000, "Member 'WIDGET_SubDetails_Story_C_InitializeItemDetails::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_InitializeItemDetails, InventoryDetails) == 0x000008, "Member 'WIDGET_SubDetails_Story_C_InitializeItemDetails::InventoryDetails' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_InitializeItemDetails, Result) == 0x000010, "Member 'WIDGET_SubDetails_Story_C_InitializeItemDetails::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_InitializeItemDetails, StoryItem) == 0x000018, "Member 'WIDGET_SubDetails_Story_C_InitializeItemDetails::StoryItem' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Story_C_InitializeItemDetails, CallFunc_GetObjectClass_ReturnValue) == 0x000020, "Member 'WIDGET_SubDetails_Story_C_InitializeItemDetails::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");

// Function WIDGET_SubDetails_Story.WIDGET_SubDetails_Story_C.ShowExtendedDetails
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SubDetails_Story_C_ShowExtendedDetails final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubDetails_Story_C_ShowExtendedDetails) == 0x000001, "Wrong alignment on WIDGET_SubDetails_Story_C_ShowExtendedDetails");
static_assert(sizeof(WIDGET_SubDetails_Story_C_ShowExtendedDetails) == 0x000001, "Wrong size on WIDGET_SubDetails_Story_C_ShowExtendedDetails");
static_assert(offsetof(WIDGET_SubDetails_Story_C_ShowExtendedDetails, Show) == 0x000000, "Member 'WIDGET_SubDetails_Story_C_ShowExtendedDetails::Show' has a wrong offset!");

// Function WIDGET_SubDetails_Story.WIDGET_SubDetails_Story_C.ShowBars
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SubDetails_Story_C_ShowBars final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubDetails_Story_C_ShowBars) == 0x000001, "Wrong alignment on WIDGET_SubDetails_Story_C_ShowBars");
static_assert(sizeof(WIDGET_SubDetails_Story_C_ShowBars) == 0x000001, "Wrong size on WIDGET_SubDetails_Story_C_ShowBars");
static_assert(offsetof(WIDGET_SubDetails_Story_C_ShowBars, Show) == 0x000000, "Member 'WIDGET_SubDetails_Story_C_ShowBars::Show' has a wrong offset!");

}

