#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubDetails_Ammo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SubDetails_Ammo.WIDGET_SubDetails_Ammo_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_SubDetails_Ammo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextMeshWidget*                        TEXT_ArmorPenetration_Details;                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_AttackType_Details;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Damage_Details;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_UsedBy_DetailsA;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_UsedBy_DetailsB;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_SubDetails_Ammo(int32 EntryPoint);
	void OnHideItemDetails();
	void OnShowItemDetails();
	void GetWeaponModeForAmmo(class UAMMO_ITEM_Base_C* Ammo, struct FSTRUCT_WeaponMode* Mode);
	void GetDamageText(class UAMMO_ITEM_Base_C* Ammo, const struct FSTRUCT_WeaponMode& Mode, class FText* Result);
	void GetAmmoDetails(bool* ShowAmmo, int32* CountInClip, int32* CountInInventory);
	void InitializeItemDetails(class UITEM_Base_C* Item, class UWIDGET_InventoryDetails_C* InventoryDetails, bool* Result);
	void ShowExtendedDetails(bool* Show);
	void ShowBars(bool* Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SubDetails_Ammo_C">();
	}
	static class UWIDGET_SubDetails_Ammo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SubDetails_Ammo_C>();
	}
};
static_assert(alignof(UWIDGET_SubDetails_Ammo_C) == 0x000008, "Wrong alignment on UWIDGET_SubDetails_Ammo_C");
static_assert(sizeof(UWIDGET_SubDetails_Ammo_C) == 0x000290, "Wrong size on UWIDGET_SubDetails_Ammo_C");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SubDetails_Ammo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, TEXT_ArmorPenetration_Details) == 0x000268, "Member 'UWIDGET_SubDetails_Ammo_C::TEXT_ArmorPenetration_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, TEXT_AttackType_Details) == 0x000270, "Member 'UWIDGET_SubDetails_Ammo_C::TEXT_AttackType_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, TEXT_Damage_Details) == 0x000278, "Member 'UWIDGET_SubDetails_Ammo_C::TEXT_Damage_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, TEXT_UsedBy_DetailsA) == 0x000280, "Member 'UWIDGET_SubDetails_Ammo_C::TEXT_UsedBy_DetailsA' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Ammo_C, TEXT_UsedBy_DetailsB) == 0x000288, "Member 'UWIDGET_SubDetails_Ammo_C::TEXT_UsedBy_DetailsB' has a wrong offset!");

}

