#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_BroadcastScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_BroadcastScreen.WIDGET_BroadcastScreen_C.UpdateContent
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BroadcastScreen_C_UpdateContent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateContent_IsFinished;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_BroadcastScreen_C_UpdateContent) == 0x000004, "Wrong alignment on WIDGET_BroadcastScreen_C_UpdateContent");
static_assert(sizeof(WIDGET_BroadcastScreen_C_UpdateContent) == 0x000008, "Wrong size on WIDGET_BroadcastScreen_C_UpdateContent");
static_assert(offsetof(WIDGET_BroadcastScreen_C_UpdateContent, DeltaTime) == 0x000000, "Member 'WIDGET_BroadcastScreen_C_UpdateContent::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_UpdateContent, IsFinished) == 0x000004, "Member 'WIDGET_BroadcastScreen_C_UpdateContent::IsFinished' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_UpdateContent, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WIDGET_BroadcastScreen_C_UpdateContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_UpdateContent, CallFunc_UpdateContent_IsFinished) == 0x000006, "Member 'WIDGET_BroadcastScreen_C_UpdateContent::CallFunc_UpdateContent_IsFinished' has a wrong offset!");

// Function WIDGET_BroadcastScreen.WIDGET_BroadcastScreen_C.PlayBroadcast
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_BroadcastScreen_C_PlayBroadcast final
{
public:
	class UVoxelAudioComponent*                   AudioComponent_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Content;                                           // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector2D                              DrawSize;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      Result;                                            // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      CallFunc_CreateBroadcast_Result;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BroadcastScreen_C_PlayBroadcast) == 0x000008, "Wrong alignment on WIDGET_BroadcastScreen_C_PlayBroadcast");
static_assert(sizeof(WIDGET_BroadcastScreen_C_PlayBroadcast) == 0x000048, "Wrong size on WIDGET_BroadcastScreen_C_PlayBroadcast");
static_assert(offsetof(WIDGET_BroadcastScreen_C_PlayBroadcast, AudioComponent_0) == 0x000000, "Member 'WIDGET_BroadcastScreen_C_PlayBroadcast::AudioComponent_0' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_PlayBroadcast, Content) == 0x000008, "Member 'WIDGET_BroadcastScreen_C_PlayBroadcast::Content' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_PlayBroadcast, DrawSize) == 0x000030, "Member 'WIDGET_BroadcastScreen_C_PlayBroadcast::DrawSize' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_PlayBroadcast, Result) == 0x000038, "Member 'WIDGET_BroadcastScreen_C_PlayBroadcast::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_PlayBroadcast, CallFunc_CreateBroadcast_Result) == 0x000040, "Member 'WIDGET_BroadcastScreen_C_PlayBroadcast::CallFunc_CreateBroadcast_Result' has a wrong offset!");

// Function WIDGET_BroadcastScreen.WIDGET_BroadcastScreen_C.CreateBroadcast
// 0x00A0 (0x00A0 - 0x0000)
struct WIDGET_BroadcastScreen_C_CreateBroadcast final
{
public:
	class UVoxelAudioComponent*                   AudioComponent_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Content;                                           // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector2D                              DrawSize;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      Result;                                            // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBROADCAST_Base;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0070(0x0010)(NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BroadcastScreen_C_CreateBroadcast) == 0x000008, "Wrong alignment on WIDGET_BroadcastScreen_C_CreateBroadcast");
static_assert(sizeof(WIDGET_BroadcastScreen_C_CreateBroadcast) == 0x0000A0, "Wrong size on WIDGET_BroadcastScreen_C_CreateBroadcast");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, AudioComponent_0) == 0x000000, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::AudioComponent_0' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, Content) == 0x000008, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::Content' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, DrawSize) == 0x000030, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::DrawSize' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, Result) == 0x000038, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000040, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, K2Node_ClassDynamicCast_AsBROADCAST_Base) == 0x000048, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::K2Node_ClassDynamicCast_AsBROADCAST_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, K2Node_ClassDynamicCast_bSuccess) == 0x000050, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, K2Node_MakeStruct_Margin) == 0x000060, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, K2Node_MakeStruct_Anchors) == 0x000070, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000088, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_Create_ReturnValue) == 0x000090, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BroadcastScreen_C_CreateBroadcast, CallFunc_AddChild_ReturnValue) == 0x000098, "Member 'WIDGET_BroadcastScreen_C_CreateBroadcast::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WIDGET_BroadcastScreen.WIDGET_BroadcastScreen_C.ExecuteUbergraph_WIDGET_BroadcastScreen
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen) == 0x000004, "Wrong alignment on WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen");
static_assert(sizeof(WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen) == 0x000004, "Wrong size on WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen");
static_assert(offsetof(WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen, EntryPoint) == 0x000000, "Member 'WIDGET_BroadcastScreen_C_ExecuteUbergraph_WIDGET_BroadcastScreen::EntryPoint' has a wrong offset!");

}

