#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_AlertConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_AlertConfirmation.WIDGET_AlertConfirmation_C
// 0x00A8 (0x0308 - 0x0260)
class UWIDGET_AlertConfirmation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_WarningIcon;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_AlertMessage;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_AlertTextLine1;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_AlertTextLine2;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Back;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Confirm;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AlertMessage;                                      // 0x02A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   AlertTextLine1;                                    // 0x02B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   AlertTextLine2;                                    // 0x02D0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnClickAccept;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClickBack;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnClickAccept__DelegateSignature();
	void OnClickBack__DelegateSignature();
	void ExecuteUbergraph_WIDGET_AlertConfirmation(int32 EntryPoint);
	void BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Confirm_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_AlertConfirmation_WIDGET_ButtonLegend_Back_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void PreConstruct(bool IsDesignTime);
	void TriggerAcceptInput();
	void TriggerBackInput();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_AlertConfirmation_C">();
	}
	static class UWIDGET_AlertConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_AlertConfirmation_C>();
	}
};
static_assert(alignof(UWIDGET_AlertConfirmation_C) == 0x000008, "Wrong alignment on UWIDGET_AlertConfirmation_C");
static_assert(sizeof(UWIDGET_AlertConfirmation_C) == 0x000308, "Wrong size on UWIDGET_AlertConfirmation_C");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_AlertConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, MESH_Background) == 0x000268, "Member 'UWIDGET_AlertConfirmation_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, MESH_WarningIcon) == 0x000270, "Member 'UWIDGET_AlertConfirmation_C::MESH_WarningIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, TEXT_AlertMessage) == 0x000278, "Member 'UWIDGET_AlertConfirmation_C::TEXT_AlertMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, TEXT_AlertTextLine1) == 0x000280, "Member 'UWIDGET_AlertConfirmation_C::TEXT_AlertTextLine1' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, TEXT_AlertTextLine2) == 0x000288, "Member 'UWIDGET_AlertConfirmation_C::TEXT_AlertTextLine2' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, WIDGET_ButtonLegend_Back) == 0x000290, "Member 'UWIDGET_AlertConfirmation_C::WIDGET_ButtonLegend_Back' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, WIDGET_ButtonLegend_Confirm) == 0x000298, "Member 'UWIDGET_AlertConfirmation_C::WIDGET_ButtonLegend_Confirm' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, AlertMessage) == 0x0002A0, "Member 'UWIDGET_AlertConfirmation_C::AlertMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, AlertTextLine1) == 0x0002B8, "Member 'UWIDGET_AlertConfirmation_C::AlertTextLine1' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, AlertTextLine2) == 0x0002D0, "Member 'UWIDGET_AlertConfirmation_C::AlertTextLine2' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, OnClickAccept) == 0x0002E8, "Member 'UWIDGET_AlertConfirmation_C::OnClickAccept' has a wrong offset!");
static_assert(offsetof(UWIDGET_AlertConfirmation_C, OnClickBack) == 0x0002F8, "Member 'UWIDGET_AlertConfirmation_C::OnClickBack' has a wrong offset!");

}

