#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DebugMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuBase_classes.hpp"
#include "UMG_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DebugMenu.WIDGET_DebugMenu_C
// 0x00C0 (0x03C8 - 0x0308)
class UWIDGET_DebugMenu_C final : public UWIDGET_MenuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           PANEL_AchievementDisabled;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PANEL_TrackingList;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusBuyAmmoFromDepot;             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusCollectAllMedia;              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusCollectAllMedia_1;            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusCollectBestHardware;          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusCollectGuns;                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusConsumeJunkFood;              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusDefeatCortexReavers;          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusHackEnemies;                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusInstallModkits;               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusKillWithBerserk;              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusSalvageJunk;                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusSolvePuzzles;                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusUseAllPatches;                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusUsePowerStation;              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementMinusZeroSecurity;                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementDisabledLabel;                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AchievementHeader;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PlatformInfo;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_BackButton;                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_DebugMenuListMain_C*            WIDGET_DebugMenuListMain;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                MainMenu;                                          // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_DebugMenu(int32 EntryPoint);
	void BndEvt__WIDGET_DebugMenu_WIDGET_ButtonLegend_BackButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void Construct();
	void OnInitialized();
	void InitializeMenu(class UWIDGET_MenuBase_C* ParentMenuWidget);
	void SetMainMenu(class UUserWidget* MainMenu_0);
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);
	void OnMenuOpen();
	void GetAchievementData(const struct FDataTableRowHandle& AchievementHandle, class FText* FormattedAchievementText);
	void SetAchievementGranting(bool AchievementGranting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DebugMenu_C">();
	}
	static class UWIDGET_DebugMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DebugMenu_C>();
	}
};
static_assert(alignof(UWIDGET_DebugMenu_C) == 0x000008, "Wrong alignment on UWIDGET_DebugMenu_C");
static_assert(sizeof(UWIDGET_DebugMenu_C) == 0x0003C8, "Wrong size on UWIDGET_DebugMenu_C");
static_assert(offsetof(UWIDGET_DebugMenu_C, UberGraphFrame) == 0x000308, "Member 'UWIDGET_DebugMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, PANEL_AchievementDisabled) == 0x000310, "Member 'UWIDGET_DebugMenu_C::PANEL_AchievementDisabled' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, PANEL_TrackingList) == 0x000318, "Member 'UWIDGET_DebugMenu_C::PANEL_TrackingList' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusBuyAmmoFromDepot) == 0x000320, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusBuyAmmoFromDepot' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusCollectAllMedia) == 0x000328, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusCollectAllMedia' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusCollectAllMedia_1) == 0x000330, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusCollectAllMedia_1' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusCollectBestHardware) == 0x000338, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusCollectBestHardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusCollectGuns) == 0x000340, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusCollectGuns' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusConsumeJunkFood) == 0x000348, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusConsumeJunkFood' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusDefeatCortexReavers) == 0x000350, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusDefeatCortexReavers' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusHackEnemies) == 0x000358, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusHackEnemies' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusInstallModkits) == 0x000360, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusInstallModkits' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusKillWithBerserk) == 0x000368, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusKillWithBerserk' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusSalvageJunk) == 0x000370, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusSalvageJunk' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusSolvePuzzles) == 0x000378, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusSolvePuzzles' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusUseAllPatches) == 0x000380, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusUseAllPatches' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusUsePowerStation) == 0x000388, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusUsePowerStation' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementMinusZeroSecurity) == 0x000390, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementMinusZeroSecurity' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementDisabledLabel) == 0x000398, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementDisabledLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_AchievementHeader) == 0x0003A0, "Member 'UWIDGET_DebugMenu_C::TEXT_AchievementHeader' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, TEXT_PlatformInfo) == 0x0003A8, "Member 'UWIDGET_DebugMenu_C::TEXT_PlatformInfo' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, WIDGET_ButtonLegend_BackButton) == 0x0003B0, "Member 'UWIDGET_DebugMenu_C::WIDGET_ButtonLegend_BackButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, WIDGET_DebugMenuListMain) == 0x0003B8, "Member 'UWIDGET_DebugMenu_C::WIDGET_DebugMenuListMain' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenu_C, MainMenu) == 0x0003C0, "Member 'UWIDGET_DebugMenu_C::MainMenu' has a wrong offset!");

}

