#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MediaListElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MediaListElement.WIDGET_MediaListElement_C
// 0x0088 (0x02E8 - 0x0260)
class UWIDGET_MediaListElement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_BG_Input;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BG_SelectedIndicator;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_AudioLog;                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_Email;                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MediaCategoryIcon_Note;                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_UnreadIndicator;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Date;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_MessagePreview;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Sender;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Subject;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseOver;                                       // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasBeenMousedOver;                                 // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHighlighted;                                     // 0x02C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaPanel_C*                   MediaPanel;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UMaterial*>                      MediaTypeIcons;                                    // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WIDGET_MediaListElement(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void InitializeMediaListElement(class UITEM_MediaBase_C* NewMediaItem, class UWIDGET_PlayerHUD_C* PlayerHUD_0);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void RefreshTextColor();
	void SetMediaSelected(bool IsSelected_0);
	void UpdateMediaListElement();
	void RefreshBackgroundColor();
	void ToggleInteractivity(bool IsInteractive);
	void ReadMedia();
	void SetHighlighted(bool IsHighlighted_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MediaListElement_C">();
	}
	static class UWIDGET_MediaListElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MediaListElement_C>();
	}
};
static_assert(alignof(UWIDGET_MediaListElement_C) == 0x000008, "Wrong alignment on UWIDGET_MediaListElement_C");
static_assert(sizeof(UWIDGET_MediaListElement_C) == 0x0002E8, "Wrong size on UWIDGET_MediaListElement_C");
static_assert(offsetof(UWIDGET_MediaListElement_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MediaListElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_BG_Input) == 0x000268, "Member 'UWIDGET_MediaListElement_C::MESH_BG_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_BG_SelectedIndicator) == 0x000270, "Member 'UWIDGET_MediaListElement_C::MESH_BG_SelectedIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_MediaCategoryIcon_AudioLog) == 0x000278, "Member 'UWIDGET_MediaListElement_C::MESH_MediaCategoryIcon_AudioLog' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_MediaCategoryIcon_Email) == 0x000280, "Member 'UWIDGET_MediaListElement_C::MESH_MediaCategoryIcon_Email' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_MediaCategoryIcon_Note) == 0x000288, "Member 'UWIDGET_MediaListElement_C::MESH_MediaCategoryIcon_Note' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MESH_UnreadIndicator) == 0x000290, "Member 'UWIDGET_MediaListElement_C::MESH_UnreadIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, TEXT_Date) == 0x000298, "Member 'UWIDGET_MediaListElement_C::TEXT_Date' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, TEXT_MessagePreview) == 0x0002A0, "Member 'UWIDGET_MediaListElement_C::TEXT_MessagePreview' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, TEXT_Sender) == 0x0002A8, "Member 'UWIDGET_MediaListElement_C::TEXT_Sender' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, TEXT_Subject) == 0x0002B0, "Member 'UWIDGET_MediaListElement_C::TEXT_Subject' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MediaItem) == 0x0002B8, "Member 'UWIDGET_MediaListElement_C::MediaItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, IsSelected) == 0x0002C0, "Member 'UWIDGET_MediaListElement_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, IsMouseOver) == 0x0002C1, "Member 'UWIDGET_MediaListElement_C::IsMouseOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, HasBeenMousedOver) == 0x0002C2, "Member 'UWIDGET_MediaListElement_C::HasBeenMousedOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, IsHighlighted) == 0x0002C3, "Member 'UWIDGET_MediaListElement_C::IsHighlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MediaPanel) == 0x0002C8, "Member 'UWIDGET_MediaListElement_C::MediaPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, PlayerHUD) == 0x0002D0, "Member 'UWIDGET_MediaListElement_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaListElement_C, MediaTypeIcons) == 0x0002D8, "Member 'UWIDGET_MediaListElement_C::MediaTypeIcons' has a wrong offset!");

}

