#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_CyberspaceHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_MFDTabCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_CyberspaceHUD.WIDGET_CyberspaceHUD_C
// 0x01C8 (0x0428 - 0x0260)
class UWIDGET_CyberspaceHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMAGE_CrosshairCursor;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_CursorBrackets;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_BL;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_BM;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_BR;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_LM;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_RM;                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_TL;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_TM;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DamageIndicator_TR;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Dashboard;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DashboardBottom;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCameraPanelWidget*                     PANEL_Camera;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Crosshairs;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_DamageIndicators;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_InfoMessage;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PrimaryMessage;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_ScanDescription;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_Activatable;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_Equipment;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ConnectionIntegrity_C*          WIDGET_ConnectionIntegrity;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CrosshairCursor_C*              WIDGET_CrosshairCursor;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Cyberspace_FunPakPickupModal_C* WIDGET_Cyberspace_FunPakPickupModal;               // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Cyberspace_SoftwareHotbar_C*    WIDGET_Cyberspace_SoftwareHotbar;                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CyberspaceDataLogPickupModal_C* WIDGET_CyberspaceDataLogPickupModal;               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CyberspaceGreeble_C*            WIDGET_CyberspaceGreeble;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CyberspaceOccularRing_C*        WIDGET_CyberspaceOccularRing;                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_CyberspacePowerUp_C*            WIDGET_CyberspacePowerUp;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_DomainTransferNotice_C*         WIDGET_DomainTransferNotice;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_FlightReticle_C*                WIDGET_FlightReticle;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_IceDrillLockOn_C*               WIDGET_IceDrillLockOn;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenu_InGame_C*              WIDGET_MainMenu_InGame;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SecurityTimer_C*                WIDGET_SecurityTimer;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APAWN_Avatar_C*                         PlayerPawn;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrimaryMessageTimestamp;                           // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrimaryMessageDuration;                            // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StatusMessageTimestamp;                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, int32>                    ItemCountDict;                                     // 0x0398(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         InfoMessageTimestamp;                              // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InfoMessageDuration;                               // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemActivationMessageTimestamp;                    // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemActivationMessageDuration;                     // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FlashIntegrityFailureTextTimer;                    // 0x03F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowStatusMessage_Health;                          // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowStatusMessage_HealthCritical;                  // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowStatusMessage_Time;                            // 0x0402(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowStatusMessage_TimeCritical;                    // 0x0403(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         CurrentHealth;                                     // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecurityTimeRemaining;                             // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StatusMinusHealthLow;                              // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StatusMinusHealthCritical;                         // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HideCrosshairs;                                    // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowMouseCursor;                                   // 0x0413(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextTyper_C*                           TextTyper;                                         // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSecurityTimerActive;                             // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WIDGET_CyberspaceHUD(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitializeCyberspaceUI(class APAWN_Avatar_C* PlayerPawn_0);
	void EVENT_OnInventoryBagChanged(class UInventoryBag_C* Bag, int32 Slot_0);
	void ReceivePrimaryMessage(const class FText& PrimaryMessage);
	void UpdateStatusMessage();
	void EVENT_OnHealthChanged(float Current, float Previous);
	void ReceivedInfoMessage(const class FText& InfoMessage);
	void ReceivedItemActivationMessage(const class FText& ItemActivationMessage);
	void UpdatePrimaryMessage();
	void UpdateInfoMessage();
	void UpdateItemActivationMessage();
	void UpdateCyberspaceUIWidgets();
	void UpdateMessages();
	void GetExternalValues();
	void GetCurrentHealth(float CurrentHealth_0, float PreviousHealth);
	void GetCurrentTime();
	void UpdateSecurityTimer();
	void UpdateIntegrity();
	void UpdateGryoscope();
	void ToggleMainMenu();
	void ShowCrosshairs(bool Visible);
	void UpdateIceDrillLockOn(float Progress);
	void CancelIceDrillLockOn();
	void OnCrosshairVisibilityChanged();
	void EVENT_OnNewSecurityTimerSet();
	void CenterMouseLocation();
	void SetGameLockedForMenus(bool LockGame, bool* Result);
	void OnCharacterDied(const struct FAttribDamageInstance& DamageInstance, bool* Result);
	void OnCharacterRespawned(bool* Result);
	void GetTutorialWidget(class UWIDGET_TutorialMessage_C** Result);
	void GetMainMenuWidget(class UWIDGET_MainMenu_InGame_C** Result);
	void GetCameraPanelWidget(class UCameraPanelWidget** Result);
	void InvokeNavManager(bool InputState, ENUM_MenuNavigationInput InputType, bool* Result);
	void GetSubtitleWidget(class UWIDGET_Subtitles_C** Result);
	void OnStartedLoadingGame(bool* Result);
	void OnFinishedLoadingGame(bool* Result);
	void OnPersistentMapMove(bool* Result);
	void GetMFDState(bool* IsMFDOpen, ENUM_MFDTabCategory* CurrentMFDTab);
	void SetHoldInteractionProgress(float Progress, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_CyberspaceHUD_C">();
	}
	static class UWIDGET_CyberspaceHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_CyberspaceHUD_C>();
	}
};
static_assert(alignof(UWIDGET_CyberspaceHUD_C) == 0x000008, "Wrong alignment on UWIDGET_CyberspaceHUD_C");
static_assert(sizeof(UWIDGET_CyberspaceHUD_C) == 0x000428, "Wrong size on UWIDGET_CyberspaceHUD_C");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_CyberspaceHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, FadeOut) == 0x000268, "Member 'UWIDGET_CyberspaceHUD_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, FadeIn) == 0x000270, "Member 'UWIDGET_CyberspaceHUD_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_CrosshairCursor) == 0x000278, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_CrosshairCursor' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_CursorBrackets) == 0x000280, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_CursorBrackets' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_BL) == 0x000288, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_BL' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_BM) == 0x000290, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_BM' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_BR) == 0x000298, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_BR' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_LM) == 0x0002A0, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_LM' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_RM) == 0x0002A8, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_RM' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_TL) == 0x0002B0, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_TL' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_TM) == 0x0002B8, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_TM' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IMAGE_DamageIndicator_TR) == 0x0002C0, "Member 'UWIDGET_CyberspaceHUD_C::IMAGE_DamageIndicator_TR' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, MESH_Dashboard) == 0x0002C8, "Member 'UWIDGET_CyberspaceHUD_C::MESH_Dashboard' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, MESH_DashboardBottom) == 0x0002D0, "Member 'UWIDGET_CyberspaceHUD_C::MESH_DashboardBottom' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PANEL_Camera) == 0x0002D8, "Member 'UWIDGET_CyberspaceHUD_C::PANEL_Camera' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PANEL_Crosshairs) == 0x0002E0, "Member 'UWIDGET_CyberspaceHUD_C::PANEL_Crosshairs' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PANEL_DamageIndicators) == 0x0002E8, "Member 'UWIDGET_CyberspaceHUD_C::PANEL_DamageIndicators' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, TEXT_InfoMessage) == 0x0002F0, "Member 'UWIDGET_CyberspaceHUD_C::TEXT_InfoMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, TEXT_PrimaryMessage) == 0x0002F8, "Member 'UWIDGET_CyberspaceHUD_C::TEXT_PrimaryMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, TEXT_ScanDescription) == 0x000300, "Member 'UWIDGET_CyberspaceHUD_C::TEXT_ScanDescription' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, VBOX_Activatable) == 0x000308, "Member 'UWIDGET_CyberspaceHUD_C::VBOX_Activatable' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, VBOX_Equipment) == 0x000310, "Member 'UWIDGET_CyberspaceHUD_C::VBOX_Equipment' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_ConnectionIntegrity) == 0x000318, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_ConnectionIntegrity' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_CrosshairCursor) == 0x000320, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_CrosshairCursor' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_Cyberspace_FunPakPickupModal) == 0x000328, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_Cyberspace_FunPakPickupModal' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_Cyberspace_SoftwareHotbar) == 0x000330, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_Cyberspace_SoftwareHotbar' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_CyberspaceDataLogPickupModal) == 0x000338, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_CyberspaceDataLogPickupModal' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_CyberspaceGreeble) == 0x000340, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_CyberspaceGreeble' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_CyberspaceOccularRing) == 0x000348, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_CyberspaceOccularRing' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_CyberspacePowerUp) == 0x000350, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_CyberspacePowerUp' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_DomainTransferNotice) == 0x000358, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_DomainTransferNotice' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_FlightReticle) == 0x000360, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_FlightReticle' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_IceDrillLockOn) == 0x000368, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_IceDrillLockOn' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_MainMenu_InGame) == 0x000370, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_MainMenu_InGame' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, WIDGET_SecurityTimer) == 0x000378, "Member 'UWIDGET_CyberspaceHUD_C::WIDGET_SecurityTimer' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PlayerPawn) == 0x000380, "Member 'UWIDGET_CyberspaceHUD_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PrimaryMessageTimestamp) == 0x000388, "Member 'UWIDGET_CyberspaceHUD_C::PrimaryMessageTimestamp' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, PrimaryMessageDuration) == 0x00038C, "Member 'UWIDGET_CyberspaceHUD_C::PrimaryMessageDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, StatusMessageTimestamp) == 0x000390, "Member 'UWIDGET_CyberspaceHUD_C::StatusMessageTimestamp' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ItemCountDict) == 0x000398, "Member 'UWIDGET_CyberspaceHUD_C::ItemCountDict' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, InfoMessageTimestamp) == 0x0003E8, "Member 'UWIDGET_CyberspaceHUD_C::InfoMessageTimestamp' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, InfoMessageDuration) == 0x0003EC, "Member 'UWIDGET_CyberspaceHUD_C::InfoMessageDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ItemActivationMessageTimestamp) == 0x0003F0, "Member 'UWIDGET_CyberspaceHUD_C::ItemActivationMessageTimestamp' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ItemActivationMessageDuration) == 0x0003F4, "Member 'UWIDGET_CyberspaceHUD_C::ItemActivationMessageDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, FlashIntegrityFailureTextTimer) == 0x0003F8, "Member 'UWIDGET_CyberspaceHUD_C::FlashIntegrityFailureTextTimer' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ShowStatusMessage_Health) == 0x000400, "Member 'UWIDGET_CyberspaceHUD_C::ShowStatusMessage_Health' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ShowStatusMessage_HealthCritical) == 0x000401, "Member 'UWIDGET_CyberspaceHUD_C::ShowStatusMessage_HealthCritical' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ShowStatusMessage_Time) == 0x000402, "Member 'UWIDGET_CyberspaceHUD_C::ShowStatusMessage_Time' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ShowStatusMessage_TimeCritical) == 0x000403, "Member 'UWIDGET_CyberspaceHUD_C::ShowStatusMessage_TimeCritical' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, CurrentHealth) == 0x000404, "Member 'UWIDGET_CyberspaceHUD_C::CurrentHealth' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, MaxHealth) == 0x000408, "Member 'UWIDGET_CyberspaceHUD_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, SecurityTimeRemaining) == 0x00040C, "Member 'UWIDGET_CyberspaceHUD_C::SecurityTimeRemaining' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, StatusMinusHealthLow) == 0x000410, "Member 'UWIDGET_CyberspaceHUD_C::StatusMinusHealthLow' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, StatusMinusHealthCritical) == 0x000411, "Member 'UWIDGET_CyberspaceHUD_C::StatusMinusHealthCritical' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, HideCrosshairs) == 0x000412, "Member 'UWIDGET_CyberspaceHUD_C::HideCrosshairs' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, ShowMouseCursor) == 0x000413, "Member 'UWIDGET_CyberspaceHUD_C::ShowMouseCursor' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, TextTyper) == 0x000418, "Member 'UWIDGET_CyberspaceHUD_C::TextTyper' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceHUD_C, IsSecurityTimerActive) == 0x000420, "Member 'UWIDGET_CyberspaceHUD_C::IsSecurityTimerActive' has a wrong offset!");

}

