#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DifficultyCategoryPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_DifficultyCategoryPanel.WIDGET_DifficultyCategoryPanel_C.ExpandContainer
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_DifficultyCategoryPanel_C_ExpandContainer final
{
public:
	bool                                          Highlighted_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyCategoryPanel_C_ExpandContainer) == 0x000008, "Wrong alignment on WIDGET_DifficultyCategoryPanel_C_ExpandContainer");
static_assert(sizeof(WIDGET_DifficultyCategoryPanel_C_ExpandContainer) == 0x000010, "Wrong size on WIDGET_DifficultyCategoryPanel_C_ExpandContainer");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ExpandContainer, Highlighted_0) == 0x000000, "Member 'WIDGET_DifficultyCategoryPanel_C_ExpandContainer::Highlighted_0' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ExpandContainer, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WIDGET_DifficultyCategoryPanel_C_ExpandContainer::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ExpandContainer, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WIDGET_DifficultyCategoryPanel_C_ExpandContainer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_DifficultyCategoryPanel.WIDGET_DifficultyCategoryPanel_C.ShrinkContainer
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_DifficultyCategoryPanel_C_ShrinkContainer final
{
public:
	bool                                          Highlighted_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyCategoryPanel_C_ShrinkContainer) == 0x000008, "Wrong alignment on WIDGET_DifficultyCategoryPanel_C_ShrinkContainer");
static_assert(sizeof(WIDGET_DifficultyCategoryPanel_C_ShrinkContainer) == 0x000010, "Wrong size on WIDGET_DifficultyCategoryPanel_C_ShrinkContainer");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ShrinkContainer, Highlighted_0) == 0x000000, "Member 'WIDGET_DifficultyCategoryPanel_C_ShrinkContainer::Highlighted_0' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ShrinkContainer, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WIDGET_DifficultyCategoryPanel_C_ShrinkContainer::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyCategoryPanel_C_ShrinkContainer, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WIDGET_DifficultyCategoryPanel_C_ShrinkContainer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

