#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SaveRow

#include "Basic.hpp"

#include "ENUM_SaveLoad_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_GameDifficulty_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SaveRow.WIDGET_SaveRow_C
// 0x0148 (0x03A8 - 0x0260)
class UWIDGET_SaveRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_SaveEnd;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_SaveBegin;                                    // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowButtons;                                       // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBOX_Buttons;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_AlertIcon;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BG;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Highlight;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Input;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_LoadingFlipbook;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Thumbnail;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MESH_TrophyIcon;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_DateAndTime;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_DeckLevel;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_OptionButtons;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_SavePending;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Thumbnail;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Caption;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_CurrentLevel;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Date;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_ErrorMessaging;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SavePendingLabel;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_TimePlayed;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_SaveMain;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Delete;                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_SaveLoad;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveDifficultyIndicator_C*      WIDGET_CombatSaveDifficultyIndicator;              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveDifficultyIndicator_C*      WIDGET_CyberSaveDifficultyIndicator;               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveDifficultyIndicator_C*      WIDGET_MissionSaveDifficultyIndicator_;            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SaveDifficultyIndicator_C*      WIDGET_PuzzleSaveDifficultyIndicator;              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStreamingSaveGameProfile*              SaveGameProfile;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_SaveLoad                                 Mode;                                              // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SaveLoadMenu_C*                 SaveLoadMenu;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         IndexInList;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         UserIndex;                                         // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 SaveName;                                          // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSaving;                                          // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AsyncSaveCheckTime;                                // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SaveStartTimestamp;                                // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_WIDGET_SaveRow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__WIDGET_SaveRow_WIDGET_ButtonLegend_Delete_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_SaveRow_WIDGET_ButtonLegend_Save_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void Construct();
	void TriggerSaveLoad();
	void SaveToSlot(int32 UserIndex_0);
	void LoadSlot(int32 UserIndex_0);
	void DeleteSlot(bool* Result);
	void GetLevelDisplayName(class FText* DisplayName);
	void SetSelected(bool Selected);
	void EVENT_MouseEnterInputBox(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_MouseExitInputBox(const struct FPointerEvent& MouseEvent);
	void ToggleButtonVisibility(bool Selected);
	void GetDifficultyValuesFromProfile(class UStreamingSaveGameProfile* Profile, ENUM_GameDifficulty* Combat, ENUM_GameDifficulty* Mission, ENUM_GameDifficulty* Puzzle, ENUM_GameDifficulty* Cyber);
	void CheckSaveProfileValidity();
	void SetDifficultyValue(class UWIDGET_SaveDifficultyIndicator_C* SaveDifficultyIndicator, ENUM_GameDifficulty DifficultyCategory);
	void EVENT_OnGameSessionSaved(const class FString& SaveName_0, const int32 UserIndex_0, bool bSuccess);
	void CheckIsSavingAsync();
	void OnSaveCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SaveRow_C">();
	}
	static class UWIDGET_SaveRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SaveRow_C>();
	}
};
static_assert(alignof(UWIDGET_SaveRow_C) == 0x000008, "Wrong alignment on UWIDGET_SaveRow_C");
static_assert(sizeof(UWIDGET_SaveRow_C) == 0x0003A8, "Wrong size on UWIDGET_SaveRow_C");
static_assert(offsetof(UWIDGET_SaveRow_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SaveRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, ANIM_SaveEnd) == 0x000268, "Member 'UWIDGET_SaveRow_C::ANIM_SaveEnd' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, ANIM_SaveBegin) == 0x000270, "Member 'UWIDGET_SaveRow_C::ANIM_SaveBegin' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, ShowButtons) == 0x000278, "Member 'UWIDGET_SaveRow_C::ShowButtons' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, HBOX_Buttons) == 0x000280, "Member 'UWIDGET_SaveRow_C::HBOX_Buttons' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_AlertIcon) == 0x000288, "Member 'UWIDGET_SaveRow_C::MESH_AlertIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_BG) == 0x000290, "Member 'UWIDGET_SaveRow_C::MESH_BG' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_Highlight) == 0x000298, "Member 'UWIDGET_SaveRow_C::MESH_Highlight' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_Input) == 0x0002A0, "Member 'UWIDGET_SaveRow_C::MESH_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_LoadingFlipbook) == 0x0002A8, "Member 'UWIDGET_SaveRow_C::MESH_LoadingFlipbook' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_Thumbnail) == 0x0002B0, "Member 'UWIDGET_SaveRow_C::MESH_Thumbnail' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, MESH_TrophyIcon) == 0x0002B8, "Member 'UWIDGET_SaveRow_C::MESH_TrophyIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, PANEL_DateAndTime) == 0x0002C0, "Member 'UWIDGET_SaveRow_C::PANEL_DateAndTime' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, PANEL_DeckLevel) == 0x0002C8, "Member 'UWIDGET_SaveRow_C::PANEL_DeckLevel' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, PANEL_OptionButtons) == 0x0002D0, "Member 'UWIDGET_SaveRow_C::PANEL_OptionButtons' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, PANEL_SavePending) == 0x0002D8, "Member 'UWIDGET_SaveRow_C::PANEL_SavePending' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, PANEL_Thumbnail) == 0x0002E0, "Member 'UWIDGET_SaveRow_C::PANEL_Thumbnail' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_Caption) == 0x0002E8, "Member 'UWIDGET_SaveRow_C::TEXT_Caption' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_CurrentLevel) == 0x0002F0, "Member 'UWIDGET_SaveRow_C::TEXT_CurrentLevel' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_Date) == 0x0002F8, "Member 'UWIDGET_SaveRow_C::TEXT_Date' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_ErrorMessaging) == 0x000300, "Member 'UWIDGET_SaveRow_C::TEXT_ErrorMessaging' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_SavePendingLabel) == 0x000308, "Member 'UWIDGET_SaveRow_C::TEXT_SavePendingLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, TEXT_TimePlayed) == 0x000310, "Member 'UWIDGET_SaveRow_C::TEXT_TimePlayed' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, VBOX_SaveMain) == 0x000318, "Member 'UWIDGET_SaveRow_C::VBOX_SaveMain' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_ButtonLegend_Delete) == 0x000320, "Member 'UWIDGET_SaveRow_C::WIDGET_ButtonLegend_Delete' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_ButtonLegend_SaveLoad) == 0x000328, "Member 'UWIDGET_SaveRow_C::WIDGET_ButtonLegend_SaveLoad' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_CombatSaveDifficultyIndicator) == 0x000330, "Member 'UWIDGET_SaveRow_C::WIDGET_CombatSaveDifficultyIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_CyberSaveDifficultyIndicator) == 0x000338, "Member 'UWIDGET_SaveRow_C::WIDGET_CyberSaveDifficultyIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_MissionSaveDifficultyIndicator_) == 0x000340, "Member 'UWIDGET_SaveRow_C::WIDGET_MissionSaveDifficultyIndicator_' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, WIDGET_PuzzleSaveDifficultyIndicator) == 0x000348, "Member 'UWIDGET_SaveRow_C::WIDGET_PuzzleSaveDifficultyIndicator' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, SaveGameProfile) == 0x000350, "Member 'UWIDGET_SaveRow_C::SaveGameProfile' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, Mode) == 0x000358, "Member 'UWIDGET_SaveRow_C::Mode' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, SaveLoadMenu) == 0x000360, "Member 'UWIDGET_SaveRow_C::SaveLoadMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, IsSelected) == 0x000368, "Member 'UWIDGET_SaveRow_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, NewEventDispatcher_0) == 0x000370, "Member 'UWIDGET_SaveRow_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, IndexInList) == 0x000380, "Member 'UWIDGET_SaveRow_C::IndexInList' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, UserIndex) == 0x000384, "Member 'UWIDGET_SaveRow_C::UserIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, SaveName) == 0x000388, "Member 'UWIDGET_SaveRow_C::SaveName' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, IsSaving) == 0x000398, "Member 'UWIDGET_SaveRow_C::IsSaving' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, AsyncSaveCheckTime) == 0x00039C, "Member 'UWIDGET_SaveRow_C::AsyncSaveCheckTime' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveRow_C, SaveStartTimestamp) == 0x0003A0, "Member 'UWIDGET_SaveRow_C::SaveStartTimestamp' has a wrong offset!");

}

