#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SoftwareItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SoftwareItem.WIDGET_SoftwareItem_C.ExecuteUbergraph_WIDGET_SoftwareItem
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCooldownRatio_Result;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCooldown_Result;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_SystemShockCharacter_C*           CallFunc_GetOwnerCharacter_Character;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivate_Result;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem) == 0x000008, "Wrong alignment on WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem");
static_assert(sizeof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem) == 0x000070, "Wrong size on WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, EntryPoint) == 0x000000, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, K2Node_Event_MyGeometry) == 0x000010, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1) == 0x000050, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_GetCooldownRatio_Result) == 0x000058, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_GetCooldownRatio_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_HasCooldown_Result) == 0x00005C, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_HasCooldown_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_GetOwnerCharacter_Character) == 0x000060, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_GetOwnerCharacter_Character' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_CanActivate_Result) == 0x000068, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_CanActivate_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00006C, "Member 'WIDGET_SoftwareItem_C_ExecuteUbergraph_WIDGET_SoftwareItem::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_SoftwareItem.WIDGET_SoftwareItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_SoftwareItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SoftwareItem_C_Tick) == 0x000004, "Wrong alignment on WIDGET_SoftwareItem_C_Tick");
static_assert(sizeof(WIDGET_SoftwareItem_C_Tick) == 0x00003C, "Wrong size on WIDGET_SoftwareItem_C_Tick");
static_assert(offsetof(WIDGET_SoftwareItem_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_SoftwareItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_SoftwareItem_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_SoftwareItem.WIDGET_SoftwareItem_C.PopulateSoftwareSlot
// 0x0040 (0x0040 - 0x0000)
struct WIDGET_SoftwareItem_C_PopulateSoftwareSlot final
{
public:
	class UITEM_Software_Base_C*                  Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0028(0x0018)()
};
static_assert(alignof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot) == 0x000008, "Wrong alignment on WIDGET_SoftwareItem_C_PopulateSoftwareSlot");
static_assert(sizeof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot) == 0x000040, "Wrong size on WIDGET_SoftwareItem_C_PopulateSoftwareSlot");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, Item) == 0x000000, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, CallFunc_GetBag_Result) == 0x000008, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, CallFunc_GetSlotIndex_Result) == 0x000010, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000024, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_PopulateSoftwareSlot, CallFunc_TextToUpper_ReturnValue) == 0x000028, "Member 'WIDGET_SoftwareItem_C_PopulateSoftwareSlot::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WIDGET_SoftwareItem.WIDGET_SoftwareItem_C.EVENT_OnBagChanged
// 0x0068 (0x0068 - 0x0000)
struct WIDGET_SoftwareItem_C_EVENT_OnBagChanged final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_Result;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBag_Result_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_Result;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	int32                                         CallFunc_GetCount_Result_1;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_Result_1;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged) == 0x000008, "Wrong alignment on WIDGET_SoftwareItem_C_EVENT_OnBagChanged");
static_assert(sizeof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged) == 0x000068, "Wrong size on WIDGET_SoftwareItem_C_EVENT_OnBagChanged");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, SlotIndex) == 0x000000, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetBag_Result) == 0x000018, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetBag_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetSlotIndex_Result) == 0x000020, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetSlotIndex_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetBag_Result_1) == 0x000028, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetBag_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetSlotItem_Item) == 0x000030, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetCount_Result) == 0x00003C, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetCount_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetCount_Result_1) == 0x000058, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetCount_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_GetSlotIndex_Result_1) == 0x000060, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_GetSlotIndex_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SoftwareItem_C_EVENT_OnBagChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'WIDGET_SoftwareItem_C_EVENT_OnBagChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

