#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MediaPanel

#include "Basic.hpp"

#include "ENUM_MediaTabFilterType_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_ItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MediaPanel.WIDGET_MediaPanel_C
// 0x0100 (0x0360 - 0x0260)
class UWIDGET_MediaPanel_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       ToggleReader;                                      // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_EmailIcon;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_LogIcon;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_NoteIcon;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Separator_ColumnLabels;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Inbox;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Media;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_EmailCount;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LogCount;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_NoteCount;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_Categories;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             VSCROLL_MediaSelection;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Cat_ALL;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_1;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_2;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_3;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_4;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_5;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_6;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_7;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_8;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_9;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     WIDGET_Deck_R;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MediaReaderPanel_C*             WIDGET_MediaReaderPanel;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MediaListElement_C*>     MediaListWidgets;                                  // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWIDGET_MediaCategoryListElement_C*     SelectedMediaCategory;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaListElement_C*             SelectedMediaListElement;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MediaTabFilterType                       MediaFilterType;                                   // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingPreview;                                  // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaListElement_C*             HighlightedMediaListItem;                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     HighlightedMediaCategory;                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeMediaPanel(class UWIDGET_PlayerHUD_C* HUD);
	void UpdateMediaListItems(TArray<class UITEM_MediaBase_C*>& NewMediaItems, bool AutoHighlight);
	void EVENT_OnAudiologsBagChanged(int32 SlotIndex);
	void EVENT_OnEmailsBagChanged(int32 SlotIndex);
	void EVENT_OnNotesBagChanged(int32 SlotIndex);
	void GetAllMediaItemsByFilter(ENUM_MediaTabFilterType Filter_Type, TArray<class UITEM_MediaBase_C*>* MediaItems);
	void GetDeckMediaItemsByFilter(ENUM_MediaTabFilterType FilterType, const class FString& Deck, TArray<class UITEM_MediaBase_C*>* MediaItems);
	void SetMediaPanelVisibility(bool Visibility_0);
	void OnMediaCategorySelected(class UWIDGET_MediaCategoryListElement_C* CategoryWidget, bool AutoHighlightFirstItem);
	void GetInventoryMediaItems(ENUM_ItemType ItemType, TArray<class UITEM_MediaBase_C*>* Result);
	void CountUnviewedMedia(TArray<class UITEM_MediaBase_C*>& MediaItems, int32* UnviewedItemCount);
	void RefreshAllCategoryValues();
	void RefreshCategoryValues(class UWIDGET_MediaCategoryListElement_C* CategoryWidget, int32* UnreadMessageCount);
	void RefreshByMediaItem(class UITEM_MediaBase_C* MediaItem);
	void GetDeckWidgetByDeckSymbol(const class FString& DeckSymbol, class UWIDGET_MediaCategoryListElement_C** DeckWidget);
	void GetCurrentDeckWidget(class UWIDGET_MediaCategoryListElement_C** DeckWidget);
	void GetCategoryWidgets(TArray<class UWIDGET_MediaCategoryListElement_C*>* Widgets);
	void OnMediaListItemSelected(class UWIDGET_MediaListElement_C* MediaListItem);
	void GetAllMediaItems(TArray<class UITEM_MediaBase_C*>* Result);
	void GetDeckSymbolFromMediaItem(class UITEM_MediaBase_C* MediaItem, class FString* DeckSymbol);
	void ToggleReaderMode(bool ShowMedia, class UITEM_MediaBase_C* MediaItem);
	void ReadMedia(class UITEM_MediaBase_C* MediaItem);
	void InvokeNavManager(bool InputState, ENUM_MenuNavigationInput InputType);
	void SetHighlightedListItem(class UWIDGET_MediaListElement_C* MediaListItem);
	void SetHighlightedCategory(class UWIDGET_MediaCategoryListElement_C* CategoryWidget);
	void SetMediaCategoryCount();
	void ReceiveNavTabRight(bool InputState, bool* Result);
	void ReceiveNavTabLeft(bool InputState, bool* Result);
	void ReceiveNavAlt2(bool InputState, bool* Result);
	void ReceiveNavAlt1(bool InputState, bool* Result);
	void ReceiveNavBack(bool InputState, bool* Result);
	void ReceiveNavAccept(bool InputState, bool* Result);
	void ReceiveNavRight(bool InputState, bool* Result);
	void ReceiveNavLeft(bool InputState, bool* Result);
	void ReceiveNavDown(bool InputState, bool* Result);
	void ReceiveNavUp(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MediaPanel_C">();
	}
	static class UWIDGET_MediaPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MediaPanel_C>();
	}
};
static_assert(alignof(UWIDGET_MediaPanel_C) == 0x000008, "Wrong alignment on UWIDGET_MediaPanel_C");
static_assert(sizeof(UWIDGET_MediaPanel_C) == 0x000360, "Wrong size on UWIDGET_MediaPanel_C");
static_assert(offsetof(UWIDGET_MediaPanel_C, ToggleReader) == 0x000260, "Member 'UWIDGET_MediaPanel_C::ToggleReader' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MESH_EmailIcon) == 0x000268, "Member 'UWIDGET_MediaPanel_C::MESH_EmailIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MESH_LogIcon) == 0x000270, "Member 'UWIDGET_MediaPanel_C::MESH_LogIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MESH_NoteIcon) == 0x000278, "Member 'UWIDGET_MediaPanel_C::MESH_NoteIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MESH_Separator_ColumnLabels) == 0x000280, "Member 'UWIDGET_MediaPanel_C::MESH_Separator_ColumnLabels' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, PANEL_Inbox) == 0x000288, "Member 'UWIDGET_MediaPanel_C::PANEL_Inbox' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, PANEL_Media) == 0x000290, "Member 'UWIDGET_MediaPanel_C::PANEL_Media' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, TEXT_EmailCount) == 0x000298, "Member 'UWIDGET_MediaPanel_C::TEXT_EmailCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, TEXT_LogCount) == 0x0002A0, "Member 'UWIDGET_MediaPanel_C::TEXT_LogCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, TEXT_NoteCount) == 0x0002A8, "Member 'UWIDGET_MediaPanel_C::TEXT_NoteCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, VBOX_Categories) == 0x0002B0, "Member 'UWIDGET_MediaPanel_C::VBOX_Categories' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, VSCROLL_MediaSelection) == 0x0002B8, "Member 'UWIDGET_MediaPanel_C::VSCROLL_MediaSelection' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Cat_ALL) == 0x0002C0, "Member 'UWIDGET_MediaPanel_C::WIDGET_Cat_ALL' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_1) == 0x0002C8, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_1' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_2) == 0x0002D0, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_2' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_3) == 0x0002D8, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_3' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_4) == 0x0002E0, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_4' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_5) == 0x0002E8, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_5' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_6) == 0x0002F0, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_6' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_7) == 0x0002F8, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_7' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_8) == 0x000300, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_8' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_9) == 0x000308, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_9' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_Deck_R) == 0x000310, "Member 'UWIDGET_MediaPanel_C::WIDGET_Deck_R' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, WIDGET_MediaReaderPanel) == 0x000318, "Member 'UWIDGET_MediaPanel_C::WIDGET_MediaReaderPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, PlayerHUD) == 0x000320, "Member 'UWIDGET_MediaPanel_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MediaListWidgets) == 0x000328, "Member 'UWIDGET_MediaPanel_C::MediaListWidgets' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, SelectedMediaCategory) == 0x000338, "Member 'UWIDGET_MediaPanel_C::SelectedMediaCategory' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, SelectedMediaListElement) == 0x000340, "Member 'UWIDGET_MediaPanel_C::SelectedMediaListElement' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, MediaFilterType) == 0x000348, "Member 'UWIDGET_MediaPanel_C::MediaFilterType' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, IsShowingPreview) == 0x000349, "Member 'UWIDGET_MediaPanel_C::IsShowingPreview' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, HighlightedMediaListItem) == 0x000350, "Member 'UWIDGET_MediaPanel_C::HighlightedMediaListItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaPanel_C, HighlightedMediaCategory) == 0x000358, "Member 'UWIDGET_MediaPanel_C::HighlightedMediaCategory' has a wrong offset!");

}

