#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_BioScanner_ListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_BioScanner_ListItem.WIDGET_BioScanner_ListItem_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_BioScanner_ListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_PatchIconEnd;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_PatchIconStart;                               // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DermalPatchIcon;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAttribMod*                             PatchEffectMod;                                    // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWIDGET_BioScanner_C*                   BioScannerWidget;                                  // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_BioScanner_ListItem(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void InitializePatchEffectIcon();
	void UpdatePatchEffectProgress();
	void StartApplyAnimation();
	void StartExpireAnimation();
	void OnExpireAnimationFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_BioScanner_ListItem_C">();
	}
	static class UWIDGET_BioScanner_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_BioScanner_ListItem_C>();
	}
};
static_assert(alignof(UWIDGET_BioScanner_ListItem_C) == 0x000008, "Wrong alignment on UWIDGET_BioScanner_ListItem_C");
static_assert(sizeof(UWIDGET_BioScanner_ListItem_C) == 0x000290, "Wrong size on UWIDGET_BioScanner_ListItem_C");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_BioScanner_ListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, ANIM_PatchIconEnd) == 0x000268, "Member 'UWIDGET_BioScanner_ListItem_C::ANIM_PatchIconEnd' has a wrong offset!");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, ANIM_PatchIconStart) == 0x000270, "Member 'UWIDGET_BioScanner_ListItem_C::ANIM_PatchIconStart' has a wrong offset!");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, MESH_DermalPatchIcon) == 0x000278, "Member 'UWIDGET_BioScanner_ListItem_C::MESH_DermalPatchIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, PatchEffectMod) == 0x000280, "Member 'UWIDGET_BioScanner_ListItem_C::PatchEffectMod' has a wrong offset!");
static_assert(offsetof(UWIDGET_BioScanner_ListItem_C, BioScannerWidget) == 0x000288, "Member 'UWIDGET_BioScanner_ListItem_C::BioScannerWidget' has a wrong offset!");

}

