#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DomainTransferNotice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DomainTransferNotice.WIDGET_DomainTransferNotice_C
// 0x0050 (0x02B0 - 0x0260)
class UWIDGET_DomainTransferNotice_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_TransitionAnim;                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MESH_Background;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Divider;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TransitionAnimFrame;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TransitionAnimIcon;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_DomainLabel;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_TransferringLabel;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextTyper_C*                           TransferLabelTextTyper;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransferLabelTextTyperInterval;                    // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_DomainTransferNotice(int32 EntryPoint);
	void Construct();
	void TriggerTransferLabelTextTyper();
	void InitializeDomainTransferWidget();
	void TriggerNewDomainTransferNotice(const class FText& DomainLinkText);
	void SequenceEvent__ENTRYPOINTWIDGET_DomainTransferNotice_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DomainTransferNotice_C">();
	}
	static class UWIDGET_DomainTransferNotice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DomainTransferNotice_C>();
	}
};
static_assert(alignof(UWIDGET_DomainTransferNotice_C) == 0x000008, "Wrong alignment on UWIDGET_DomainTransferNotice_C");
static_assert(sizeof(UWIDGET_DomainTransferNotice_C) == 0x0002B0, "Wrong size on UWIDGET_DomainTransferNotice_C");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_DomainTransferNotice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, ANIM_TransitionAnim) == 0x000268, "Member 'UWIDGET_DomainTransferNotice_C::ANIM_TransitionAnim' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, MESH_Background) == 0x000270, "Member 'UWIDGET_DomainTransferNotice_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, MESH_Divider) == 0x000278, "Member 'UWIDGET_DomainTransferNotice_C::MESH_Divider' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, MESH_TransitionAnimFrame) == 0x000280, "Member 'UWIDGET_DomainTransferNotice_C::MESH_TransitionAnimFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, MESH_TransitionAnimIcon) == 0x000288, "Member 'UWIDGET_DomainTransferNotice_C::MESH_TransitionAnimIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, TEXT_DomainLabel) == 0x000290, "Member 'UWIDGET_DomainTransferNotice_C::TEXT_DomainLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, TEXT_TransferringLabel) == 0x000298, "Member 'UWIDGET_DomainTransferNotice_C::TEXT_TransferringLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, TransferLabelTextTyper) == 0x0002A0, "Member 'UWIDGET_DomainTransferNotice_C::TransferLabelTextTyper' has a wrong offset!");
static_assert(offsetof(UWIDGET_DomainTransferNotice_C, TransferLabelTextTyperInterval) == 0x0002A8, "Member 'UWIDGET_DomainTransferNotice_C::TransferLabelTextTyperInterval' has a wrong offset!");

}

