#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_MultiSelector_Pip

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Settings_MultiSelector_Pip.WIDGET_Settings_MultiSelector_Pip_C
// 0x0028 (0x0288 - 0x0260)
class UWIDGET_Settings_MultiSelector_Pip_C final : public UUserWidget
{
public:
	class UImage*                                 IMAGE_Pip;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TEXT_SelectionName;                                // 0x0268(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         IndexInList;                                       // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetSelected(bool Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Settings_MultiSelector_Pip_C">();
	}
	static class UWIDGET_Settings_MultiSelector_Pip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Settings_MultiSelector_Pip_C>();
	}
};
static_assert(alignof(UWIDGET_Settings_MultiSelector_Pip_C) == 0x000008, "Wrong alignment on UWIDGET_Settings_MultiSelector_Pip_C");
static_assert(sizeof(UWIDGET_Settings_MultiSelector_Pip_C) == 0x000288, "Wrong size on UWIDGET_Settings_MultiSelector_Pip_C");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_Pip_C, IMAGE_Pip) == 0x000260, "Member 'UWIDGET_Settings_MultiSelector_Pip_C::IMAGE_Pip' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_Pip_C, TEXT_SelectionName) == 0x000268, "Member 'UWIDGET_Settings_MultiSelector_Pip_C::TEXT_SelectionName' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_Pip_C, IndexInList) == 0x000280, "Member 'UWIDGET_Settings_MultiSelector_Pip_C::IndexInList' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_Pip_C, IsSelected) == 0x000284, "Member 'UWIDGET_Settings_MultiSelector_Pip_C::IsSelected' has a wrong offset!");

}

