#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_CyberspaceGreeble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_CyberspaceGreeble.WIDGET_CyberspaceGreeble_C
// 0x0058 (0x02B8 - 0x0260)
class UWIDGET_CyberspaceGreeble_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TEXT_Data_Info;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Pitch_Info;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Roll_Info;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Virt_Info;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_X_Info;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Y_Info;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Yaw_Info;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Z_Info;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimePassed;                                        // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DataNumber;                                        // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VirtNumber;                                        // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_CyberspaceGreeble(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void GetPlayerLocation();
	void SetRandomValues(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_CyberspaceGreeble_C">();
	}
	static class UWIDGET_CyberspaceGreeble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_CyberspaceGreeble_C>();
	}
};
static_assert(alignof(UWIDGET_CyberspaceGreeble_C) == 0x000008, "Wrong alignment on UWIDGET_CyberspaceGreeble_C");
static_assert(sizeof(UWIDGET_CyberspaceGreeble_C) == 0x0002B8, "Wrong size on UWIDGET_CyberspaceGreeble_C");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_CyberspaceGreeble_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Data_Info) == 0x000268, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Data_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Pitch_Info) == 0x000270, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Pitch_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Roll_Info) == 0x000278, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Roll_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Virt_Info) == 0x000280, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Virt_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_X_Info) == 0x000288, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_X_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Y_Info) == 0x000290, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Y_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Yaw_Info) == 0x000298, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Yaw_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TEXT_Z_Info) == 0x0002A0, "Member 'UWIDGET_CyberspaceGreeble_C::TEXT_Z_Info' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, TimePassed) == 0x0002A8, "Member 'UWIDGET_CyberspaceGreeble_C::TimePassed' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, DataNumber) == 0x0002AC, "Member 'UWIDGET_CyberspaceGreeble_C::DataNumber' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceGreeble_C, VirtNumber) == 0x0002B0, "Member 'UWIDGET_CyberspaceGreeble_C::VirtNumber' has a wrong offset!");

}

