#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_CyberspaceDataLogPickupModal

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_CyberspaceDataLogPickupModal.WIDGET_CyberspaceDataLogPickupModal_C
// 0x0078 (0x02D8 - 0x0260)
class UWIDGET_CyberspaceDataLogPickupModal_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_AuthorBg;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BottomBar;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DataTypeIcon_AudioLog;                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DataTypeIcon_Note;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DateBg;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_LogBg;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MainBg;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ModalIcon;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SublineBg;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SubLineFrame;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TopBar;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Author;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DataType;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Date;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Subject;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetPickupData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_CyberspaceDataLogPickupModal_C">();
	}
	static class UWIDGET_CyberspaceDataLogPickupModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_CyberspaceDataLogPickupModal_C>();
	}
};
static_assert(alignof(UWIDGET_CyberspaceDataLogPickupModal_C) == 0x000008, "Wrong alignment on UWIDGET_CyberspaceDataLogPickupModal_C");
static_assert(sizeof(UWIDGET_CyberspaceDataLogPickupModal_C) == 0x0002D8, "Wrong size on UWIDGET_CyberspaceDataLogPickupModal_C");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_AuthorBg) == 0x000260, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_AuthorBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_BottomBar) == 0x000268, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_BottomBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_DataTypeIcon_AudioLog) == 0x000270, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_DataTypeIcon_AudioLog' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_DataTypeIcon_Note) == 0x000278, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_DataTypeIcon_Note' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_DateBg) == 0x000280, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_DateBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_LogBg) == 0x000288, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_LogBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_MainBg) == 0x000290, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_MainBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_ModalIcon) == 0x000298, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_ModalIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_SublineBg) == 0x0002A0, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_SublineBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_SubLineFrame) == 0x0002A8, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_SubLineFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, MESH_TopBar) == 0x0002B0, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::MESH_TopBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, TEXT_Author) == 0x0002B8, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::TEXT_Author' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, TEXT_DataType) == 0x0002C0, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::TEXT_DataType' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, TEXT_Date) == 0x0002C8, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::TEXT_Date' has a wrong offset!");
static_assert(offsetof(UWIDGET_CyberspaceDataLogPickupModal_C, TEXT_Subject) == 0x0002D0, "Member 'UWIDGET_CyberspaceDataLogPickupModal_C::TEXT_Subject' has a wrong offset!");

}

