#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsCategoryMenuList

#include "Basic.hpp"

#include "ENUM_OptionCategories_structs.hpp"
#include "Engine_structs.hpp"
#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C
// 0x0058 (0x0320 - 0x02C8)
class UWIDGET_OptionsCategoryMenuList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VBOX_OptionCategoryWidgetList;                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Audio;                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Controls;                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Display;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Gameplay;                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Graphics;                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionCategoryMenuListItem_C*   WIDGET_OptionMenuCategory_Interface;               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOptionCategoryClicked;                           // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ENUM_OptionCategories                         SelectedCategory;                                  // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedItemIndex;                                 // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnOptionCategoryClicked__DelegateSignature(int32 OptionCategoryIndex);
	void ExecuteUbergraph_WIDGET_OptionsCategoryMenuList(int32 EntryPoint);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void GetListItemByCategory(ENUM_OptionCategories Category, class UWIDGET_OptionCategoryMenuListItem_C** Result);
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void SetSelectedItem(int32 ItemIndex, class FText* CategoryText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsCategoryMenuList_C">();
	}
	static class UWIDGET_OptionsCategoryMenuList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsCategoryMenuList_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsCategoryMenuList_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsCategoryMenuList_C");
static_assert(sizeof(UWIDGET_OptionsCategoryMenuList_C) == 0x000320, "Wrong size on UWIDGET_OptionsCategoryMenuList_C");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, UberGraphFrame) == 0x0002C8, "Member 'UWIDGET_OptionsCategoryMenuList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, VBOX_OptionCategoryWidgetList) == 0x0002D0, "Member 'UWIDGET_OptionsCategoryMenuList_C::VBOX_OptionCategoryWidgetList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Audio) == 0x0002D8, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Audio' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Controls) == 0x0002E0, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Controls' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Display) == 0x0002E8, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Display' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Gameplay) == 0x0002F0, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Gameplay' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Graphics) == 0x0002F8, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Graphics' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, WIDGET_OptionMenuCategory_Interface) == 0x000300, "Member 'UWIDGET_OptionsCategoryMenuList_C::WIDGET_OptionMenuCategory_Interface' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, OnOptionCategoryClicked) == 0x000308, "Member 'UWIDGET_OptionsCategoryMenuList_C::OnOptionCategoryClicked' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, SelectedCategory) == 0x000318, "Member 'UWIDGET_OptionsCategoryMenuList_C::SelectedCategory' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsCategoryMenuList_C, SelectedItemIndex) == 0x00031C, "Member 'UWIDGET_OptionsCategoryMenuList_C::SelectedItemIndex' has a wrong offset!");

}

