#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MFDControllerBumpers

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_MFDControllerBumpers.WIDGET_MFDControllerBumpers_C.ExecuteUbergraph_WIDGET_MFDControllerBumpers
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers) == 0x000004, "Wrong alignment on WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers");
static_assert(sizeof(WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers) == 0x000008, "Wrong size on WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers");
static_assert(offsetof(WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers, EntryPoint) == 0x000000, "Member 'WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_MFDControllerBumpers_C_ExecuteUbergraph_WIDGET_MFDControllerBumpers::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_MFDControllerBumpers.WIDGET_MFDControllerBumpers_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MFDControllerBumpers_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MFDControllerBumpers_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_MFDControllerBumpers_C_PreConstruct");
static_assert(sizeof(WIDGET_MFDControllerBumpers_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_MFDControllerBumpers_C_PreConstruct");
static_assert(offsetof(WIDGET_MFDControllerBumpers_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_MFDControllerBumpers_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_MFDControllerBumpers.WIDGET_MFDControllerBumpers_C.PressLB
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MFDControllerBumpers_C_PressLB final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MFDControllerBumpers_C_PressLB) == 0x000008, "Wrong alignment on WIDGET_MFDControllerBumpers_C_PressLB");
static_assert(sizeof(WIDGET_MFDControllerBumpers_C_PressLB) == 0x000008, "Wrong size on WIDGET_MFDControllerBumpers_C_PressLB");
static_assert(offsetof(WIDGET_MFDControllerBumpers_C_PressLB, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_MFDControllerBumpers_C_PressLB::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_MFDControllerBumpers.WIDGET_MFDControllerBumpers_C.PressRB
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MFDControllerBumpers_C_PressRB final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MFDControllerBumpers_C_PressRB) == 0x000008, "Wrong alignment on WIDGET_MFDControllerBumpers_C_PressRB");
static_assert(sizeof(WIDGET_MFDControllerBumpers_C_PressRB) == 0x000008, "Wrong size on WIDGET_MFDControllerBumpers_C_PressRB");
static_assert(offsetof(WIDGET_MFDControllerBumpers_C_PressRB, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WIDGET_MFDControllerBumpers_C_PressRB::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

