#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SimplifiedHotbarInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SimplifiedHotbarInput.WIDGET_SimplifiedHotbarInput_C
// 0x0018 (0x0278 - 0x0260)
class UWIDGET_SimplifiedHotbarInput_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_InputFrame;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_InputIcon;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_SimplifiedHotbarInput(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void RotateBy(float RotationAngle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SimplifiedHotbarInput_C">();
	}
	static class UWIDGET_SimplifiedHotbarInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SimplifiedHotbarInput_C>();
	}
};
static_assert(alignof(UWIDGET_SimplifiedHotbarInput_C) == 0x000008, "Wrong alignment on UWIDGET_SimplifiedHotbarInput_C");
static_assert(sizeof(UWIDGET_SimplifiedHotbarInput_C) == 0x000278, "Wrong size on UWIDGET_SimplifiedHotbarInput_C");
static_assert(offsetof(UWIDGET_SimplifiedHotbarInput_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SimplifiedHotbarInput_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarInput_C, MESH_InputFrame) == 0x000268, "Member 'UWIDGET_SimplifiedHotbarInput_C::MESH_InputFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarInput_C, MESH_InputIcon) == 0x000270, "Member 'UWIDGET_SimplifiedHotbarInput_C::MESH_InputIcon' has a wrong offset!");

}

