#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls_GamepadList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsMenu_Controls_GamepadList.WIDGET_OptionsMenu_Controls_GamepadList_C.SetHighlightedListItem
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectionState;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options;              // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem) == 0x000020, "Wrong size on WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem::ItemIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem, SelectionState) == 0x000004, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem::SelectionState' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem, CallFunc_GetAllMenuListItems_Options) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem::CallFunc_GetAllMenuListItems_Options' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_SetHighlightedListItem::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_GamepadList.WIDGET_OptionsMenu_Controls_GamepadList_C.InitializeItemArray
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     Children;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_InitializeItemArray_MenuListItems;        // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray) == 0x000070, "Wrong size on WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, Children) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::Children' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_Array_Get_Item) == 0x000040, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base) == 0x000050, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray, CallFunc_InitializeItemArray_MenuListItems) == 0x000060, "Member 'WIDGET_OptionsMenu_Controls_GamepadList_C_InitializeItemArray::CallFunc_InitializeItemArray_MenuListItems' has a wrong offset!");

}

