#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ButtonLegend_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ButtonLegend_Button.WIDGET_ButtonLegend_Button_C
// 0x0088 (0x02E8 - 0x0260)
class UWIDGET_ButtonLegend_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_EnableButton;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ButtonBackground;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_InputRegion;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Action;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Key_C*             WIDGET_ButtonLegend_Key;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonActionText;                                  // 0x0290(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 ButtonInputAction;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FKey                                   ExplicitKeyMapping;                                // 0x02C8(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ShowBackground;                                    // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void ExecuteUbergraph_WIDGET_ButtonLegend_Button(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void UpdateKeyWidget();
	void HandleMouseEnter();
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void HandleMouseLeave();
	void ToggleInteractivity(bool IsInteractive);
	void SetButtonActionText(const class FText& NewText);
	void UpdateBackgroundVisibility();
	void UpdateTextDistanceFromIcon();
	void UpdateMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ButtonLegend_Button_C">();
	}
	static class UWIDGET_ButtonLegend_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ButtonLegend_Button_C>();
	}
};
static_assert(alignof(UWIDGET_ButtonLegend_Button_C) == 0x000008, "Wrong alignment on UWIDGET_ButtonLegend_Button_C");
static_assert(sizeof(UWIDGET_ButtonLegend_Button_C) == 0x0002E8, "Wrong size on UWIDGET_ButtonLegend_Button_C");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_ButtonLegend_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, ANIM_EnableButton) == 0x000268, "Member 'UWIDGET_ButtonLegend_Button_C::ANIM_EnableButton' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, MESH_ButtonBackground) == 0x000270, "Member 'UWIDGET_ButtonLegend_Button_C::MESH_ButtonBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, MESH_InputRegion) == 0x000278, "Member 'UWIDGET_ButtonLegend_Button_C::MESH_InputRegion' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, TEXT_Action) == 0x000280, "Member 'UWIDGET_ButtonLegend_Button_C::TEXT_Action' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, WIDGET_ButtonLegend_Key) == 0x000288, "Member 'UWIDGET_ButtonLegend_Button_C::WIDGET_ButtonLegend_Key' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, ButtonActionText) == 0x000290, "Member 'UWIDGET_ButtonLegend_Button_C::ButtonActionText' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, OnClicked) == 0x0002A8, "Member 'UWIDGET_ButtonLegend_Button_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, ButtonInputAction) == 0x0002B8, "Member 'UWIDGET_ButtonLegend_Button_C::ButtonInputAction' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, ExplicitKeyMapping) == 0x0002C8, "Member 'UWIDGET_ButtonLegend_Button_C::ExplicitKeyMapping' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_Button_C, ShowBackground) == 0x0002E0, "Member 'UWIDGET_ButtonLegend_Button_C::ShowBackground' has a wrong offset!");

}

