#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_LoadingScreen.WIDGET_LoadingScreen_C
// 0x0020 (0x0280 - 0x0260)
class UWIDGET_LoadingScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_Background;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_LoadingFlipbook;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FadeProgress;                                      // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_LoadingScreen(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StartFadeOut();
	void UpdateFadeEffect(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_LoadingScreen_C">();
	}
	static class UWIDGET_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_LoadingScreen_C>();
	}
};
static_assert(alignof(UWIDGET_LoadingScreen_C) == 0x000008, "Wrong alignment on UWIDGET_LoadingScreen_C");
static_assert(sizeof(UWIDGET_LoadingScreen_C) == 0x000280, "Wrong size on UWIDGET_LoadingScreen_C");
static_assert(offsetof(UWIDGET_LoadingScreen_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_LoadingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_LoadingScreen_C, IMG_Background) == 0x000268, "Member 'UWIDGET_LoadingScreen_C::IMG_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_LoadingScreen_C, MESH_LoadingFlipbook) == 0x000270, "Member 'UWIDGET_LoadingScreen_C::MESH_LoadingFlipbook' has a wrong offset!");
static_assert(offsetof(UWIDGET_LoadingScreen_C, FadeProgress) == 0x000278, "Member 'UWIDGET_LoadingScreen_C::FadeProgress' has a wrong offset!");

}

