#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MediaPanel

#include "Basic.hpp"

#include "STRUCT_MediaObject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "STRUCT_LevelInfo_structs.hpp"
#include "ENUM_ItemType_structs.hpp"
#include "ENUM_MediaTabFilterType_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.InitializeMediaPanel
// 0x00B0 (0x00B0 - 0x0000)
struct WIDGET_MediaPanel_C_InitializeMediaPanel final
{
public:
	class UWIDGET_PlayerHUD_C*                    HUD;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CurrentDeckWidget;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     CurrentCatWidget;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnviewedItemCount;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MediaItemCount;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              MediaItems;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MediaCategoryListElement_C*> CallFunc_GetCategoryWidgets_Widgets;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MediaCategoryListElement_C*     CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RefreshCategoryValues_UnreadMessageCount; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag_1;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag_2;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MediaPanel_C_InitializeMediaPanel) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_InitializeMediaPanel");
static_assert(sizeof(WIDGET_MediaPanel_C_InitializeMediaPanel) == 0x0000B0, "Wrong size on WIDGET_MediaPanel_C_InitializeMediaPanel");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, HUD) == 0x000000, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::HUD' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CurrentDeckWidget) == 0x000008, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CurrentDeckWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CurrentCatWidget) == 0x000010, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CurrentCatWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, UnviewedItemCount) == 0x000018, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::UnviewedItemCount' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, MediaItemCount) == 0x00001C, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::MediaItemCount' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, MediaItems) == 0x000020, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_GetCategoryWidgets_Widgets) == 0x000038, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_GetCategoryWidgets_Widgets' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_Array_Get_Item) == 0x000048, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_RefreshCategoryValues_UnreadMessageCount) == 0x000054, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_RefreshCategoryValues_UnreadMessageCount' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_GetBagByType_Bag) == 0x000088, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_GetBagByType_Bag_1) == 0x000090, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_GetBagByType_Bag_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_InitializeMediaPanel, CallFunc_GetBagByType_Bag_2) == 0x0000A8, "Member 'WIDGET_MediaPanel_C_InitializeMediaPanel::CallFunc_GetBagByType_Bag_2' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.UpdateMediaListItems
// 0x0110 (0x0110 - 0x0000)
struct WIDGET_MediaPanel_C_UpdateMediaListItems final
{
public:
	TArray<class UITEM_MediaBase_C*>              NewMediaItems;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          AutoHighlight;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MediaListElement_C*>     RemovedWidgets;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CurrentMediaItemIndex;                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaListElement_C*             K2Node_DynamicCast_AsWIDGET_Media_List_Element;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaListElement_C*             CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaListElement_C*             CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaListElement_C*             CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaListElement_C*             CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaListElement_C*             CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      CallFunc_Array_Get_Item_4;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      CallFunc_Array_Get_Item_5;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaListElement_C*             CallFunc_Array_Get_Item_6;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MediaPanel_C_UpdateMediaListItems) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_UpdateMediaListItems");
static_assert(sizeof(WIDGET_MediaPanel_C_UpdateMediaListItems) == 0x000110, "Wrong size on WIDGET_MediaPanel_C_UpdateMediaListItems");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, NewMediaItems) == 0x000000, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::NewMediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, AutoHighlight) == 0x000010, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::AutoHighlight' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, RemovedWidgets) == 0x000018, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::RemovedWidgets' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CurrentMediaItemIndex) == 0x000028, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CurrentMediaItemIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, MediaItem) == 0x000030, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::MediaItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, K2Node_DynamicCast_AsWIDGET_Media_List_Element) == 0x000050, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::K2Node_DynamicCast_AsWIDGET_Media_List_Element' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item) == 0x000060, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_RemoveItem_ReturnValue) == 0x000078, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, Temp_int_Variable) == 0x000080, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_2) == 0x0000A0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A4, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_3) == 0x0000A8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Max_ReturnValue) == 0x0000AC, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Add_ReturnValue_1) == 0x0000C0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_AddChild_ReturnValue) == 0x0000C8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_4) == 0x0000D0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_5) == 0x0000D8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Get_Item_6) == 0x0000E0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_4) == 0x0000E8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Greater_IntInt_ReturnValue) == 0x0000EC, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_5) == 0x0000F0, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, Temp_int_Loop_Counter_Variable_1) == 0x0000F4, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000FD, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Add_IntInt_ReturnValue_2) == 0x000100, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Array_Length_ReturnValue_6) == 0x000104, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_UpdateMediaListItems, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000108, "Member 'WIDGET_MediaPanel_C_UpdateMediaListItems::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.EVENT_OnAudiologsBagChanged
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetAllMediaItemsByFilter_MediaItems;      // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol;    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetDeckMediaItemsByFilter_MediaItems;     // 0x0030(0x0010)(ReferenceParm)
	class UWIDGET_MediaCategoryListElement_C*     CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      K2Node_DynamicCast_AsITEM_Media_Base;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged");
static_assert(sizeof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged) == 0x000070, "Wrong size on WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, SlotIndex) == 0x000000, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, MediaItem) == 0x000008, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::MediaItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetAllMediaItemsByFilter_MediaItems) == 0x000010, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetAllMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol) == 0x000020, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetDeckMediaItemsByFilter_MediaItems) == 0x000030, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetDeckMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget) == 0x000040, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetBagByType_Bag) == 0x000050, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, CallFunc_GetSlotItem_Item) == 0x000058, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, K2Node_DynamicCast_AsITEM_Media_Base) == 0x000060, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::K2Node_DynamicCast_AsITEM_Media_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WIDGET_MediaPanel_C_EVENT_OnAudiologsBagChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.EVENT_OnEmailsBagChanged
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetAllMediaItemsByFilter_MediaItems;      // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol;    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetDeckMediaItemsByFilter_MediaItems;     // 0x0030(0x0010)(ReferenceParm)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      K2Node_DynamicCast_AsITEM_Media_Base;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged");
static_assert(sizeof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged) == 0x000070, "Wrong size on WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, SlotIndex) == 0x000000, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, MediaItem) == 0x000008, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::MediaItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetAllMediaItemsByFilter_MediaItems) == 0x000010, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetAllMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol) == 0x000020, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetDeckMediaItemsByFilter_MediaItems) == 0x000030, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetDeckMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetBagByType_Bag) == 0x000040, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget) == 0x000048, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_GetSlotItem_Item) == 0x000050, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, K2Node_DynamicCast_AsITEM_Media_Base) == 0x000060, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::K2Node_DynamicCast_AsITEM_Media_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WIDGET_MediaPanel_C_EVENT_OnEmailsBagChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.EVENT_OnNotesBagChanged
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      MediaItem;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetAllMediaItemsByFilter_MediaItems;      // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol;    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetDeckMediaItemsByFilter_MediaItems;     // 0x0030(0x0010)(ReferenceParm)
	class UInventoryBag_C*                        CallFunc_GetBagByType_Bag;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MediaCategoryListElement_C*     CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_MediaBase_C*                      K2Node_DynamicCast_AsITEM_Media_Base;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged");
static_assert(sizeof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged) == 0x000070, "Wrong size on WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, SlotIndex) == 0x000000, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::SlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, MediaItem) == 0x000008, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::MediaItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetAllMediaItemsByFilter_MediaItems) == 0x000010, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetAllMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol) == 0x000020, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetDeckMediaItemsByFilter_MediaItems) == 0x000030, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetDeckMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetBagByType_Bag) == 0x000040, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetBagByType_Bag' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget) == 0x000048, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetDeckWidgetByDeckSymbol_DeckWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_GetSlotItem_Item) == 0x000050, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, K2Node_DynamicCast_AsITEM_Media_Base) == 0x000060, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::K2Node_DynamicCast_AsITEM_Media_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WIDGET_MediaPanel_C_EVENT_OnNotesBagChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.GetAllMediaItemsByFilter
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_MediaPanel_C_GetAllMediaItemsByFilter final
{
public:
	ENUM_MediaTabFilterType                       Filter_Type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_MediaBase_C*>              MediaItems;                                        // 0x0008(0x0010)(Parm, OutParm)
	ENUM_MediaTabFilterType                       Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_ItemType                                 Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ItemType                                 Temp_byte_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ItemType                                 Temp_byte_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_ItemType                                 Temp_byte_Variable_4;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetAllMediaItems_Result;                  // 0x0020(0x0010)(ReferenceParm)
	ENUM_ItemType                                 K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetInventoryMediaItems_Result;            // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_GetAllMediaItemsByFilter");
static_assert(sizeof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter) == 0x000048, "Wrong size on WIDGET_MediaPanel_C_GetAllMediaItemsByFilter");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Filter_Type) == 0x000000, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Filter_Type' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, MediaItems) == 0x000008, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Temp_byte_Variable) == 0x000018, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Temp_byte_Variable_1) == 0x00001A, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Temp_byte_Variable_2) == 0x00001B, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Temp_byte_Variable_3) == 0x00001C, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, Temp_byte_Variable_4) == 0x00001D, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, CallFunc_GetAllMediaItems_Result) == 0x000020, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::CallFunc_GetAllMediaItems_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, K2Node_Select_Default) == 0x000030, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetAllMediaItemsByFilter, CallFunc_GetInventoryMediaItems_Result) == 0x000038, "Member 'WIDGET_MediaPanel_C_GetAllMediaItemsByFilter::CallFunc_GetInventoryMediaItems_Result' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.GetDeckMediaItemsByFilter
// 0x0090 (0x0090 - 0x0000)
struct WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter final
{
public:
	ENUM_MediaTabFilterType                       FilterType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Deck;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              MediaItems;                                        // 0x0018(0x0010)(Parm, OutParm)
	class UITEM_MediaBase_C*                      CurrentMediaItem;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UITEM_MediaBase_C*>              ReturnItems;                                       // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class UITEM_MediaBase_C*>              CallFunc_GetAllMediaItemsByFilter_MediaItems;      // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_MediaBase_C*                      K2Node_DynamicCast_AsITEM_Media_Base;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol;    // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter");
static_assert(sizeof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter) == 0x000090, "Wrong size on WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, FilterType) == 0x000000, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::FilterType' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, Deck) == 0x000008, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::Deck' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, MediaItems) == 0x000018, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CurrentMediaItem) == 0x000028, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CurrentMediaItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, ReturnItems) == 0x000030, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::ReturnItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_GetAllMediaItemsByFilter_MediaItems) == 0x000040, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_GetAllMediaItemsByFilter_MediaItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_Array_Get_Item) == 0x000058, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, K2Node_DynamicCast_AsITEM_Media_Base) == 0x000060, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::K2Node_DynamicCast_AsITEM_Media_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol) == 0x000078, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_GetDeckSymbolFromMediaItem_DeckSymbol' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000088, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'WIDGET_MediaPanel_C_GetDeckMediaItemsByFilter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.SetMediaPanelVisibility
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_MediaPanel_C_SetMediaPanelVisibility final
{
public:
	bool                                          Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MediaCategoryListElement_C*     CallFunc_GetCurrentDeckWidget_DeckWidget;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MediaPanel_C_SetMediaPanelVisibility) == 0x000008, "Wrong alignment on WIDGET_MediaPanel_C_SetMediaPanelVisibility");
static_assert(sizeof(WIDGET_MediaPanel_C_SetMediaPanelVisibility) == 0x000018, "Wrong size on WIDGET_MediaPanel_C_SetMediaPanelVisibility");
static_assert(offsetof(WIDGET_MediaPanel_C_SetMediaPanelVisibility, Visibility_0) == 0x000000, "Member 'WIDGET_MediaPanel_C_SetMediaPanelVisibility::Visibility_0' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_SetMediaPanelVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WIDGET_MediaPanel_C_SetMediaPanelVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_SetMediaPanelVisibility, CallFunc_GetCurrentDeckWidget_DeckWidget) == 0x000008, "Member 'WIDGET_MediaPanel_C_SetMediaPanelVisibility::CallFunc_GetCurrentDeckWidget_DeckWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_MediaPanel_C_SetMediaPanelVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WIDGET_MediaPanel_C_SetMediaPanelVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WIDGET_MediaPanel.WIDGET_MediaPanel_C.OnMediaCategorySelected
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_MediaPanel_C_OnMediaCategorySelected final
{
public:
