#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MapInfoBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MapInfoBar.WIDGET_MapInfoBar_C
// 0x0050 (0x02B0 - 0x0260)
class UWIDGET_MapInfoBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_DeckIcon;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LevelName;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LevelSecurity;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        Text_LevelSymbol;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SecurityPercentage;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   LevelNameForInfo;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LevelSymbolPrefix;                                 // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WIDGET_MapInfoBar(int32 EntryPoint);
	void SetIconTexture(TSoftObjectPtr<class UTexture2D> Texture);
	void Construct();
	void OnLoaded_3740FF584BCD96FEEA1703A114E7515A(class UObject* Loaded);
	void UpdateLevelDetails(class FName LevelName);
	void EVENT_OnLevelSecurityChanged(int32 SecurityLevel);
	void SetSecurityLevelPercentage(int32 SecurityPercentage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MapInfoBar_C">();
	}
	static class UWIDGET_MapInfoBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MapInfoBar_C>();
	}
};
static_assert(alignof(UWIDGET_MapInfoBar_C) == 0x000008, "Wrong alignment on UWIDGET_MapInfoBar_C");
static_assert(sizeof(UWIDGET_MapInfoBar_C) == 0x0002B0, "Wrong size on UWIDGET_MapInfoBar_C");
static_assert(offsetof(UWIDGET_MapInfoBar_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MapInfoBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, MESH_DeckIcon) == 0x000268, "Member 'UWIDGET_MapInfoBar_C::MESH_DeckIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, TEXT_LevelName) == 0x000270, "Member 'UWIDGET_MapInfoBar_C::TEXT_LevelName' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, TEXT_LevelSecurity) == 0x000278, "Member 'UWIDGET_MapInfoBar_C::TEXT_LevelSecurity' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, Text_LevelSymbol) == 0x000280, "Member 'UWIDGET_MapInfoBar_C::Text_LevelSymbol' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, TEXT_SecurityPercentage) == 0x000288, "Member 'UWIDGET_MapInfoBar_C::TEXT_SecurityPercentage' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, LevelNameForInfo) == 0x000290, "Member 'UWIDGET_MapInfoBar_C::LevelNameForInfo' has a wrong offset!");
static_assert(offsetof(UWIDGET_MapInfoBar_C, LevelSymbolPrefix) == 0x000298, "Member 'UWIDGET_MapInfoBar_C::LevelSymbolPrefix' has a wrong offset!");

}

