#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_Waypoints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Automap_Waypoints.WIDGET_Automap_Waypoints_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_Automap_Waypoints_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Automap_WaypointElement_C*      WIDGET_Automap_WaypointElement_Add;                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Automap_WaypointElement_C*      WIDGET_Automap_WaypointElement_Remove;             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_AutoMap_C*                      Automap;                                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Automap_WaypointElement_C*      ActiveWaypointElement;                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Automap_Waypoints(int32 EntryPoint);
	void Construct();
	void InitializeWaypoints(class UWIDGET_AutoMap_C* Automap_0);
	void SetActiveWaypointElement(class UWIDGET_Automap_WaypointElement_C* WaypointElement);
	void ReceiveWaypointInput(const struct FVector& WorldLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Automap_Waypoints_C">();
	}
	static class UWIDGET_Automap_Waypoints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Automap_Waypoints_C>();
	}
};
static_assert(alignof(UWIDGET_Automap_Waypoints_C) == 0x000008, "Wrong alignment on UWIDGET_Automap_Waypoints_C");
static_assert(sizeof(UWIDGET_Automap_Waypoints_C) == 0x000290, "Wrong size on UWIDGET_Automap_Waypoints_C");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_Automap_Waypoints_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, MESH_Background) == 0x000268, "Member 'UWIDGET_Automap_Waypoints_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, WIDGET_Automap_WaypointElement_Add) == 0x000270, "Member 'UWIDGET_Automap_Waypoints_C::WIDGET_Automap_WaypointElement_Add' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, WIDGET_Automap_WaypointElement_Remove) == 0x000278, "Member 'UWIDGET_Automap_Waypoints_C::WIDGET_Automap_WaypointElement_Remove' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, Automap) == 0x000280, "Member 'UWIDGET_Automap_Waypoints_C::Automap' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Waypoints_C, ActiveWaypointElement) == 0x000288, "Member 'UWIDGET_Automap_Waypoints_C::ActiveWaypointElement' has a wrong offset!");

}

