#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls_GamepadBindsList

#include "Basic.hpp"

#include "STRUCT_BoundInputActionPair_structs.hpp"
#include "WIDGET_OptionsMenu_Controls_BindsList_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsMenu_Controls_GamepadBindsList.WIDGET_OptionsMenu_Controls_GamepadBindsList_C
// 0x0268 (0x0760 - 0x04F8)
class UWIDGET_OptionsMenu_Controls_GamepadBindsList_C final : public UWIDGET_OptionsMenu_Controls_BindsList_C
{
public:
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_AcquireTarget;           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_AimDownSights;           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Attack;                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Crouch;                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_Ascend;            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_Decoy;             // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_Descend;           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_PrimaryAttack;     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_Recall;            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_RollLeft;          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_RollRight;         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_SecondaryAttack;   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Cyber_TurboDash;         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_CycleHardware;           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_HotbarCycleNext;         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_HotbarCyclePrevious;     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Interact;                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Jump;                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Lean;                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Minigame_PrimaryAction;  // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Minigame_SecondaryAction; // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_ModeSwitch;              // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Sprint;                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_ToggleMFD;               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_UseConsumable;           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_UseExplosive;            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_UseHardware;             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_InputBind_C*           OPTION_Controls_InputBind_Zoom;                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_Options;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ActionLabel;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AltLabel;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_MainLabel;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Cyberspace;              // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Hardware;                // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Interaction;             // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Minigames;               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Movement;                // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> RealspaceKeyMap_0;                                 // 0x0620(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CyberspaceKeyMap_0;                                // 0x0670(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> MinigameKeyMap_0;                                  // 0x06C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class UOPTION_Controls_InputBind_C*> OptionKeyMap_0;                                    // 0x0710(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsMenu_Controls_GamepadBindsList_C">();
	}
	static class UWIDGET_OptionsMenu_Controls_GamepadBindsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsMenu_Controls_GamepadBindsList_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsMenu_Controls_GamepadBindsList_C");
static_assert(sizeof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C) == 0x000760, "Wrong size on UWIDGET_OptionsMenu_Controls_GamepadBindsList_C");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_AcquireTarget) == 0x0004F8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_AcquireTarget' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_AimDownSights) == 0x000500, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_AimDownSights' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Attack) == 0x000508, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Attack' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Crouch) == 0x000510, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Crouch' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_Ascend) == 0x000518, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_Ascend' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_Decoy) == 0x000520, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_Decoy' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_Descend) == 0x000528, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_Descend' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_PrimaryAttack) == 0x000530, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_PrimaryAttack' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_Recall) == 0x000538, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_Recall' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_RollLeft) == 0x000540, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_RollLeft' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_RollRight) == 0x000548, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_RollRight' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_SecondaryAttack) == 0x000550, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_SecondaryAttack' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Cyber_TurboDash) == 0x000558, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Cyber_TurboDash' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_CycleHardware) == 0x000560, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_CycleHardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_HotbarCycleNext) == 0x000568, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_HotbarCycleNext' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_HotbarCyclePrevious) == 0x000570, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_HotbarCyclePrevious' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Interact) == 0x000578, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Interact' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Jump) == 0x000580, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Jump' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Lean) == 0x000588, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Lean' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Minigame_PrimaryAction) == 0x000590, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Minigame_PrimaryAction' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Minigame_SecondaryAction) == 0x000598, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Minigame_SecondaryAction' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_ModeSwitch) == 0x0005A0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_ModeSwitch' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Sprint) == 0x0005A8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Sprint' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_ToggleMFD) == 0x0005B0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_ToggleMFD' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_UseConsumable) == 0x0005B8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_UseConsumable' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_UseExplosive) == 0x0005C0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_UseExplosive' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_UseHardware) == 0x0005C8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_UseHardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OPTION_Controls_InputBind_Zoom) == 0x0005D0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OPTION_Controls_InputBind_Zoom' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, SCROLLBOX_Options) == 0x0005D8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::SCROLLBOX_Options' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, TEXT_ActionLabel) == 0x0005E0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::TEXT_ActionLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, TEXT_AltLabel) == 0x0005E8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::TEXT_AltLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, TEXT_MainLabel) == 0x0005F0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::TEXT_MainLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, WIDGET_ListCategoryHeader_Cyberspace) == 0x0005F8, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::WIDGET_ListCategoryHeader_Cyberspace' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, WIDGET_ListCategoryHeader_Hardware) == 0x000600, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::WIDGET_ListCategoryHeader_Hardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, WIDGET_ListCategoryHeader_Interaction) == 0x000608, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::WIDGET_ListCategoryHeader_Interaction' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, WIDGET_ListCategoryHeader_Minigames) == 0x000610, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::WIDGET_ListCategoryHeader_Minigames' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, WIDGET_ListCategoryHeader_Movement) == 0x000618, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::WIDGET_ListCategoryHeader_Movement' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, RealspaceKeyMap_0) == 0x000620, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::RealspaceKeyMap_0' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, CyberspaceKeyMap_0) == 0x000670, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::CyberspaceKeyMap_0' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, MinigameKeyMap_0) == 0x0006C0, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::MinigameKeyMap_0' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GamepadBindsList_C, OptionKeyMap_0) == 0x000710, "Member 'UWIDGET_OptionsMenu_Controls_GamepadBindsList_C::OptionKeyMap_0' has a wrong offset!");

}

