#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_StatusDeck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_StatusDeck.WIDGET_StatusDeck_C
// 0x00A8 (0x0308 - 0x0260)
class UWIDGET_StatusDeck_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnMouseDown_NotVisited;                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnMouseOver_NotVisited;                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnMouseDown_Visited;                               // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnMouseOver_Visited;                               // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BGInput;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LevelName;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        Text_LevelSymbol;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Deck;                                              // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DeckSymbol;                                        // 0x02A8(0x0018)(Edit, BlueprintVisible)
	class FText                                   MouseOverText_NotVisited;                          // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsMouseOver;                                       // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelected;                                        // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              FontSize_MouseOver_NotVisited;                     // 0x02DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FontSize_MouseOver_Visited;                        // 0x02E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FontSize_MouseNotOver;                             // 0x02EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_Status_C*                       StatusUI;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshWidget*                      SplineMeshWidget;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_StatusDeck(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void GetDeckLevelName(class FName* LevelName);
	void InitializeStatusDeck(class UWIDGET_Status_C* Status);
	void HasVisitedLevel(class FName LevelName, bool* HasVisited);
	void UpdatePanelFont();
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void EVENT_OnFinishedLoadingLevel();
	struct FEventReply EVENT_OnMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetSelected(bool Selected);
	struct FEventReply EVENT_OnMouseDoubleClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void TryShowAutomapForSelectedDeck(bool* Result);
	void UpdateSplineMaterials();
	void GetToolTipText(class FText* ToolTip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_StatusDeck_C">();
	}
	static class UWIDGET_StatusDeck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_StatusDeck_C>();
	}
};
static_assert(alignof(UWIDGET_StatusDeck_C) == 0x000008, "Wrong alignment on UWIDGET_StatusDeck_C");
static_assert(sizeof(UWIDGET_StatusDeck_C) == 0x000308, "Wrong size on UWIDGET_StatusDeck_C");
static_assert(offsetof(UWIDGET_StatusDeck_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_StatusDeck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, OnMouseDown_NotVisited) == 0x000268, "Member 'UWIDGET_StatusDeck_C::OnMouseDown_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, OnMouseOver_NotVisited) == 0x000270, "Member 'UWIDGET_StatusDeck_C::OnMouseOver_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, OnMouseDown_Visited) == 0x000278, "Member 'UWIDGET_StatusDeck_C::OnMouseDown_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, OnMouseOver_Visited) == 0x000280, "Member 'UWIDGET_StatusDeck_C::OnMouseOver_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, MESH_BGInput) == 0x000288, "Member 'UWIDGET_StatusDeck_C::MESH_BGInput' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, TEXT_LevelName) == 0x000290, "Member 'UWIDGET_StatusDeck_C::TEXT_LevelName' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, Text_LevelSymbol) == 0x000298, "Member 'UWIDGET_StatusDeck_C::Text_LevelSymbol' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, Deck) == 0x0002A0, "Member 'UWIDGET_StatusDeck_C::Deck' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, DeckSymbol) == 0x0002A8, "Member 'UWIDGET_StatusDeck_C::DeckSymbol' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, MouseOverText_NotVisited) == 0x0002C0, "Member 'UWIDGET_StatusDeck_C::MouseOverText_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, IsMouseOver) == 0x0002D8, "Member 'UWIDGET_StatusDeck_C::IsMouseOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, IsSelected) == 0x0002D9, "Member 'UWIDGET_StatusDeck_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, FontSize_MouseOver_NotVisited) == 0x0002DC, "Member 'UWIDGET_StatusDeck_C::FontSize_MouseOver_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, FontSize_MouseOver_Visited) == 0x0002E4, "Member 'UWIDGET_StatusDeck_C::FontSize_MouseOver_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, FontSize_MouseNotOver) == 0x0002EC, "Member 'UWIDGET_StatusDeck_C::FontSize_MouseNotOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, StatusUI) == 0x0002F8, "Member 'UWIDGET_StatusDeck_C::StatusUI' has a wrong offset!");
static_assert(offsetof(UWIDGET_StatusDeck_C, SplineMeshWidget) == 0x000300, "Member 'UWIDGET_StatusDeck_C::SplineMeshWidget' has a wrong offset!");

}

