#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_SplashScreenList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C
// 0x0040 (0x0308 - 0x02C8)
class UWIDGET_MainMenu_SplashScreenList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           MainMenuItemList;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Continue;                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Credits;                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_LoadGame;                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_NewGame;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_Options;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MainMenuButton_C*               WIDGET_MainMenuButton_QuitGame;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList(int32 EntryPoint);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature(const struct FPointerEvent& InputEvent);
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);
	void OnListOpen();
	void UpdateContinueLoadButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MainMenu_SplashScreenList_C">();
	}
	static class UWIDGET_MainMenu_SplashScreenList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MainMenu_SplashScreenList_C>();
	}
};
static_assert(alignof(UWIDGET_MainMenu_SplashScreenList_C) == 0x000008, "Wrong alignment on UWIDGET_MainMenu_SplashScreenList_C");
static_assert(sizeof(UWIDGET_MainMenu_SplashScreenList_C) == 0x000308, "Wrong size on UWIDGET_MainMenu_SplashScreenList_C");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, UberGraphFrame) == 0x0002C8, "Member 'UWIDGET_MainMenu_SplashScreenList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, MainMenuItemList) == 0x0002D0, "Member 'UWIDGET_MainMenu_SplashScreenList_C::MainMenuItemList' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_Continue) == 0x0002D8, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_Continue' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_Credits) == 0x0002E0, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_Credits' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_LoadGame) == 0x0002E8, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_LoadGame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_NewGame) == 0x0002F0, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_NewGame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_Options) == 0x0002F8, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_Options' has a wrong offset!");
static_assert(offsetof(UWIDGET_MainMenu_SplashScreenList_C, WIDGET_MainMenuButton_QuitGame) == 0x000300, "Member 'UWIDGET_MainMenu_SplashScreenList_C::WIDGET_MainMenuButton_QuitGame' has a wrong offset!");

}

