#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MediaDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MediaType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MediaDisplay.WIDGET_MediaDisplay_C
// 0x00A0 (0x0300 - 0x0260)
class UWIDGET_MediaDisplay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MediaStart;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_PlayIcon;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Portrait;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Main;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Sender;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Subject;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Type;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OutroTimerHandle;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnMediaFinished;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           FeedInterruptTimerHandle;                          // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   LiveTransmissionText;                              // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DataStickType;                                     // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnMediaFinished__DelegateSignature();
	void ExecuteUbergraph_WIDGET_MediaDisplay(int32 EntryPoint);
	void Construct();
	void InitializeMediaDisplay(class UWIDGET_PlayerHUD_C* PlayerHUD_0);
	void DisplayMediaFromData(ENUM_MediaType MediaType, const struct FSTRUCT_MediaObject& MediaData);
	void DisplayMediaFromItem(class UITEM_MediaBase_C* MediaItem);
	void DisplayMediaFromItemClass(class UClass* MediaItemClass);
	void DisplayMediaFromParameters(TSoftObjectPtr<class UTexture2D> PortraitTexture, int32 PortraitRowCount, int32 PortraitColCount, int32 PortraitFrameRate, const class FText& Type, const class FText& Subject, const class FText& Sender);
	void DisplayMediaFeedInterrupt(TSoftObjectPtr<class UTexture2D> PortraitTexture, int32 PortraitRowCount, int32 PortraitColCount, int32 PortraitFrameRate, bool DisplayStatic);
	void DisplayShodanMediaFeedInterrupt(bool DisplayStatic);
	void SetMediaPortraitTexture(TSoftObjectPtr<class UTexture2D> PortraitTexture, int32 PortraitRowCount, int32 PortraitColCount, int32 PortraitFrameRate);
	void UpdateMediaItemDisplay();
	void StopCurrentMedia();
	void EVENT_AudioLogFinished(class USoundCue* SoundCue);
	void EVENT_OnOutroFinished();
	void ShowMediaText(bool Visible);
	void ResetMediaTurnOffTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MediaDisplay_C">();
	}
	static class UWIDGET_MediaDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MediaDisplay_C>();
	}
};
static_assert(alignof(UWIDGET_MediaDisplay_C) == 0x000008, "Wrong alignment on UWIDGET_MediaDisplay_C");
static_assert(sizeof(UWIDGET_MediaDisplay_C) == 0x000300, "Wrong size on UWIDGET_MediaDisplay_C");
static_assert(offsetof(UWIDGET_MediaDisplay_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MediaDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, MediaStart) == 0x000268, "Member 'UWIDGET_MediaDisplay_C::MediaStart' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, MESH_PlayIcon) == 0x000270, "Member 'UWIDGET_MediaDisplay_C::MESH_PlayIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, MESH_Portrait) == 0x000278, "Member 'UWIDGET_MediaDisplay_C::MESH_Portrait' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, PANEL_Main) == 0x000280, "Member 'UWIDGET_MediaDisplay_C::PANEL_Main' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, TEXT_Sender) == 0x000288, "Member 'UWIDGET_MediaDisplay_C::TEXT_Sender' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, TEXT_Subject) == 0x000290, "Member 'UWIDGET_MediaDisplay_C::TEXT_Subject' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, TEXT_Type) == 0x000298, "Member 'UWIDGET_MediaDisplay_C::TEXT_Type' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, MaterialInstance) == 0x0002A0, "Member 'UWIDGET_MediaDisplay_C::MaterialInstance' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, PlayerHUD) == 0x0002A8, "Member 'UWIDGET_MediaDisplay_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, OutroTimerHandle) == 0x0002B0, "Member 'UWIDGET_MediaDisplay_C::OutroTimerHandle' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, OnMediaFinished) == 0x0002B8, "Member 'UWIDGET_MediaDisplay_C::OnMediaFinished' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, FeedInterruptTimerHandle) == 0x0002C8, "Member 'UWIDGET_MediaDisplay_C::FeedInterruptTimerHandle' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, LiveTransmissionText) == 0x0002D0, "Member 'UWIDGET_MediaDisplay_C::LiveTransmissionText' has a wrong offset!");
static_assert(offsetof(UWIDGET_MediaDisplay_C, DataStickType) == 0x0002E8, "Member 'UWIDGET_MediaDisplay_C::DataStickType' has a wrong offset!");

}

