#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_GraphicsList

#include "Basic.hpp"

#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsMenu_GraphicsList.WIDGET_OptionsMenu_GraphicsList_C
// 0x0050 (0x0318 - 0x02C8)
class UWIDGET_OptionsMenu_GraphicsList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Graphics_AmbientOcclusion_C*    OPTION_Graphics_AmbientOcclusion;                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_DLSSMode_C*            OPTION_Graphics_DLSSMode;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_EffectsQuality_C*      OPTION_Graphics_EffectsQuality;                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_FogQuality_C*          OPTION_Graphics_FogQuality;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_FoliageQuality_C*      OPTION_Graphics_FoliageDistance;                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_PostProcessingQuality_C* OPTION_Graphics_PostProcessingQuality;             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_ShaderQuality_C*       OPTION_Graphics_ShaderQuality;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_ShadowQuality_C*       OPTION_Graphics_ShadowQuality;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Graphics_TextureQuality_C*      OPTION_Graphics_TextureQuality;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_OptionsMenuList;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsMenu_GraphicsList_C">();
	}
	static class UWIDGET_OptionsMenu_GraphicsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsMenu_GraphicsList_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsMenu_GraphicsList_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsMenu_GraphicsList_C");
static_assert(sizeof(UWIDGET_OptionsMenu_GraphicsList_C) == 0x000318, "Wrong size on UWIDGET_OptionsMenu_GraphicsList_C");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_AmbientOcclusion) == 0x0002C8, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_AmbientOcclusion' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_DLSSMode) == 0x0002D0, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_DLSSMode' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_EffectsQuality) == 0x0002D8, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_EffectsQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_FogQuality) == 0x0002E0, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_FogQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_FoliageDistance) == 0x0002E8, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_FoliageDistance' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_PostProcessingQuality) == 0x0002F0, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_PostProcessingQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_ShaderQuality) == 0x0002F8, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_ShaderQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_ShadowQuality) == 0x000300, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_ShadowQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, OPTION_Graphics_TextureQuality) == 0x000308, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::OPTION_Graphics_TextureQuality' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_GraphicsList_C, SCROLLBOX_OptionsMenuList) == 0x000310, "Member 'UWIDGET_OptionsMenu_GraphicsList_C::SCROLLBOX_OptionsMenuList' has a wrong offset!");

}

