#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MenuListBase

#include "Basic.hpp"

#include "ENUM_MenuNavigationInput_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnMenuAction__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature");
static_assert(sizeof(WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature) == 0x000010, "Wrong size on WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature");
static_assert(offsetof(WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature, Message) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnMenuAction__DelegateSignature::Message' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnListDirty__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MenuListBase_C_OnListDirty__DelegateSignature final
{
public:
	bool                                          IsDirty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnListDirty__DelegateSignature) == 0x000001, "Wrong alignment on WIDGET_MenuListBase_C_OnListDirty__DelegateSignature");
static_assert(sizeof(WIDGET_MenuListBase_C_OnListDirty__DelegateSignature) == 0x000001, "Wrong size on WIDGET_MenuListBase_C_OnListDirty__DelegateSignature");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListDirty__DelegateSignature, IsDirty) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnListDirty__DelegateSignature::IsDirty' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnListFullyDefault__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature final
{
public:
	bool                                          IsDefault;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature) == 0x000001, "Wrong alignment on WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature");
static_assert(sizeof(WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature) == 0x000001, "Wrong size on WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature, IsDefault) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnListFullyDefault__DelegateSignature::IsDefault' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.InitializeList
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_MenuListBase_C_InitializeList final
{
public:
	class UWIDGET_MenuBase_C*                     ParentScreen;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Base_C*                         K2Node_DynamicCast_AsOPTION_Base;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_InitializeItemArray_MenuListItems;        // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MenuListBase_C_InitializeList) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_InitializeList");
static_assert(sizeof(WIDGET_MenuListBase_C_InitializeList) == 0x000058, "Wrong size on WIDGET_MenuListBase_C_InitializeList");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, ParentScreen) == 0x000000, "Member 'WIDGET_MenuListBase_C_InitializeList::ParentScreen' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WIDGET_MenuListBase_C_InitializeList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WIDGET_MenuListBase_C_InitializeList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WIDGET_MenuListBase_C_InitializeList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WIDGET_MenuListBase_C_InitializeList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_MenuListBase_C_InitializeList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WIDGET_MenuListBase_C_InitializeList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, K2Node_DynamicCast_AsOPTION_Base) == 0x000038, "Member 'WIDGET_MenuListBase_C_InitializeList::K2Node_DynamicCast_AsOPTION_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIDGET_MenuListBase_C_InitializeList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WIDGET_MenuListBase_C_InitializeList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeList, CallFunc_InitializeItemArray_MenuListItems) == 0x000048, "Member 'WIDGET_MenuListBase_C_InitializeList::CallFunc_InitializeItemArray_MenuListItems' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.SetHighlightedListItem
// 0x0098 (0x0098 - 0x0000)
struct WIDGET_MenuListBase_C_SetHighlightedListItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectionState;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             OldItem;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             NewItem;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionsScreen_C*                K2Node_DynamicCast_AsWIDGET_Options_Screen;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionsScreen_C*                K2Node_DynamicCast_AsWIDGET_Options_Screen_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_OptionsScreen_C*                K2Node_DynamicCast_AsWIDGET_Options_Screen_2;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionsScreen_C*                K2Node_DynamicCast_AsWIDGET_Options_Screen_3;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHighlighted_Result;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHighlighted_Result_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_SetHighlightedListItem) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_SetHighlightedListItem");
static_assert(sizeof(WIDGET_MenuListBase_C_SetHighlightedListItem) == 0x000098, "Wrong size on WIDGET_MenuListBase_C_SetHighlightedListItem");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, ItemIndex) == 0x000000, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::ItemIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, SelectionState) == 0x000004, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::SelectionState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, OldItem) == 0x000008, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::OldItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, NewItem) == 0x000010, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::NewItem' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_AsWIDGET_Options_Screen) == 0x000020, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_AsWIDGET_Options_Screen' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_AsWIDGET_Options_Screen_1) == 0x000030, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_AsWIDGET_Options_Screen_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_AsWIDGET_Options_Screen_2) == 0x000040, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_AsWIDGET_Options_Screen_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_AsWIDGET_Options_Screen_3) == 0x000050, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_AsWIDGET_Options_Screen_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000059, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_GetIsHighlighted_Result) == 0x00005A, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_GetIsHighlighted_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_IsValid_ReturnValue_2) == 0x00005B, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_GetIsHighlighted_Result_1) == 0x00005C, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_GetIsHighlighted_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_IsValid_ReturnValue_3) == 0x00005D, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00005E, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_BooleanAND_ReturnValue) == 0x00005F, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000061, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Array_Get_Item) == 0x000070, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetHighlightedListItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'WIDGET_MenuListBase_C_SetHighlightedListItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.GetAllMenuListItems
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MenuListBase_C_GetAllMenuListItems final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     Options;                                           // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MenuListBase_C_GetAllMenuListItems) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_GetAllMenuListItems");
static_assert(sizeof(WIDGET_MenuListBase_C_GetAllMenuListItems) == 0x000010, "Wrong size on WIDGET_MenuListBase_C_GetAllMenuListItems");
static_assert(offsetof(WIDGET_MenuListBase_C_GetAllMenuListItems, Options) == 0x000000, "Member 'WIDGET_MenuListBase_C_GetAllMenuListItems::Options' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.GetDirtyChildOptions
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_MenuListBase_C_GetDirtyChildOptions final
{
public:
	TArray<class UOPTION_Base_C*>                 Options;                                           // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UOPTION_Base_C*>                 DirtyOptions;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Base_C*                         K2Node_DynamicCast_AsOPTION_Base;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDirty_IsDirty;                          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MenuListBase_C_GetDirtyChildOptions) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_GetDirtyChildOptions");
static_assert(sizeof(WIDGET_MenuListBase_C_GetDirtyChildOptions) == 0x000050, "Wrong size on WIDGET_MenuListBase_C_GetDirtyChildOptions");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, Options) == 0x000000, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::Options' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, DirtyOptions) == 0x000010, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::DirtyOptions' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_Array_Get_Item) == 0x000030, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, K2Node_DynamicCast_AsOPTION_Base) == 0x000040, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::K2Node_DynamicCast_AsOPTION_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_IsDirty_IsDirty) == 0x00004A, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_IsDirty_IsDirty' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_GetDirtyChildOptions, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'WIDGET_MenuListBase_C_GetDirtyChildOptions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnListClose
// 0x0080 (0x0080 - 0x0000)
struct WIDGET_MenuListBase_C_OnListClose final
{
public:
	TArray<class UOPTION_Base_C*>                 DirtyChildOptions;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options;              // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options_1;            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOPTION_Base_C*                         CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Base_C*                         CallFunc_Array_Get_Item_2;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOPTION_Base_C*>                 CallFunc_GetDirtyChildOptions_Options;             // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnListClose) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_OnListClose");
static_assert(sizeof(WIDGET_MenuListBase_C_OnListClose) == 0x000080, "Wrong size on WIDGET_MenuListBase_C_OnListClose");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, DirtyChildOptions) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnListClose::DirtyChildOptions' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, Temp_int_Variable) == 0x000010, "Member 'WIDGET_MenuListBase_C_OnListClose::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, Temp_int_Variable_1) == 0x000014, "Member 'WIDGET_MenuListBase_C_OnListClose::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_GetAllMenuListItems_Options) == 0x000020, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_GetAllMenuListItems_Options' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_GetAllMenuListItems_Options_1) == 0x000030, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_GetAllMenuListItems_Options_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_Get_Item) == 0x000048, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListClose, CallFunc_GetDirtyChildOptions_Options) == 0x000070, "Member 'WIDGET_MenuListBase_C_OnListClose::CallFunc_GetDirtyChildOptions_Options' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnListOpen
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_MenuListBase_C_OnListOpen final
{
public:
	bool                                          CallFunc_ReceiveNavDown_Result;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnListOpen) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_OnListOpen");
static_assert(sizeof(WIDGET_MenuListBase_C_OnListOpen) == 0x000020, "Wrong size on WIDGET_MenuListBase_C_OnListOpen");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListOpen, CallFunc_ReceiveNavDown_Result) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnListOpen::CallFunc_ReceiveNavDown_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListOpen, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WIDGET_MenuListBase_C_OnListOpen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListOpen, K2Node_DynamicCast_AsCON_Hacker) == 0x000010, "Member 'WIDGET_MenuListBase_C_OnListOpen::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListOpen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WIDGET_MenuListBase_C_OnListOpen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnListOpen, CallFunc_IsUsingGamepad_Result) == 0x000019, "Member 'WIDGET_MenuListBase_C_OnListOpen::CallFunc_IsUsingGamepad_Result' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.InitializeItemArray
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MenuListBase_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MenuListBase_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_InitializeItemArray");
static_assert(sizeof(WIDGET_MenuListBase_C_InitializeItemArray) == 0x000010, "Wrong size on WIDGET_MenuListBase_C_InitializeItemArray");
static_assert(offsetof(WIDGET_MenuListBase_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_MenuListBase_C_InitializeItemArray::MenuListItems' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.InvokeNavManager
// 0x000D (0x000D - 0x0000)
struct WIDGET_MenuListBase_C_InvokeNavManager final
{
public:
	ENUM_MenuNavigationInput                      InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputState;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavTabRight_Result;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavTabLeft_Result;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavAlt2_Result;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavAlt1_Result;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavBack_Result;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavAccept_Result;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavRight_Result;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavLeft_Result;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavDown_Result;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavUp_Result;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_InvokeNavManager) == 0x000001, "Wrong alignment on WIDGET_MenuListBase_C_InvokeNavManager");
static_assert(sizeof(WIDGET_MenuListBase_C_InvokeNavManager) == 0x00000D, "Wrong size on WIDGET_MenuListBase_C_InvokeNavManager");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, InputType) == 0x000000, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::InputType' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, InputState) == 0x000001, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavTabRight_Result) == 0x000003, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavTabRight_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavTabLeft_Result) == 0x000004, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavTabLeft_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavAlt2_Result) == 0x000005, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavAlt2_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavAlt1_Result) == 0x000006, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavAlt1_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavBack_Result) == 0x000007, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavBack_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavAccept_Result) == 0x000008, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavAccept_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavRight_Result) == 0x000009, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavRight_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavLeft_Result) == 0x00000A, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavLeft_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavDown_Result) == 0x00000B, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavDown_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_InvokeNavManager, CallFunc_ReceiveNavUp_Result) == 0x00000C, "Member 'WIDGET_MenuListBase_C_InvokeNavManager::CallFunc_ReceiveNavUp_Result' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.EVENT_OnOptionChanged
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_MenuListBase_C_EVENT_OnOptionChanged final
{
public:
	bool                                          CallFunc_AreOptionsAllDefault_AreAllDefault;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOPTION_Base_C*>                 CallFunc_GetDirtyChildOptions_Options;             // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_EVENT_OnOptionChanged");
static_assert(sizeof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged) == 0x000020, "Wrong size on WIDGET_MenuListBase_C_EVENT_OnOptionChanged");
static_assert(offsetof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged, CallFunc_AreOptionsAllDefault_AreAllDefault) == 0x000000, "Member 'WIDGET_MenuListBase_C_EVENT_OnOptionChanged::CallFunc_AreOptionsAllDefault_AreAllDefault' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged, CallFunc_GetDirtyChildOptions_Options) == 0x000008, "Member 'WIDGET_MenuListBase_C_EVENT_OnOptionChanged::CallFunc_GetDirtyChildOptions_Options' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_MenuListBase_C_EVENT_OnOptionChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_EVENT_OnOptionChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_MenuListBase_C_EVENT_OnOptionChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.AreOptionsAllDefault
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_MenuListBase_C_AreOptionsAllDefault final
{
public:
	bool                                          AreAllDefault;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOPTION_Base_C*>                 NonDefaultOptions;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOPTION_Base_C*                         K2Node_DynamicCast_AsOPTION_Base;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDefault_Result;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_AreOptionsAllDefault) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_AreOptionsAllDefault");
static_assert(sizeof(WIDGET_MenuListBase_C_AreOptionsAllDefault) == 0x000048, "Wrong size on WIDGET_MenuListBase_C_AreOptionsAllDefault");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, AreAllDefault) == 0x000000, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::AreAllDefault' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, NonDefaultOptions) == 0x000008, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::NonDefaultOptions' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, K2Node_DynamicCast_AsOPTION_Base) == 0x000030, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::K2Node_DynamicCast_AsOPTION_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_IsDefault_Result) == 0x000040, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_IsDefault_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_AreOptionsAllDefault, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WIDGET_MenuListBase_C_AreOptionsAllDefault::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.OnHighlightedItemChanged
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MenuListBase_C_OnHighlightedItemChanged final
{
public:
	class UScrollBox*                             K2Node_DynamicCast_AsScroll_Box;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_OnHighlightedItemChanged) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_OnHighlightedItemChanged");
static_assert(sizeof(WIDGET_MenuListBase_C_OnHighlightedItemChanged) == 0x000010, "Wrong size on WIDGET_MenuListBase_C_OnHighlightedItemChanged");
static_assert(offsetof(WIDGET_MenuListBase_C_OnHighlightedItemChanged, K2Node_DynamicCast_AsScroll_Box) == 0x000000, "Member 'WIDGET_MenuListBase_C_OnHighlightedItemChanged::K2Node_DynamicCast_AsScroll_Box' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnHighlightedItemChanged, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WIDGET_MenuListBase_C_OnHighlightedItemChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_OnHighlightedItemChanged, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WIDGET_MenuListBase_C_OnHighlightedItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListBase.WIDGET_MenuListBase_C.SetListInteractive
// 0x0040 (0x0040 - 0x0000)
struct WIDGET_MenuListBase_C_SetListInteractive final
{
public:
	bool                                          ListInteractive;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListBase_C_SetListInteractive) == 0x000008, "Wrong alignment on WIDGET_MenuListBase_C_SetListInteractive");
static_assert(sizeof(WIDGET_MenuListBase_C_SetListInteractive) == 0x000040, "Wrong size on WIDGET_MenuListBase_C_SetListInteractive");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, ListInteractive) == 0x000000, "Member 'WIDGET_MenuListBase_C_SetListInteractive::ListInteractive' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_MenuListBase_C_SetListInteractive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_MenuListBase_C_SetListInteractive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WIDGET_MenuListBase_C_SetListInteractive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WIDGET_MenuListBase_C_SetListInteractive::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListBase_C_SetListInteractive, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'WIDGET_MenuListBase_C_SetListInteractive::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
