#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_UnreadMediaIcon

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_UnreadMediaIcon.WIDGET_UnreadMediaIcon_C
// 0x0028 (0x0288 - 0x0260)
class UWIDGET_UnreadMediaIcon_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_UnreadMediaIcon;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnreadMessage;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PageTab_C*                      PageTab;                                           // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnreadMediaCount;                                  // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseExit(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void InitializeUnreadMediaIcon(class UWIDGET_PlayerHUD_C* PlayerHUD_0, class UWIDGET_PageTab_C* PageTab_0);
	void SetIsUnreadMessage(bool IsUnreadMessage_0);
	void UnreadMessageHandler();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_UnreadMediaIcon_C">();
	}
	static class UWIDGET_UnreadMediaIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_UnreadMediaIcon_C>();
	}
};
static_assert(alignof(UWIDGET_UnreadMediaIcon_C) == 0x000008, "Wrong alignment on UWIDGET_UnreadMediaIcon_C");
static_assert(sizeof(UWIDGET_UnreadMediaIcon_C) == 0x000288, "Wrong size on UWIDGET_UnreadMediaIcon_C");
static_assert(offsetof(UWIDGET_UnreadMediaIcon_C, MESH_UnreadMediaIcon) == 0x000260, "Member 'UWIDGET_UnreadMediaIcon_C::MESH_UnreadMediaIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_UnreadMediaIcon_C, PlayerHUD) == 0x000268, "Member 'UWIDGET_UnreadMediaIcon_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_UnreadMediaIcon_C, IsUnreadMessage) == 0x000270, "Member 'UWIDGET_UnreadMediaIcon_C::IsUnreadMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_UnreadMediaIcon_C, PageTab) == 0x000278, "Member 'UWIDGET_UnreadMediaIcon_C::PageTab' has a wrong offset!");
static_assert(offsetof(UWIDGET_UnreadMediaIcon_C, UnreadMediaCount) == 0x000280, "Member 'UWIDGET_UnreadMediaIcon_C::UnreadMediaCount' has a wrong offset!");

}

