#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MultiFunctionDisplayTabs

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ENUM_MFDTabCategory_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs) == 0x000004, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs) == 0x000008, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs, EntryPoint) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_MultiFunctionDisplayTabs_C_ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_PreConstruct");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_PreConstruct");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.InitializeTabs
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs final
{
public:
	class UWIDGET_PlayerHUD_C*                    PlayerHUD_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs) == 0x000008, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs) == 0x000008, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs, PlayerHUD_0) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_InitializeTabs::PlayerHUD_0' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.SetSelectedTab
// 0x0006 (0x0006 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab final
{
public:
	ENUM_MFDTabCategory                           NewTabCategory;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab) == 0x000001, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab) == 0x000006, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, NewTabCategory) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::NewTabCategory' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, CallFunc_IsVisible_ReturnValue) == 0x000002, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, CallFunc_IsValid_ReturnValue_1) == 0x000003, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'WIDGET_MultiFunctionDisplayTabs_C_SetSelectedTab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.OnBackgroundPanelMouseMove
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove) == 0x000008, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove) == 0x000218, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove, MyGeometry) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove, MouseEvent) == 0x000038, "Member 'WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove, ReturnValue) == 0x0000A8, "Member 'WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_MultiFunctionDisplayTabs_C_OnBackgroundPanelMouseMove::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.IsTabEnabled
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled final
{
public:
	ENUM_MFDTabCategory                           TabCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled) == 0x000001, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled) == 0x000003, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled, TabCategory) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled::TabCategory' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled, Result) == 0x000001, "Member 'WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WIDGET_MultiFunctionDisplayTabs_C_IsTabEnabled::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.UpdateMaterialParameters
// 0x0048 (0x0048 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters final
{
public:
	float                                         Alt_Intensity;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alt_Transition_Background;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BackgroundTexture;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CornerMaterial;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EdgeMaterial;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GridMaterial;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters) == 0x000008, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters) == 0x000048, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, Alt_Intensity) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::Alt_Intensity' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, Alt_Transition_Background) == 0x000004, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::Alt_Transition_Background' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, BackgroundTexture) == 0x000008, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::BackgroundTexture' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, CornerMaterial) == 0x000010, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::CornerMaterial' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, EdgeMaterial) == 0x000018, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::EdgeMaterial' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, GridMaterial) == 0x000020, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::GridMaterial' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial) == 0x000030, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::CallFunc_ConvertBorderToDynamicMaterialInstance_OutCornerMaterial' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::CallFunc_ConvertBorderToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateMaterialParameters::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C.UpdateGamepadIconVisibility
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility) == 0x000008, "Wrong alignment on WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility");
static_assert(sizeof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility) == 0x000018, "Wrong size on WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility, K2Node_DynamicCast_AsCON_Hacker) == 0x000008, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility, CallFunc_IsUsingGamepad_Result) == 0x000011, "Member 'WIDGET_MultiFunctionDisplayTabs_C_UpdateGamepadIconVisibility::CallFunc_IsUsingGamepad_Result' has a wrong offset!");

}

