#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_InventoryPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_InventoryPanel.WIDGET_InventoryPanel_C
// 0x0028 (0x0288 - 0x0260)
class UWIDGET_InventoryPanel_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_Inventory;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCOMP_Inventory_C*                      LootInventory;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBagUI_C*                      BagUI;                                             // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryBag_C*                        InventoryBag;                                      // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeInventoryPanel(class UWIDGET_PlayerHUD_C* HUD, class UInventoryBag_C* Bag);
	struct FEventReply EVENT_OnInventoryMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnInventoryMouseDoubleClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnInventoryMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CreateItemMeshWidget(class UITEM_Base_C* Item, class UGridMeshWidget* BagMeshWidget, int32 ItemCount, class UWIDGET_SlottedItem_C** MeshWidget);
	void CreateItemMeshWidgetFromItem(class UITEM_Base_C* Item, class UGridMeshWidget* BagMeshWidget, class UWIDGET_SlottedItem_C** MeshWidget);
	struct FEventReply OnInventoryMouseMove(const struct FVector2D& MouseScreenPosition);
	struct FEventReply OnInventoryMouseDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, bool DoubleClick);
	void EVENT_OnBagChanged(int32 SlotIndex);
	void OnInventoryBagResized();
	void UpdateInventoryPanelSize();
	void DestroyBagUI();
	void HandleCursorLeave();
	void EVENT_OnInventoryMouseLeave(const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_InventoryPanel_C">();
	}
	static class UWIDGET_InventoryPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_InventoryPanel_C>();
	}
};
static_assert(alignof(UWIDGET_InventoryPanel_C) == 0x000008, "Wrong alignment on UWIDGET_InventoryPanel_C");
static_assert(sizeof(UWIDGET_InventoryPanel_C) == 0x000288, "Wrong size on UWIDGET_InventoryPanel_C");
static_assert(offsetof(UWIDGET_InventoryPanel_C, MESH_Inventory) == 0x000260, "Member 'UWIDGET_InventoryPanel_C::MESH_Inventory' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryPanel_C, LootInventory) == 0x000268, "Member 'UWIDGET_InventoryPanel_C::LootInventory' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryPanel_C, PlayerHUD) == 0x000270, "Member 'UWIDGET_InventoryPanel_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryPanel_C, BagUI) == 0x000278, "Member 'UWIDGET_InventoryPanel_C::BagUI' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryPanel_C, InventoryBag) == 0x000280, "Member 'UWIDGET_InventoryPanel_C::InventoryBag' has a wrong offset!");

}

