#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MFDControllerBumpers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MFDControllerBumpers.WIDGET_MFDControllerBumpers_C
// 0x0038 (0x0298 - 0x0260)
class UWIDGET_MFDControllerBumpers_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RB_Press;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LB_Press;                                          // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_LBHitArea;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_RBHitArea;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Icon_C*            WIDGET_LeftBumperIcon;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Icon_C*            WIDGET_RightBumperIcon;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MFDControllerBumpers(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void InitializeControllerBumpers();
	void UpdatePlatformTextures();
	void PressLB();
	void PressRB();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MFDControllerBumpers_C">();
	}
	static class UWIDGET_MFDControllerBumpers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MFDControllerBumpers_C>();
	}
};
static_assert(alignof(UWIDGET_MFDControllerBumpers_C) == 0x000008, "Wrong alignment on UWIDGET_MFDControllerBumpers_C");
static_assert(sizeof(UWIDGET_MFDControllerBumpers_C) == 0x000298, "Wrong size on UWIDGET_MFDControllerBumpers_C");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MFDControllerBumpers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, RB_Press) == 0x000268, "Member 'UWIDGET_MFDControllerBumpers_C::RB_Press' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, LB_Press) == 0x000270, "Member 'UWIDGET_MFDControllerBumpers_C::LB_Press' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, MESH_LBHitArea) == 0x000278, "Member 'UWIDGET_MFDControllerBumpers_C::MESH_LBHitArea' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, MESH_RBHitArea) == 0x000280, "Member 'UWIDGET_MFDControllerBumpers_C::MESH_RBHitArea' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, WIDGET_LeftBumperIcon) == 0x000288, "Member 'UWIDGET_MFDControllerBumpers_C::WIDGET_LeftBumperIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_MFDControllerBumpers_C, WIDGET_RightBumperIcon) == 0x000290, "Member 'UWIDGET_MFDControllerBumpers_C::WIDGET_RightBumperIcon' has a wrong offset!");

}

