#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls

#include "Basic.hpp"

#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_Options_ControlsTabs_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.ExecuteUbergraph_WIDGET_OptionsMenu_Controls
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Message;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     K2Node_ComponentBoundEvent_TabEnum;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls) == 0x000020, "Wrong size on WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls, EntryPoint) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls, K2Node_ComponentBoundEvent_Message) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls::K2Node_ComponentBoundEvent_Message' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls, K2Node_ComponentBoundEvent_TabEnum) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_C_ExecuteUbergraph_WIDGET_OptionsMenu_Controls::K2Node_ComponentBoundEvent_TabEnum' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     TabEnum;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000018, "Wrong size on WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, Message) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::Message' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, TabEnum) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::TabEnum' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.OnTabSelected
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_OnTabSelected final
{
public:
	class FString                                 ListLabel;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     ListEnum;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListBase_C*                 DesiredList;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListBase_C*                 CurrentList;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_OnTabSelected) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_OnTabSelected");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_OnTabSelected) == 0x000050, "Wrong size on WIDGET_OptionsMenu_Controls_C_OnTabSelected");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, ListLabel) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::ListLabel' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, ListEnum) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::ListEnum' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, DesiredList) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::DesiredList' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CurrentList) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CurrentList' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_GetActiveMenuList_Result) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_GetActiveMenuList_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_GetActiveMenuList_Result_1) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_GetActiveMenuList_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_GetActiveMenuList_Result_2) == 0x000040, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_GetActiveMenuList_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnTabSelected, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'WIDGET_OptionsMenu_Controls_C_OnTabSelected::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.GetListByIndex
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_GetListByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListBase_C*                 List;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListBase_C*>         CallFunc_GetAllControlLists_Result;                // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MenuListBase_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_GetListByIndex) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_GetListByIndex");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_GetListByIndex) == 0x000028, "Wrong size on WIDGET_OptionsMenu_Controls_C_GetListByIndex");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetListByIndex, Index_0) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_GetListByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetListByIndex, List) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_C_GetListByIndex::List' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetListByIndex, CallFunc_GetAllControlLists_Result) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_GetListByIndex::CallFunc_GetAllControlLists_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetListByIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_C_GetListByIndex::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.GetAllControlLists
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_GetAllControlLists final
{
public:
	TArray<class UWIDGET_MenuListBase_C*>         Result;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListBase_C*>         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_GetAllControlLists) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_GetAllControlLists");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_GetAllControlLists) == 0x000020, "Wrong size on WIDGET_OptionsMenu_Controls_C_GetAllControlLists");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetAllControlLists, Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_GetAllControlLists::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_GetAllControlLists, K2Node_MakeArray_Array) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_GetAllControlLists::K2Node_MakeArray_Array' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.InitializeMenu
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_InitializeMenu final
{
public:
	class UWIDGET_MenuBase_C*                     ParentMenuWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListBase_C*>         CallFunc_GetAllControlLists_Result;                // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MenuListBase_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_InitializeMenu) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_InitializeMenu");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_InitializeMenu) == 0x000030, "Wrong size on WIDGET_OptionsMenu_Controls_C_InitializeMenu");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, ParentMenuWidget) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::ParentMenuWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, Temp_int_Variable) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, CallFunc_GetAllControlLists_Result) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::CallFunc_GetAllControlLists_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, CallFunc_Array_Get_Item) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InitializeMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WIDGET_OptionsMenu_Controls_C_InitializeMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.OnMenuOpen
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_OnMenuOpen final
{
public:
	TArray<class UWIDGET_SubMenu_Tab_C*>          CallFunc_GetValidTabs_Result;                      // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_SubMenu_Tab_C*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_OnMenuOpen) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_OnMenuOpen");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_OnMenuOpen) == 0x000028, "Wrong size on WIDGET_OptionsMenu_Controls_C_OnMenuOpen");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnMenuOpen, CallFunc_GetValidTabs_Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_OnMenuOpen::CallFunc_GetValidTabs_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnMenuOpen, CallFunc_Array_Get_Item) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_C_OnMenuOpen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_OnMenuOpen, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_C_OnMenuOpen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C.InvokeNavManager
// 0x0038 (0x0038 - 0x0000)
struct WIDGET_OptionsMenu_Controls_C_InvokeNavManager final
{
public:
	ENUM_MenuNavigationInput                      InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputState;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MenuNavigationRecipient_C> CallFunc_ReceiveNavTabRight_self_CastInput;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavTabRight_Result;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MenuNavigationRecipient_C> CallFunc_ReceiveNavTabLeft_self_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavTabLeft_Result;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_C_InvokeNavManager");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager) == 0x000038, "Wrong size on WIDGET_OptionsMenu_Controls_C_InvokeNavManager");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, InputType) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::InputType' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, InputState) == 0x000001, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_ReceiveNavTabRight_self_CastInput) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_ReceiveNavTabRight_self_CastInput' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_ReceiveNavTabRight_Result) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_ReceiveNavTabRight_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001A, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_ReceiveNavTabLeft_self_CastInput) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_ReceiveNavTabLeft_self_CastInput' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_ReceiveNavTabLeft_Result) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_ReceiveNavTabLeft_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_C_InvokeNavManager, CallFunc_BooleanOR_ReturnValue) == 0x000031, "Member 'WIDGET_OptionsMenu_Controls_C_InvokeNavManager::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

