#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SoftwareItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SoftwareItem.WIDGET_SoftwareItem_C
// 0x0058 (0x02B8 - 0x0260)
class UWIDGET_SoftwareItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CANVAS_SoftwareContainer;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ItemIcon;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SlotBackground;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SlotFrame;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_ItemCount;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SlotItemName;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Key_C*             WIDGET_ButtonLegend_Key;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UITEM_Software_Base_C*                  SoftwareItem;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 KeyIconCode;                                       // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_SoftwareItem(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PopulateSoftwareSlot(class UITEM_Software_Base_C* Item);
	void EVENT_OnBagChanged(int32 SlotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SoftwareItem_C">();
	}
	static class UWIDGET_SoftwareItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SoftwareItem_C>();
	}
};
static_assert(alignof(UWIDGET_SoftwareItem_C) == 0x000008, "Wrong alignment on UWIDGET_SoftwareItem_C");
static_assert(sizeof(UWIDGET_SoftwareItem_C) == 0x0002B8, "Wrong size on UWIDGET_SoftwareItem_C");
static_assert(offsetof(UWIDGET_SoftwareItem_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SoftwareItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, CANVAS_SoftwareContainer) == 0x000268, "Member 'UWIDGET_SoftwareItem_C::CANVAS_SoftwareContainer' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, MESH_ItemIcon) == 0x000270, "Member 'UWIDGET_SoftwareItem_C::MESH_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, MESH_SlotBackground) == 0x000278, "Member 'UWIDGET_SoftwareItem_C::MESH_SlotBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, MESH_SlotFrame) == 0x000280, "Member 'UWIDGET_SoftwareItem_C::MESH_SlotFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, TEXT_ItemCount) == 0x000288, "Member 'UWIDGET_SoftwareItem_C::TEXT_ItemCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, TEXT_SlotItemName) == 0x000290, "Member 'UWIDGET_SoftwareItem_C::TEXT_SlotItemName' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, WIDGET_ButtonLegend_Key) == 0x000298, "Member 'UWIDGET_SoftwareItem_C::WIDGET_ButtonLegend_Key' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, SoftwareItem) == 0x0002A0, "Member 'UWIDGET_SoftwareItem_C::SoftwareItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwareItem_C, KeyIconCode) == 0x0002A8, "Member 'UWIDGET_SoftwareItem_C::KeyIconCode' has a wrong offset!");

}

