#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionCategoryMenuListItem

#include "Basic.hpp"

#include "ENUM_OptionCategories_structs.hpp"
#include "Engine_structs.hpp"
#include "WIDGET_MenuListItemBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionCategoryMenuListItem.WIDGET_OptionCategoryMenuListItem_C
// 0x0080 (0x0390 - 0x0310)
class UWIDGET_OptionCategoryMenuListItem_C final : public UWIDGET_MenuListItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANIM_OnHighlighted;                                // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BTN_InputCollapsed;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BTN_InputExpanded;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_BackgroundCollapsed;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_BackgroundExpanded;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_IconSelectedBorder;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_OptionCategoryIcon;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_OptionCategoryLabel;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UMaterial*>                      OptionCategoryIcon;                                // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENUM_OptionCategories                         ENUM_OptionCategories;                             // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionsScreen_C*                OptionsScreen;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExpanded;                                        // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCategoryButtonClicked;                           // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnCategoryButtonClicked__DelegateSignature(int32 ItemIndex);
	void ExecuteUbergraph_WIDGET_OptionCategoryMenuListItem(int32 EntryPoint);
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputExpanded_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputExpanded_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputCollapsed_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputExpanded_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputExpanded_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputCollapsed_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WIDGET_OptionCategoryMenuListItem_BTN_InputCollapsed_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void EVENT_OnMouseEnter();
	void EVENT_OnMouseExit();
	void EVENT_OnMousePress();
	void SetExpandedState(bool NewExpandedState);
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void SetCategorySelected(bool NewSelectedState);
	void SetCategoryDescription(const class FText& DefaultDescription, const class FText& PlaystationDescription, const class FText& XboxDescription);
	void ReceiveNavAccept(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionCategoryMenuListItem_C">();
	}
	static class UWIDGET_OptionCategoryMenuListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionCategoryMenuListItem_C>();
	}
};
static_assert(alignof(UWIDGET_OptionCategoryMenuListItem_C) == 0x000008, "Wrong alignment on UWIDGET_OptionCategoryMenuListItem_C");
static_assert(sizeof(UWIDGET_OptionCategoryMenuListItem_C) == 0x000390, "Wrong size on UWIDGET_OptionCategoryMenuListItem_C");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, UberGraphFrame) == 0x000310, "Member 'UWIDGET_OptionCategoryMenuListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, ANIM_OnHighlighted) == 0x000318, "Member 'UWIDGET_OptionCategoryMenuListItem_C::ANIM_OnHighlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, BTN_InputCollapsed) == 0x000320, "Member 'UWIDGET_OptionCategoryMenuListItem_C::BTN_InputCollapsed' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, BTN_InputExpanded) == 0x000328, "Member 'UWIDGET_OptionCategoryMenuListItem_C::BTN_InputExpanded' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, IMAGE_BackgroundCollapsed) == 0x000330, "Member 'UWIDGET_OptionCategoryMenuListItem_C::IMAGE_BackgroundCollapsed' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, IMAGE_BackgroundExpanded) == 0x000338, "Member 'UWIDGET_OptionCategoryMenuListItem_C::IMAGE_BackgroundExpanded' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, IMAGE_IconSelectedBorder) == 0x000340, "Member 'UWIDGET_OptionCategoryMenuListItem_C::IMAGE_IconSelectedBorder' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, IMAGE_OptionCategoryIcon) == 0x000348, "Member 'UWIDGET_OptionCategoryMenuListItem_C::IMAGE_OptionCategoryIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, TEXT_OptionCategoryLabel) == 0x000350, "Member 'UWIDGET_OptionCategoryMenuListItem_C::TEXT_OptionCategoryLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, OptionCategoryIcon) == 0x000358, "Member 'UWIDGET_OptionCategoryMenuListItem_C::OptionCategoryIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, ENUM_OptionCategories) == 0x000368, "Member 'UWIDGET_OptionCategoryMenuListItem_C::ENUM_OptionCategories' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, OptionsScreen) == 0x000370, "Member 'UWIDGET_OptionCategoryMenuListItem_C::OptionsScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, IsExpanded) == 0x000378, "Member 'UWIDGET_OptionCategoryMenuListItem_C::IsExpanded' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionCategoryMenuListItem_C, OnCategoryButtonClicked) == 0x000380, "Member 'UWIDGET_OptionCategoryMenuListItem_C::OnCategoryButtonClicked' has a wrong offset!");

}

