#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls_GeneralList

#include "Basic.hpp"

#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsMenu_Controls_GeneralList.WIDGET_OptionsMenu_Controls_GeneralList_C
// 0x0058 (0x0320 - 0x02C8)
class UWIDGET_OptionsMenu_Controls_GeneralList_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Controls_AimAssist_C*           OPTION_Controls_AimAssist;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_FocusAimToggle_C*      OPTION_Controls_AimToggle;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_CrouchToggle_C*        OPTION_Controls_CrouchToggle;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_CyberInvertY_C*        OPTION_Controls_CyberInvertY;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_CyberLookSensitivity_C* OPTION_Controls_CyberLookSensitivity;              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_HackerInvertY_C*       OPTION_Controls_HackerInvertY;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOPTION_Controls_HackerLookSensitivity_C* OPTION_Controls_HackerLookSensitivity;             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_Options;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Cyberspace;              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_General;                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Realspace;               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsMenu_Controls_GeneralList_C">();
	}
	static class UWIDGET_OptionsMenu_Controls_GeneralList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsMenu_Controls_GeneralList_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsMenu_Controls_GeneralList_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsMenu_Controls_GeneralList_C");
static_assert(sizeof(UWIDGET_OptionsMenu_Controls_GeneralList_C) == 0x000320, "Wrong size on UWIDGET_OptionsMenu_Controls_GeneralList_C");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_AimAssist) == 0x0002C8, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_AimAssist' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_AimToggle) == 0x0002D0, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_AimToggle' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_CrouchToggle) == 0x0002D8, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_CrouchToggle' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_CyberInvertY) == 0x0002E0, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_CyberInvertY' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_CyberLookSensitivity) == 0x0002E8, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_CyberLookSensitivity' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_HackerInvertY) == 0x0002F0, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_HackerInvertY' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, OPTION_Controls_HackerLookSensitivity) == 0x0002F8, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::OPTION_Controls_HackerLookSensitivity' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, SCROLLBOX_Options) == 0x000300, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::SCROLLBOX_Options' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, WIDGET_ListCategoryHeader_Cyberspace) == 0x000308, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::WIDGET_ListCategoryHeader_Cyberspace' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, WIDGET_ListCategoryHeader_General) == 0x000310, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::WIDGET_ListCategoryHeader_General' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_GeneralList_C, WIDGET_ListCategoryHeader_Realspace) == 0x000318, "Member 'UWIDGET_OptionsMenu_Controls_GeneralList_C::WIDGET_ListCategoryHeader_Realspace' has a wrong offset!");

}

