#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MultiFunctionDisplayTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_MFDTabCategory_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MultiFunctionDisplayTabs.WIDGET_MultiFunctionDisplayTabs_C
// 0x0060 (0x02C0 - 0x0260)
class UWIDGET_MultiFunctionDisplayTabs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_BackgroundPanel;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_FrameTabBorder;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PageTab_C*                      TAB_Inventory;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PageTab_C*                      TAB_Map;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PageTab_C*                      TAB_Media;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PageTab_C*                      TAB_Software;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PageTab_C*                      TAB_Status;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_MFDControllerBumpers_C*         WIDGET_MFDControllerBumpers;                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_MFDTabCategory                           CurrentTabCategory;                                // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PageTab_C*                      PreviousTab;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MultiFunctionDisplayTabs(int32 EntryPoint);
	void BndEvt__TAB_Software_K2Node_ComponentBoundEvent_14_OnMouseOut__DelegateSignature();
	void BndEvt__TAB_Media_K2Node_ComponentBoundEvent_13_OnMouseOut__DelegateSignature();
	void BndEvt__TAB_Status_K2Node_ComponentBoundEvent_12_OnMouseOut__DelegateSignature();
	void BndEvt__TAB_Map_K2Node_ComponentBoundEvent_11_OnMouseOut__DelegateSignature();
	void BndEvt__TAB_Inventory_K2Node_ComponentBoundEvent_10_OnMouseOut__DelegateSignature();
	void BndEvt__TAB_Status_K2Node_ComponentBoundEvent_9_OnMouseOver__DelegateSignature();
	void BndEvt__TAB_Status_K2Node_ComponentBoundEvent_8_OnMouseClick__DelegateSignature();
	void BndEvt__TAB_Software_K2Node_ComponentBoundEvent_7_OnMouseOver__DelegateSignature();
	void BndEvt__TAB_Media_K2Node_ComponentBoundEvent_6_OnMouseOver__DelegateSignature();
	void BndEvt__TAB_Map_K2Node_ComponentBoundEvent_5_OnMouseOver__DelegateSignature();
	void BndEvt__TAB_Inventory_K2Node_ComponentBoundEvent_4_OnMouseOver__DelegateSignature();
	void BndEvt__TAB_Software_K2Node_ComponentBoundEvent_3_OnMouseClick__DelegateSignature();
	void BndEvt__TAB_Media_K2Node_ComponentBoundEvent_2_OnMouseClick__DelegateSignature();
	void BndEvt__TAB_Map_K2Node_ComponentBoundEvent_1_OnMouseClick__DelegateSignature();
	void BndEvt__TAB_Inventory_K2Node_ComponentBoundEvent_0_OnMouseClick__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void InitializeTabs(class UWIDGET_PlayerHUD_C* PlayerHUD_0);
	void SetSelectedTab(ENUM_MFDTabCategory NewTabCategory);
	struct FEventReply OnBackgroundPanelMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void IsTabEnabled(ENUM_MFDTabCategory TabCategory, bool* Result);
	void UpdateMaterialParameters();
	void UpdateGamepadIconVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MultiFunctionDisplayTabs_C">();
	}
	static class UWIDGET_MultiFunctionDisplayTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MultiFunctionDisplayTabs_C>();
	}
};
static_assert(alignof(UWIDGET_MultiFunctionDisplayTabs_C) == 0x000008, "Wrong alignment on UWIDGET_MultiFunctionDisplayTabs_C");
static_assert(sizeof(UWIDGET_MultiFunctionDisplayTabs_C) == 0x0002C0, "Wrong size on UWIDGET_MultiFunctionDisplayTabs_C");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, MESH_BackgroundPanel) == 0x000268, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::MESH_BackgroundPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, MESH_FrameTabBorder) == 0x000270, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::MESH_FrameTabBorder' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, TAB_Inventory) == 0x000278, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::TAB_Inventory' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, TAB_Map) == 0x000280, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::TAB_Map' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, TAB_Media) == 0x000288, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::TAB_Media' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, TAB_Software) == 0x000290, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::TAB_Software' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, TAB_Status) == 0x000298, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::TAB_Status' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, WIDGET_MFDControllerBumpers) == 0x0002A0, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::WIDGET_MFDControllerBumpers' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, PlayerHUD) == 0x0002A8, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, CurrentTabCategory) == 0x0002B0, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::CurrentTabCategory' has a wrong offset!");
static_assert(offsetof(UWIDGET_MultiFunctionDisplayTabs_C, PreviousTab) == 0x0002B8, "Member 'UWIDGET_MultiFunctionDisplayTabs_C::PreviousTab' has a wrong offset!");

}

