#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MouseOverDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_MouseOverDetails.WIDGET_MouseOverDetails_C
// 0x0028 (0x0288 - 0x0260)
class UWIDGET_MouseOverDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Bar_Bottom;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Mainpanel;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Details;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_MouseOverDetails(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetMouseOverText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_MouseOverDetails_C">();
	}
	static class UWIDGET_MouseOverDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_MouseOverDetails_C>();
	}
};
static_assert(alignof(UWIDGET_MouseOverDetails_C) == 0x000008, "Wrong alignment on UWIDGET_MouseOverDetails_C");
static_assert(sizeof(UWIDGET_MouseOverDetails_C) == 0x000288, "Wrong size on UWIDGET_MouseOverDetails_C");
static_assert(offsetof(UWIDGET_MouseOverDetails_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_MouseOverDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_MouseOverDetails_C, MESH_Background) == 0x000268, "Member 'UWIDGET_MouseOverDetails_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_MouseOverDetails_C, MESH_Bar_Bottom) == 0x000270, "Member 'UWIDGET_MouseOverDetails_C::MESH_Bar_Bottom' has a wrong offset!");
static_assert(offsetof(UWIDGET_MouseOverDetails_C, PANEL_Mainpanel) == 0x000278, "Member 'UWIDGET_MouseOverDetails_C::PANEL_Mainpanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_MouseOverDetails_C, TEXT_Details) == 0x000280, "Member 'UWIDGET_MouseOverDetails_C::TEXT_Details' has a wrong offset!");

}

