#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubMenu_Breadcrumb

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SubMenu_Breadcrumb.WIDGET_SubMenu_Breadcrumb_C.EnableBreadcrumb
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb final
{
public:
	class FText                                   Breadcrumb;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb");
static_assert(sizeof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb) == 0x000028, "Wrong size on WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, Breadcrumb) == 0x000000, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::Breadcrumb' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, Temp_bool_Variable) == 0x000018, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, Temp_byte_Variable) == 0x000019, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, Temp_byte_Variable_1) == 0x00001A, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, CallFunc_TextIsEmpty_ReturnValue) == 0x00001B, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, CallFunc_TextIsEmpty_ReturnValue_1) == 0x00001C, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, K2Node_Select_Default) == 0x00001E, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WIDGET_SubMenu_Breadcrumb_C_EnableBreadcrumb::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WIDGET_SubMenu_Breadcrumb.WIDGET_SubMenu_Breadcrumb_C.ChangeBreadcrumb
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb final
{
public:
	class FText                                   Breadcrumb;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb");
static_assert(sizeof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb) == 0x000020, "Wrong size on WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, Breadcrumb) == 0x000000, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::Breadcrumb' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, Temp_bool_Variable) == 0x000018, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, Temp_byte_Variable) == 0x000019, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, Temp_byte_Variable_1) == 0x00001A, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, CallFunc_TextIsEmpty_ReturnValue) == 0x00001B, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb, K2Node_Select_Default) == 0x00001C, "Member 'WIDGET_SubMenu_Breadcrumb_C_ChangeBreadcrumb::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_SubMenu_Breadcrumb.WIDGET_SubMenu_Breadcrumb_C.DisableBreadcrumb
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb) == 0x000008, "Wrong alignment on WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb");
static_assert(sizeof(WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb) == 0x000008, "Wrong size on WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb");
static_assert(offsetof(WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'WIDGET_SubMenu_Breadcrumb_C_DisableBreadcrumb::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

