#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_Slider

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.ExecuteUbergraph_WIDGET_Settings_Slider
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewSliderValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewAbsoluteValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider) == 0x000004, "Wrong alignment on WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider");
static_assert(sizeof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider) == 0x000010, "Wrong size on WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider");
static_assert(offsetof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider, EntryPoint) == 0x000000, "Member 'WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider, K2Node_ComponentBoundEvent_NewSliderValue) == 0x000004, "Member 'WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider::K2Node_ComponentBoundEvent_NewSliderValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider, K2Node_ComponentBoundEvent_NewAbsoluteValue) == 0x000008, "Member 'WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider::K2Node_ComponentBoundEvent_NewAbsoluteValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WIDGET_Settings_Slider_C_ExecuteUbergraph_WIDGET_Settings_Slider::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	float                                         NewSliderValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewAbsoluteValue;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong size on WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, NewSliderValue) == 0x000000, "Member 'WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::NewSliderValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, NewAbsoluteValue) == 0x000004, "Member 'WIDGET_Settings_Slider_C_BndEvt__WIDGET_Settings_Slider_WIDGET_Slider_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::NewAbsoluteValue' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_Slider_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_Slider_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_Settings_Slider_C_PreConstruct");
static_assert(sizeof(WIDGET_Settings_Slider_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_Settings_Slider_C_PreConstruct");
static_assert(offsetof(WIDGET_Settings_Slider_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_Settings_Slider_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_Settings_Slider_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_Slider_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_Settings_Slider_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on WIDGET_Settings_Slider_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_Settings_Slider_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_Settings_Slider_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_Settings_Slider_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.EVENT_OnMouseExit
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_Settings_Slider_C_EVENT_OnMouseExit final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_Slider_C_EVENT_OnMouseExit) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_EVENT_OnMouseExit");
static_assert(sizeof(WIDGET_Settings_Slider_C_EVENT_OnMouseExit) == 0x000070, "Wrong size on WIDGET_Settings_Slider_C_EVENT_OnMouseExit");
static_assert(offsetof(WIDGET_Settings_Slider_C_EVENT_OnMouseExit, MouseEvent) == 0x000000, "Member 'WIDGET_Settings_Slider_C_EVENT_OnMouseExit::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.OnSliderValueChanged
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_Settings_Slider_C_OnSliderValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_OnSliderValueChanged) == 0x000004, "Wrong alignment on WIDGET_Settings_Slider_C_OnSliderValueChanged");
static_assert(sizeof(WIDGET_Settings_Slider_C_OnSliderValueChanged) == 0x000004, "Wrong size on WIDGET_Settings_Slider_C_OnSliderValueChanged");
static_assert(offsetof(WIDGET_Settings_Slider_C_OnSliderValueChanged, NewValue) == 0x000000, "Member 'WIDGET_Settings_Slider_C_OnSliderValueChanged::NewValue' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.SetIsHighlighted
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Settings_Slider_C_SetIsHighlighted final
{
public:
	bool                                          NewHighlightedState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceInstant;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHighlighted_Result;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHighlighted_Result_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_SetIsHighlighted) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_Settings_Slider_C_SetIsHighlighted) == 0x000018, "Wrong size on WIDGET_Settings_Slider_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, NewHighlightedState) == 0x000000, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::NewHighlightedState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, ForceInstant) == 0x000001, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::ForceInstant' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, CallFunc_GetIsHighlighted_Result) == 0x000002, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::CallFunc_GetIsHighlighted_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, CallFunc_GetIsHighlighted_Result_1) == 0x000003, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::CallFunc_GetIsHighlighted_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000010, "Member 'WIDGET_Settings_Slider_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.GetSlider
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Settings_Slider_C_GetSlider final
{
public:
	class UWIDGET_Slider_C*                       Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_GetSlider) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_GetSlider");
static_assert(sizeof(WIDGET_Settings_Slider_C_GetSlider) == 0x000008, "Wrong size on WIDGET_Settings_Slider_C_GetSlider");
static_assert(offsetof(WIDGET_Settings_Slider_C_GetSlider, Result) == 0x000000, "Member 'WIDGET_Settings_Slider_C_GetSlider::Result' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.ReceiveNavLeft
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_Settings_Slider_C_ReceiveNavLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_Slider_C*                       CallFunc_GetSlider_Result;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_ReceiveNavLeft) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_ReceiveNavLeft");
static_assert(sizeof(WIDGET_Settings_Slider_C_ReceiveNavLeft) == 0x000020, "Wrong size on WIDGET_Settings_Slider_C_ReceiveNavLeft");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, InputState) == 0x000000, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, Result) == 0x000001, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, CallFunc_GetSlider_Result) == 0x000008, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::CallFunc_GetSlider_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, CallFunc_GetSliderValue_NormalizedValue) == 0x000010, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavLeft, CallFunc_SetSliderValue_RealValue) == 0x00001C, "Member 'WIDGET_Settings_Slider_C_ReceiveNavLeft::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.InitializeMenuListItem
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_Settings_Slider_C_InitializeMenuListItem final
{
public:
	class UWIDGET_MenuListBase_C*                 ParentList;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_InitializeMenuListItem) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_InitializeMenuListItem");
static_assert(sizeof(WIDGET_Settings_Slider_C_InitializeMenuListItem) == 0x000020, "Wrong size on WIDGET_Settings_Slider_C_InitializeMenuListItem");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, ParentList) == 0x000000, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::ParentList' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, Index_0) == 0x000008, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::Index_0' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_InitializeMenuListItem, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'WIDGET_Settings_Slider_C_InitializeMenuListItem::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.GetScaledCurrentSliderValue
// 0x000C (0x000C - 0x0000)
struct WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue final
{
public:
	float                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue) == 0x000004, "Wrong alignment on WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue");
static_assert(sizeof(WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue) == 0x00000C, "Wrong size on WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue");
static_assert(offsetof(WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue, Result) == 0x000000, "Member 'WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue, CallFunc_GetSliderValue_NormalizedValue) == 0x000004, "Member 'WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_Slider_C_GetScaledCurrentSliderValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_Slider.WIDGET_Settings_Slider_C.ReceiveNavRight
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_Settings_Slider_C_ReceiveNavRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Increments;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Slider_C*                       CallFunc_GetSlider_Result;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSliderValue_NormalizedValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSliderValue_RealValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_Slider_C_ReceiveNavRight) == 0x000008, "Wrong alignment on WIDGET_Settings_Slider_C_ReceiveNavRight");
static_assert(sizeof(WIDGET_Settings_Slider_C_ReceiveNavRight) == 0x000020, "Wrong size on WIDGET_Settings_Slider_C_ReceiveNavRight");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, InputState) == 0x000000, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, Result) == 0x000001, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, Increments) == 0x000004, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::Increments' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, CallFunc_GetSlider_Result) == 0x000008, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::CallFunc_GetSlider_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, CallFunc_GetSliderValue_NormalizedValue) == 0x000010, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::CallFunc_GetSliderValue_NormalizedValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_Slider_C_ReceiveNavRight, CallFunc_SetSliderValue_RealValue) == 0x00001C, "Member 'WIDGET_Settings_Slider_C_ReceiveNavRight::CallFunc_SetSliderValue_RealValue' has a wrong offset!");

}

