#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SimplifiedHotbarCategoryModal

#include "Basic.hpp"

#include "ENUM_SimplifiedHotbarState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SimplifiedHotbarCategoryModal.WIDGET_SimplifiedHotbarCategoryModal_C
// 0x00D8 (0x0338 - 0x0260)
class UWIDGET_SimplifiedHotbarCategoryModal_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       OpenSelectorMinusRight;                            // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenSelectorMinusLeft;                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenSelectorMinusUp;                               // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_CategoryFrame;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_HotkeyIcon;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_BgInputs;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_SelectedSlotLocation;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_SimplifiedHotbarModalContainer;              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Slots;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_CategoryName;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SelectedSlotCategoryName;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Button;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarInput_C*        WIDGET_Input1;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarInput_C*        WIDGET_Input2;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarInput_C*        WIDGET_Input3;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         WIDGET_SimplifiedHotbarSlot1;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         WIDGET_SimplifiedHotbarSlot2;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         WIDGET_SimplifiedHotbarSlot3;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ENUM_SimplifiedHotbarState                    AssignedHotbarCategory;                            // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_SimplifiedHotbarSlot_C*> SimplifiedHotbarSlots;                             // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FVector>                        UnselectedSlotLocations;                           // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsModalOpen;                                       // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActiveHotbarSlotIndex;                             // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        SelectedSlotLocations;                             // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void InitializeSimplifiedHotbarModal(class UWIDGET_PlayerHUD_C*& PlayerHUD_0);
	void SetModalCategoryText();
	void ToggleModalVisiblityMinusUp();
	void ToggleModalVisiblityMinusLeft();
	void ToggleModalVisiblityMinusRight();
	void MoveSlotTo();
	void ToggleModalVisibility(ENUM_SimplifiedHotbarState HotbarCategoryState);
	void CloseModal();
	void SelectCategoryHotbarSlot(int32 HotbarSlotIndex);
	void AssignSlotNumber();
	void BindHotbarSlotToCategorySlots();
	void MakeSimplifiedHotbarSlotsArray();
	void Handle_Slot_Selection(bool Selected, class UWIDGET_SimplifiedHotbarSlot_C* Simplified_HotbarSlot, class UCanvasPanel* SlotDestination, const struct FVector& Slot_New_Position);
	void SetSelectedSlotLocations();
	void Place_Slot_In(class UWIDGET_SimplifiedHotbarSlot_C* Widget, const struct FVector& NewPosition, class UCanvasPanel* NewParent);
	void SetModalInvisible();
	void Rotate_Input_Icon();
	void UpdateSlotAppearance();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SimplifiedHotbarCategoryModal_C">();
	}
	static class UWIDGET_SimplifiedHotbarCategoryModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SimplifiedHotbarCategoryModal_C>();
	}
};
static_assert(alignof(UWIDGET_SimplifiedHotbarCategoryModal_C) == 0x000008, "Wrong alignment on UWIDGET_SimplifiedHotbarCategoryModal_C");
static_assert(sizeof(UWIDGET_SimplifiedHotbarCategoryModal_C) == 0x000338, "Wrong size on UWIDGET_SimplifiedHotbarCategoryModal_C");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, OpenSelectorMinusRight) == 0x000260, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::OpenSelectorMinusRight' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, OpenSelectorMinusLeft) == 0x000268, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::OpenSelectorMinusLeft' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, OpenSelectorMinusUp) == 0x000270, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::OpenSelectorMinusUp' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, MESH_CategoryFrame) == 0x000278, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::MESH_CategoryFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, MESH_HotkeyIcon) == 0x000280, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::MESH_HotkeyIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, PANEL_BgInputs) == 0x000288, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::PANEL_BgInputs' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, PANEL_SelectedSlotLocation) == 0x000290, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::PANEL_SelectedSlotLocation' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, PANEL_SimplifiedHotbarModalContainer) == 0x000298, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::PANEL_SimplifiedHotbarModalContainer' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, PANEL_Slots) == 0x0002A0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::PANEL_Slots' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, TEXT_CategoryName) == 0x0002A8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::TEXT_CategoryName' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, TEXT_SelectedSlotCategoryName) == 0x0002B0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::TEXT_SelectedSlotCategoryName' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_ButtonLegend_Button) == 0x0002B8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_ButtonLegend_Button' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_Input1) == 0x0002C0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_Input1' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_Input2) == 0x0002C8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_Input2' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_Input3) == 0x0002D0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_Input3' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_SimplifiedHotbarSlot1) == 0x0002D8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_SimplifiedHotbarSlot1' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_SimplifiedHotbarSlot2) == 0x0002E0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_SimplifiedHotbarSlot2' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, WIDGET_SimplifiedHotbarSlot3) == 0x0002E8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::WIDGET_SimplifiedHotbarSlot3' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, AssignedHotbarCategory) == 0x0002F0, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::AssignedHotbarCategory' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, PlayerHUD) == 0x0002F8, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, SimplifiedHotbarSlots) == 0x000300, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::SimplifiedHotbarSlots' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, UnselectedSlotLocations) == 0x000310, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::UnselectedSlotLocations' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, IsModalOpen) == 0x000320, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::IsModalOpen' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, ActiveHotbarSlotIndex) == 0x000324, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::ActiveHotbarSlotIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_SimplifiedHotbarCategoryModal_C, SelectedSlotLocations) == 0x000328, "Member 'UWIDGET_SimplifiedHotbarCategoryModal_C::SelectedSlotLocations' has a wrong offset!");

}

