#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_BootupScreen

#include "Basic.hpp"

#include "ENUM_BootupState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_BootupScreen.WIDGET_BootupScreen_C
// 0x0138 (0x0398 - 0x0260)
class UWIDGET_BootupScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RespawnBootupScreen;                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SecondaryBootupScreen;                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrimaryBootupScreen;                               // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMAGE_Background;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_BorderFrame;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_BotBox;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_HorizontalBar;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_Rorshach;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_TopBox;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_TriopAnimation;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_TriopLogo;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OVERLAY_BootupBorderBoxes;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_PrimaryBootupScreen;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_RespawnBootupScreen;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_SecondaryBootupScreen;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RETAINER_ScreenEffects;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DeviceListing;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_EllipsisInputConfirmed;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_EllipsisRetinaConfirmed;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_EllipsisUplinkConfirmed;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_GrantingRootAccess;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_InitializationFinished;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentElapsedStateTime;                           // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentStateDuration;                              // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_BootupState                              CurrentState;                                      // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnBootupFadingOut;                                 // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnBootupFinished;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CurrentMemCount;                                   // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DeviceListingText;                                 // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   InitializationFinishedText;                        // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   GrantingRootAccessText;                            // 0x0380(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnBootupFinished__DelegateSignature();
	void OnBootupFadingOut__DelegateSignature();
	void ExecuteUbergraph_WIDGET_BootupScreen(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void TEXT_GrantingRootAccess_Event_0(class UTextBlock* TEXT_GrantingRootAccess_0);
	void TEXT_InitializationFinished_Event_4(class UTextBlock* TEXT_InitializationFinished_0);
	void TEXT_InitializationFinished_Event_3(class UTextBlock* TEXT_InitializationFinished_0);
	void TEXT_InitializationFinished_Event_2(class UTextBlock* TEXT_InitializationFinished_0);
	void TEXT_InitializationFinished_Event_1(class UTextBlock* TEXT_InitializationFinished_0);
	void TEXT_InitializationFinished_Event_0(class UTextBlock* TEXT_InitializationFinished_0);
	void TEXT_DeviceListing_Event_4(class UTextBlock* TEXT_DeviceListing_0);
	void TEXT_DeviceListing_Event_2(class UTextBlock* TEXT_DeviceListing_0);
	void TEXT_DeviceListing_Event_1(class UTextBlock* TEXT_DeviceListing_0);
	void TEXT_DeviceListing_Event_0(class UTextBlock* TEXT_DeviceListing_0);
	void TEXT_DeviceListing_Event_3(class UTextBlock* TEXT_DeviceListing_0);
	void TEXT_EllipsisRetinaConfirmed_Event_0(class UTextBlock* TEXT_EllipsisRetinaConfirmed_0);
	void TEXT_EllipsisUplinkConfirmed_Event_3(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void TEXT_EllipsisInputConfirmed_Event_3(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void TEXT_EllipsisInputConfirmed_Event_2(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void TEXT_EllipsisInputConfirmed_Event_1(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void TEXT_EllipsisInputConfirmed_Event_0(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void TEXT_EllipsisUplinkConfirmed_Event_2(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void TEXT_EllipsisUplinkConfirmed_Event_1(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void TEXT_EllipsisUplinkConfirmed_Event_0(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void TEXT_EllipsisRetina_Event_2(class UTextBlock* TEXT_EllipsisRetina);
	void TEXT_EllipsisRetina_Event_1(class UTextBlock* TEXT_EllipsisRetina);
	void TEXT_EllipsisRetina_Event_0(class UTextBlock* TEXT_EllipsisRetina);
	void TEXT_MemCount_IncrementText(class UTextBlock* TEXT_MemCount);
	void StartBootupSequence(bool IsRespawning);
	void SetCurrentState(ENUM_BootupState State);
	void TickBootupSequence(float DeltaTime);
	void UpdateLogoAnimation(float StateProgress);
	void UpdateScreenFlash(float StateProgress);
	void UpdateFadeOut(float StateProgress);
	void AddPeriodToText(class UTextBlock* Text);
	void ResetBootupFields();
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_0(class UTextBlock* TEXT_MemCount);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_1(class UTextBlock* TEXT_EllipsisRetina);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_2(class UTextBlock* TEXT_EllipsisRetina);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_3(class UTextBlock* TEXT_EllipsisRetina);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_4(class UTextBlock* TEXT_EllipsisRetinaConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_5(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_6(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_7(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_8(class UTextBlock* TEXT_EllipsisUplinkConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_9(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_10(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_11(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_12(class UTextBlock* TEXT_EllipsisInputConfirmed_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_13(class UTextBlock* TEXT_DeviceListing_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_14(class UTextBlock* TEXT_DeviceListing_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_15(class UTextBlock* TEXT_DeviceListing_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_16(class UTextBlock* TEXT_DeviceListing_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_17(class UTextBlock* TEXT_DeviceListing_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_18(class UTextBlock* TEXT_InitializationFinished_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_19(class UTextBlock* TEXT_InitializationFinished_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_20(class UTextBlock* TEXT_InitializationFinished_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_21(class UTextBlock* TEXT_InitializationFinished_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_22(class UTextBlock* TEXT_InitializationFinished_0);
	void SequenceEvent__ENTRYPOINTWIDGET_BootupScreen_23(class UTextBlock* TEXT_GrantingRootAccess_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_BootupScreen_C">();
	}
	static class UWIDGET_BootupScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_BootupScreen_C>();
	}
};
static_assert(alignof(UWIDGET_BootupScreen_C) == 0x000008, "Wrong alignment on UWIDGET_BootupScreen_C");
static_assert(sizeof(UWIDGET_BootupScreen_C) == 0x000398, "Wrong size on UWIDGET_BootupScreen_C");
static_assert(offsetof(UWIDGET_BootupScreen_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_BootupScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, RespawnBootupScreen) == 0x000268, "Member 'UWIDGET_BootupScreen_C::RespawnBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, SecondaryBootupScreen) == 0x000270, "Member 'UWIDGET_BootupScreen_C::SecondaryBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, PrimaryBootupScreen) == 0x000278, "Member 'UWIDGET_BootupScreen_C::PrimaryBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_Background) == 0x000280, "Member 'UWIDGET_BootupScreen_C::IMAGE_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_BorderFrame) == 0x000288, "Member 'UWIDGET_BootupScreen_C::IMAGE_BorderFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_BotBox) == 0x000290, "Member 'UWIDGET_BootupScreen_C::IMAGE_BotBox' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_HorizontalBar) == 0x000298, "Member 'UWIDGET_BootupScreen_C::IMAGE_HorizontalBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_Rorshach) == 0x0002A0, "Member 'UWIDGET_BootupScreen_C::IMAGE_Rorshach' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_TopBox) == 0x0002A8, "Member 'UWIDGET_BootupScreen_C::IMAGE_TopBox' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_TriopAnimation) == 0x0002B0, "Member 'UWIDGET_BootupScreen_C::IMAGE_TriopAnimation' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, IMAGE_TriopLogo) == 0x0002B8, "Member 'UWIDGET_BootupScreen_C::IMAGE_TriopLogo' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, OVERLAY_BootupBorderBoxes) == 0x0002C0, "Member 'UWIDGET_BootupScreen_C::OVERLAY_BootupBorderBoxes' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, PANEL_PrimaryBootupScreen) == 0x0002C8, "Member 'UWIDGET_BootupScreen_C::PANEL_PrimaryBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, PANEL_RespawnBootupScreen) == 0x0002D0, "Member 'UWIDGET_BootupScreen_C::PANEL_RespawnBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, PANEL_SecondaryBootupScreen) == 0x0002D8, "Member 'UWIDGET_BootupScreen_C::PANEL_SecondaryBootupScreen' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, RETAINER_ScreenEffects) == 0x0002E0, "Member 'UWIDGET_BootupScreen_C::RETAINER_ScreenEffects' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_DeviceListing) == 0x0002E8, "Member 'UWIDGET_BootupScreen_C::TEXT_DeviceListing' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_EllipsisInputConfirmed) == 0x0002F0, "Member 'UWIDGET_BootupScreen_C::TEXT_EllipsisInputConfirmed' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_EllipsisRetinaConfirmed) == 0x0002F8, "Member 'UWIDGET_BootupScreen_C::TEXT_EllipsisRetinaConfirmed' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_EllipsisUplinkConfirmed) == 0x000300, "Member 'UWIDGET_BootupScreen_C::TEXT_EllipsisUplinkConfirmed' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_GrantingRootAccess) == 0x000308, "Member 'UWIDGET_BootupScreen_C::TEXT_GrantingRootAccess' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, TEXT_InitializationFinished) == 0x000310, "Member 'UWIDGET_BootupScreen_C::TEXT_InitializationFinished' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, CurrentElapsedStateTime) == 0x000318, "Member 'UWIDGET_BootupScreen_C::CurrentElapsedStateTime' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, CurrentStateDuration) == 0x00031C, "Member 'UWIDGET_BootupScreen_C::CurrentStateDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, CurrentState) == 0x000320, "Member 'UWIDGET_BootupScreen_C::CurrentState' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, OnBootupFadingOut) == 0x000328, "Member 'UWIDGET_BootupScreen_C::OnBootupFadingOut' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, OnBootupFinished) == 0x000338, "Member 'UWIDGET_BootupScreen_C::OnBootupFinished' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, CurrentMemCount) == 0x000348, "Member 'UWIDGET_BootupScreen_C::CurrentMemCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, DeviceListingText) == 0x000350, "Member 'UWIDGET_BootupScreen_C::DeviceListingText' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, InitializationFinishedText) == 0x000368, "Member 'UWIDGET_BootupScreen_C::InitializationFinishedText' has a wrong offset!");
static_assert(offsetof(UWIDGET_BootupScreen_C, GrantingRootAccessText) == 0x000380, "Member 'UWIDGET_BootupScreen_C::GrantingRootAccessText' has a wrong offset!");

}

