#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SimplifiedHotbar

#include "Basic.hpp"

#include "ENUM_HotbarStyle_structs.hpp"
#include "ENUM_SimplifiedHotbarState_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SimplifiedHotbar.WIDGET_SimplifiedHotbar_C.ToggleSimplifiedHotbarCategory
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory final
{
public:
	ENUM_SimplifiedHotbarState                    NewHotbarState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_HotbarStyle                              CallFunc_GetHotbarStyle_Result;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory");
static_assert(sizeof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory) == 0x000018, "Wrong size on WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory, NewHotbarState) == 0x000000, "Member 'WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory::NewHotbarState' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory, CallFunc_GetHotbarStyle_Result) == 0x000010, "Member 'WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory::CallFunc_GetHotbarStyle_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WIDGET_SimplifiedHotbar_C_ToggleSimplifiedHotbarCategory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbar.WIDGET_SimplifiedHotbar_C.GetHotbarSlots
// 0x00B8 (0x00B8 - 0x0000)
struct WIDGET_SimplifiedHotbar_C_GetHotbarSlots final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SimplifiedHotbarSlot_C*         K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SimplifiedHotbarSlot_C*         K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_2; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbar_C_GetHotbarSlots");
static_assert(sizeof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots) == 0x0000B8, "Wrong size on WIDGET_SimplifiedHotbar_C_GetHotbarSlots");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, Temp_int_Loop_Counter_Variable_2) == 0x00001C, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Get_Item) == 0x000030, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot) == 0x000040, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_GetAllChildren_ReturnValue_1) == 0x000058, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_GetAllChildren_ReturnValue_2) == 0x000068, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_1) == 0x000088, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_2) == 0x000098, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_AsWIDGET_Simplified_Hotbar_Slot_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Add_ReturnValue_1) == 0x0000A4, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Length_ReturnValue_2) == 0x0000AC, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000B1, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_GetHotbarSlots, CallFunc_Array_Add_ReturnValue_2) == 0x0000B4, "Member 'WIDGET_SimplifiedHotbar_C_GetHotbarSlots::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function WIDGET_SimplifiedHotbar.WIDGET_SimplifiedHotbar_C.InitializeSimplifiedHotbar
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar final
{
public:
	class UWIDGET_PlayerHUD_C*                    Player_HUD;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar");
static_assert(sizeof(WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar) == 0x000008, "Wrong size on WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar, Player_HUD) == 0x000000, "Member 'WIDGET_SimplifiedHotbar_C_InitializeSimplifiedHotbar::Player_HUD' has a wrong offset!");

// Function WIDGET_SimplifiedHotbar.WIDGET_SimplifiedHotbar_C.CloseSimplifiedHotbarModal
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_HotbarStyle                              CallFunc_GetHotbarStyle_Result;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal");
static_assert(sizeof(WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal) == 0x000010, "Wrong size on WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal, CallFunc_GetHotbarStyle_Result) == 0x000008, "Member 'WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal::CallFunc_GetHotbarStyle_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WIDGET_SimplifiedHotbar_C_CloseSimplifiedHotbarModal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIDGET_SimplifiedHotbar.WIDGET_SimplifiedHotbar_C.Select Simplifed Hotbar Slot
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot final
{
public:
	int32                                         HotbarSlotIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_Hotbar_C*                         COMP_Hotbar;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Implant_C*                 K2Node_DynamicCast_AsPAWN_Hacker_Implant_2;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot) == 0x000008, "Wrong alignment on WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot");
static_assert(sizeof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot) == 0x000058, "Wrong size on WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, HotbarSlotIndex) == 0x000000, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::HotbarSlotIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, COMP_Hotbar) == 0x000008, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::COMP_Hotbar' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000018, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_AsPAWN_Hacker_Implant) == 0x000020, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_AsPAWN_Hacker_Implant' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_AsPAWN_Hacker_Implant_1) == 0x000030, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_AsPAWN_Hacker_Implant_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000040, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_AsPAWN_Hacker_Implant_2) == 0x000048, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_AsPAWN_Hacker_Implant_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WIDGET_SimplifiedHotbar_C_Select_Simplifed_Hotbar_Slot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

