#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_SplashScreenList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList
// 0x02A8 (0x02A8 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_5;           // 0x0008(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_4;           // 0x0078(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_3;           // 0x00E8(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_2;           // 0x0158(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_1;           // 0x01C8(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x0238(0x0070)()
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList) == 0x0002A8, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, EntryPoint) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent_5) == 0x000008, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent_5' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent_4) == 0x000078, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent_4' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent_3) == 0x0000E8, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent_2) == 0x000158, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent_1) == 0x0001C8, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList, K2Node_ComponentBoundEvent_InputEvent) == 0x000238, "Member 'WIDGET_MainMenu_SplashScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_SplashScreenList::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Credits_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_QuitGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_NewGame_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_BndEvt__WIDGET_MainMenu_SplashScreenList_WIDGET_MainMenuButton_Continue_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.InitializeItemArray
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetPlatformType_IsConsole;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_InitializeItemArray_MenuListItems;        // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray) == 0x000050, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000010, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, K2Node_MakeArray_Array) == 0x000018, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, CallFunc_GetPlatformType_IsConsole) == 0x000028, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::CallFunc_GetPlatformType_IsConsole' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, CallFunc_InitializeItemArray_MenuListItems) == 0x000030, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::CallFunc_InitializeItemArray_MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray, K2Node_MakeArray_Array_1) == 0x000040, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeItemArray::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.InitializeList
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_InitializeList final
{
public:
	class UWIDGET_MenuBase_C*                     ParentScreen;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlatformType_IsConsole;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_InitializeList) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_InitializeList");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_InitializeList) == 0x000018, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_InitializeList");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeList, ParentScreen) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeList::ParentScreen' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeList, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000008, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeList::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_InitializeList, CallFunc_GetPlatformType_IsConsole) == 0x000010, "Member 'WIDGET_MainMenu_SplashScreenList_C_InitializeList::CallFunc_GetPlatformType_IsConsole' has a wrong offset!");

// Function WIDGET_MainMenu_SplashScreenList.WIDGET_MainMenu_SplashScreenList_C.UpdateContinueLoadButtons
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons final
{
public:
	bool                                          HasSaveFiles;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetExistingSaveGameNames_ReturnValue;     // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons) == 0x000008, "Wrong alignment on WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons");
static_assert(sizeof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons) == 0x000020, "Wrong size on WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons, HasSaveFiles) == 0x000000, "Member 'WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons::HasSaveFiles' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons, CallFunc_GetIsEnabled_ReturnValue) == 0x000001, "Member 'WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons, CallFunc_GetExistingSaveGameNames_ReturnValue) == 0x000008, "Member 'WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons::CallFunc_GetExistingSaveGameNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_MainMenu_SplashScreenList_C_UpdateContinueLoadButtons::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

