#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls_BindsList

#include "Basic.hpp"

#include "STRUCT_BoundInputActionPair_structs.hpp"
#include "ENUM_PrimarySecondary_structs.hpp"
#include "InputCore_structs.hpp"
#include "ENUM_InputCategory_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.InitializeList
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList final
{
public:
	class UWIDGET_MenuBase_C*                     ParentScreen;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList) == 0x000008, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList, ParentScreen) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_InitializeList::ParentScreen' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.StashKeyAction
// 0x00D8 (0x00D8 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   KeyMapping;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	ENUM_PrimarySecondary                         Rank;                                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputCategoryFromActionName_Found;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_InputCategory                            CallFunc_GetInputCategoryFromActionName_Result;    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_InputCategory                            Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> K2Node_Select_Default;                             // 0x0038(0x0050)()
	TArray<class FName>                           CallFunc_BindKeyAction_ChangedActionNames;         // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Controls_InputBind_C*           CallFunc_Map_Find_Value;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction) == 0x0000D8, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, ActionName) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::ActionName' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, KeyMapping) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::KeyMapping' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, Rank) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::Rank' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_GetInputCategoryFromActionName_Found) == 0x000021, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_GetInputCategoryFromActionName_Found' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_GetInputCategoryFromActionName_Result) == 0x000022, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_GetInputCategoryFromActionName_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, Temp_byte_Variable) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, K2Node_Select_Default) == 0x000038, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_BindKeyAction_ChangedActionNames) == 0x000088, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_BindKeyAction_ChangedActionNames' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Array_Get_Item) == 0x00009C, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Conv_NameToString_ReturnValue) == 0x0000B8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_StashKeyAction::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.GetStashedKeyForAction
// 0x0098 (0x0098 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_PrimarySecondary                         Rank;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Result;                                            // 0x0010(0x0018)(Parm, OutParm, HasGetValueTypeHash)
	ENUM_InputCategory                            Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInputCategoryFromActionName_Found;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_InputCategory                            CallFunc_GetInputCategoryFromActionName_Result;    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> K2Node_Select_Default;                             // 0x0030(0x0050)()
	struct FKey                                   CallFunc_GetBoundKey_BoundKey;                     // 0x0080(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction) == 0x000098, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, ActionName) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::ActionName' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, Rank) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::Rank' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, Result) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, Temp_byte_Variable) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, CallFunc_GetInputCategoryFromActionName_Found) == 0x000029, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::CallFunc_GetInputCategoryFromActionName_Found' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, CallFunc_GetInputCategoryFromActionName_Result) == 0x00002A, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::CallFunc_GetInputCategoryFromActionName_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, K2Node_Select_Default) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction, CallFunc_GetBoundKey_BoundKey) == 0x000080, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetStashedKeyForAction::CallFunc_GetBoundKey_BoundKey' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.IsGamepadBindsList
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList) == 0x000001, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList) == 0x000001, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList, Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_IsGamepadBindsList::Result' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.SetIsOptionListeningForInput
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput final
{
public:
	bool                                          IsListening;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput) == 0x000001, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput) == 0x000001, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput, IsListening) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_SetIsOptionListeningForInput::IsListening' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.GetIsOptionListeningForInput
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput) == 0x000001, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput) == 0x000001, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput, Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_GetIsOptionListeningForInput::Result' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.UpdateCurrentVisuals
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options;              // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOPTION_Controls_InputBind_C*           K2Node_DynamicCast_AsOPTION_Controls_Input_Bind;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals) == 0x000050, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_GetAllMenuListItems_Options) == 0x000010, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_GetAllMenuListItems_Options' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, K2Node_DynamicCast_AsOPTION_Controls_Input_Bind) == 0x000038, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::K2Node_DynamicCast_AsOPTION_Controls_Input_Bind' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals, CallFunc_Conv_StringToName_ReturnValue) == 0x000044, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_UpdateCurrentVisuals::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.HasInputKeyMapChanged
// 0x02D8 (0x02D8 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged final
{
public:
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> OldKeyMap;                                         // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> NewKeyMap;                                         // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Result;                                            // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_BoundInputActionPair           NewBoundKeyPair;                                   // 0x00A8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTRUCT_BoundInputActionPair           OldBoundKeyPair;                                   // 0x00D8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   InputActionName;                                   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             NewKeySet;                                         // 0x0110(0x0050)(Edit, BlueprintVisible)
	TSet<class FName>                             OldKeySet;                                         // 0x0160(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x01C8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x01D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys_2;                          // 0x01F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_BoundInputActionPair           CallFunc_Map_Find_Value;                           // 0x0210(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_BoundInputActionPair           CallFunc_Map_Find_Value_1;                         // 0x0248(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class FName>                             CallFunc_Set_Intersection_Result;                  // 0x0280(0x0050)()
	int32                                         CallFunc_Set_Length_ReturnValue_1;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged) == 0x0002D8, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, OldKeyMap) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::OldKeyMap' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, NewKeyMap) == 0x000050, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::NewKeyMap' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, Result) == 0x0000A0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, NewBoundKeyPair) == 0x0000A8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::NewBoundKeyPair' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, OldBoundKeyPair) == 0x0000D8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::OldBoundKeyPair' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, InputActionName) == 0x000108, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::InputActionName' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, NewKeySet) == 0x000110, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::NewKeySet' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, OldKeySet) == 0x000160, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::OldKeySet' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, Temp_int_Array_Index_Variable) == 0x0001B0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, Temp_int_Loop_Counter_Variable) == 0x0001B4, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Length_ReturnValue) == 0x0001BC, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Length_ReturnValue_1) == 0x0001C0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C4, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Keys_Keys) == 0x0001C8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Keys_Keys_1) == 0x0001D8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Less_IntInt_ReturnValue) == 0x0001F4, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Keys_Keys_2) == 0x0001F8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000208, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Find_Value) == 0x000210, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Find_ReturnValue) == 0x000240, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000241, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_BooleanAND_ReturnValue) == 0x000242, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000243, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Find_Value_1) == 0x000248, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Map_Find_ReturnValue_1) == 0x000278, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Set_Length_ReturnValue) == 0x00027C, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Set_Intersection_Result) == 0x000280, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Set_Intersection_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_Set_Length_ReturnValue_1) == 0x0002D0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_Set_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002D4, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_HasInputKeyMapChanged::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.ResetStashedBinds
// 0x0288 (0x0288 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds final
{
public:
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result;   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_1; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result;           // 0x0028(0x0050)()
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result_1;         // 0x0080(0x0050)()
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_2; // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_2; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result_2;         // 0x00E8(0x0050)()
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_3; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_4; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_5; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_3; // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_4; // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_GetOrCreateInputKeyMapForCategory_Result; // 0x0170(0x0050)()
	bool                                          CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_GetOrCreateInputKeyMapForCategory_Result_1; // 0x01C8(0x0050)()
	bool                                          CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_1; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_5; // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_GetOrCreateInputKeyMapForCategory_Result_2; // 0x0230(0x0050)()
	bool                                          CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_2; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds) == 0x000288, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result_1) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_BuildDefaultInputKeyMap_Result) == 0x000028, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_BuildDefaultInputKeyMap_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings_1) == 0x000078, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_BuildDefaultInputKeyMap_Result_1) == 0x000080, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_BuildDefaultInputKeyMap_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result_2) == 0x0000D0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings_2) == 0x0000E0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_BuildDefaultInputKeyMap_Result_2) == 0x0000E8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_BuildDefaultInputKeyMap_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings_3) == 0x000138, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings_3' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings_4) == 0x000140, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings_4' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetShockSettingsForCurrentUser_Settings_5) == 0x000148, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetShockSettingsForCurrentUser_Settings_5' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result_3) == 0x000150, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result_3' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result_4) == 0x000160, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result_4' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_Result) == 0x000170, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault) == 0x0001C0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_Result_1) == 0x0001C8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_1) == 0x000218, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetInputActionPrefixForCategory_Result_5) == 0x000220, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetInputActionPrefixForCategory_Result_5' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_Result_2) == 0x000230, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds, CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_2) == 0x000280, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ResetStashedBinds::CallFunc_GetOrCreateInputKeyMapForCategory_IsDefault_2' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.ReceiveNavAlt1
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveNavAlt1_Result;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result;   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_2; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1) == 0x000050, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, InputState) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, Result) == 0x000001, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_ReceiveNavAlt1_Result) == 0x000002, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_ReceiveNavAlt1_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetInputActionPrefixForCategory_Result) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetInputActionPrefixForCategory_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetInputActionPrefixForCategory_Result_1) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetInputActionPrefixForCategory_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetShockSettingsForCurrentUser_Settings_1) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetShockSettingsForCurrentUser_Settings_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetInputActionPrefixForCategory_Result_2) == 0x000038, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetInputActionPrefixForCategory_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1, CallFunc_GetShockSettingsForCurrentUser_Settings_2) == 0x000048, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt1::CallFunc_GetShockSettingsForCurrentUser_Settings_2' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.ReceiveNavAlt2
// 0x0140 (0x0140 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result;   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result;           // 0x0030(0x0050)()
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputActionPrefixForCategory_Result_2; // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result_1;         // 0x0098(0x0050)()
	class USAVE_Settings_C*                       CallFunc_GetShockSettingsForCurrentUser_Settings_2; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> CallFunc_BuildDefaultInputKeyMap_Result_2;         // 0x00F0(0x0050)()
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2) == 0x000140, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, InputState) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, Result) == 0x000001, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetInputActionPrefixForCategory_Result) == 0x000008, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetInputActionPrefixForCategory_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetShockSettingsForCurrentUser_Settings) == 0x000018, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetShockSettingsForCurrentUser_Settings' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetInputActionPrefixForCategory_Result_1) == 0x000020, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetInputActionPrefixForCategory_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_BuildDefaultInputKeyMap_Result) == 0x000030, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_BuildDefaultInputKeyMap_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetShockSettingsForCurrentUser_Settings_1) == 0x000080, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetShockSettingsForCurrentUser_Settings_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetInputActionPrefixForCategory_Result_2) == 0x000088, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetInputActionPrefixForCategory_Result_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_BuildDefaultInputKeyMap_Result_1) == 0x000098, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_BuildDefaultInputKeyMap_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_GetShockSettingsForCurrentUser_Settings_2) == 0x0000E8, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_GetShockSettingsForCurrentUser_Settings_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2, CallFunc_BuildDefaultInputKeyMap_Result_2) == 0x0000F0, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavAlt2::CallFunc_BuildDefaultInputKeyMap_Result_2' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.ReceiveNavBack
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack) == 0x000001, "Wrong alignment on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack");
static_assert(sizeof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack) == 0x000002, "Wrong size on WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack, InputState) == 0x000000, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack, Result) == 0x000001, "Member 'WIDGET_OptionsMenu_Controls_BindsList_C_ReceiveNavBack::Result' has a wrong offset!");

// Function WIDGET_OptionsMenu_Controls_BindsList.WIDGET_OptionsMenu_Controls_BindsList_C.EVENT_OnOptionChanged
// 0x0328 (0x0328 - 0x0000)
struct WIDGET_OptionsMenu_Controls_BindsList_C_EVENT_OnOptionChanged final
{
public:
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> SavedMinigameKeyMap;                               // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class FName, struct FSTRUCT_BoundInputActionPair> SavedCyberspaceKeyMap;                             // 0x0050(0x0050)(Edit, BlueprintVisible)
