#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DifficultyConfigScreen

#include "Basic.hpp"

#include "ENUM_GameDifficulty_structs.hpp"
#include "STRUCT_MissionDifficultySettings_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.ExecuteUbergraph_WIDGET_DifficultyConfigScreen
// 0x00F0 (0x00F0 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_IndexInList_3;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_IndexInList_2;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_IndexInList_1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_IndexInList;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x0018(0x0070)()
	bool                                          CallFunc_IsMedicalDemo_Result;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsUsingGamepad)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen) == 0x0000F0, "Wrong size on WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, EntryPoint) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_ComponentBoundEvent_IndexInList_3) == 0x000004, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_ComponentBoundEvent_IndexInList_3' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_ComponentBoundEvent_IndexInList_2) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_ComponentBoundEvent_IndexInList_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_ComponentBoundEvent_IndexInList_1) == 0x00000C, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_ComponentBoundEvent_IndexInList_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_ComponentBoundEvent_IndexInList) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_ComponentBoundEvent_IndexInList' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_ComponentBoundEvent_InputEvent) == 0x000018, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, CallFunc_IsMedicalDemo_Result) == 0x000088, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::CallFunc_IsMedicalDemo_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000090, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_DynamicCast_AsCON_Hacker) == 0x0000A8, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_Event_MyGeometry) == 0x0000B4, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen, K2Node_Event_InDeltaTime) == 0x0000EC, "Member 'WIDGET_DifficultyConfigScreen_C_ExecuteUbergraph_WIDGET_DifficultyConfigScreen::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_Tick) == 0x000004, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_Tick");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_Tick) == 0x00003C, "Wrong size on WIDGET_DifficultyConfigScreen_C_Tick");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_ConfirmButton_K2Node_ComponentBoundEvent_5_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature final
{
public:
	int32                                         IndexInList;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong size on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature, IndexInList) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Puzzle_K2Node_ComponentBoundEvent_4_OnSelectHexLayout__DelegateSignature::IndexInList' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature final
{
public:
	int32                                         IndexInList;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong size on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature, IndexInList) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Cyber_K2Node_ComponentBoundEvent_3_OnSelectHexLayout__DelegateSignature::IndexInList' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature final
{
public:
	int32                                         IndexInList;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong size on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature, IndexInList) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Mission_K2Node_ComponentBoundEvent_2_OnSelectHexLayout__DelegateSignature::IndexInList' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature final
{
public:
	int32                                         IndexInList;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature) == 0x000004, "Wrong size on WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature, IndexInList) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_BndEvt__WIDGET_DifficultyConfigScreen_WIDGET_DifficultyHexagon_Combat_K2Node_ComponentBoundEvent_1_OnSelectHexLayout__DelegateSignature::IndexInList' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetDefaults
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetDefaults final
{
public:
	class UWIDGET_CrosshairCursor_C*              CursorWidget_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetDefaults) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetDefaults");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetDefaults) == 0x000010, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetDefaults");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetDefaults, CursorWidget_0) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetDefaults::CursorWidget_0' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetDefaults, CallFunc_GetChildIndex_ReturnValue) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetDefaults::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetAsParentInChildren
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MainMenuButton_C*               K2Node_DynamicCast_AsWIDGET_Main_Menu_Button;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_DifficultyHexagonLayout_C*      K2Node_DynamicCast_AsWIDGET_Difficulty_Hexagon_Layout; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren) == 0x000058, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, K2Node_DynamicCast_AsWIDGET_Main_Menu_Button) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::K2Node_DynamicCast_AsWIDGET_Main_Menu_Button' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, K2Node_DynamicCast_AsWIDGET_Difficulty_Hexagon_Layout) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::K2Node_DynamicCast_AsWIDGET_Difficulty_Hexagon_Layout' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WIDGET_DifficultyConfigScreen_C_SetAsParentInChildren::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.GetDifficultySettings
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_GetDifficultySettings final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Combat;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Mission;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Puzzle;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           CallFunc_GetDifficultyValues_Cyber;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_GetDifficultySettings");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings) == 0x000018, "Wrong size on WIDGET_DifficultyConfigScreen_C_GetDifficultySettings");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, K2Node_DynamicCast_AsGI_Single_Player) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, CallFunc_GetDifficultyValues_Combat) == 0x000011, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::CallFunc_GetDifficultyValues_Combat' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, CallFunc_GetDifficultyValues_Mission) == 0x000012, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::CallFunc_GetDifficultyValues_Mission' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, CallFunc_GetDifficultyValues_Puzzle) == 0x000013, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::CallFunc_GetDifficultyValues_Puzzle' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_GetDifficultySettings, CallFunc_GetDifficultyValues_Cyber) == 0x000014, "Member 'WIDGET_DifficultyConfigScreen_C_GetDifficultySettings::CallFunc_GetDifficultyValues_Cyber' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetHighlightInDemonstratonPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_DifficultyHexagonLayout_C*> K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_DifficultyHexagonLayout_C*      CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel) == 0x000050, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, K2Node_MakeArray_Array) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, CallFunc_Array_Get_Item) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, K2Node_MakeArray_Array_1) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetHighlightInDemonstratonPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetCombatInDemonstrationPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel) == 0x000050, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000018, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000030, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_8) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetCombatInDemonstrationPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetMissionInDemonstrationPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel) == 0x000050, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, K2Node_MakeStruct_LinearColor_1) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, K2Node_MakeStruct_LinearColor_2) == 0x000030, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetMissionInDemonstrationPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetPuzzleInDemonstrationPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel) == 0x000050, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000018, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000030, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_8) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetPuzzleInDemonstrationPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.SetCyberInDemonstrationPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel) == 0x000008, "Wrong alignment on WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel");
static_assert(sizeof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel) == 0x000050, "Wrong size on WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000010, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000018, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000020, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000028, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000030, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000038, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, CallFunc_GetDynamicMaterial_ReturnValue_8) == 0x000040, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::CallFunc_GetDynamicMaterial_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WIDGET_DifficultyConfigScreen_C_SetCyberInDemonstrationPanel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_DifficultyConfigScreen.WIDGET_DifficultyConfigScreen_C.Update Description
// 0x0320 (0x0320 - 0x0000)
struct WIDGET_DifficultyConfigScreen_C_Update_Description final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0030(0x0018)()
	ENUM_GameDifficulty                           Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	ENUM_GameDifficulty                           Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x00A0(0x0018)()
	ENUM_GameDifficulty                           Temp_byte_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00F0(0x0018)()
	ENUM_GameDifficulty                           Temp_byte_Variable_3;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_GameDifficulty                           Temp_byte_Variable_4;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0140(0x0018)()
	class UWIDGET_MenuListItemBase_C*             K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base;   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_DifficultyHexagonLayout_C*      K2Node_DynamicCast_AsWIDGET_Difficulty_Hexagon_Layout; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_MissionDifficultySettings      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0218(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0228(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0240(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0258(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
