#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_TutorialMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STRUCT_TutorialInstance_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_TutorialMessage.WIDGET_TutorialMessage_C
// 0x00B0 (0x0310 - 0x0260)
class UWIDGET_TutorialMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_TargetLine;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_TutorialMessage;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSTRUCT_TutorialInstance               CurrentTutorial;                                   // 0x0280(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CurrentMessage;                                    // 0x02A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TargetMessage;                                     // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NoWeaponTutorialMessage;                           // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TutorialsOverridden;                               // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APAWN_Hacker_Simple_C*                  PlayerHacker;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SourceOpacity;                                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetOpacity;                                     // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionRate;                                    // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_TutorialMessage(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitializeTutorialMessage();
	void SetCurrentTutorial(const struct FSTRUCT_TutorialInstance& Tutorial);
	void SetTutorialsEnabled(bool TutorialsEnabled);
	void SetTutorialsOverridden(bool TutorialsOverridden_0);
	void TryShowTutorialMessage();
	void TryHideTutorialMessage();
	void UpdateCurrentMessageToTarget();
	void UpdateRenderOpacity(float DeltaTime);
	void UpdateTargetLine();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_TutorialMessage_C">();
	}
	static class UWIDGET_TutorialMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_TutorialMessage_C>();
	}
};
static_assert(alignof(UWIDGET_TutorialMessage_C) == 0x000008, "Wrong alignment on UWIDGET_TutorialMessage_C");
static_assert(sizeof(UWIDGET_TutorialMessage_C) == 0x000310, "Wrong size on UWIDGET_TutorialMessage_C");
static_assert(offsetof(UWIDGET_TutorialMessage_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_TutorialMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, MESH_Background) == 0x000268, "Member 'UWIDGET_TutorialMessage_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, MESH_TargetLine) == 0x000270, "Member 'UWIDGET_TutorialMessage_C::MESH_TargetLine' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, TEXT_TutorialMessage) == 0x000278, "Member 'UWIDGET_TutorialMessage_C::TEXT_TutorialMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, CurrentTutorial) == 0x000280, "Member 'UWIDGET_TutorialMessage_C::CurrentTutorial' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, CurrentMessage) == 0x0002A8, "Member 'UWIDGET_TutorialMessage_C::CurrentMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, TargetMessage) == 0x0002C0, "Member 'UWIDGET_TutorialMessage_C::TargetMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, NoWeaponTutorialMessage) == 0x0002D8, "Member 'UWIDGET_TutorialMessage_C::NoWeaponTutorialMessage' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, TutorialsOverridden) == 0x0002F0, "Member 'UWIDGET_TutorialMessage_C::TutorialsOverridden' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, PlayerHacker) == 0x0002F8, "Member 'UWIDGET_TutorialMessage_C::PlayerHacker' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, SourceOpacity) == 0x000300, "Member 'UWIDGET_TutorialMessage_C::SourceOpacity' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, TargetOpacity) == 0x000304, "Member 'UWIDGET_TutorialMessage_C::TargetOpacity' has a wrong offset!");
static_assert(offsetof(UWIDGET_TutorialMessage_C, TransitionRate) == 0x000308, "Member 'UWIDGET_TutorialMessage_C::TransitionRate' has a wrong offset!");

}

