#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_InventoryContextMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.InitializeInventoryContextMenu
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu final
{
public:
	class UWIDGET_PlayerHUD_C*                    HUDWidget_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInventoryContextMenuEnabled_Result;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu) == 0x000010, "Wrong size on WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu, HUDWidget_0) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu::HUDWidget_0' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu, CallFunc_SetInventoryContextMenuEnabled_Result) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_InitializeInventoryContextMenu::CallFunc_SetInventoryContextMenuEnabled_Result' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.SetInventoryContextMenuEnabled
// 0x01A8 (0x01A8 - 0x0000)
struct WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MousePosition;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        ItemBag;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BagSlot;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_InventoryPanel_C*               InventoryPanel;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCONTEXT_Base_C*                        CurrentContextWidget;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CurrentContextClass;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValidChildCount;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           SlotItem;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOptionBeDisplayed_Result;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCONTEXT_Base_C*                        CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x0070(0x0010)(NoDestructor)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0080(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Array_Get_Item;                           // 0x00E0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsCONTEXT_Base;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Base_C*                           CallFunc_GetSlotItem_Item;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetWindowPointFromScreenPoint_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTriangleIndexAtWindowPoint_OutBarycentricCoords; // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTriangleIndexAtWindowPoint_ReturnValue; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetUnprojectedTrianglePoint_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled) == 0x0001A8, "Wrong size on WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, Enabled) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, MousePosition) == 0x000004, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::MousePosition' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, ItemBag) == 0x000010, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::ItemBag' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, BagSlot) == 0x000018, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::BagSlot' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, InventoryPanel) == 0x000020, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::InventoryPanel' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, Result) == 0x000028, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CurrentContextWidget) == 0x000030, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CurrentContextWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CurrentContextClass) == 0x000038, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CurrentContextClass' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, ValidChildCount) == 0x000040, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::ValidChildCount' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, SlotItem) == 0x000048, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::SlotItem' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, Temp_int_Array_Index_Variable) == 0x000058, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_CanOptionBeDisplayed_Result) == 0x00005C, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_CanOptionBeDisplayed_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Create_ReturnValue) == 0x000060, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000068, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetAnchors_ReturnValue) == 0x000070, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetCachedGeometry_ReturnValue) == 0x000080, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetLocalSize_ReturnValue) == 0x0000B8, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0000C0, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_IsValidClass_ReturnValue) == 0x0000C8, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000D0, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000110, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, K2Node_ClassDynamicCast_AsCONTEXT_Base) == 0x000120, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::K2Node_ClassDynamicCast_AsCONTEXT_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, K2Node_ClassDynamicCast_bSuccess) == 0x000128, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_AddChild_ReturnValue) == 0x000130, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000138, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetSlotItem_Item) == 0x000140, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetSlotItem_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000148, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000150, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000158, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetWindowPointFromScreenPoint_ReturnValue) == 0x000160, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetWindowPointFromScreenPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetTriangleIndexAtWindowPoint_OutBarycentricCoords) == 0x000168, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetTriangleIndexAtWindowPoint_OutBarycentricCoords' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetTriangleIndexAtWindowPoint_ReturnValue) == 0x000174, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetTriangleIndexAtWindowPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_GetUnprojectedTrianglePoint_ReturnValue) == 0x000178, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_GetUnprojectedTrianglePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_BreakVector2D_X) == 0x000180, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_BreakVector2D_Y) == 0x000184, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000188, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_MakeVector2D_ReturnValue) == 0x00018C, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000194, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x00019C, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled, Temp_int_Variable) == 0x0001A4, "Member 'WIDGET_InventoryContextMenu_C_SetInventoryContextMenuEnabled::Temp_int_Variable' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.SetContextItemMouseOver
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_InventoryContextMenu_C_SetContextItemMouseOver final
{
public:
	bool                                          CursorOver;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disabled;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextMeshWidget*                        TextMesh;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        ImageMesh;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default;                             // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_Select_Default_1;                           // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_SetContextItemMouseOver");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver) == 0x000030, "Wrong size on WIDGET_InventoryContextMenu_C_SetContextItemMouseOver");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, CursorOver) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::CursorOver' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, Disabled) == 0x000001, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::Disabled' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, TextMesh) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::TextMesh' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, ImageMesh) == 0x000010, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::ImageMesh' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, Temp_bool_Variable) == 0x000018, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, Temp_bool_Variable_1) == 0x00001A, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, CallFunc_GetMeshUIColor_Color) == 0x00001C, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, CallFunc_GetMeshUIColor_Color_1) == 0x000020, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::CallFunc_GetMeshUIColor_Color_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, K2Node_Select_Default) == 0x000024, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetContextItemMouseOver, K2Node_Select_Default_1) == 0x000028, "Member 'WIDGET_InventoryContextMenu_C_SetContextItemMouseOver::K2Node_Select_Default_1' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.IsInventoryContextEnabled
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled) == 0x000001, "Wrong alignment on WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled) == 0x000001, "Wrong size on WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled, Result) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_IsInventoryContextEnabled::Result' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.GetDisabledColor
// 0x0044 (0x0044 - 0x0000)
struct WIDGET_InventoryContextMenu_C_GetDisabledColor final
{
public:
	struct FColor                                 DisabledColor;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetMeshUIColor_Color_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_MakeStruct_Color;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_GetDisabledColor) == 0x000004, "Wrong alignment on WIDGET_InventoryContextMenu_C_GetDisabledColor");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_GetDisabledColor) == 0x000044, "Wrong size on WIDGET_InventoryContextMenu_C_GetDisabledColor");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, DisabledColor) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::DisabledColor' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_GetMeshUIColor_Color) == 0x000004, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_GetMeshUIColor_Color' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_GetMeshUIColor_Color_1) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_GetMeshUIColor_Color_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x00001C, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_LinearColorLerp_ReturnValue) == 0x00002C, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x00003C, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_GetDisabledColor, K2Node_MakeStruct_Color) == 0x000040, "Member 'WIDGET_InventoryContextMenu_C_GetDisabledColor::K2Node_MakeStruct_Color' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.UpdateBackgroundWidget
// 0x0038 (0x0038 - 0x0000)
struct WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget) == 0x000038, "Wrong size on WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_GetSize_ReturnValue) == 0x00000C, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_Multiply_IntInt_ReturnValue) == 0x000014, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_BreakVector2D_Y) == 0x00001C, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000028, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WIDGET_InventoryContextMenu_C_UpdateBackgroundWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.SetSelectedOptionWidgetState
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState final
{
public:
	class UCONTEXT_Base_C*                        OptionWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState) == 0x000010, "Wrong size on WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, OptionWidget) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::OptionWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, State) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::State' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00000A, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, CallFunc_IsValid_ReturnValue_1) == 0x00000B, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000C, "Member 'WIDGET_InventoryContextMenu_C_SetSelectedOptionWidgetState::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.TrySelectFirstContextOption
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption final
{
public:
	class UVerticalBox*                           VerticalBox;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCONTEXT_Base_C*                        CandidateOptionWidget;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCONTEXT_Base_C*                        K2Node_DynamicCast_AsCONTEXT_Base;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOptionBeActivated_Result;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption) == 0x000050, "Wrong size on WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, VerticalBox) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::VerticalBox' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CandidateOptionWidget) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CandidateOptionWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, Temp_int_Variable) == 0x000010, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, K2Node_DynamicCast_AsCONTEXT_Base) == 0x000020, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::K2Node_DynamicCast_AsCONTEXT_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_GetChildrenCount_ReturnValue) == 0x00002C, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_CanOptionBeActivated_Result) == 0x000035, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_CanOptionBeActivated_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, K2Node_DynamicCast_AsCON_Hacker) == 0x000040, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption, CallFunc_IsUsingGamepad_Result) == 0x000049, "Member 'WIDGET_InventoryContextMenu_C_TrySelectFirstContextOption::CallFunc_IsUsingGamepad_Result' has a wrong offset!");

// Function WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C.TrySelectNextContextOption
// 0x0060 (0x0060 - 0x0000)
struct WIDGET_InventoryContextMenu_C_TrySelectNextContextOption final
{
public:
	class UVerticalBox*                           VerticalBox;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Previous;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCONTEXT_Base_C*                        NewOptionWidget;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOptionBeActivated_Result;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCONTEXT_Base_C*                        K2Node_DynamicCast_AsCONTEXT_Base;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption) == 0x000008, "Wrong alignment on WIDGET_InventoryContextMenu_C_TrySelectNextContextOption");
static_assert(sizeof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption) == 0x000060, "Wrong size on WIDGET_InventoryContextMenu_C_TrySelectNextContextOption");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, VerticalBox) == 0x000000, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::VerticalBox' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CurrentIndex) == 0x000008, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CurrentIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, Previous) == 0x00000C, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::Previous' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, Result) == 0x00000D, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, NewOptionWidget) == 0x000010, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::NewOptionWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, NewIndex) == 0x000018, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::NewIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, Temp_bool_Variable) == 0x00001C, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, Temp_int_Variable) == 0x000020, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, Temp_int_Variable_1) == 0x000024, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_GetChildrenCount_ReturnValue) == 0x000028, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, K2Node_Select_Default) == 0x000030, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000034, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, CallFunc_CanOptionBeActivated_Result) == 0x000048, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::CallFunc_CanOptionBeActivated_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_InventoryContextMenu_C_TrySelectNextContextOption, K2Node_DynamicCast_AsCONTEXT_Base) == 0x000050, "Member 'WIDGET_InventoryContextMenu_C_TrySelectNextContextOption::K2Node_DynamicCast_AsCONTEXT_Base' has a wrong offset!");
