#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MenuListItemBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.InitializeMenuListItem
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_MenuListItemBase_C_InitializeMenuListItem final
{
public:
	class UWIDGET_MenuListBase_C*                 ParentList;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_InitializeMenuListItem) == 0x000008, "Wrong alignment on WIDGET_MenuListItemBase_C_InitializeMenuListItem");
static_assert(sizeof(WIDGET_MenuListItemBase_C_InitializeMenuListItem) == 0x000010, "Wrong size on WIDGET_MenuListItemBase_C_InitializeMenuListItem");
static_assert(offsetof(WIDGET_MenuListItemBase_C_InitializeMenuListItem, ParentList) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_InitializeMenuListItem::ParentList' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_InitializeMenuListItem, Index_0) == 0x000008, "Member 'WIDGET_MenuListItemBase_C_InitializeMenuListItem::Index_0' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.OnMouseEntered
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_OnMouseEntered final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_OnMouseEntered) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_OnMouseEntered");
static_assert(sizeof(WIDGET_MenuListItemBase_C_OnMouseEntered) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_OnMouseEntered");
static_assert(offsetof(WIDGET_MenuListItemBase_C_OnMouseEntered, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_OnMouseEntered::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_OnMouseEntered, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_OnMouseEntered::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.OnMouseExited
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MenuListItemBase_C_OnMouseExited final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_OnMouseExited) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_OnMouseExited");
static_assert(sizeof(WIDGET_MenuListItemBase_C_OnMouseExited) == 0x000001, "Wrong size on WIDGET_MenuListItemBase_C_OnMouseExited");
static_assert(offsetof(WIDGET_MenuListItemBase_C_OnMouseExited, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_OnMouseExited::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.SetIsHighlighted
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_MenuListItemBase_C_SetIsHighlighted final
{
public:
	bool                                          NewHighlightedState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceInstant;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_SetIsHighlighted) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_MenuListItemBase_C_SetIsHighlighted) == 0x000003, "Wrong size on WIDGET_MenuListItemBase_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetIsHighlighted, NewHighlightedState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_SetIsHighlighted::NewHighlightedState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetIsHighlighted, ForceInstant) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_SetIsHighlighted::ForceInstant' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetIsHighlighted, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WIDGET_MenuListItemBase_C_SetIsHighlighted::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.SetVisibilityBasedOnPlatform
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform) == 0x000008, "Wrong alignment on WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform");
static_assert(sizeof(WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform) == 0x000018, "Wrong size on WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform, CallFunc_Map_Find_Value) == 0x000010, "Member 'WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform, CallFunc_Map_Find_ReturnValue) == 0x000011, "Member 'WIDGET_MenuListItemBase_C_SetVisibilityBasedOnPlatform::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.GetIsHighlighted
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_MenuListItemBase_C_GetIsHighlighted final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_GetIsHighlighted) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_GetIsHighlighted");
static_assert(sizeof(WIDGET_MenuListItemBase_C_GetIsHighlighted) == 0x000001, "Wrong size on WIDGET_MenuListItemBase_C_GetIsHighlighted");
static_assert(offsetof(WIDGET_MenuListItemBase_C_GetIsHighlighted, Result) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_GetIsHighlighted::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavUp
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavUp final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavUp) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavUp");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavUp) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavUp");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavUp, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavUp::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavUp, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavUp::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavDown
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavDown final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavDown) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavDown");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavDown) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavDown");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavDown, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavDown::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavDown, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavDown::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavLeft
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavLeft) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavLeft");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavLeft) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavLeft");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavLeft, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavLeft, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavLeft::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavRight
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavRight) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavRight");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavRight) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavRight");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavRight, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavRight, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavRight::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavAccept
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavAccept final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavAccept) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavAccept");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavAccept) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavAccept");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAccept, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAccept::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAccept, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAccept::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavBack
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavBack final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavBack) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavBack");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavBack) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavBack");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavBack, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavBack::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavBack, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavBack::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavAlt1
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavAlt1 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavAlt1) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavAlt1");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavAlt1) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavAlt1");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAlt1, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAlt1::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAlt1, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAlt1::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavAlt2
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavAlt2 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavAlt2) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavAlt2");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavAlt2) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavAlt2");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAlt2, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAlt2::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavAlt2, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavAlt2::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavTabLeft
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavTabLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavTabLeft) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavTabLeft");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavTabLeft) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavTabLeft");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavTabLeft, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavTabLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavTabLeft, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavTabLeft::Result' has a wrong offset!");

// Function WIDGET_MenuListItemBase.WIDGET_MenuListItemBase_C.ReceiveNavTabRight
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_MenuListItemBase_C_ReceiveNavTabRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MenuListItemBase_C_ReceiveNavTabRight) == 0x000001, "Wrong alignment on WIDGET_MenuListItemBase_C_ReceiveNavTabRight");
static_assert(sizeof(WIDGET_MenuListItemBase_C_ReceiveNavTabRight) == 0x000002, "Wrong size on WIDGET_MenuListItemBase_C_ReceiveNavTabRight");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavTabRight, InputState) == 0x000000, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavTabRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_MenuListItemBase_C_ReceiveNavTabRight, Result) == 0x000001, "Member 'WIDGET_MenuListItemBase_C_ReceiveNavTabRight::Result' has a wrong offset!");

}

