#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Controls

#include "Basic.hpp"

#include "WIDGET_OptionsMenu_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "ENUM_Options_ControlsTabs_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsMenu_Controls.WIDGET_OptionsMenu_Controls_C
// 0x0038 (0x0340 - 0x0308)
class UWIDGET_OptionsMenu_Controls_C final : public UWIDGET_OptionsMenu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMAGE_PanelBackground;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Controls_GamepadBindsList_C* WIDGET_OptionsMenu_Controls_GamepadBindsList;      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Controls_GamepadList_C* WIDGET_OptionsMenu_Controls_GamepadList;           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Controls_GeneralList_C* WIDGET_OptionsMenu_Controls_GeneralList;           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_OptionsMenu_Controls_KeyboardBindList_C* WIDGET_OptionsMenu_Controls_InputBindList;         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Controls_TabPanel_C*            WIDGET_SubMenu_ListPanel;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_OptionsMenu_Controls(int32 EntryPoint);
	void BndEvt__WIDGET_OptionsMenu_Controls_WIDGET_SubMenu_ListPanel_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(const class FString& Message, ENUM_Options_ControlsTabs TabEnum);
	void OnTabSelected(const class FString& ListLabel, ENUM_Options_ControlsTabs ListEnum);
	void GetListByIndex(int32 Index_0, class UWIDGET_MenuListBase_C** List);
	void GetAllControlLists(TArray<class UWIDGET_MenuListBase_C*>* Result);
	void InitializeMenu(class UWIDGET_MenuBase_C* ParentMenuWidget);
	void OnMenuOpen();
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsMenu_Controls_C">();
	}
	static class UWIDGET_OptionsMenu_Controls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsMenu_Controls_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsMenu_Controls_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsMenu_Controls_C");
static_assert(sizeof(UWIDGET_OptionsMenu_Controls_C) == 0x000340, "Wrong size on UWIDGET_OptionsMenu_Controls_C");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, UberGraphFrame) == 0x000308, "Member 'UWIDGET_OptionsMenu_Controls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, IMAGE_PanelBackground) == 0x000310, "Member 'UWIDGET_OptionsMenu_Controls_C::IMAGE_PanelBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, WIDGET_OptionsMenu_Controls_GamepadBindsList) == 0x000318, "Member 'UWIDGET_OptionsMenu_Controls_C::WIDGET_OptionsMenu_Controls_GamepadBindsList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, WIDGET_OptionsMenu_Controls_GamepadList) == 0x000320, "Member 'UWIDGET_OptionsMenu_Controls_C::WIDGET_OptionsMenu_Controls_GamepadList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, WIDGET_OptionsMenu_Controls_GeneralList) == 0x000328, "Member 'UWIDGET_OptionsMenu_Controls_C::WIDGET_OptionsMenu_Controls_GeneralList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, WIDGET_OptionsMenu_Controls_InputBindList) == 0x000330, "Member 'UWIDGET_OptionsMenu_Controls_C::WIDGET_OptionsMenu_Controls_InputBindList' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsMenu_Controls_C, WIDGET_SubMenu_ListPanel) == 0x000338, "Member 'UWIDGET_OptionsMenu_Controls_C::WIDGET_SubMenu_ListPanel' has a wrong offset!");

}

