#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SaveLoadMenu

#include "Basic.hpp"

#include "ENUM_SaveLoad_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.ExecuteUbergraph_WIDGET_SaveLoadMenu
// 0x0158 (0x0158 - 0x0000)
struct WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_ComponentBoundEvent_Geometry;               // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x0040(0x0070)()
	struct FGeometry                              K2Node_ComponentBoundEvent_Geometry_1;             // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_1;           // 0x00E8(0x0070)()
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu) == 0x000158, "Wrong size on WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu, EntryPoint) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu, K2Node_ComponentBoundEvent_Geometry) == 0x000004, "Member 'WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu::K2Node_ComponentBoundEvent_Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu, K2Node_ComponentBoundEvent_InputEvent) == 0x000040, "Member 'WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu, K2Node_ComponentBoundEvent_Geometry_1) == 0x0000B0, "Member 'WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu::K2Node_ComponentBoundEvent_Geometry_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu, K2Node_ComponentBoundEvent_InputEvent_1) == 0x0000E8, "Member 'WIDGET_SaveLoadMenu_C_ExecuteUbergraph_WIDGET_SaveLoadMenu::K2Node_ComponentBoundEvent_InputEvent_1' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InputEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x0000A8, "Wrong size on WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Geometry) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, InputEvent) == 0x000038, "Member 'WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	struct FGeometry                              Geometry;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InputEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x0000A8, "Wrong size on WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Geometry) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Geometry' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, InputEvent) == 0x000038, "Member 'WIDGET_SaveLoadMenu_C_BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.SetSaveLoadMenuVisibility
// 0x0028 (0x0028 - 0x0000)
struct WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_SaveLoad                                 Mode_0;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UserIndex_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility) == 0x000028, "Wrong size on WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, NewVisibility) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::NewVisibility' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, Mode_0) == 0x000001, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::Mode_0' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, UserIndex_0) == 0x000004, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::UserIndex_0' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, Temp_byte_Variable) == 0x000008, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, Temp_byte_Variable_1) == 0x000009, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, Temp_bool_Variable) == 0x00000A, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, K2Node_DynamicCast_AsCON_Hacker) == 0x000018, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, CallFunc_IsUsingGamepad_Result) == 0x000021, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::CallFunc_IsUsingGamepad_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility, K2Node_Select_Default) == 0x000023, "Member 'WIDGET_SaveLoadMenu_C_SetSaveLoadMenuVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.RefreshSaveRows
// 0x01F8 (0x01F8 - 0x0000)
struct WIDGET_SaveLoadMenu_C_RefreshSaveRows final
{
public:
	TArray<class FString>                         SaveGameNameArrayTemp;                             // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UWIDGET_SaveRow_C*                      CurrentSaveWidget;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_SaveLoad                                 Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SaveRow_C*                      CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConditionalDestroyObject_ReturnValue;     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWIDGET_SaveRow_C*                      CallFunc_Map_Find_Value_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_PC;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Xbox;                  // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Playstation;           // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Switch;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Console;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAutoSaveName_Result;                   // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetExistingSaveGameNames_ReturnValue;     // 0x01C8(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SaveRow_C*                      CallFunc_Create_ReturnValue;                       // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_RefreshSaveRows) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_RefreshSaveRows");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_RefreshSaveRows) == 0x0001F8, "Wrong size on WIDGET_SaveLoadMenu_C_RefreshSaveRows");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, SaveGameNameArrayTemp) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::SaveGameNameArrayTemp' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CurrentSaveWidget) == 0x000010, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CurrentSaveWidget' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Length_ReturnValue) == 0x000030, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_string_Variable) == 0x000038, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_byte_Variable) == 0x000049, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Get_Item) == 0x000068, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Length_ReturnValue_2) == 0x000078, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Remove_ReturnValue) == 0x00007C, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Less_IntInt_ReturnValue) == 0x00007D, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Find_Value) == 0x000080, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_ConditionalDestroyObject_ReturnValue) == 0x000089, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_ConditionalDestroyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_RemoveItem_ReturnValue) == 0x00008A, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Not_PreBool_ReturnValue) == 0x00008B, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Find_Value_1) == 0x0000A0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Map_Find_ReturnValue_1) == 0x0000A8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Array_Length_ReturnValue_3) == 0x0000AC, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_AddChild_ReturnValue) == 0x0000B8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Greater_IntInt_ReturnValue) == 0x000108, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetCurrentPlatform_PC) == 0x000109, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetCurrentPlatform_PC' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetCurrentPlatform_Xbox) == 0x00010A, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetCurrentPlatform_Xbox' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetCurrentPlatform_Playstation) == 0x00010B, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetCurrentPlatform_Playstation' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetCurrentPlatform_Switch) == 0x00010C, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetCurrentPlatform_Switch' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetCurrentPlatform_Console) == 0x00010D, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetCurrentPlatform_Console' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_MakeLiteralInt_ReturnValue) == 0x000110, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_MakeArray_Array) == 0x000158, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_MakeStruct_Margin) == 0x000168, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Format_ReturnValue) == 0x000178, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetGameInstance_ReturnValue) == 0x000190, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_DynamicCast_AsGI_Single_Player) == 0x000198, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetAutoSaveName_Result) == 0x0001A8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetAutoSaveName_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, K2Node_Select_Default) == 0x0001B8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetExistingSaveGameNames_ReturnValue) == 0x0001C8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetExistingSaveGameNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_AddChild_ReturnValue_1) == 0x0001D8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_HasAnyChildren_ReturnValue) == 0x0001E0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001E8, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_RefreshSaveRows, CallFunc_Create_ReturnValue) == 0x0001F0, "Member 'WIDGET_SaveLoadMenu_C_RefreshSaveRows::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.CreateNewSave
// 0x00B0 (0x00B0 - 0x0000)
struct WIDGET_SaveLoadMenu_C_CreateNewSave final
{
public:
	class FString                                 NewSaveSlotName;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         NewSaveSlotNumber;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingSaveGameSession*              GameSession;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStreamingSaveGameProfile*              SaveGame;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SaveName, int32 UserIndex, bool bSuccess)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AsyncSaveGameWithEvent_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGI_SinglePlayer_C*                     K2Node_DynamicCast_AsGI_Single_Player;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStreamingSaveGameSession*              CallFunc_GetGameSession_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_CreateNewSave) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_CreateNewSave");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_CreateNewSave) == 0x0000B0, "Wrong size on WIDGET_SaveLoadMenu_C_CreateNewSave");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, NewSaveSlotName) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::NewSaveSlotName' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, NewSaveSlotNumber) == 0x000010, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::NewSaveSlotNumber' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, GameSession) == 0x000018, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::GameSession' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, SaveGame) == 0x000020, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::SaveGame' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, Temp_int_Variable) == 0x000050, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_Array_Contains_ReturnValue) == 0x000068, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_GetGameInstance_ReturnValue) == 0x000070, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_AsyncSaveGameWithEvent_ReturnValue) == 0x000078, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_AsyncSaveGameWithEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, K2Node_DynamicCast_AsGI_Single_Player) == 0x000080, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::K2Node_DynamicCast_AsGI_Single_Player' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_GetPlayerPawn_ReturnValue) == 0x000090, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, CallFunc_GetGameSession_ReturnValue) == 0x000098, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::CallFunc_GetGameSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x0000A0, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_CreateNewSave, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WIDGET_SaveLoadMenu_C_CreateNewSave::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.SetMainMenu
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_SaveLoadMenu_C_SetMainMenu final
{
public:
	class UWidget*                                MainMenu_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_SetMainMenu) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_SetMainMenu");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_SetMainMenu) == 0x000008, "Wrong size on WIDGET_SaveLoadMenu_C_SetMainMenu");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetMainMenu, MainMenu_0) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_SetMainMenu::MainMenu_0' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavUp
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavUp final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_WrapIntLowerbound_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavUp) == 0x000004, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavUp");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavUp) == 0x000010, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavUp");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavUp, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavUp::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavUp, CallFunc_HasAnyChildren_ReturnValue) == 0x000004, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavUp::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavUp, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavUp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavUp, CallFunc_WrapIntLowerbound_ReturnValue) == 0x00000C, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavUp::CallFunc_WrapIntLowerbound_ReturnValue' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavDown
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavDown final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_WrapIntUpperbound_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavDown) == 0x000004, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavDown");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavDown) == 0x000010, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavDown");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavDown, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavDown, CallFunc_HasAnyChildren_ReturnValue) == 0x000004, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavDown::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavDown, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavDown::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavDown, CallFunc_WrapIntUpperbound_ReturnValue) == 0x00000C, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavDown::CallFunc_WrapIntUpperbound_ReturnValue' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavAccept
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavAccept final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavAccept) == 0x000001, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavAccept");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavAccept) == 0x000002, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavAccept");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavAccept, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavAccept::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavAccept, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000001, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavAccept::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavBack
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavBack final
{
public:
	class UWIDGET_GameOverScreen_C*               K2Node_DynamicCast_AsWIDGET_Game_Over_Screen;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SplashScreen_Title_C*           K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MainMenu_InGame_C*              K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavBack) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavBack");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavBack) == 0x000030, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavBack");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_AsWIDGET_Game_Over_Screen) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_AsWIDGET_Game_Over_Screen' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title) == 0x000010, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_AsWIDGET_Splash_Screen_Title' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game) == 0x000020, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_AsWIDGET_Main_Menu_in_Game' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavBack, K2Node_DynamicCast_bSuccess_2) == 0x000028, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavBack::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavAlt1
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavAlt1 final
{
public:
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavAlt1) == 0x000001, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavAlt1");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavAlt1) == 0x000001, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavAlt1");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavAlt1, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavAlt1::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.TriggerNavAlt2
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_SaveLoadMenu_C_TriggerNavAlt2 final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DeleteSlot_Result;                        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_TriggerNavAlt2) == 0x000001, "Wrong alignment on WIDGET_SaveLoadMenu_C_TriggerNavAlt2");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_TriggerNavAlt2) == 0x000002, "Wrong size on WIDGET_SaveLoadMenu_C_TriggerNavAlt2");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavAlt2, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavAlt2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_TriggerNavAlt2, CallFunc_DeleteSlot_Result) == 0x000001, "Member 'WIDGET_SaveLoadMenu_C_TriggerNavAlt2::CallFunc_DeleteSlot_Result' has a wrong offset!");

// Function WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C.SetSelectedItem
// 0x0038 (0x0038 - 0x0000)
struct WIDGET_SaveLoadMenu_C_SetSelectedItem final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SaveRow_C*                      K2Node_DynamicCast_AsWIDGET_Save_Row;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SaveLoadMenu_C_SetSelectedItem) == 0x000008, "Wrong alignment on WIDGET_SaveLoadMenu_C_SetSelectedItem");
static_assert(sizeof(WIDGET_SaveLoadMenu_C_SetSelectedItem) == 0x000038, "Wrong size on WIDGET_SaveLoadMenu_C_SetSelectedItem");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, Index_0) == 0x000000, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::Index_0' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_Min_ReturnValue) == 0x00001C, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SaveLoadMenu_C_SetSelectedItem, CallFunc_GetChildAt_ReturnValue_1) == 0x000020, "Member 'WIDGET_SaveLoadMenu_C_SetSelectedItem::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
