#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_BootupScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_BootupState_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.ExecuteUbergraph_WIDGET_BootupScreen
// 0x0208 (0x0208 - 0x0000)
struct WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_CustomEvent_TEXT_MemCount;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisRetina_2;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisRetina_1;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisRetina;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_3; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_2; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_3;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_2;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_1;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisInputConfirmed;    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_EllipsisRetinaConfirmed;   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_DeviceListing_4;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_DeviceListing_3;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_DeviceListing_2;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_DeviceListing_1;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_DeviceListing;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_InitializationFinished_4;  // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_InitializationFinished_3;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_InitializationFinished_2;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_InitializationFinished_1;  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_InitializationFinished;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TEXT_GrantingRootAccess;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0188(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01C8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen");
static_assert(sizeof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen) == 0x000208, "Wrong size on WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, EntryPoint) == 0x000000, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_MemCount) == 0x000008, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_MemCount' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisRetina_2) == 0x000018, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisRetina_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Round_ReturnValue) == 0x000020, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisRetina_1) == 0x000028, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisRetina_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Min_ReturnValue) == 0x000030, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisRetina) == 0x000038, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisRetina' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_3) == 0x000040, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_3' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_2) == 0x000048, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_1) == 0x000050, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_3) == 0x000058, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_3' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_2) == 0x000060, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_1) == 0x000068, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisInputConfirmed_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisInputConfirmed) == 0x000070, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisInputConfirmed' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed) == 0x000078, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisUplinkConfirmed' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_EllipsisRetinaConfirmed) == 0x000080, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_EllipsisRetinaConfirmed' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_DeviceListing_4) == 0x000088, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_DeviceListing_4' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_DeviceListing_3) == 0x000090, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_DeviceListing_3' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_DeviceListing_2) == 0x000098, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_DeviceListing_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_DeviceListing_1) == 0x0000A0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_DeviceListing_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_DeviceListing) == 0x0000A8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_DeviceListing' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_InitializationFinished_4) == 0x0000B0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_InitializationFinished_4' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_InitializationFinished_3) == 0x0000B8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_InitializationFinished_3' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_InitializationFinished_2) == 0x0000C0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_InitializationFinished_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_InitializationFinished_1) == 0x0000C8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_InitializationFinished_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_InitializationFinished) == 0x0000D0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_InitializationFinished' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_CustomEvent_TEXT_GrantingRootAccess) == 0x0000D8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_CustomEvent_TEXT_GrantingRootAccess' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_MakeArray_Array) == 0x000178, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_MakeArray_Array_1) == 0x000188, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Format_ReturnValue) == 0x000198, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_Event_MyGeometry) == 0x0001C8, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen, K2Node_Event_InDeltaTime) == 0x000200, "Member 'WIDGET_BootupScreen_C_ExecuteUbergraph_WIDGET_BootupScreen::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct WIDGET_BootupScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_Tick) == 0x000004, "Wrong alignment on WIDGET_BootupScreen_C_Tick");
static_assert(sizeof(WIDGET_BootupScreen_C_Tick) == 0x00003C, "Wrong size on WIDGET_BootupScreen_C_Tick");
static_assert(offsetof(WIDGET_BootupScreen_C_Tick, MyGeometry) == 0x000000, "Member 'WIDGET_BootupScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'WIDGET_BootupScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_GrantingRootAccess_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0 final
{
public:
	class UTextBlock*                             TEXT_GrantingRootAccess_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0, TEXT_GrantingRootAccess_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_GrantingRootAccess_Event_0::TEXT_GrantingRootAccess_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_InitializationFinished_Event_4
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4 final
{
public:
	class UTextBlock*                             TEXT_InitializationFinished_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4, TEXT_InitializationFinished_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_4::TEXT_InitializationFinished_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_InitializationFinished_Event_3
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3 final
{
public:
	class UTextBlock*                             TEXT_InitializationFinished_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3, TEXT_InitializationFinished_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_3::TEXT_InitializationFinished_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_InitializationFinished_Event_2
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2 final
{
public:
	class UTextBlock*                             TEXT_InitializationFinished_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2, TEXT_InitializationFinished_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_2::TEXT_InitializationFinished_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_InitializationFinished_Event_1
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1 final
{
public:
	class UTextBlock*                             TEXT_InitializationFinished_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1, TEXT_InitializationFinished_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_1::TEXT_InitializationFinished_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_InitializationFinished_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0 final
{
public:
	class UTextBlock*                             TEXT_InitializationFinished_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0, TEXT_InitializationFinished_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_InitializationFinished_Event_0::TEXT_InitializationFinished_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_DeviceListing_Event_4
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4 final
{
public:
	class UTextBlock*                             TEXT_DeviceListing_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4, TEXT_DeviceListing_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_4::TEXT_DeviceListing_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_DeviceListing_Event_2
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2 final
{
public:
	class UTextBlock*                             TEXT_DeviceListing_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2, TEXT_DeviceListing_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_2::TEXT_DeviceListing_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_DeviceListing_Event_1
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1 final
{
public:
	class UTextBlock*                             TEXT_DeviceListing_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1, TEXT_DeviceListing_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_1::TEXT_DeviceListing_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_DeviceListing_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0 final
{
public:
	class UTextBlock*                             TEXT_DeviceListing_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0, TEXT_DeviceListing_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_0::TEXT_DeviceListing_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_DeviceListing_Event_3
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3 final
{
public:
	class UTextBlock*                             TEXT_DeviceListing_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3, TEXT_DeviceListing_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_DeviceListing_Event_3::TEXT_DeviceListing_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisRetinaConfirmed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0 final
{
public:
	class UTextBlock*                             TEXT_EllipsisRetinaConfirmed_0;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0, TEXT_EllipsisRetinaConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisRetinaConfirmed_Event_0::TEXT_EllipsisRetinaConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisUplinkConfirmed_Event_3
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3 final
{
public:
	class UTextBlock*                             TEXT_EllipsisUplinkConfirmed_0;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3, TEXT_EllipsisUplinkConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_3::TEXT_EllipsisUplinkConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisInputConfirmed_Event_3
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3 final
{
public:
	class UTextBlock*                             TEXT_EllipsisInputConfirmed_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3, TEXT_EllipsisInputConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_3::TEXT_EllipsisInputConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisInputConfirmed_Event_2
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2 final
{
public:
	class UTextBlock*                             TEXT_EllipsisInputConfirmed_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2, TEXT_EllipsisInputConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_2::TEXT_EllipsisInputConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisInputConfirmed_Event_1
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1 final
{
public:
	class UTextBlock*                             TEXT_EllipsisInputConfirmed_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1, TEXT_EllipsisInputConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_1::TEXT_EllipsisInputConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisInputConfirmed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0 final
{
public:
	class UTextBlock*                             TEXT_EllipsisInputConfirmed_0;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0, TEXT_EllipsisInputConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisInputConfirmed_Event_0::TEXT_EllipsisInputConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisUplinkConfirmed_Event_2
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2 final
{
public:
	class UTextBlock*                             TEXT_EllipsisUplinkConfirmed_0;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2, TEXT_EllipsisUplinkConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_2::TEXT_EllipsisUplinkConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisUplinkConfirmed_Event_1
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1 final
{
public:
	class UTextBlock*                             TEXT_EllipsisUplinkConfirmed_0;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1, TEXT_EllipsisUplinkConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_1::TEXT_EllipsisUplinkConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisUplinkConfirmed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0 final
{
public:
	class UTextBlock*                             TEXT_EllipsisUplinkConfirmed_0;                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0, TEXT_EllipsisUplinkConfirmed_0) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisUplinkConfirmed_Event_0::TEXT_EllipsisUplinkConfirmed_0' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisRetina_Event_2
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2 final
{
public:
	class UTextBlock*                             TEXT_EllipsisRetina;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2, TEXT_EllipsisRetina) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_2::TEXT_EllipsisRetina' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisRetina_Event_1
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1 final
{
public:
	class UTextBlock*                             TEXT_EllipsisRetina;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1, TEXT_EllipsisRetina) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_1::TEXT_EllipsisRetina' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_EllipsisRetina_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0 final
{
public:
	class UTextBlock*                             TEXT_EllipsisRetina;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0, TEXT_EllipsisRetina) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_EllipsisRetina_Event_0::TEXT_EllipsisRetina' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TEXT_MemCount_IncrementText
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText final
{
public:
	class UTextBlock*                             TEXT_MemCount;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText");
static_assert(sizeof(WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText) == 0x000008, "Wrong size on WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText");
static_assert(offsetof(WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText, TEXT_MemCount) == 0x000000, "Member 'WIDGET_BootupScreen_C_TEXT_MemCount_IncrementText::TEXT_MemCount' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.StartBootupSequence
// 0x0006 (0x0006 - 0x0000)
struct WIDGET_BootupScreen_C_StartBootupSequence final
{
public:
	bool                                          IsRespawning;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_BootupState                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_BootupState                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_BootupState                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_StartBootupSequence) == 0x000001, "Wrong alignment on WIDGET_BootupScreen_C_StartBootupSequence");
static_assert(sizeof(WIDGET_BootupScreen_C_StartBootupSequence) == 0x000006, "Wrong size on WIDGET_BootupScreen_C_StartBootupSequence");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, IsRespawning) == 0x000000, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::IsRespawning' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, Temp_bool_Variable) == 0x000001, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, Temp_byte_Variable) == 0x000002, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, Temp_byte_Variable_1) == 0x000003, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, CallFunc_SetGamePaused_ReturnValue) == 0x000004, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_StartBootupSequence, K2Node_Select_Default) == 0x000005, "Member 'WIDGET_BootupScreen_C_StartBootupSequence::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.SetCurrentState
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_BootupScreen_C_SetCurrentState final
{
public:
	ENUM_BootupState                              State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_BootupScreen_C_SetCurrentState) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_SetCurrentState");
static_assert(sizeof(WIDGET_BootupScreen_C_SetCurrentState) == 0x000058, "Wrong size on WIDGET_BootupScreen_C_SetCurrentState");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, State) == 0x000000, "Member 'WIDGET_BootupScreen_C_SetCurrentState::State' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_SetGamePaused_ReturnValue) == 0x000010, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_GetStartTime_ReturnValue) == 0x000020, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_GetEndTime_ReturnValue) == 0x000024, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_GetEndTime_ReturnValue_1) == 0x000030, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_GetStartTime_ReturnValue_1) == 0x000034, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_GetStartTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000038, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000040, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WIDGET_BootupScreen_C_SetCurrentState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_SetCurrentState, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WIDGET_BootupScreen_C_SetCurrentState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.TickBootupSequence
// 0x001C (0x001C - 0x0000)
struct WIDGET_BootupScreen_C_TickBootupSequence final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_BootupState                              NextState;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StateProgress;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_BootupScreen_C_TickBootupSequence) == 0x000004, "Wrong alignment on WIDGET_BootupScreen_C_TickBootupSequence");
static_assert(sizeof(WIDGET_BootupScreen_C_TickBootupSequence) == 0x00001C, "Wrong size on WIDGET_BootupScreen_C_TickBootupSequence");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, DeltaTime) == 0x000000, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::DeltaTime' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, NextState) == 0x000004, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::NextState' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, StateProgress) == 0x000008, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::StateProgress' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_Add_ByteByte_ReturnValue) == 0x000011, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000012, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_GetValidValue_ReturnValue) == 0x000013, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_TickBootupSequence, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WIDGET_BootupScreen_C_TickBootupSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIDGET_BootupScreen.WIDGET_BootupScreen_C.UpdateLogoAnimation
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_BootupScreen_C_UpdateLogoAnimation final
{
public:
	float                                         StateProgress;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_BootupScreen_C_UpdateLogoAnimation) == 0x000008, "Wrong alignment on WIDGET_BootupScreen_C_UpdateLogoAnimation");
static_assert(sizeof(WIDGET_BootupScreen_C_UpdateLogoAnimation) == 0x000010, "Wrong size on WIDGET_BootupScreen_C_UpdateLogoAnimation");
static_assert(offsetof(WIDGET_BootupScreen_C_UpdateLogoAnimation, StateProgress) == 0x000000, "Member 'WIDGET_BootupScreen_C_UpdateLogoAnimation::StateProgress' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_UpdateLogoAnimation, CallFunc_FMin_ReturnValue) == 0x000004, "Member 'WIDGET_BootupScreen_C_UpdateLogoAnimation::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_BootupScreen_C_UpdateLogoAnimation, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WIDGET_BootupScreen_C_UpdateLogoAnimation::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

