#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Status

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Status.WIDGET_Status_C
// 0x0200 (0x0460 - 0x0260)
class UWIDGET_Status_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       ANIM_DeckInfo_Visible;                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANIM_DeckInfo_Invisible;                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_CatchInputMesh;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_CitadelStation;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_DeckInfo;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Bridge;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Engineering;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Executive;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Flight;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Maintenance;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Medical;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Reactor;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Research;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Security;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Storage;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_DeckInfo;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Decks;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Groves;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_Computer;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_Groves;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_StationProperties;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_LevelName;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Bridge;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Engineering;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Executive;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Flight;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Maintenance;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Medical;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Reactor;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Research;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Security;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   WIDGET_StatusDeck_Storage;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Alpha;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Beta;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Comm;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_CPUNodes;                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_DeckNodes;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_DeckSecurity;                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Delta;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Gamma;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Laser;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_LifePods;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Program;                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Reactor;                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_StatusQuest_C*                  WIDGET_StatusQuest_Shield;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   QName_JettisonBetaGrove;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_LaserDestroyed;                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_AntennaRelayDestroyed;                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_EscapePodLaunched;                           // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_ShieldsEngaged;                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_EscapePodEnabled;                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_ReactorSelfDestruct;                         // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_BridgeSeparated;                             // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           MouseOverPanel;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 COLOR_MouseOver_Visited;                           // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 COLOR_MouseOver_NotVisited;                        // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 COLOR_MouseNotOver_Visited;                        // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 COLOR_MouseNotOver_NotVisited;                     // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FontSize_MouseNotOver;                             // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FontSize_MouseOver_Visited;                        // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FontSize_MouseOver_NotVisited;                     // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_StatusDeck_C*                   SelectedStatusDeck;                                // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            LastToolTipWidget;                                 // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TBPS_Timer;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   QName_EarthDestroyed;                              // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetStatusVisibility(bool Visibility_0);
	void InitializeStatus(class UWIDGET_PlayerHUD_C* HUD);
	void EVENT_OnStoryQuestChanged(class FName Quest, bool Value);
	void EVENT_OnUpdateTbps();
	void InitializeStoryQuests();
	void EVENT_OnNodesChanged(int32 NodesRemaining);
	void SetSelectedDeck(class UWIDGET_StatusDeck_C* StatusDeck);
	struct FEventReply EVENT_OnMouseDown_BG(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SelectCurrentDeck();
	void SetSelectedDeckByLevel(class FName LevelName);
	void GetDeckWidgetByLevelName(class FName LevelName, class UWIDGET_StatusDeck_C** DeckStatusWidget);
	void EVENT_OnBagChanged(class UInventoryBag_C* Bag, int32 Slot_0);
	void UpdateStationComputerNodesCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Status_C">();
	}
	static class UWIDGET_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Status_C>();
	}
};
static_assert(alignof(UWIDGET_Status_C) == 0x000008, "Wrong alignment on UWIDGET_Status_C");
static_assert(sizeof(UWIDGET_Status_C) == 0x000460, "Wrong size on UWIDGET_Status_C");
static_assert(offsetof(UWIDGET_Status_C, ANIM_DeckInfo_Visible) == 0x000260, "Member 'UWIDGET_Status_C::ANIM_DeckInfo_Visible' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, ANIM_DeckInfo_Invisible) == 0x000268, "Member 'UWIDGET_Status_C::ANIM_DeckInfo_Invisible' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_CatchInputMesh) == 0x000270, "Member 'UWIDGET_Status_C::MESH_CatchInputMesh' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_CitadelStation) == 0x000278, "Member 'UWIDGET_Status_C::MESH_CitadelStation' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_DeckInfo) == 0x000280, "Member 'UWIDGET_Status_C::MESH_DeckInfo' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Bridge) == 0x000288, "Member 'UWIDGET_Status_C::MESH_Spline_Bridge' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Engineering) == 0x000290, "Member 'UWIDGET_Status_C::MESH_Spline_Engineering' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Executive) == 0x000298, "Member 'UWIDGET_Status_C::MESH_Spline_Executive' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Flight) == 0x0002A0, "Member 'UWIDGET_Status_C::MESH_Spline_Flight' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Maintenance) == 0x0002A8, "Member 'UWIDGET_Status_C::MESH_Spline_Maintenance' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Medical) == 0x0002B0, "Member 'UWIDGET_Status_C::MESH_Spline_Medical' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Reactor) == 0x0002B8, "Member 'UWIDGET_Status_C::MESH_Spline_Reactor' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Research) == 0x0002C0, "Member 'UWIDGET_Status_C::MESH_Spline_Research' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Security) == 0x0002C8, "Member 'UWIDGET_Status_C::MESH_Spline_Security' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MESH_Spline_Storage) == 0x0002D0, "Member 'UWIDGET_Status_C::MESH_Spline_Storage' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, PANEL_DeckInfo) == 0x0002D8, "Member 'UWIDGET_Status_C::PANEL_DeckInfo' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, PANEL_Decks) == 0x0002E0, "Member 'UWIDGET_Status_C::PANEL_Decks' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, PANEL_Groves) == 0x0002E8, "Member 'UWIDGET_Status_C::PANEL_Groves' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, SCROLLBOX_Computer) == 0x0002F0, "Member 'UWIDGET_Status_C::SCROLLBOX_Computer' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, SCROLLBOX_Groves) == 0x0002F8, "Member 'UWIDGET_Status_C::SCROLLBOX_Groves' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, SCROLLBOX_StationProperties) == 0x000300, "Member 'UWIDGET_Status_C::SCROLLBOX_StationProperties' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, TEXT_LevelName) == 0x000308, "Member 'UWIDGET_Status_C::TEXT_LevelName' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Bridge) == 0x000310, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Bridge' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Engineering) == 0x000318, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Engineering' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Executive) == 0x000320, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Executive' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Flight) == 0x000328, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Flight' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Maintenance) == 0x000330, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Maintenance' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Medical) == 0x000338, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Medical' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Reactor) == 0x000340, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Reactor' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Research) == 0x000348, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Research' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Security) == 0x000350, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Security' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusDeck_Storage) == 0x000358, "Member 'UWIDGET_Status_C::WIDGET_StatusDeck_Storage' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Alpha) == 0x000360, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Alpha' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Beta) == 0x000368, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Beta' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Comm) == 0x000370, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Comm' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_CPUNodes) == 0x000378, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_CPUNodes' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_DeckNodes) == 0x000380, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_DeckNodes' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_DeckSecurity) == 0x000388, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_DeckSecurity' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Delta) == 0x000390, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Delta' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Gamma) == 0x000398, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Gamma' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Laser) == 0x0003A0, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Laser' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_LifePods) == 0x0003A8, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_LifePods' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Program) == 0x0003B0, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Program' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Reactor) == 0x0003B8, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Reactor' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, WIDGET_StatusQuest_Shield) == 0x0003C0, "Member 'UWIDGET_Status_C::WIDGET_StatusQuest_Shield' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_JettisonBetaGrove) == 0x0003C8, "Member 'UWIDGET_Status_C::QName_JettisonBetaGrove' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_LaserDestroyed) == 0x0003D0, "Member 'UWIDGET_Status_C::QName_LaserDestroyed' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_AntennaRelayDestroyed) == 0x0003D8, "Member 'UWIDGET_Status_C::QName_AntennaRelayDestroyed' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_EscapePodLaunched) == 0x0003E0, "Member 'UWIDGET_Status_C::QName_EscapePodLaunched' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_ShieldsEngaged) == 0x0003E8, "Member 'UWIDGET_Status_C::QName_ShieldsEngaged' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_EscapePodEnabled) == 0x0003F0, "Member 'UWIDGET_Status_C::QName_EscapePodEnabled' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_ReactorSelfDestruct) == 0x0003F8, "Member 'UWIDGET_Status_C::QName_ReactorSelfDestruct' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_BridgeSeparated) == 0x000400, "Member 'UWIDGET_Status_C::QName_BridgeSeparated' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, MouseOverPanel) == 0x000408, "Member 'UWIDGET_Status_C::MouseOverPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, COLOR_MouseOver_Visited) == 0x000410, "Member 'UWIDGET_Status_C::COLOR_MouseOver_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, COLOR_MouseOver_NotVisited) == 0x000414, "Member 'UWIDGET_Status_C::COLOR_MouseOver_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, COLOR_MouseNotOver_Visited) == 0x000418, "Member 'UWIDGET_Status_C::COLOR_MouseNotOver_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, COLOR_MouseNotOver_NotVisited) == 0x00041C, "Member 'UWIDGET_Status_C::COLOR_MouseNotOver_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, FontSize_MouseNotOver) == 0x000420, "Member 'UWIDGET_Status_C::FontSize_MouseNotOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, FontSize_MouseOver_Visited) == 0x000428, "Member 'UWIDGET_Status_C::FontSize_MouseOver_Visited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, FontSize_MouseOver_NotVisited) == 0x000430, "Member 'UWIDGET_Status_C::FontSize_MouseOver_NotVisited' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, PlayerHUD) == 0x000438, "Member 'UWIDGET_Status_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, SelectedStatusDeck) == 0x000440, "Member 'UWIDGET_Status_C::SelectedStatusDeck' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, LastToolTipWidget) == 0x000448, "Member 'UWIDGET_Status_C::LastToolTipWidget' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, TBPS_Timer) == 0x000450, "Member 'UWIDGET_Status_C::TBPS_Timer' has a wrong offset!");
static_assert(offsetof(UWIDGET_Status_C, QName_EarthDestroyed) == 0x000458, "Member 'UWIDGET_Status_C::QName_EarthDestroyed' has a wrong offset!");

}

