#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DebugMenuListMain

#include "Basic.hpp"

#include "WIDGET_MenuListBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DebugMenuListMain.WIDGET_DebugMenuListMain_C
// 0x0118 (0x03E0 - 0x02C8)
class UWIDGET_DebugMenuListMain_C final : public UWIDGET_MenuListBase_C
{
public:
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDEBUG_Ghost_C*                         DEBUG_Ghost;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_Ghost_Disable_C*                 DEBUG_Ghost_Disable;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_GodMode_C*                       DEBUG_GodMode;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_GodMode_Disable_C*               DEBUG_GodMode_Disable;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_GrantLoadout_C*                  DEBUG_GrantCoin;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_GrantLoadout_C*                  DEBUG_GrantLoadout;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_GrantLoadout_C*                  DEBUG_GrantLoadout_1;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_00Reactor;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_01Medical;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_02Research;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_03Maintenance;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_04Storage;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_05FlightDeck;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_06aAlphaGrove;                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_06bBetaGrove;                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_06cDeltaGrove;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_06Executive;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_07SystemsEngineering;                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_08Security;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_09Bridge;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_MapMove_C*                       DEBUG_MapMove_ShodanArena;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_RevealMap_C*                     DEBUG_RevealMap;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_SkipShodanArena_C*               DEBUG_SkipShodanArena;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_TimeScale_C*                     DEBUG_TimeScale;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_TimeScale_C*                     DEBUG_TimeScale_1;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_TimeScale_C*                     DEBUG_TimeScale_2;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_ToggleHUD_C*                     DEBUG_ToggleHUD;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_PanelBackground;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             PANEL_ScrollBox;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_DestroyCPUNodes_C*               WIDGET_DestroyCPUNodes;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_DestroyEnemies_C*                WIDGET_DestroyEnemies;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_Cheats;                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_LoadOuts;                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ListCategoryHeader_C*           WIDGET_ListCategoryHeader_MapMove;                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDEBUG_RefillVitals_C*                  WIDGET_RefillVitals;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeList(class UWIDGET_MenuBase_C* ParentScreen);
	void InitializeItemArray(TArray<class UWIDGET_MenuListItemBase_C*>* MenuListItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DebugMenuListMain_C">();
	}
	static class UWIDGET_DebugMenuListMain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DebugMenuListMain_C>();
	}
};
static_assert(alignof(UWIDGET_DebugMenuListMain_C) == 0x000008, "Wrong alignment on UWIDGET_DebugMenuListMain_C");
static_assert(sizeof(UWIDGET_DebugMenuListMain_C) == 0x0003E0, "Wrong size on UWIDGET_DebugMenuListMain_C");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_Ghost) == 0x0002C8, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_Ghost' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_Ghost_Disable) == 0x0002D0, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_Ghost_Disable' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_GodMode) == 0x0002D8, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_GodMode' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_GodMode_Disable) == 0x0002E0, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_GodMode_Disable' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_GrantCoin) == 0x0002E8, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_GrantCoin' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_GrantLoadout) == 0x0002F0, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_GrantLoadout' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_GrantLoadout_1) == 0x0002F8, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_GrantLoadout_1' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_00Reactor) == 0x000300, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_00Reactor' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_01Medical) == 0x000308, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_01Medical' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_02Research) == 0x000310, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_02Research' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_03Maintenance) == 0x000318, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_03Maintenance' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_04Storage) == 0x000320, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_04Storage' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_05FlightDeck) == 0x000328, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_05FlightDeck' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_06aAlphaGrove) == 0x000330, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_06aAlphaGrove' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_06bBetaGrove) == 0x000338, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_06bBetaGrove' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_06cDeltaGrove) == 0x000340, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_06cDeltaGrove' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_06Executive) == 0x000348, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_06Executive' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_07SystemsEngineering) == 0x000350, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_07SystemsEngineering' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_08Security) == 0x000358, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_08Security' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_09Bridge) == 0x000360, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_09Bridge' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_MapMove_ShodanArena) == 0x000368, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_MapMove_ShodanArena' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_RevealMap) == 0x000370, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_RevealMap' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_SkipShodanArena) == 0x000378, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_SkipShodanArena' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_TimeScale) == 0x000380, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_TimeScale' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_TimeScale_1) == 0x000388, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_TimeScale_1' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_TimeScale_2) == 0x000390, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_TimeScale_2' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, DEBUG_ToggleHUD) == 0x000398, "Member 'UWIDGET_DebugMenuListMain_C::DEBUG_ToggleHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, IMAGE_PanelBackground) == 0x0003A0, "Member 'UWIDGET_DebugMenuListMain_C::IMAGE_PanelBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, PANEL_ScrollBox) == 0x0003A8, "Member 'UWIDGET_DebugMenuListMain_C::PANEL_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_DestroyCPUNodes) == 0x0003B0, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_DestroyCPUNodes' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_DestroyEnemies) == 0x0003B8, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_DestroyEnemies' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_ListCategoryHeader_Cheats) == 0x0003C0, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_ListCategoryHeader_Cheats' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_ListCategoryHeader_LoadOuts) == 0x0003C8, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_ListCategoryHeader_LoadOuts' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_ListCategoryHeader_MapMove) == 0x0003D0, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_ListCategoryHeader_MapMove' has a wrong offset!");
static_assert(offsetof(UWIDGET_DebugMenuListMain_C, WIDGET_RefillVitals) == 0x0003D8, "Member 'UWIDGET_DebugMenuListMain_C::WIDGET_RefillVitals' has a wrong offset!");

}

