#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_HotbarSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_HotbarSlot.WIDGET_HotbarSlot_C
// 0x0080 (0x02E0 - 0x0260)
class UWIDGET_HotbarSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TransitionEquipped;                                // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionOccupied;                                // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_InputRegion;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ItemIcon;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SlotBackground;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_ItemCount;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SlotItemName;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SlotNumber;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IINTERF_HotbarSlottable_C> SlottableObject;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         LastItemCount;                                     // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotNumber;                                        // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasEquipped;                                       // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameOpacity;                                      // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EVENT_HotbarSlotUpdated;                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EVENT_HotbarSlotUpdated__DelegateSignature();
	void ExecuteUbergraph_WIDGET_HotbarSlot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnItemSlotted(TScriptInterface<class IINTERF_HotbarSlottable_C> Object);
	void OnItemUnslotted();
	void SetItemCount(int32 Count);
	void SetSlotNumber(int32 Number);
	struct FEventReply EVENT_OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseDown(struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseDoubleClick(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetEquipState(bool Equipped);
	void HandleMouseEnter();
	void HandleMouseLeave();
	void EVENT_OnItemCountChanged(class UITEM_Base_C* Item, int32 Count);
	void BindItemChangedEvents();
	void UnbindItemChangedEvents();
	void UpdateHotbarSlot();
	void SetFrameOpacity(float NewOpacity);
	void UpdateSlotDisplayName();
	void UpdateSlotNumberColor();
	void SetIsCurrentQuickSlot(bool State);
	void EVENT_OnEquipStateChanged(class UITEM_WeaponBase_C* Weapon);
	void GetSlotIndex(int32* SlotIndex);
	void EVENT_OnModKitInstalled(class UITEM_WeaponBase_C* Weapon, class UITEM_WeaponModKit_Base_C* ModKit);
	void DisableFlickerEffect(bool* Result);
	void EnableFlickerEffect(bool* Result);
	void OnMouseExit(bool* Result);
	void OnMouseOver(bool* Result);
	void GetMeshWidget(class UGridMeshWidget** Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_HotbarSlot_C">();
	}
	static class UWIDGET_HotbarSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_HotbarSlot_C>();
	}
};
static_assert(alignof(UWIDGET_HotbarSlot_C) == 0x000008, "Wrong alignment on UWIDGET_HotbarSlot_C");
static_assert(sizeof(UWIDGET_HotbarSlot_C) == 0x0002E0, "Wrong size on UWIDGET_HotbarSlot_C");
static_assert(offsetof(UWIDGET_HotbarSlot_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_HotbarSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, TransitionEquipped) == 0x000268, "Member 'UWIDGET_HotbarSlot_C::TransitionEquipped' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, TransitionOccupied) == 0x000270, "Member 'UWIDGET_HotbarSlot_C::TransitionOccupied' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, MESH_InputRegion) == 0x000278, "Member 'UWIDGET_HotbarSlot_C::MESH_InputRegion' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, MESH_ItemIcon) == 0x000280, "Member 'UWIDGET_HotbarSlot_C::MESH_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, MESH_SlotBackground) == 0x000288, "Member 'UWIDGET_HotbarSlot_C::MESH_SlotBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, TEXT_ItemCount) == 0x000290, "Member 'UWIDGET_HotbarSlot_C::TEXT_ItemCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, TEXT_SlotItemName) == 0x000298, "Member 'UWIDGET_HotbarSlot_C::TEXT_SlotItemName' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, TEXT_SlotNumber) == 0x0002A0, "Member 'UWIDGET_HotbarSlot_C::TEXT_SlotNumber' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, PlayerHUD) == 0x0002A8, "Member 'UWIDGET_HotbarSlot_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, SlottableObject) == 0x0002B0, "Member 'UWIDGET_HotbarSlot_C::SlottableObject' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, LastItemCount) == 0x0002C0, "Member 'UWIDGET_HotbarSlot_C::LastItemCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, SlotNumber) == 0x0002C4, "Member 'UWIDGET_HotbarSlot_C::SlotNumber' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, WasEquipped) == 0x0002C8, "Member 'UWIDGET_HotbarSlot_C::WasEquipped' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, FrameOpacity) == 0x0002CC, "Member 'UWIDGET_HotbarSlot_C::FrameOpacity' has a wrong offset!");
static_assert(offsetof(UWIDGET_HotbarSlot_C, EVENT_HotbarSlotUpdated) == 0x0002D0, "Member 'UWIDGET_HotbarSlot_C::EVENT_HotbarSlotUpdated' has a wrong offset!");

}

