#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_DifficultyPreset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_DifficultyPreset.WIDGET_DifficultyPreset_C
// 0x0048 (0x02A8 - 0x0260)
class UWIDGET_DifficultyPreset_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMAGE_PresetPanelBacking;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_InputRegion;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PresetPipContainer;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PresetOptionLabel;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PresetOptionLabel_Bg;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_Settings_MultiSelector_Pip_C*   WIDGET_DifficultyPresetPip;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Highlighted;                                       // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_DifficultyConfigScreen_C*       PARENT_DifficultyConfigScreen;                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_DifficultyPreset(int32 EntryPoint);
	void Construct();
	void GetPresetOptions();
	void SetHighlighted(bool Highlighted_0);
	void HighlightHandler();
	void On_MESH_InputRegion_MouseEnter_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_DifficultyPreset_C">();
	}
	static class UWIDGET_DifficultyPreset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_DifficultyPreset_C>();
	}
};
static_assert(alignof(UWIDGET_DifficultyPreset_C) == 0x000008, "Wrong alignment on UWIDGET_DifficultyPreset_C");
static_assert(sizeof(UWIDGET_DifficultyPreset_C) == 0x0002A8, "Wrong size on UWIDGET_DifficultyPreset_C");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_DifficultyPreset_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, IMAGE_PresetPanelBacking) == 0x000268, "Member 'UWIDGET_DifficultyPreset_C::IMAGE_PresetPanelBacking' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, MESH_InputRegion) == 0x000270, "Member 'UWIDGET_DifficultyPreset_C::MESH_InputRegion' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, PresetPipContainer) == 0x000278, "Member 'UWIDGET_DifficultyPreset_C::PresetPipContainer' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, TEXT_PresetOptionLabel) == 0x000280, "Member 'UWIDGET_DifficultyPreset_C::TEXT_PresetOptionLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, TEXT_PresetOptionLabel_Bg) == 0x000288, "Member 'UWIDGET_DifficultyPreset_C::TEXT_PresetOptionLabel_Bg' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, WIDGET_DifficultyPresetPip) == 0x000290, "Member 'UWIDGET_DifficultyPreset_C::WIDGET_DifficultyPresetPip' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, Highlighted) == 0x000298, "Member 'UWIDGET_DifficultyPreset_C::Highlighted' has a wrong offset!");
static_assert(offsetof(UWIDGET_DifficultyPreset_C, PARENT_DifficultyConfigScreen) == 0x0002A0, "Member 'UWIDGET_DifficultyPreset_C::PARENT_DifficultyConfigScreen' has a wrong offset!");

}

