#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsDescriptionBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_OptionsDescriptionBox.WIDGET_OptionsDescriptionBox_C
// 0x0038 (0x0298 - 0x0260)
class UWIDGET_OptionsDescriptionBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMAGE_DescriptionBackground;                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DescriptionBottom;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_DescriptionHeader;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_PreviewImage;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SelectedItemName;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SelectedListItemDescription;                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_OptionsDescriptionBox(int32 EntryPoint);
	void Construct();
	void SetNameAndDescription(const class FText& OptionName, const class FText& OptionDescription);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_OptionsDescriptionBox_C">();
	}
	static class UWIDGET_OptionsDescriptionBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_OptionsDescriptionBox_C>();
	}
};
static_assert(alignof(UWIDGET_OptionsDescriptionBox_C) == 0x000008, "Wrong alignment on UWIDGET_OptionsDescriptionBox_C");
static_assert(sizeof(UWIDGET_OptionsDescriptionBox_C) == 0x000298, "Wrong size on UWIDGET_OptionsDescriptionBox_C");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_OptionsDescriptionBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, IMAGE_DescriptionBackground) == 0x000268, "Member 'UWIDGET_OptionsDescriptionBox_C::IMAGE_DescriptionBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, IMAGE_DescriptionBottom) == 0x000270, "Member 'UWIDGET_OptionsDescriptionBox_C::IMAGE_DescriptionBottom' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, IMAGE_DescriptionHeader) == 0x000278, "Member 'UWIDGET_OptionsDescriptionBox_C::IMAGE_DescriptionHeader' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, IMAGE_PreviewImage) == 0x000280, "Member 'UWIDGET_OptionsDescriptionBox_C::IMAGE_PreviewImage' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, TEXT_SelectedItemName) == 0x000288, "Member 'UWIDGET_OptionsDescriptionBox_C::TEXT_SelectedItemName' has a wrong offset!");
static_assert(offsetof(UWIDGET_OptionsDescriptionBox_C, TEXT_SelectedListItemDescription) == 0x000290, "Member 'UWIDGET_OptionsDescriptionBox_C::TEXT_SelectedListItemDescription' has a wrong offset!");

}

