#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_BroadcastScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_BroadcastScreen.WIDGET_BroadcastScreen_C
// 0x0028 (0x0288 - 0x0260)
class UWIDGET_BroadcastScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_Background;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainPanel;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBROADCAST_Base_C*                      CurrentBroadcastContent;                           // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoxelAudioComponent*                   AudioComponent;                                    // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearBroadcast();
	void UpdateContent(float DeltaTime, bool* IsFinished);
	void PlayBroadcast(class UVoxelAudioComponent* AudioComponent_0, TSoftClassPtr<class UClass> Content, const struct FVector2D& DrawSize, class UBROADCAST_Base_C** Result);
	void CreateBroadcast(class UVoxelAudioComponent* AudioComponent_0, TSoftClassPtr<class UClass> Content, const struct FVector2D& DrawSize, class UBROADCAST_Base_C** Result);
	void Construct();
	void ExecuteUbergraph_WIDGET_BroadcastScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_BroadcastScreen_C">();
	}
	static class UWIDGET_BroadcastScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_BroadcastScreen_C>();
	}
};
static_assert(alignof(UWIDGET_BroadcastScreen_C) == 0x000008, "Wrong alignment on UWIDGET_BroadcastScreen_C");
static_assert(sizeof(UWIDGET_BroadcastScreen_C) == 0x000288, "Wrong size on UWIDGET_BroadcastScreen_C");
static_assert(offsetof(UWIDGET_BroadcastScreen_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_BroadcastScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_BroadcastScreen_C, IMG_Background) == 0x000268, "Member 'UWIDGET_BroadcastScreen_C::IMG_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_BroadcastScreen_C, MainPanel) == 0x000270, "Member 'UWIDGET_BroadcastScreen_C::MainPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_BroadcastScreen_C, CurrentBroadcastContent) == 0x000278, "Member 'UWIDGET_BroadcastScreen_C::CurrentBroadcastContent' has a wrong offset!");
static_assert(offsetof(UWIDGET_BroadcastScreen_C, AudioComponent) == 0x000280, "Member 'UWIDGET_BroadcastScreen_C::AudioComponent' has a wrong offset!");

}

