#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ImplantButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SystemReShock_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ImplantButton.WIDGET_ImplantButton_C
// 0x0070 (0x02D0 - 0x0260)
class UWIDGET_ImplantButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnMousOver;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnActivated;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHasItem;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ImplantItem;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Text;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Hardware;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Version;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlignLeft;                                         // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 HardwareClass;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_HardwareBase_C*                   HardwareItem;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasActivated;                                      // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshWidget*                      SplineMeshWidget;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_ImplantButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void InitializeImpantButton(class UWIDGET_PlayerHUD_C* PlayerHUD_0);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_OnMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnBagChanged(int32 Slot_0);
	void EVENT_OnHardwareStateChanged(bool Activated, bool MagLocked);
	void FindHardwareItem(class UITEM_HardwareBase_C** Item);
	void FindHardwareBag(class UInventoryBag_C** Bag);
	void SetMouseOver(bool MouseOver, bool Instant);
	void SetHardwareItem(class UITEM_HardwareBase_C* Item, bool Instant);
	void SetHardwareActivated(bool Activated, bool Instant);
	void UpdateVisibilityState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ImplantButton_C">();
	}
	static class UWIDGET_ImplantButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ImplantButton_C>();
	}
};
static_assert(alignof(UWIDGET_ImplantButton_C) == 0x000008, "Wrong alignment on UWIDGET_ImplantButton_C");
static_assert(sizeof(UWIDGET_ImplantButton_C) == 0x0002D0, "Wrong size on UWIDGET_ImplantButton_C");
static_assert(offsetof(UWIDGET_ImplantButton_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_ImplantButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, OnMousOver) == 0x000268, "Member 'UWIDGET_ImplantButton_C::OnMousOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, OnActivated) == 0x000270, "Member 'UWIDGET_ImplantButton_C::OnActivated' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, OnHasItem) == 0x000278, "Member 'UWIDGET_ImplantButton_C::OnHasItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, MESH_ImplantItem) == 0x000280, "Member 'UWIDGET_ImplantButton_C::MESH_ImplantItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, PANEL_Text) == 0x000288, "Member 'UWIDGET_ImplantButton_C::PANEL_Text' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, TEXT_Hardware) == 0x000290, "Member 'UWIDGET_ImplantButton_C::TEXT_Hardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, TEXT_Version) == 0x000298, "Member 'UWIDGET_ImplantButton_C::TEXT_Version' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, PlayerHUD) == 0x0002A0, "Member 'UWIDGET_ImplantButton_C::PlayerHUD' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, AlignLeft) == 0x0002A8, "Member 'UWIDGET_ImplantButton_C::AlignLeft' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, HardwareClass) == 0x0002B0, "Member 'UWIDGET_ImplantButton_C::HardwareClass' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, HardwareItem) == 0x0002B8, "Member 'UWIDGET_ImplantButton_C::HardwareItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, WasActivated) == 0x0002C0, "Member 'UWIDGET_ImplantButton_C::WasActivated' has a wrong offset!");
static_assert(offsetof(UWIDGET_ImplantButton_C, SplineMeshWidget) == 0x0002C8, "Member 'UWIDGET_ImplantButton_C::SplineMeshWidget' has a wrong offset!");

}

