#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ContextSubMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ContextSubMenu.WIDGET_ContextSubMenu_C
// 0x0048 (0x02A8 - 0x0260)
class UWIDGET_ContextSubMenu_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BottomBar;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TopBar;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_BackgroundMesh;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_ContextMenu;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_ContextOptions;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_OptionsAndBars;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_InventoryContextMenu_C*         ContextMenu;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCONTEXT_Selector_C*                    ContextSelector;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void InitializeContextSubMenu(TArray<class UCONTEXT_Base_C*>& ContextOptions);
	void UpdateBackgroundWidget();
	void UpdateSubMenuPosition();
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void SetSubMenuSelectionState(bool State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ContextSubMenu_C">();
	}
	static class UWIDGET_ContextSubMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ContextSubMenu_C>();
	}
};
static_assert(alignof(UWIDGET_ContextSubMenu_C) == 0x000008, "Wrong alignment on UWIDGET_ContextSubMenu_C");
static_assert(sizeof(UWIDGET_ContextSubMenu_C) == 0x0002A8, "Wrong size on UWIDGET_ContextSubMenu_C");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, MESH_Background) == 0x000260, "Member 'UWIDGET_ContextSubMenu_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, MESH_BottomBar) == 0x000268, "Member 'UWIDGET_ContextSubMenu_C::MESH_BottomBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, MESH_TopBar) == 0x000270, "Member 'UWIDGET_ContextSubMenu_C::MESH_TopBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, PANEL_BackgroundMesh) == 0x000278, "Member 'UWIDGET_ContextSubMenu_C::PANEL_BackgroundMesh' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, PANEL_ContextMenu) == 0x000280, "Member 'UWIDGET_ContextSubMenu_C::PANEL_ContextMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, VBOX_ContextOptions) == 0x000288, "Member 'UWIDGET_ContextSubMenu_C::VBOX_ContextOptions' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, VBOX_OptionsAndBars) == 0x000290, "Member 'UWIDGET_ContextSubMenu_C::VBOX_OptionsAndBars' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, ContextMenu) == 0x000298, "Member 'UWIDGET_ContextSubMenu_C::ContextMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_ContextSubMenu_C, ContextSelector) == 0x0002A0, "Member 'UWIDGET_ContextSubMenu_C::ContextSelector' has a wrong offset!");

}

