#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ButtonLegend_KeyComposite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ButtonLegend_KeyComposite.WIDGET_ButtonLegend_KeyComposite_C
// 0x0040 (0x02A0 - 0x0260)
class UWIDGET_ButtonLegend_KeyComposite_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWIDGET_ButtonLegend_Key_C*             KeyA;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Key_C*             KeyB;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        KeySeparator;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              CompositePanelSize;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CompositeInputActionString;                        // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        SourceTextMeshWidget;                              // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_ButtonLegend_KeyComposite(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetDecoratorColor(const struct FColor& Color);
	void GetInputActionFromGenericToken(const class FString& InputString, bool IsUsingGamepad, class FName* Result);
	void GetInputActionFromTokenPair(const class FString& InputStringA, const class FString& InputStringB, bool IsUsingGamepad, class FName* Result);
	void ParseInputActionsFromString(const class FString& InputString, bool IsUsingGamepad, class FName* InputNameA, class FName* InputNameB);
	void InitializeLegendKeys();
	void InitializeLegendKeyComposite();
	void EVENT_OnUsingGamepadChanged(bool IsUsingGamepad);
	void UpdateInputActions(bool IsUsingGamepad);
	bool InitializeDecorator(class UTextMeshWidget* TextMeshWidget, const struct FColor& Color);
	struct FVector2D GetDecoratorSizeFromPayload(const class FString& Payload);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ButtonLegend_KeyComposite_C">();
	}
	static class UWIDGET_ButtonLegend_KeyComposite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ButtonLegend_KeyComposite_C>();
	}
};
static_assert(alignof(UWIDGET_ButtonLegend_KeyComposite_C) == 0x000008, "Wrong alignment on UWIDGET_ButtonLegend_KeyComposite_C");
static_assert(sizeof(UWIDGET_ButtonLegend_KeyComposite_C) == 0x0002A0, "Wrong size on UWIDGET_ButtonLegend_KeyComposite_C");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, KeyA) == 0x000268, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::KeyA' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, KeyB) == 0x000270, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::KeyB' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, KeySeparator) == 0x000278, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::KeySeparator' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, CompositePanelSize) == 0x000280, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::CompositePanelSize' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, CompositeInputActionString) == 0x000288, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::CompositeInputActionString' has a wrong offset!");
static_assert(offsetof(UWIDGET_ButtonLegend_KeyComposite_C, SourceTextMeshWidget) == 0x000298, "Member 'UWIDGET_ButtonLegend_KeyComposite_C::SourceTextMeshWidget' has a wrong offset!");

}

