#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_GameOverScreenList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList
// 0x0158 (0x0158 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_2;           // 0x0008(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_1;           // 0x0078(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x00E8(0x0070)()
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList) == 0x000158, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList, EntryPoint) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList, K2Node_ComponentBoundEvent_InputEvent_2) == 0x000008, "Member 'WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList::K2Node_ComponentBoundEvent_InputEvent_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList, K2Node_ComponentBoundEvent_InputEvent_1) == 0x000078, "Member 'WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList::K2Node_ComponentBoundEvent_InputEvent_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList, K2Node_ComponentBoundEvent_InputEvent) == 0x0000E8, "Member 'WIDGET_MainMenu_GameOverScreenList_C_ExecuteUbergraph_WIDGET_MainMenu_GameOverScreenList::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_QuitToTitle_K2Node_ComponentBoundEvent_2_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_LoadSave_K2Node_ComponentBoundEvent_1_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_BndEvt__WIDGET_MainMenu_GameOverScreenList_WIDGET_Button_Continue_K2Node_ComponentBoundEvent_0_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.InitializeItemArray
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     Children;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_InitializeItemArray_MenuListItems;        // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray) == 0x000070, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, Children) == 0x000010, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::Children' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_Array_Get_Item) == 0x000040, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base) == 0x000050, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray, CallFunc_InitializeItemArray_MenuListItems) == 0x000060, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeItemArray::CallFunc_InitializeItemArray_MenuListItems' has a wrong offset!");

// Function WIDGET_MainMenu_GameOverScreenList.WIDGET_MainMenu_GameOverScreenList_C.InitializeList
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_MainMenu_GameOverScreenList_C_InitializeList final
{
public:
	class UWIDGET_MenuBase_C*                     ParentScreen;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetExistingSaveGameNames_ReturnValue;     // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList) == 0x000008, "Wrong alignment on WIDGET_MainMenu_GameOverScreenList_C_InitializeList");
static_assert(sizeof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList) == 0x000020, "Wrong size on WIDGET_MainMenu_GameOverScreenList_C_InitializeList");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList, ParentScreen) == 0x000000, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeList::ParentScreen' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList, CallFunc_GetExistingSaveGameNames_ReturnValue) == 0x000008, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeList::CallFunc_GetExistingSaveGameNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_GameOverScreenList_C_InitializeList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_MainMenu_GameOverScreenList_C_InitializeList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

