#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SoftwarePanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_HackerGender_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SoftwarePanel.WIDGET_SoftwarePanel_C
// 0x0110 (0x0370 - 0x0260)
class UWIDGET_SoftwarePanel_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_BodySchematic;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Bioscan;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_EnergyShield;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_EnviroPack;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_NavUnit;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_Sensaround;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_TargetIdentifier;                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_TurboBoots;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineMeshWidget*                      MESH_Spline_VisionUnit;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TriopSymbol;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Hardware;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Implants;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_NeuralInterface;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Software;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Subject;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SubjectNumber;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_Bioscan;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_CShield;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_DataReader;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_Decoy;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_Drill;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_EnergyShield;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_EnviroPack;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_FakeID;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_NavUnit;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_Pulser;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_Recall;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_Sensaround;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_SysAnalyzer;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_TargetIdentifier;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SoftwareListItem_C*             WIDGET_Turbo;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_TurboBoots;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ImplantButton_C*                WIDGET_VisionUnit;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    PlayerHUD;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeSoftwarePanel(class UWIDGET_PlayerHUD_C* HUD);
	void SetSoftwarePanelVisibility(bool Visible);
	struct FEventReply EVENT_OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SoftwarePanel_C">();
	}
	static class UWIDGET_SoftwarePanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SoftwarePanel_C>();
	}
};
static_assert(alignof(UWIDGET_SoftwarePanel_C) == 0x000008, "Wrong alignment on UWIDGET_SoftwarePanel_C");
static_assert(sizeof(UWIDGET_SoftwarePanel_C) == 0x000370, "Wrong size on UWIDGET_SoftwarePanel_C");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_BodySchematic) == 0x000260, "Member 'UWIDGET_SoftwarePanel_C::MESH_BodySchematic' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_Bioscan) == 0x000268, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_Bioscan' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_EnergyShield) == 0x000270, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_EnergyShield' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_EnviroPack) == 0x000278, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_EnviroPack' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_NavUnit) == 0x000280, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_NavUnit' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_Sensaround) == 0x000288, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_Sensaround' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_TargetIdentifier) == 0x000290, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_TargetIdentifier' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_TurboBoots) == 0x000298, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_TurboBoots' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_Spline_VisionUnit) == 0x0002A0, "Member 'UWIDGET_SoftwarePanel_C::MESH_Spline_VisionUnit' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, MESH_TriopSymbol) == 0x0002A8, "Member 'UWIDGET_SoftwarePanel_C::MESH_TriopSymbol' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_Hardware) == 0x0002B0, "Member 'UWIDGET_SoftwarePanel_C::TEXT_Hardware' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_Implants) == 0x0002B8, "Member 'UWIDGET_SoftwarePanel_C::TEXT_Implants' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_NeuralInterface) == 0x0002C0, "Member 'UWIDGET_SoftwarePanel_C::TEXT_NeuralInterface' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_Software) == 0x0002C8, "Member 'UWIDGET_SoftwarePanel_C::TEXT_Software' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_Subject) == 0x0002D0, "Member 'UWIDGET_SoftwarePanel_C::TEXT_Subject' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, TEXT_SubjectNumber) == 0x0002D8, "Member 'UWIDGET_SoftwarePanel_C::TEXT_SubjectNumber' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Bioscan) == 0x0002E0, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Bioscan' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_CShield) == 0x0002E8, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_CShield' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_DataReader) == 0x0002F0, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_DataReader' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Decoy) == 0x0002F8, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Decoy' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Drill) == 0x000300, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Drill' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_EnergyShield) == 0x000308, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_EnergyShield' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_EnviroPack) == 0x000310, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_EnviroPack' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_FakeID) == 0x000318, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_FakeID' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_NavUnit) == 0x000320, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_NavUnit' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Pulser) == 0x000328, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Pulser' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Recall) == 0x000330, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Recall' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Sensaround) == 0x000338, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Sensaround' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_SysAnalyzer) == 0x000340, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_SysAnalyzer' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_TargetIdentifier) == 0x000348, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_TargetIdentifier' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_Turbo) == 0x000350, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_Turbo' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_TurboBoots) == 0x000358, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_TurboBoots' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, WIDGET_VisionUnit) == 0x000360, "Member 'UWIDGET_SoftwarePanel_C::WIDGET_VisionUnit' has a wrong offset!");
static_assert(offsetof(UWIDGET_SoftwarePanel_C, PlayerHUD) == 0x000368, "Member 'UWIDGET_SoftwarePanel_C::PlayerHUD' has a wrong offset!");

}

