#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubMenu_Header

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SubMenu_Header.WIDGET_SubMenu_Header_C
// 0x0070 (0x02D0 - 0x0260)
class UWIDGET_SubMenu_Header_C final : public UUserWidget
{
public:
	class UImage*                                 IMAGE_HeaderFade;                                  // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ExtraText;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageName;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_SubMenu_Breadcrumb_C*           WIDGET_SubMenu_Breadcrumb;                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PageLabel;                                         // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Breadcrumb;                                        // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          EnableExtraText;                                   // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExtraText;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPageLabel(const class FText& PageLabelText);
	void SetBreadcrumb(const class FText& BreadcrumbText);
	void ToggleExtraText(bool EnableExtraText_0, const class FString& TextToDisplay);
	void ClearSubMenuHeader();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SubMenu_Header_C">();
	}
	static class UWIDGET_SubMenu_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SubMenu_Header_C>();
	}
};
static_assert(alignof(UWIDGET_SubMenu_Header_C) == 0x000008, "Wrong alignment on UWIDGET_SubMenu_Header_C");
static_assert(sizeof(UWIDGET_SubMenu_Header_C) == 0x0002D0, "Wrong size on UWIDGET_SubMenu_Header_C");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, IMAGE_HeaderFade) == 0x000260, "Member 'UWIDGET_SubMenu_Header_C::IMAGE_HeaderFade' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, TEXT_ExtraText) == 0x000268, "Member 'UWIDGET_SubMenu_Header_C::TEXT_ExtraText' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, TEXT_PageName) == 0x000270, "Member 'UWIDGET_SubMenu_Header_C::TEXT_PageName' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, WIDGET_SubMenu_Breadcrumb) == 0x000278, "Member 'UWIDGET_SubMenu_Header_C::WIDGET_SubMenu_Breadcrumb' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, PageLabel) == 0x000280, "Member 'UWIDGET_SubMenu_Header_C::PageLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, Breadcrumb) == 0x000298, "Member 'UWIDGET_SubMenu_Header_C::Breadcrumb' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, EnableExtraText) == 0x0002B0, "Member 'UWIDGET_SubMenu_Header_C::EnableExtraText' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubMenu_Header_C, ExtraText) == 0x0002B8, "Member 'UWIDGET_SubMenu_Header_C::ExtraText' has a wrong offset!");

}

