#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Cyberspace_FunPakPickupModal

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Cyberspace_FunPakPickupModal.WIDGET_Cyberspace_FunPakPickupModal_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_Cyberspace_FunPakPickupModal_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_BottomBar;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_MainBg;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_ModalIcon;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SublineBg;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SubLineFrame;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TopBar;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Cyberspace_FunPakPickupModal_C">();
	}
	static class UWIDGET_Cyberspace_FunPakPickupModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Cyberspace_FunPakPickupModal_C>();
	}
};
static_assert(alignof(UWIDGET_Cyberspace_FunPakPickupModal_C) == 0x000008, "Wrong alignment on UWIDGET_Cyberspace_FunPakPickupModal_C");
static_assert(sizeof(UWIDGET_Cyberspace_FunPakPickupModal_C) == 0x000290, "Wrong size on UWIDGET_Cyberspace_FunPakPickupModal_C");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_BottomBar) == 0x000260, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_BottomBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_MainBg) == 0x000268, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_MainBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_ModalIcon) == 0x000270, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_ModalIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_SublineBg) == 0x000278, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_SublineBg' has a wrong offset!");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_SubLineFrame) == 0x000280, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_SubLineFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Cyberspace_FunPakPickupModal_C, MESH_TopBar) == 0x000288, "Member 'UWIDGET_Cyberspace_FunPakPickupModal_C::MESH_TopBar' has a wrong offset!");

}

