#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_MultiSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPTION_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C
// 0x0078 (0x03B0 - 0x0338)
class UWIDGET_Settings_MultiSelector_C : public UOPTION_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowMultiselectorArrows;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBOX_MultiSelectPips;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMAGE_SelectedBackground;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_Input;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SelectorLeftArrow;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_SelectorRightArrow;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Selectors;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_MultiSelectorText;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SettingNameLabel;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 MultiSelectorPipsClass;                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           MultiSelectorElements;                             // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsQualitySetting;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CleanValue;                                        // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Settings_MultiSelector(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void PopulateQualitySettings();
	void PopulateUniqueSettings();
	void CreateMultiSelectorPips();
	void IncrementSelectedOption();
	void DecrementSelectedOption();
	void SetSelectedMultiSelectorPip(int32 NewSelectedPipIndex);
	void EVENT_OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void EVENT_OnMouseExit(const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_SelectorRightArrow_OnMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply EVENT_SelectorLeftArrow_OnMouseDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void UpdateMultiSelectorLabel();
	void InitializeMenuListItem(class UWIDGET_MenuListBase_C* ParentList, int32 Index_0);
	void SetIsHighlighted(bool NewHighlightedState, bool ForceInstant);
	void SetOptionEnabled(bool IsOptionEnabled, bool* Result);
	void OnMultiSelectorValueModifiedByUser();
	void ReceiveNavLeft(bool InputState, bool* Result);
	void ReceiveNavRight(bool InputState, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Settings_MultiSelector_C">();
	}
	static class UWIDGET_Settings_MultiSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Settings_MultiSelector_C>();
	}
};
static_assert(alignof(UWIDGET_Settings_MultiSelector_C) == 0x000008, "Wrong alignment on UWIDGET_Settings_MultiSelector_C");
static_assert(sizeof(UWIDGET_Settings_MultiSelector_C) == 0x0003B0, "Wrong size on UWIDGET_Settings_MultiSelector_C");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, UberGraphFrame) == 0x000338, "Member 'UWIDGET_Settings_MultiSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, ShowMultiselectorArrows) == 0x000340, "Member 'UWIDGET_Settings_MultiSelector_C::ShowMultiselectorArrows' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, HBOX_MultiSelectPips) == 0x000348, "Member 'UWIDGET_Settings_MultiSelector_C::HBOX_MultiSelectPips' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, IMAGE_SelectedBackground) == 0x000350, "Member 'UWIDGET_Settings_MultiSelector_C::IMAGE_SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, MESH_Input) == 0x000358, "Member 'UWIDGET_Settings_MultiSelector_C::MESH_Input' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, MESH_SelectorLeftArrow) == 0x000360, "Member 'UWIDGET_Settings_MultiSelector_C::MESH_SelectorLeftArrow' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, MESH_SelectorRightArrow) == 0x000368, "Member 'UWIDGET_Settings_MultiSelector_C::MESH_SelectorRightArrow' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, PANEL_Selectors) == 0x000370, "Member 'UWIDGET_Settings_MultiSelector_C::PANEL_Selectors' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, TEXT_MultiSelectorText) == 0x000378, "Member 'UWIDGET_Settings_MultiSelector_C::TEXT_MultiSelectorText' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, TEXT_SettingNameLabel) == 0x000380, "Member 'UWIDGET_Settings_MultiSelector_C::TEXT_SettingNameLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, MultiSelectorPipsClass) == 0x000388, "Member 'UWIDGET_Settings_MultiSelector_C::MultiSelectorPipsClass' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, MultiSelectorElements) == 0x000390, "Member 'UWIDGET_Settings_MultiSelector_C::MultiSelectorElements' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, IsQualitySetting) == 0x0003A0, "Member 'UWIDGET_Settings_MultiSelector_C::IsQualitySetting' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, SelectedIndex) == 0x0003A4, "Member 'UWIDGET_Settings_MultiSelector_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_Settings_MultiSelector_C, CleanValue) == 0x0003A8, "Member 'UWIDGET_Settings_MultiSelector_C::CleanValue' has a wrong offset!");

}

