#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_InventoryContextMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_InventoryContextMenu.WIDGET_InventoryContextMenu_C
// 0x00A8 (0x0308 - 0x0260)
class UWIDGET_InventoryContextMenu_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_BottomBar;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        MESH_TopBar;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_BackgroundMesh;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_ContextMenu;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_Main;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_ContextOptions;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOX_OptionsAndBars;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 BackgroundColor_Normal;                            // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 BackgroundColor_MouseOver;                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInventoryContextMenuEnabled;                     // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBag_C*                        ContextBag;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ContextSlot;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ContextOffset;                                     // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LastEnableCursorPosition;                          // 0x02C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_InventoryPanel_C*               ContextInventoryPanel;                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCONTEXT_Base_C*                        SelectedOptionWidget;                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_PlayerHUD_C*                    HUDWidget;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenStartTimestamp;                                // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenAnimationDuration;                             // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DropMat;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               UseEquipMat;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VaporizeMat;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeInventoryContextMenu(class UWIDGET_PlayerHUD_C* HUDWidget_0);
	void SetInventoryContextMenuEnabled(bool Enabled, const struct FVector2D& MousePosition, class UInventoryBag_C* ItemBag, int32 BagSlot, class UWIDGET_InventoryPanel_C* InventoryPanel, bool* Result);
	void SetContextItemMouseOver(bool CursorOver, bool Disabled, class UTextMeshWidget* TextMesh, class UGridMeshWidget* ImageMesh);
	void IsInventoryContextEnabled(bool* Result);
	void GetDisabledColor(struct FColor* DisabledColor);
	void UpdateBackgroundWidget();
	void SetSelectedOptionWidgetState(class UCONTEXT_Base_C* OptionWidget, bool State);
	void TrySelectFirstContextOption(class UVerticalBox* VerticalBox);
	void TrySelectNextContextOption(class UVerticalBox* VerticalBox, int32 CurrentIndex, bool Previous, bool* Result);
	void InvokeNavManager(bool InputState, ENUM_MenuNavigationInput InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_InventoryContextMenu_C">();
	}
	static class UWIDGET_InventoryContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_InventoryContextMenu_C>();
	}
};
static_assert(alignof(UWIDGET_InventoryContextMenu_C) == 0x000008, "Wrong alignment on UWIDGET_InventoryContextMenu_C");
static_assert(sizeof(UWIDGET_InventoryContextMenu_C) == 0x000308, "Wrong size on UWIDGET_InventoryContextMenu_C");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, MESH_Background) == 0x000260, "Member 'UWIDGET_InventoryContextMenu_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, MESH_BottomBar) == 0x000268, "Member 'UWIDGET_InventoryContextMenu_C::MESH_BottomBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, MESH_TopBar) == 0x000270, "Member 'UWIDGET_InventoryContextMenu_C::MESH_TopBar' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, PANEL_BackgroundMesh) == 0x000278, "Member 'UWIDGET_InventoryContextMenu_C::PANEL_BackgroundMesh' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, PANEL_ContextMenu) == 0x000280, "Member 'UWIDGET_InventoryContextMenu_C::PANEL_ContextMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, PANEL_Main) == 0x000288, "Member 'UWIDGET_InventoryContextMenu_C::PANEL_Main' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, VBOX_ContextOptions) == 0x000290, "Member 'UWIDGET_InventoryContextMenu_C::VBOX_ContextOptions' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, VBOX_OptionsAndBars) == 0x000298, "Member 'UWIDGET_InventoryContextMenu_C::VBOX_OptionsAndBars' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, BackgroundColor_Normal) == 0x0002A0, "Member 'UWIDGET_InventoryContextMenu_C::BackgroundColor_Normal' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, BackgroundColor_MouseOver) == 0x0002A4, "Member 'UWIDGET_InventoryContextMenu_C::BackgroundColor_MouseOver' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, IsInventoryContextMenuEnabled) == 0x0002A8, "Member 'UWIDGET_InventoryContextMenu_C::IsInventoryContextMenuEnabled' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, ContextBag) == 0x0002B0, "Member 'UWIDGET_InventoryContextMenu_C::ContextBag' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, ContextSlot) == 0x0002B8, "Member 'UWIDGET_InventoryContextMenu_C::ContextSlot' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, ContextOffset) == 0x0002BC, "Member 'UWIDGET_InventoryContextMenu_C::ContextOffset' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, LastEnableCursorPosition) == 0x0002C4, "Member 'UWIDGET_InventoryContextMenu_C::LastEnableCursorPosition' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, ContextInventoryPanel) == 0x0002D0, "Member 'UWIDGET_InventoryContextMenu_C::ContextInventoryPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, SelectedOptionWidget) == 0x0002D8, "Member 'UWIDGET_InventoryContextMenu_C::SelectedOptionWidget' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, HUDWidget) == 0x0002E0, "Member 'UWIDGET_InventoryContextMenu_C::HUDWidget' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, OpenStartTimestamp) == 0x0002E8, "Member 'UWIDGET_InventoryContextMenu_C::OpenStartTimestamp' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, OpenAnimationDuration) == 0x0002EC, "Member 'UWIDGET_InventoryContextMenu_C::OpenAnimationDuration' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, DropMat) == 0x0002F0, "Member 'UWIDGET_InventoryContextMenu_C::DropMat' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, UseEquipMat) == 0x0002F8, "Member 'UWIDGET_InventoryContextMenu_C::UseEquipMat' has a wrong offset!");
static_assert(offsetof(UWIDGET_InventoryContextMenu_C, VaporizeMat) == 0x000300, "Member 'UWIDGET_InventoryContextMenu_C::VaporizeMat' has a wrong offset!");

}

