#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsDescriptionBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsDescriptionBox.WIDGET_OptionsDescriptionBox_C.ExecuteUbergraph_WIDGET_OptionsDescriptionBox
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox) == 0x000004, "Wrong alignment on WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox");
static_assert(sizeof(WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox) == 0x000004, "Wrong size on WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox");
static_assert(offsetof(WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox, EntryPoint) == 0x000000, "Member 'WIDGET_OptionsDescriptionBox_C_ExecuteUbergraph_WIDGET_OptionsDescriptionBox::EntryPoint' has a wrong offset!");

// Function WIDGET_OptionsDescriptionBox.WIDGET_OptionsDescriptionBox_C.SetNameAndDescription
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_OptionsDescriptionBox_C_SetNameAndDescription final
{
public:
	class FText                                   OptionName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   OptionDescription;                                 // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_OptionsDescriptionBox_C_SetNameAndDescription) == 0x000008, "Wrong alignment on WIDGET_OptionsDescriptionBox_C_SetNameAndDescription");
static_assert(sizeof(WIDGET_OptionsDescriptionBox_C_SetNameAndDescription) == 0x000030, "Wrong size on WIDGET_OptionsDescriptionBox_C_SetNameAndDescription");
static_assert(offsetof(WIDGET_OptionsDescriptionBox_C_SetNameAndDescription, OptionName) == 0x000000, "Member 'WIDGET_OptionsDescriptionBox_C_SetNameAndDescription::OptionName' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsDescriptionBox_C_SetNameAndDescription, OptionDescription) == 0x000018, "Member 'WIDGET_OptionsDescriptionBox_C_SetNameAndDescription::OptionDescription' has a wrong offset!");

}

