#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ConnectionIntegrity

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_ConnectionIntegrity.WIDGET_ConnectionIntegrity_C
// 0x0048 (0x02A8 - 0x0260)
class UWIDGET_ConnectionIntegrity_C final : public UUserWidget
{
public:
	class UGridMeshWidget*                        ConnectionIntegrityMinusHealth;                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        ConnectionIntegrityMinusIcon;                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ConnectionIntegrityMinusLabel;                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        ConnectionIntegrityMinusPanel;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        HealthPip1;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        HealthPip2;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        HealthPip2_1;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        StatusIndicatorMinusSecure;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridMeshWidget*                        StatusIndicatorMinusThreat;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_Integrity_Value(float CurrentHealth, float MaxHealth);
	void SetConnectionStatus(bool HealthCritical, bool TimeCritical);
	void SetConnectionColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_ConnectionIntegrity_C">();
	}
	static class UWIDGET_ConnectionIntegrity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_ConnectionIntegrity_C>();
	}
};
static_assert(alignof(UWIDGET_ConnectionIntegrity_C) == 0x000008, "Wrong alignment on UWIDGET_ConnectionIntegrity_C");
static_assert(sizeof(UWIDGET_ConnectionIntegrity_C) == 0x0002A8, "Wrong size on UWIDGET_ConnectionIntegrity_C");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, ConnectionIntegrityMinusHealth) == 0x000260, "Member 'UWIDGET_ConnectionIntegrity_C::ConnectionIntegrityMinusHealth' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, ConnectionIntegrityMinusIcon) == 0x000268, "Member 'UWIDGET_ConnectionIntegrity_C::ConnectionIntegrityMinusIcon' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, ConnectionIntegrityMinusLabel) == 0x000270, "Member 'UWIDGET_ConnectionIntegrity_C::ConnectionIntegrityMinusLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, ConnectionIntegrityMinusPanel) == 0x000278, "Member 'UWIDGET_ConnectionIntegrity_C::ConnectionIntegrityMinusPanel' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, HealthPip1) == 0x000280, "Member 'UWIDGET_ConnectionIntegrity_C::HealthPip1' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, HealthPip2) == 0x000288, "Member 'UWIDGET_ConnectionIntegrity_C::HealthPip2' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, HealthPip2_1) == 0x000290, "Member 'UWIDGET_ConnectionIntegrity_C::HealthPip2_1' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, StatusIndicatorMinusSecure) == 0x000298, "Member 'UWIDGET_ConnectionIntegrity_C::StatusIndicatorMinusSecure' has a wrong offset!");
static_assert(offsetof(UWIDGET_ConnectionIntegrity_C, StatusIndicatorMinusThreat) == 0x0002A0, "Member 'UWIDGET_ConnectionIntegrity_C::StatusIndicatorMinusThreat' has a wrong offset!");

}

