#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_Filters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Automap_Filters.WIDGET_Automap_Filters_C
// 0x0030 (0x0290 - 0x0260)
class UWIDGET_Automap_Filters_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WBOX_Filters;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            OrderedMapFilters;                                 // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UInventoryBag_C*                        HardwareBag;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Automap_Filters(int32 EntryPoint);
	void Construct();
	void SetFiltersVisible();
	void GetOrderedRows(TArray<class FName>* AvailableGroups);
	void IsAnyTagInFilterRowAvailable(class FName FilterRow, bool* Result);
	void GetRowTags(class FName RowName, TArray<class FName>* Tags);
	void CreateFilterElements(TArray<class FName>& FilterRows);
	void EVENT_OnAvailableFilterTagsChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Automap_Filters_C">();
	}
	static class UWIDGET_Automap_Filters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Automap_Filters_C>();
	}
};
static_assert(alignof(UWIDGET_Automap_Filters_C) == 0x000008, "Wrong alignment on UWIDGET_Automap_Filters_C");
static_assert(sizeof(UWIDGET_Automap_Filters_C) == 0x000290, "Wrong size on UWIDGET_Automap_Filters_C");
static_assert(offsetof(UWIDGET_Automap_Filters_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_Automap_Filters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Filters_C, MESH_Background) == 0x000268, "Member 'UWIDGET_Automap_Filters_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Filters_C, WBOX_Filters) == 0x000270, "Member 'UWIDGET_Automap_Filters_C::WBOX_Filters' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Filters_C, OrderedMapFilters) == 0x000278, "Member 'UWIDGET_Automap_Filters_C::OrderedMapFilters' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Filters_C, HardwareBag) == 0x000288, "Member 'UWIDGET_Automap_Filters_C::HardwareBag' has a wrong offset!");

}

