#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsCategoryMenuList

#include "Basic.hpp"

#include "ENUM_OptionCategories_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.OnOptionCategoryClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature final
{
public:
	int32                                         OptionCategoryIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature, OptionCategoryIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_OnOptionCategoryClicked__DelegateSignature::OptionCategoryIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.ExecuteUbergraph_WIDGET_OptionsCategoryMenuList
// 0x001C (0x001C - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex_5;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex_4;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex_3;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex_2;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList) == 0x00001C, "Wrong size on WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, EntryPoint) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex) == 0x000004, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex_5) == 0x000008, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex_5' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex_4) == 0x00000C, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex_4' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex_3) == 0x000010, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex_3' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex_2) == 0x000014, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex_2' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList, K2Node_ComponentBoundEvent_ItemIndex_1) == 0x000018, "Member 'WIDGET_OptionsCategoryMenuList_C_ExecuteUbergraph_WIDGET_OptionsCategoryMenuList::K2Node_ComponentBoundEvent_ItemIndex_1' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Interface_K2Node_ComponentBoundEvent_5_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Audio_K2Node_ComponentBoundEvent_4_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Graphics_K2Node_ComponentBoundEvent_3_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Display_K2Node_ComponentBoundEvent_2_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Controls_K2Node_ComponentBoundEvent_1_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_BndEvt__WIDGET_OptionsCategoryMenuList_WIDGET_OptionMenuCategory_Gameplay_K2Node_ComponentBoundEvent_0_OnCategoryButtonClicked__DelegateSignature::ItemIndex' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.GetListItemByCategory
// 0x0020 (0x0020 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory final
{
public:
	ENUM_OptionCategories                         Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionCategoryMenuListItem_C*   Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_OptionCategories                         Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionCategoryMenuListItem_C*   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory) == 0x000008, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory) == 0x000020, "Wrong size on WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory, Category) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory::Category' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory, Result) == 0x000008, "Member 'WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory, Temp_byte_Variable) == 0x000010, "Member 'WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory, K2Node_Select_Default) == 0x000018, "Member 'WIDGET_OptionsCategoryMenuList_C_GetListItemByCategory::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.InitializeItemArray
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     ChildItems;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_InitializeItemArray_MenuListItems;        // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_MenuListItemBase_C*             K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_InitializeItemArray");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray) == 0x000070, "Wrong size on WIDGET_OptionsCategoryMenuList_C_InitializeItemArray");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, ChildItems) == 0x000010, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::ChildItems' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_InitializeItemArray_MenuListItems) == 0x000040, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_InitializeItemArray_MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_Array_Get_Item) == 0x000050, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base) == 0x000060, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_InitializeItemArray, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'WIDGET_OptionsCategoryMenuList_C_InitializeItemArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsCategoryMenuList.WIDGET_OptionsCategoryMenuList_C.SetSelectedItem
// 0x0098 (0x0098 - 0x0000)
struct WIDGET_OptionsCategoryMenuList_C_SetSelectedItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CategoryText;                                      // 0x0008(0x0018)(Parm, OutParm)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options;              // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options_1;            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_OptionCategoryMenuListItem_C*   K2Node_DynamicCast_AsWIDGET_Option_Category_Menu_List_Item; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options_2;            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_MenuListItemBase_C*             CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWIDGET_MenuListItemBase_C*>     CallFunc_GetAllMenuListItems_Options_3;            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWIDGET_OptionCategoryMenuListItem_C*   K2Node_DynamicCast_AsWIDGET_Option_Category_Menu_List_Item_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsCategoryMenuList_C_SetSelectedItem) == 0x000008, "Wrong alignment on WIDGET_OptionsCategoryMenuList_C_SetSelectedItem");
static_assert(sizeof(WIDGET_OptionsCategoryMenuList_C_SetSelectedItem) == 0x000098, "Wrong size on WIDGET_OptionsCategoryMenuList_C_SetSelectedItem");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_SetSelectedItem, ItemIndex) == 0x000000, "Member 'WIDGET_OptionsCategoryMenuList_C_SetSelectedItem::ItemIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsCategoryMenuList_C_SetSelectedItem, CategoryText) == 0x000008, "Member 'WIDGET_OptionsCategoryMenuList_C_SetSelectedItem::CategoryText' has a wrong offset!");
