#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SaveLoadMenu

#include "Basic.hpp"

#include "ENUM_SaveLoad_structs.hpp"
#include "Engine_structs.hpp"
#include "WIDGET_MenuBase_classes.hpp"
#include "ENUM_MenuNavigationInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SaveLoadMenu.WIDGET_SaveLoadMenu_C
// 0x00D8 (0x03E0 - 0x0308)
class UWIDGET_SaveLoadMenu_C final : public UWIDGET_MenuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           PANEL_SaveGames;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SCROLLBOX_SaveGameRows;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_SaveCount;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_Back;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_ButtonLegend_Button_C*          WIDGET_ButtonLegend_CreateSave;                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ENUM_SaveLoad                                 Mode;                                              // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                MainMenu;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SaveRow_C*                      SelectedItem;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UserIndex;                                         // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadLabel;                                         // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanCreateNewSave;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SaveGameCount;                                     // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SaveGameNameArray;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class UWIDGET_SaveRow_C*> WidgetMap;                                         // 0x0390(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WIDGET_SaveLoadMenu(int32 EntryPoint);
	void BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_3_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void BndEvt__WIDGET_SaveLoadMenu_WIDGET_ButtonLegend_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(const struct FGeometry& Geometry, const struct FPointerEvent& InputEvent);
	void SetSaveLoadMenuVisibility(bool NewVisibility, ENUM_SaveLoad Mode_0, int32 UserIndex_0);
	void RefreshSaveRows();
	void CreateNewSave();
	void SetMainMenu(class UWidget* MainMenu_0);
	void TriggerNavUp();
	void TriggerNavDown();
	void TriggerNavAccept();
	void TriggerNavBack();
	void TriggerNavAlt1();
	void TriggerNavAlt2();
	void SetSelectedItem(int32 Index_0);
	void EVENT_OnGameSessionSaved(const class FString& SaveName, const int32 UserIndex_0, bool bSuccess);
	void InvokeNavManager(ENUM_MenuNavigationInput InputType, bool InputState);
	void GetMenuLabel(class FText* Page);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SaveLoadMenu_C">();
	}
	static class UWIDGET_SaveLoadMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SaveLoadMenu_C>();
	}
};
static_assert(alignof(UWIDGET_SaveLoadMenu_C) == 0x000008, "Wrong alignment on UWIDGET_SaveLoadMenu_C");
static_assert(sizeof(UWIDGET_SaveLoadMenu_C) == 0x0003E0, "Wrong size on UWIDGET_SaveLoadMenu_C");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, UberGraphFrame) == 0x000308, "Member 'UWIDGET_SaveLoadMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, PANEL_SaveGames) == 0x000310, "Member 'UWIDGET_SaveLoadMenu_C::PANEL_SaveGames' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, SCROLLBOX_SaveGameRows) == 0x000318, "Member 'UWIDGET_SaveLoadMenu_C::SCROLLBOX_SaveGameRows' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, TEXT_SaveCount) == 0x000320, "Member 'UWIDGET_SaveLoadMenu_C::TEXT_SaveCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, WIDGET_ButtonLegend_Back) == 0x000328, "Member 'UWIDGET_SaveLoadMenu_C::WIDGET_ButtonLegend_Back' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, WIDGET_ButtonLegend_CreateSave) == 0x000330, "Member 'UWIDGET_SaveLoadMenu_C::WIDGET_ButtonLegend_CreateSave' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, Mode) == 0x000338, "Member 'UWIDGET_SaveLoadMenu_C::Mode' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, MainMenu) == 0x000340, "Member 'UWIDGET_SaveLoadMenu_C::MainMenu' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, SelectedIndex) == 0x000348, "Member 'UWIDGET_SaveLoadMenu_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, SelectedItem) == 0x000350, "Member 'UWIDGET_SaveLoadMenu_C::SelectedItem' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, UserIndex) == 0x000358, "Member 'UWIDGET_SaveLoadMenu_C::UserIndex' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, LoadLabel) == 0x000360, "Member 'UWIDGET_SaveLoadMenu_C::LoadLabel' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, CanCreateNewSave) == 0x000378, "Member 'UWIDGET_SaveLoadMenu_C::CanCreateNewSave' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, SaveGameCount) == 0x00037C, "Member 'UWIDGET_SaveLoadMenu_C::SaveGameCount' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, SaveGameNameArray) == 0x000380, "Member 'UWIDGET_SaveLoadMenu_C::SaveGameNameArray' has a wrong offset!");
static_assert(offsetof(UWIDGET_SaveLoadMenu_C, WidgetMap) == 0x000390, "Member 'UWIDGET_SaveLoadMenu_C::WidgetMap' has a wrong offset!");

}

