#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Automap_Keys

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_Automap_Keys.WIDGET_Automap_Keys_C
// 0x0020 (0x0280 - 0x0260)
class UWIDGET_Automap_Keys_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridMeshWidget*                        MESH_Background;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WBOX_Keys;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         KeyCount;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_Automap_Keys(int32 EntryPoint);
	void Construct();
	void SetKeysVisible(bool Visibility_0);
	void UpdateKeysVisiblity();
	void EVENT_OnBagChanged(class UInventoryBag_C* Bag, int32 SlotIndex);
	void GetKeyItems(TArray<class UITEM_Base_C*>* KeyItems);
	void HasAnyKeyItems(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_Automap_Keys_C">();
	}
	static class UWIDGET_Automap_Keys_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_Automap_Keys_C>();
	}
};
static_assert(alignof(UWIDGET_Automap_Keys_C) == 0x000008, "Wrong alignment on UWIDGET_Automap_Keys_C");
static_assert(sizeof(UWIDGET_Automap_Keys_C) == 0x000280, "Wrong size on UWIDGET_Automap_Keys_C");
static_assert(offsetof(UWIDGET_Automap_Keys_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_Automap_Keys_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Keys_C, MESH_Background) == 0x000268, "Member 'UWIDGET_Automap_Keys_C::MESH_Background' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Keys_C, WBOX_Keys) == 0x000270, "Member 'UWIDGET_Automap_Keys_C::WBOX_Keys' has a wrong offset!");
static_assert(offsetof(UWIDGET_Automap_Keys_C, KeyCount) == 0x000278, "Member 'UWIDGET_Automap_Keys_C::KeyCount' has a wrong offset!");

}

