#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_ButtonLegend_Icon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_ButtonLegend_Icon.WIDGET_ButtonLegend_Icon_C.ExecuteUbergraph_WIDGET_ButtonLegend_Icon
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon) == 0x000004, "Wrong alignment on WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon");
static_assert(sizeof(WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon) == 0x000008, "Wrong size on WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon, EntryPoint) == 0x000000, "Member 'WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_ButtonLegend_Icon_C_ExecuteUbergraph_WIDGET_ButtonLegend_Icon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_ButtonLegend_Icon.WIDGET_ButtonLegend_Icon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_ButtonLegend_Icon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_ButtonLegend_Icon_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_ButtonLegend_Icon_C_PreConstruct");
static_assert(sizeof(WIDGET_ButtonLegend_Icon_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_ButtonLegend_Icon_C_PreConstruct");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_ButtonLegend_Icon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_ButtonLegend_Icon.WIDGET_ButtonLegend_Icon_C.UpdateActionButtonIconTextures
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures final
{
public:
	class UTexture*                               IconTexture;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_GetButtonLegendTextureForPlatformName_Texture; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_GetButtonLegendTextureForPlatformName_Texture_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACON_Hacker_C*                          K2Node_DynamicCast_AsCON_Hacker;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_Result;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures) == 0x000008, "Wrong alignment on WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures");
static_assert(sizeof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures) == 0x000058, "Wrong size on WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, IconTexture) == 0x000000, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::IconTexture' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_GetButtonLegendTextureForPlatformName_Texture) == 0x000008, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_GetButtonLegendTextureForPlatformName_Texture' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_GetPlatformName_ReturnValue) == 0x000010, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_GetButtonLegendTextureForPlatformName_Texture_1) == 0x000028, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_GetButtonLegendTextureForPlatformName_Texture_1' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, K2Node_DynamicCast_AsCON_Hacker) == 0x000040, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::K2Node_DynamicCast_AsCON_Hacker' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_IsUsingGamepad_Result) == 0x000049, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_IsUsingGamepad_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1) == 0x000050, "Member 'WIDGET_ButtonLegend_Icon_C_UpdateActionButtonIconTextures::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function WIDGET_ButtonLegend_Icon.WIDGET_ButtonLegend_Icon_C.SetDisabled
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_ButtonLegend_Icon_C_SetDisabled final
{
public:
	bool                                          IsDisabled_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_ButtonLegend_Icon_C_SetDisabled) == 0x000008, "Wrong alignment on WIDGET_ButtonLegend_Icon_C_SetDisabled");
static_assert(sizeof(WIDGET_ButtonLegend_Icon_C_SetDisabled) == 0x000010, "Wrong size on WIDGET_ButtonLegend_Icon_C_SetDisabled");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetDisabled, IsDisabled_0) == 0x000000, "Member 'WIDGET_ButtonLegend_Icon_C_SetDisabled::IsDisabled_0' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetDisabled, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'WIDGET_ButtonLegend_Icon_C_SetDisabled::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetDisabled, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WIDGET_ButtonLegend_Icon_C_SetDisabled::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WIDGET_ButtonLegend_Icon.WIDGET_ButtonLegend_Icon_C.SetActionButtonIcon
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon final
{
public:
	int32                                         ButtonIconIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon) == 0x000008, "Wrong alignment on WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon");
static_assert(sizeof(WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon) == 0x000010, "Wrong size on WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon, ButtonIconIndex) == 0x000000, "Member 'WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon::ButtonIconIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WIDGET_ButtonLegend_Icon_C_SetActionButtonIcon::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

