#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Cyberspace_SoftwareHotbar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_Cyberspace_SoftwareHotbar.WIDGET_Cyberspace_SoftwareHotbar_C.SetSoftwareInSlot
// 0x0090 (0x0090 - 0x0000)
struct WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Software_Base_C*                  SoftwareItem;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Software_Base_C*                  K2Node_DynamicCast_AsITEM_Software_Base;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_QuadDamage_C*                     K2Node_DynamicCast_AsITEM_Quad_Damage;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Cybershield_Base_C*               K2Node_DynamicCast_AsITEM_Cybershield_Base;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Decoy_C*                          K2Node_DynamicCast_AsITEM_Decoy;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_CyberDash_C*                      K2Node_DynamicCast_AsITEM_Cyber_Dash;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_IceDrill_Base_C*                  K2Node_DynamicCast_AsITEM_Ice_Drill_Base;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Pulser_Base_C*                    K2Node_DynamicCast_AsITEM_Pulser_Base;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UITEM_Recall_C*                         K2Node_DynamicCast_AsITEM_Recall;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot) == 0x000008, "Wrong alignment on WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot");
static_assert(sizeof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot) == 0x000090, "Wrong size on WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, Item) == 0x000000, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, SoftwareItem) == 0x000008, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::SoftwareItem' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Software_Base) == 0x000010, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Software_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Quad_Damage) == 0x000020, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Quad_Damage' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Cybershield_Base) == 0x000030, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Cybershield_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Decoy) == 0x000040, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Decoy' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_3) == 0x000048, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Cyber_Dash) == 0x000050, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Cyber_Dash' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_4) == 0x000058, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Ice_Drill_Base) == 0x000060, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Ice_Drill_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_5) == 0x000068, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Pulser_Base) == 0x000070, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Pulser_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_6) == 0x000078, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_AsITEM_Recall) == 0x000080, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_AsITEM_Recall' has a wrong offset!");
static_assert(offsetof(WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot, K2Node_DynamicCast_bSuccess_7) == 0x000088, "Member 'WIDGET_Cyberspace_SoftwareHotbar_C_SetSoftwareInSlot::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

}

