#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Controls_TabPanel

#include "Basic.hpp"

#include "ENUM_Options_ControlsTabs_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.OnTabSelected__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     TabEnum;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature) == 0x000018, "Wrong size on WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature, Message) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature::Message' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature, TabEnum) == 0x000010, "Member 'WIDGET_Controls_TabPanel_C_OnTabSelected__DelegateSignature::TabEnum' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ExecuteUbergraph_WIDGET_Controls_TabPanel
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentPlatform_PC;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Xbox;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Playstation;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Switch;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Console;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel) == 0x000050, "Wrong size on WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, EntryPoint) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000018, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000028, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000038, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_GetCurrentPlatform_PC) == 0x000048, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_GetCurrentPlatform_PC' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_GetCurrentPlatform_Xbox) == 0x000049, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_GetCurrentPlatform_Xbox' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_GetCurrentPlatform_Playstation) == 0x00004A, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_GetCurrentPlatform_Playstation' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_GetCurrentPlatform_Switch) == 0x00004B, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_GetCurrentPlatform_Switch' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel, CallFunc_GetCurrentPlatform_Console) == 0x00004C, "Member 'WIDGET_Controls_TabPanel_C_ExecuteUbergraph_WIDGET_Controls_TabPanel::CallFunc_GetCurrentPlatform_Console' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.SetSelectedTab
// 0x0068 (0x0068 - 0x0000)
struct WIDGET_Controls_TabPanel_C_SetSelectedTab final
{
public:
	class FString                                 TabLabel;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     TabEnum;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_Options_ControlsTabs                     CurrentTabEnum;                                    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurrentLabel;                                      // 0x0018(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_SubMenu_Tab_C*>          CallFunc_GetValidTabs_Result;                      // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SubMenu_Tab_C*                  CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_SetSelectedTab) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_SetSelectedTab");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_SetSelectedTab) == 0x000068, "Wrong size on WIDGET_Controls_TabPanel_C_SetSelectedTab");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, TabLabel) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::TabLabel' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, TabEnum) == 0x000010, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::TabEnum' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CurrentTabEnum) == 0x000011, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CurrentTabEnum' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CurrentLabel) == 0x000018, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CurrentLabel' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_GetValidTabs_Result) == 0x000040, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_GetValidTabs_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_Array_Get_Item) == 0x000058, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetSelectedTab, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WIDGET_Controls_TabPanel_C_SetSelectedTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.GetValidTabs
// 0x0068 (0x0068 - 0x0000)
struct WIDGET_Controls_TabPanel_C_GetValidTabs final
{
public:
	TArray<class UWIDGET_SubMenu_Tab_C*>          Result;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SubMenu_Tab_C*                  K2Node_DynamicCast_AsWIDGET_Sub_Menu_Tab;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_GetValidTabs) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_GetValidTabs");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_GetValidTabs) == 0x000068, "Wrong size on WIDGET_Controls_TabPanel_C_GetValidTabs");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, Result) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Array_Get_Item) == 0x000040, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, K2Node_DynamicCast_AsWIDGET_Sub_Menu_Tab) == 0x000050, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::K2Node_DynamicCast_AsWIDGET_Sub_Menu_Tab' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_GetValidTabs, CallFunc_IsVisible_ReturnValue) == 0x000060, "Member 'WIDGET_Controls_TabPanel_C_GetValidTabs::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.SetLabelFromPlatform
// 0x0005 (0x0005 - 0x0000)
struct WIDGET_Controls_TabPanel_C_SetLabelFromPlatform final
{
public:
	bool                                          CallFunc_GetCurrentPlatform_PC;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Xbox;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Playstation;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Switch;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentPlatform_Console;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_SetLabelFromPlatform");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform) == 0x000005, "Wrong size on WIDGET_Controls_TabPanel_C_SetLabelFromPlatform");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform, CallFunc_GetCurrentPlatform_PC) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_SetLabelFromPlatform::CallFunc_GetCurrentPlatform_PC' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform, CallFunc_GetCurrentPlatform_Xbox) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_SetLabelFromPlatform::CallFunc_GetCurrentPlatform_Xbox' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform, CallFunc_GetCurrentPlatform_Playstation) == 0x000002, "Member 'WIDGET_Controls_TabPanel_C_SetLabelFromPlatform::CallFunc_GetCurrentPlatform_Playstation' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform, CallFunc_GetCurrentPlatform_Switch) == 0x000003, "Member 'WIDGET_Controls_TabPanel_C_SetLabelFromPlatform::CallFunc_GetCurrentPlatform_Switch' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_SetLabelFromPlatform, CallFunc_GetCurrentPlatform_Console) == 0x000004, "Member 'WIDGET_Controls_TabPanel_C_SetLabelFromPlatform::CallFunc_GetCurrentPlatform_Console' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavTabRight
// 0x0040 (0x0040 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavTabRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_SubMenu_Tab_C*>          CallFunc_GetValidTabs_Result;                      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_SubMenu_Tab_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavTabRight");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight) == 0x000040, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavTabRight");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_GetValidTabs_Result) == 0x000008, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_GetValidTabs_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Wrap_ReturnValue) == 0x000024, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Wrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabRight, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabRight::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavTabLeft
// 0x0040 (0x0040 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWIDGET_SubMenu_Tab_C*>          CallFunc_GetValidTabs_Result;                      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_SubMenu_Tab_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft) == 0x000008, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft) == 0x000040, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_GetValidTabs_Result) == 0x000008, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_GetValidTabs_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_Wrap_ReturnValue) == 0x000020, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_Wrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavTabLeft::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavAlt2
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavAlt2 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt2) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavAlt2");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt2) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavAlt2");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt2, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAlt2::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt2, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAlt2::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavAlt1
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavAlt1 final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt1) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavAlt1");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt1) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavAlt1");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt1, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAlt1::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAlt1, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAlt1::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavBack
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavBack final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavBack) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavBack");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavBack) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavBack");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavBack, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavBack::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavBack, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavBack::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavAccept
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavAccept final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavAccept) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavAccept");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavAccept) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavAccept");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAccept, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAccept::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavAccept, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavAccept::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavRight
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavRight) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavRight");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavRight) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavRight");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavRight, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavRight, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavRight::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavLeft
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavLeft) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavLeft");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavLeft) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavLeft");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavLeft, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavLeft, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavLeft::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavDown
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavDown final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavDown) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavDown");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavDown) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavDown");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavDown, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavDown::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavDown, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavDown::Result' has a wrong offset!");

// Function WIDGET_Controls_TabPanel.WIDGET_Controls_TabPanel_C.ReceiveNavUp
// 0x0002 (0x0002 - 0x0000)
struct WIDGET_Controls_TabPanel_C_ReceiveNavUp final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Controls_TabPanel_C_ReceiveNavUp) == 0x000001, "Wrong alignment on WIDGET_Controls_TabPanel_C_ReceiveNavUp");
static_assert(sizeof(WIDGET_Controls_TabPanel_C_ReceiveNavUp) == 0x000002, "Wrong size on WIDGET_Controls_TabPanel_C_ReceiveNavUp");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavUp, InputState) == 0x000000, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavUp::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Controls_TabPanel_C_ReceiveNavUp, Result) == 0x000001, "Member 'WIDGET_Controls_TabPanel_C_ReceiveNavUp::Result' has a wrong offset!");

}

