#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_MainMenu_InGameList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ENUM_MainMenuSubScreens_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.OnMainMenuItemSelected__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature final
{
public:
	ENUM_MainMenuSubScreens                       Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          InputEvent;                                        // 0x0008(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature) == 0x000078, "Wrong size on WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature, Result) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature, InputEvent) == 0x000008, "Member 'WIDGET_MainMenu_InGameList_C_OnMainMenuItemSelected__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.ExecuteUbergraph_WIDGET_MainMenu_InGameList
// 0x02A8 (0x02A8 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_5;           // 0x0008(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_4;           // 0x0078(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_3;           // 0x00E8(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_2;           // 0x0158(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent_1;           // 0x01C8(0x0070)()
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InputEvent;             // 0x0238(0x0070)()
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList) == 0x0002A8, "Wrong size on WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, EntryPoint) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent_5) == 0x000008, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent_5' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent_4) == 0x000078, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent_4' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent_3) == 0x0000E8, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent_3' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent_2) == 0x000158, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent_2' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent_1) == 0x0001C8, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList, K2Node_ComponentBoundEvent_InputEvent) == 0x000238, "Member 'WIDGET_MainMenu_InGameList_C_ExecuteUbergraph_WIDGET_MainMenu_InGameList::K2Node_ComponentBoundEvent_InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Quit_K2Node_ComponentBoundEvent_11_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_QuitToTitle_K2Node_ComponentBoundEvent_10_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_LoadGame_K2Node_ComponentBoundEvent_9_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_SaveGame_K2Node_ComponentBoundEvent_8_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Options_K2Node_ComponentBoundEvent_7_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature final
{
public:
	struct FPointerEvent                          InputEvent;                                        // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature) == 0x000070, "Wrong size on WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature, InputEvent) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_BndEvt__WIDGET_MainMenu_InGameList_WIDGET_MainMenuButton_Resume_K2Node_ComponentBoundEvent_6_OnMainMenuButtonClicked__DelegateSignature::InputEvent' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.InitializeItemArray
// 0x0078 (0x0078 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_InitializeItemArray final
{
public:
	TArray<class UWIDGET_MenuListItemBase_C*>     MenuListItems;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWIDGET_MenuListItemBase_C*>     Children;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListItemBase_C*             K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base;   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_InitializeItemArray) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_InitializeItemArray");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_InitializeItemArray) == 0x000078, "Wrong size on WIDGET_MainMenu_InGameList_C_InitializeItemArray");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, MenuListItems) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::MenuListItems' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, Children) == 0x000010, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::Children' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000038, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_GetAllChildren_ReturnValue) == 0x000048, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Array_Get_Item) == 0x000058, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base) == 0x000060, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::K2Node_DynamicCast_AsWIDGET_Menu_List_Item_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_InitializeItemArray, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WIDGET_MainMenu_InGameList_C_InitializeItemArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.OnListOpen
// 0x0030 (0x0030 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_OnListOpen final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APAWN_Hacker_Simple_C*                  K2Node_DynamicCast_AsPAWN_Hacker_Simple;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSaveGames_Result;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetExistingSaveGameNames_ReturnValue;     // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_OnListOpen) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_OnListOpen");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_OnListOpen) == 0x000030, "Wrong size on WIDGET_MainMenu_InGameList_C_OnListOpen");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, K2Node_DynamicCast_AsPAWN_Hacker_Simple) == 0x000008, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::K2Node_DynamicCast_AsPAWN_Hacker_Simple' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, CallFunc_CanSaveGames_Result) == 0x000011, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::CallFunc_CanSaveGames_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, CallFunc_GetExistingSaveGameNames_ReturnValue) == 0x000018, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::CallFunc_GetExistingSaveGameNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_OnListOpen, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WIDGET_MainMenu_InGameList_C_OnListOpen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_MainMenu_InGameList.WIDGET_MainMenu_InGameList_C.EVENT_MouseDown_MeshDebugTrigger
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger) == 0x000008, "Wrong alignment on WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger");
static_assert(sizeof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger) == 0x000218, "Wrong size on WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger, MyGeometry) == 0x000000, "Member 'WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger, MouseEvent) == 0x000038, "Member 'WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger, ReturnValue) == 0x0000A8, "Member 'WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_MainMenu_InGameList_C_EVENT_MouseDown_MeshDebugTrigger::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

