#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubDetails_Consumable

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_SubDetails_Consumable.WIDGET_SubDetails_Consumable_C.ExecuteUbergraph_WIDGET_SubDetails_Consumable
// 0x0004 (0x0004 - 0x0000)
struct WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable) == 0x000004, "Wrong alignment on WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable");
static_assert(sizeof(WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable) == 0x000004, "Wrong size on WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable, EntryPoint) == 0x000000, "Member 'WIDGET_SubDetails_Consumable_C_ExecuteUbergraph_WIDGET_SubDetails_Consumable::EntryPoint' has a wrong offset!");

// Function WIDGET_SubDetails_Consumable.WIDGET_SubDetails_Consumable_C.GetAmmoDetails
// 0x000C (0x000C - 0x0000)
struct WIDGET_SubDetails_Consumable_C_GetAmmoDetails final
{
public:
	bool                                          ShowAmmo;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountInClip;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CountInInventory;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_SubDetails_Consumable_C_GetAmmoDetails) == 0x000004, "Wrong alignment on WIDGET_SubDetails_Consumable_C_GetAmmoDetails");
static_assert(sizeof(WIDGET_SubDetails_Consumable_C_GetAmmoDetails) == 0x00000C, "Wrong size on WIDGET_SubDetails_Consumable_C_GetAmmoDetails");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_GetAmmoDetails, ShowAmmo) == 0x000000, "Member 'WIDGET_SubDetails_Consumable_C_GetAmmoDetails::ShowAmmo' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_GetAmmoDetails, CountInClip) == 0x000004, "Member 'WIDGET_SubDetails_Consumable_C_GetAmmoDetails::CountInClip' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_GetAmmoDetails, CountInInventory) == 0x000008, "Member 'WIDGET_SubDetails_Consumable_C_GetAmmoDetails::CountInInventory' has a wrong offset!");

// Function WIDGET_SubDetails_Consumable.WIDGET_SubDetails_Consumable_C.InitializeItemDetails
// 0x0208 (0x0208 - 0x0000)
struct WIDGET_SubDetails_Consumable_C_InitializeItemDetails final
{
public:
	class UITEM_Base_C*                           Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_InventoryDetails_C*             InventoryDetails;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SideEffectsText;                                   // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UITEM_ConsumableBase_C*                 ConsumableItem;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_ConsumableBase_C*                 K2Node_DynamicCast_AsITEM_Consumable_Base;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetSideEffects_SideEffectsText;           // 0x00C0(0x0018)()
	class FText                                   CallFunc_GetDuration_DurationText;                 // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetEffects_EffectsText;                   // 0x0130(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0198(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01D8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01F0(0x0018)()
};
static_assert(alignof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails) == 0x000008, "Wrong alignment on WIDGET_SubDetails_Consumable_C_InitializeItemDetails");
static_assert(sizeof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails) == 0x000208, "Wrong size on WIDGET_SubDetails_Consumable_C_InitializeItemDetails");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, Item) == 0x000000, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::Item' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, InventoryDetails) == 0x000008, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::InventoryDetails' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, Result) == 0x000010, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, SideEffectsText) == 0x000018, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::SideEffectsText' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, ConsumableItem) == 0x000030, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::ConsumableItem' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_DynamicCast_AsITEM_Consumable_Base) == 0x000038, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_DynamicCast_AsITEM_Consumable_Base' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_TextIsEmpty_ReturnValue) == 0x000041, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeArray_Array) == 0x000098, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_GetSideEffects_SideEffectsText) == 0x0000C0, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_GetSideEffects_SideEffectsText' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_GetDuration_DurationText) == 0x0000D8, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_GetDuration_DurationText' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F0, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_GetEffects_EffectsText) == 0x000130, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_GetEffects_EffectsText' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeArray_Array_1) == 0x000148, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_MakeLiteralText_ReturnValue) == 0x000198, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, K2Node_MakeArray_Array_2) == 0x0001B0, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_Format_ReturnValue_1) == 0x0001C0, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001D8, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_InitializeItemDetails, CallFunc_Format_ReturnValue_2) == 0x0001F0, "Member 'WIDGET_SubDetails_Consumable_C_InitializeItemDetails::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WIDGET_SubDetails_Consumable.WIDGET_SubDetails_Consumable_C.ShowExtendedDetails
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SubDetails_Consumable_C_ShowExtendedDetails final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubDetails_Consumable_C_ShowExtendedDetails) == 0x000001, "Wrong alignment on WIDGET_SubDetails_Consumable_C_ShowExtendedDetails");
static_assert(sizeof(WIDGET_SubDetails_Consumable_C_ShowExtendedDetails) == 0x000001, "Wrong size on WIDGET_SubDetails_Consumable_C_ShowExtendedDetails");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_ShowExtendedDetails, Show) == 0x000000, "Member 'WIDGET_SubDetails_Consumable_C_ShowExtendedDetails::Show' has a wrong offset!");

// Function WIDGET_SubDetails_Consumable.WIDGET_SubDetails_Consumable_C.ShowBars
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_SubDetails_Consumable_C_ShowBars final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_SubDetails_Consumable_C_ShowBars) == 0x000001, "Wrong alignment on WIDGET_SubDetails_Consumable_C_ShowBars");
static_assert(sizeof(WIDGET_SubDetails_Consumable_C_ShowBars) == 0x000001, "Wrong size on WIDGET_SubDetails_Consumable_C_ShowBars");
static_assert(offsetof(WIDGET_SubDetails_Consumable_C_ShowBars, Show) == 0x000000, "Member 'WIDGET_SubDetails_Consumable_C_ShowBars::Show' has a wrong offset!");

}

