#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_BinaryToggle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.ExecuteUbergraph_WIDGET_Settings_BinaryToggle
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsBoxChecked;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle) == 0x000004, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle) == 0x000008, "Wrong size on WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle, EntryPoint) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle, K2Node_ComponentBoundEvent_IsBoxChecked) == 0x000005, "Member 'WIDGET_Settings_BinaryToggle_C_ExecuteUbergraph_WIDGET_Settings_BinaryToggle::K2Node_ComponentBoundEvent_IsBoxChecked' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature final
{
public:
	bool                                          IsBoxChecked;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature) == 0x000001, "Wrong size on WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature, IsBoxChecked) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_BndEvt__WIDGET_Settings_BinaryToggle_WIDGET_Checkbox_K2Node_ComponentBoundEvent_0_OnCheckboxStateChanged__DelegateSignature::IsBoxChecked' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_PreConstruct");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_Settings_BinaryToggle_C_PreConstruct");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.SetCheckboxValue
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_SetCheckboxValue final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_SetCheckboxValue) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_SetCheckboxValue");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_SetCheckboxValue) == 0x000001, "Wrong size on WIDGET_Settings_BinaryToggle_C_SetCheckboxValue");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetCheckboxValue, Value) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_SetCheckboxValue::Value' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.GetCheckboxValue
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_GetCheckboxValue final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_GetCheckboxValue) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_GetCheckboxValue");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_GetCheckboxValue) == 0x000001, "Wrong size on WIDGET_Settings_BinaryToggle_C_GetCheckboxValue");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_GetCheckboxValue, Result) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_GetCheckboxValue::Result' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.EVENT_OnMouseExit
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit) == 0x000008, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit) == 0x000070, "Wrong size on WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit, MouseEvent) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_EVENT_OnMouseExit::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.SetIsHighlighted
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_SetIsHighlighted final
{
public:
	bool                                          NewHighlightedState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceInstant;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsHighlighted_Result;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted) == 0x000008, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted) == 0x000018, "Wrong size on WIDGET_Settings_BinaryToggle_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, NewHighlightedState) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::NewHighlightedState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, ForceInstant) == 0x000001, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::ForceInstant' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, CallFunc_GetIsHighlighted_Result) == 0x000002, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::CallFunc_GetIsHighlighted_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, CallFunc_GetIsEnabled_ReturnValue) == 0x000003, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000010, "Member 'WIDGET_Settings_BinaryToggle_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.SetOptionEnabled
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_SetOptionEnabled final
{
public:
	bool                                          IsOptionEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOptionEnabled_Result;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_SetOptionEnabled) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_SetOptionEnabled");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_SetOptionEnabled) == 0x000003, "Wrong size on WIDGET_Settings_BinaryToggle_C_SetOptionEnabled");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetOptionEnabled, IsOptionEnabled) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_SetOptionEnabled::IsOptionEnabled' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetOptionEnabled, Result) == 0x000001, "Member 'WIDGET_Settings_BinaryToggle_C_SetOptionEnabled::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_SetOptionEnabled, CallFunc_SetOptionEnabled_Result) == 0x000002, "Member 'WIDGET_Settings_BinaryToggle_C_SetOptionEnabled::CallFunc_SetOptionEnabled_Result' has a wrong offset!");

// Function WIDGET_Settings_BinaryToggle.WIDGET_Settings_BinaryToggle_C.ReceiveNavAccept
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept) == 0x000001, "Wrong alignment on WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept");
static_assert(sizeof(WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept) == 0x000003, "Wrong size on WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept, InputState) == 0x000000, "Member 'WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept, Result) == 0x000001, "Member 'WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WIDGET_Settings_BinaryToggle_C_ReceiveNavAccept::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

