#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_SubDetails_Weapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_WeaponDetailsType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ENUM_WeaponOperation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WIDGET_SubDetails_Weapon.WIDGET_SubDetails_Weapon_C
// 0x0128 (0x0388 - 0x0260)
class UWIDGET_SubDetails_Weapon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           PANEL_EnergyWeapon;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_ExplosiveWeapon;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_KineticWeapon;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PANEL_MeleeWeapon;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_AmmoType;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Attack_Type_Details;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Damage_Type_Details;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_AP_Details;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_Damage_Details;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_Mode_Details;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_Operation_Details;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_Type_Details;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Energy_Used_Details;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_AP;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_AP_Details;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_BlastRadius_Details;                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_Damage;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_Damage_Details;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_Operation_Details;                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_Timer_Details;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Explosive_Type_Details;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_AP;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_AP_Details;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_Damage;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_Damage_Details;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_Magazine_Details;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Kinetic_Op_Details;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_AP_Details;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_Damage_Details;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_EnergyUsed;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_EnergyUsed_Details;                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_Operation_Details;                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextMeshWidget*                        TEXT_Melee_Range_Details;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWIDGET_InventoryDetails_C*             InventoryDetails;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UITEM_Base_C*                           Item;                                              // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_WeaponDetailsType                        LastDetailsType;                                   // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WIDGET_SubDetails_Weapon(int32 EntryPoint);
	void OnShowItemDetails();
	void OnHideItemDetails();
	void EVENT_OnModeChanged(class UITEM_WeaponBase_C* Weapon, int32 OldMode, int32 NewMode);
	void SetModeDetails();
	void OnDetailsTypeChanged();
	void OperationToText(ENUM_WeaponOperation Operation, class FText* Text);
	void GetItemDetailsType(ENUM_WeaponDetailsType* DetailsType);
	void GetModeDetailsType(const struct FSTRUCT_WeaponMode& ModeToUse, ENUM_WeaponDetailsType* DetailsType);
	void GetWeaponMode(bool DefaultValues, struct FSTRUCT_WeaponMode* WeaponMode);
	void GetWeaponAllowsUserModeSelection(bool* Result);
	void GetWeaponTextColor(bool IsModified, struct FColor* Color);
	void GetWeaponDamageLabel(class UAttribDamageType* DamageType, bool IsDetonation, class FText* Result);
	void GetWeaponArmorModifierLabel(class UAttribDamageType* DamageType, bool IsDetonation, class FText* Result);
	void GetAmmoDetails(bool* ShowAmmo, int32* CountInClip, int32* CountInInventory);
	void InitializeItemDetails(class UITEM_Base_C* Item_0, class UWIDGET_InventoryDetails_C* InventoryDetails_0, bool* Result);
	void ShowExtendedDetails(bool* Show);
	void ShowBars(bool* Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WIDGET_SubDetails_Weapon_C">();
	}
	static class UWIDGET_SubDetails_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWIDGET_SubDetails_Weapon_C>();
	}
};
static_assert(alignof(UWIDGET_SubDetails_Weapon_C) == 0x000008, "Wrong alignment on UWIDGET_SubDetails_Weapon_C");
static_assert(sizeof(UWIDGET_SubDetails_Weapon_C) == 0x000388, "Wrong size on UWIDGET_SubDetails_Weapon_C");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, UberGraphFrame) == 0x000260, "Member 'UWIDGET_SubDetails_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, PANEL_EnergyWeapon) == 0x000268, "Member 'UWIDGET_SubDetails_Weapon_C::PANEL_EnergyWeapon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, PANEL_ExplosiveWeapon) == 0x000270, "Member 'UWIDGET_SubDetails_Weapon_C::PANEL_ExplosiveWeapon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, PANEL_KineticWeapon) == 0x000278, "Member 'UWIDGET_SubDetails_Weapon_C::PANEL_KineticWeapon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, PANEL_MeleeWeapon) == 0x000280, "Member 'UWIDGET_SubDetails_Weapon_C::PANEL_MeleeWeapon' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_AmmoType) == 0x000288, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_AmmoType' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Attack_Type_Details) == 0x000290, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Attack_Type_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Damage_Type_Details) == 0x000298, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Damage_Type_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_AP_Details) == 0x0002A0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_AP_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_Damage_Details) == 0x0002A8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_Damage_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_Mode_Details) == 0x0002B0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_Mode_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_Operation_Details) == 0x0002B8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_Operation_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_Type_Details) == 0x0002C0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_Type_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Energy_Used_Details) == 0x0002C8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Energy_Used_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_AP) == 0x0002D0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_AP' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_AP_Details) == 0x0002D8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_AP_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_BlastRadius_Details) == 0x0002E0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_BlastRadius_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_Damage) == 0x0002E8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_Damage' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_Damage_Details) == 0x0002F0, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_Damage_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_Operation_Details) == 0x0002F8, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_Operation_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_Timer_Details) == 0x000300, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_Timer_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Explosive_Type_Details) == 0x000308, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Explosive_Type_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_AP) == 0x000310, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_AP' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_AP_Details) == 0x000318, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_AP_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_Damage) == 0x000320, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_Damage' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_Damage_Details) == 0x000328, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_Damage_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_Magazine_Details) == 0x000330, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_Magazine_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Kinetic_Op_Details) == 0x000338, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Kinetic_Op_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_AP_Details) == 0x000340, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_AP_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_Damage_Details) == 0x000348, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_Damage_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_EnergyUsed) == 0x000350, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_EnergyUsed' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_EnergyUsed_Details) == 0x000358, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_EnergyUsed_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_Operation_Details) == 0x000360, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_Operation_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, TEXT_Melee_Range_Details) == 0x000368, "Member 'UWIDGET_SubDetails_Weapon_C::TEXT_Melee_Range_Details' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, InventoryDetails) == 0x000370, "Member 'UWIDGET_SubDetails_Weapon_C::InventoryDetails' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, Item) == 0x000378, "Member 'UWIDGET_SubDetails_Weapon_C::Item' has a wrong offset!");
static_assert(offsetof(UWIDGET_SubDetails_Weapon_C, LastDetailsType) == 0x000380, "Member 'UWIDGET_SubDetails_Weapon_C::LastDetailsType' has a wrong offset!");

}

