#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_Settings_MultiSelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.ExecuteUbergraph_WIDGET_Settings_MultiSelector
// 0x0008 (0x0008 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector) == 0x000004, "Wrong alignment on WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector) == 0x000008, "Wrong size on WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector, EntryPoint) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_ExecuteUbergraph_WIDGET_Settings_MultiSelector::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_PreConstruct) == 0x000001, "Wrong alignment on WIDGET_Settings_MultiSelector_C_PreConstruct");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_PreConstruct) == 0x000001, "Wrong size on WIDGET_Settings_MultiSelector_C_PreConstruct");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.PopulateQualitySettings
// 0x0090 (0x0090 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_PopulateQualitySettings final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_2;                              // 0x0030(0x0018)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)(ConstParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_PopulateQualitySettings");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings) == 0x000090, "Wrong size on WIDGET_Settings_MultiSelector_C_PopulateQualitySettings");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_text_Variable) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_text_Variable_1) == 0x000018, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_text_Variable_2) == 0x000030, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_int_Variable) == 0x000048, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_int_Variable_1) == 0x00004C, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Conv_IntToByte_ReturnValue) == 0x000050, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_GetValidValue_ReturnValue) == 0x000058, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000059, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00005B, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00005C, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, Temp_text_Variable_3) == 0x000060, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_MakeLiteralInt_ReturnValue) == 0x000078, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Array_Add_ReturnValue_1) == 0x000084, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Array_Add_ReturnValue_2) == 0x000088, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_PopulateQualitySettings, CallFunc_Array_Add_ReturnValue_3) == 0x00008C, "Member 'WIDGET_Settings_MultiSelector_C_PopulateQualitySettings::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.CreateMultiSelectorPips
// 0x0058 (0x0058 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Settings_MultiSelector_Pip_C*   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips) == 0x000058, "Wrong size on WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, K2Node_MakeStruct_SlateChildSize) == 0x00000C, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_Array_Get_Item) == 0x000028, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000040, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WIDGET_Settings_MultiSelector_C_CreateMultiSelectorPips::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.IncrementSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_IncrementSelectedOption final
{
public:
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption) == 0x000004, "Wrong alignment on WIDGET_Settings_MultiSelector_C_IncrementSelectedOption");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption) == 0x000018, "Wrong size on WIDGET_Settings_MultiSelector_C_IncrementSelectedOption");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, CallFunc_GetIsEnabled_ReturnValue) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, Temp_int_Variable) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, CallFunc_Clamp_ReturnValue) == 0x000010, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_IncrementSelectedOption, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WIDGET_Settings_MultiSelector_C_IncrementSelectedOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.DecrementSelectedOption
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_DecrementSelectedOption final
{
public:
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption) == 0x000004, "Wrong alignment on WIDGET_Settings_MultiSelector_C_DecrementSelectedOption");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption) == 0x000018, "Wrong size on WIDGET_Settings_MultiSelector_C_DecrementSelectedOption");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, CallFunc_GetIsEnabled_ReturnValue) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, Temp_int_Variable) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_DecrementSelectedOption, CallFunc_Clamp_ReturnValue) == 0x000014, "Member 'WIDGET_Settings_MultiSelector_C_DecrementSelectedOption::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.SetSelectedMultiSelectorPip
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip final
{
public:
	int32                                         NewSelectedPipIndex;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWIDGET_Settings_MultiSelector_Pip_C*   K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip) == 0x000050, "Wrong size on WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, NewSelectedPipIndex) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::NewSelectedPipIndex' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_Array_Get_Item) == 0x000030, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip) == 0x000040, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WIDGET_Settings_MultiSelector_C_SetSelectedMultiSelectorPip::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.EVENT_OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter) == 0x0000A8, "Wrong size on WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.EVENT_OnMouseExit
// 0x0070 (0x0070 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit) == 0x000070, "Wrong size on WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit, MouseEvent) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_OnMouseExit::MouseEvent' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.EVENT_SelectorRightArrow_OnMouseDown
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown) == 0x000218, "Wrong size on WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown, MyGeometry) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown, MouseEvent) == 0x000038, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown, ReturnValue) == 0x0000A8, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorRightArrow_OnMouseDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.EVENT_SelectorLeftArrow_OnMouseDown
// 0x0218 (0x0218 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown) == 0x000218, "Wrong size on WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown, MyGeometry) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown, MouseEvent) == 0x000038, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown, ReturnValue) == 0x0000A8, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'WIDGET_Settings_MultiSelector_C_EVENT_SelectorLeftArrow_OnMouseDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.UpdateMultiSelectorLabel
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_Settings_MultiSelector_Pip_C*   K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel) == 0x000018, "Wrong size on WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel, K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel::K2Node_DynamicCast_AsWIDGET_Settings_Multi_Selector_Pip' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WIDGET_Settings_MultiSelector_C_UpdateMultiSelectorLabel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.InitializeMenuListItem
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_InitializeMenuListItem final
{
public:
	class UWIDGET_MenuListBase_C*                 ParentList;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_InitializeMenuListItem) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_InitializeMenuListItem");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_InitializeMenuListItem) == 0x000010, "Wrong size on WIDGET_Settings_MultiSelector_C_InitializeMenuListItem");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_InitializeMenuListItem, ParentList) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_InitializeMenuListItem::ParentList' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_InitializeMenuListItem, Index_0) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_InitializeMenuListItem::Index_0' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.SetIsHighlighted
// 0x0050 (0x0050 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_SetIsHighlighted final
{
public:
	bool                                          NewHighlightedState;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceInstant;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_2; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_3; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHighlighted_Result;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_2;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_3;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted) == 0x000008, "Wrong alignment on WIDGET_Settings_MultiSelector_C_SetIsHighlighted");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted) == 0x000050, "Wrong size on WIDGET_Settings_MultiSelector_C_SetIsHighlighted");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, NewHighlightedState) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::NewHighlightedState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, ForceInstant) == 0x000001, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::ForceInstant' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_2) == 0x000018, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_3) == 0x000020, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_ConvertToDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetIsHighlighted_Result) == 0x000028, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetIsHighlighted_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetIsEnabled_ReturnValue) == 0x000029, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000030, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000038, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue_2) == 0x000040, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetIsHighlighted, CallFunc_GetDynamicFontMaterial_ReturnValue_3) == 0x000048, "Member 'WIDGET_Settings_MultiSelector_C_SetIsHighlighted::CallFunc_GetDynamicFontMaterial_ReturnValue_3' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.SetOptionEnabled
// 0x0007 (0x0007 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_SetOptionEnabled final
{
public:
	bool                                          IsOptionEnabled;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetOptionEnabled_Result;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled) == 0x000001, "Wrong alignment on WIDGET_Settings_MultiSelector_C_SetOptionEnabled");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled) == 0x000007, "Wrong size on WIDGET_Settings_MultiSelector_C_SetOptionEnabled");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, IsOptionEnabled) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::IsOptionEnabled' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, Result) == 0x000001, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, Temp_bool_Variable) == 0x000002, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, CallFunc_SetOptionEnabled_Result) == 0x000003, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::CallFunc_SetOptionEnabled_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, Temp_byte_Variable) == 0x000004, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, Temp_byte_Variable_1) == 0x000005, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_SetOptionEnabled, K2Node_Select_Default) == 0x000006, "Member 'WIDGET_Settings_MultiSelector_C_SetOptionEnabled::K2Node_Select_Default' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.ReceiveNavLeft
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_ReceiveNavLeft final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_ReceiveNavLeft) == 0x000001, "Wrong alignment on WIDGET_Settings_MultiSelector_C_ReceiveNavLeft");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_ReceiveNavLeft) == 0x000003, "Wrong size on WIDGET_Settings_MultiSelector_C_ReceiveNavLeft");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavLeft, InputState) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavLeft::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavLeft, Result) == 0x000001, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavLeft::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavLeft, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavLeft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WIDGET_Settings_MultiSelector.WIDGET_Settings_MultiSelector_C.ReceiveNavRight
// 0x0003 (0x0003 - 0x0000)
struct WIDGET_Settings_MultiSelector_C_ReceiveNavRight final
{
public:
	bool                                          InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_Settings_MultiSelector_C_ReceiveNavRight) == 0x000001, "Wrong alignment on WIDGET_Settings_MultiSelector_C_ReceiveNavRight");
static_assert(sizeof(WIDGET_Settings_MultiSelector_C_ReceiveNavRight) == 0x000003, "Wrong size on WIDGET_Settings_MultiSelector_C_ReceiveNavRight");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavRight, InputState) == 0x000000, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavRight::InputState' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavRight, Result) == 0x000001, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavRight::Result' has a wrong offset!");
static_assert(offsetof(WIDGET_Settings_MultiSelector_C_ReceiveNavRight, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WIDGET_Settings_MultiSelector_C_ReceiveNavRight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

