#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIDGET_OptionsMenu_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function WIDGET_OptionsMenu_Base.WIDGET_OptionsMenu_Base_C.OnMenuClose
// 0x0018 (0x0018 - 0x0000)
struct WIDGET_OptionsMenu_Base_C_OnMenuClose final
{
public:
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Base_C_OnMenuClose) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Base_C_OnMenuClose");
static_assert(sizeof(WIDGET_OptionsMenu_Base_C_OnMenuClose) == 0x000018, "Wrong size on WIDGET_OptionsMenu_Base_C_OnMenuClose");
static_assert(offsetof(WIDGET_OptionsMenu_Base_C_OnMenuClose, CallFunc_GetActiveMenuList_Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Base_C_OnMenuClose::CallFunc_GetActiveMenuList_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Base_C_OnMenuClose, CallFunc_GetActiveMenuList_Result_1) == 0x000008, "Member 'WIDGET_OptionsMenu_Base_C_OnMenuClose::CallFunc_GetActiveMenuList_Result_1' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Base_C_OnMenuClose, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WIDGET_OptionsMenu_Base_C_OnMenuClose::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WIDGET_OptionsMenu_Base.WIDGET_OptionsMenu_Base_C.OnMenuOpen
// 0x0010 (0x0010 - 0x0000)
struct WIDGET_OptionsMenu_Base_C_OnMenuOpen final
{
public:
	class UWIDGET_MenuListBase_C*                 CallFunc_GetActiveMenuList_Result;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIDGET_OptionsMenu_Base_C_OnMenuOpen) == 0x000008, "Wrong alignment on WIDGET_OptionsMenu_Base_C_OnMenuOpen");
static_assert(sizeof(WIDGET_OptionsMenu_Base_C_OnMenuOpen) == 0x000010, "Wrong size on WIDGET_OptionsMenu_Base_C_OnMenuOpen");
static_assert(offsetof(WIDGET_OptionsMenu_Base_C_OnMenuOpen, CallFunc_GetActiveMenuList_Result) == 0x000000, "Member 'WIDGET_OptionsMenu_Base_C_OnMenuOpen::CallFunc_GetActiveMenuList_Result' has a wrong offset!");
static_assert(offsetof(WIDGET_OptionsMenu_Base_C_OnMenuOpen, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WIDGET_OptionsMenu_Base_C_OnMenuOpen::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

