#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIREPUZZLE_WirePlug

#include "Basic.hpp"

#include "ENUM_WirePlugState_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "ENUM_InteractResultType_structs.hpp"
#include "ENUM_InteractionType_structs.hpp"


namespace SDK::Params
{

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.ExecuteUbergraph_WIREPUZZLE_WirePlug
// 0x0028 (0x0028 - 0x0000)
struct WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTimeOffset;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_WirePlugState                            CallFunc_GetNextTransitionState_State;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CallFunc_GetTimelineForState_Result;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug) == 0x000008, "Wrong alignment on WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug) == 0x000028, "Wrong size on WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, EntryPoint) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, K2Node_CustomEvent_DeltaTimeOffset) == 0x000008, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::K2Node_CustomEvent_DeltaTimeOffset' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, CallFunc_GetNextTransitionState_State) == 0x00000C, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::CallFunc_GetNextTransitionState_State' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, CallFunc_GetTimelineForState_Result) == 0x000018, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::CallFunc_GetTimelineForState_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'WIREPUZZLE_WirePlug_C_ExecuteUbergraph_WIREPUZZLE_WirePlug::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.OnTransitionStateChanged
// 0x0004 (0x0004 - 0x0000)
struct WIREPUZZLE_WirePlug_C_OnTransitionStateChanged final
{
public:
	float                                         DeltaTimeOffset;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_OnTransitionStateChanged) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_OnTransitionStateChanged");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_OnTransitionStateChanged) == 0x000004, "Wrong size on WIREPUZZLE_WirePlug_C_OnTransitionStateChanged");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_OnTransitionStateChanged, DeltaTimeOffset) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_OnTransitionStateChanged::DeltaTimeOffset' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WIREPUZZLE_WirePlug_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_ReceiveTick) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_ReceiveTick");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_ReceiveTick) == 0x000004, "Wrong size on WIREPUZZLE_WirePlug_C_ReceiveTick");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.UpdateWireMesh
// 0x00C0 (0x00C0 - 0x0000)
struct WIREPUZZLE_WirePlug_C_UpdateWireMesh final
{
public:
	TArray<struct FVector2D>                      Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_1;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FProcMeshTangent>               Temp_struct_Variable_3;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable_4;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_5;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_6;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_7;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetNumSections_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   Temp_struct_Variable_8;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProcMeshTangent>               Temp_struct_Variable_9;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_UpdateWireMesh) == 0x000008, "Wrong alignment on WIREPUZZLE_WirePlug_C_UpdateWireMesh");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_UpdateWireMesh) == 0x0000C0, "Wrong size on WIREPUZZLE_WirePlug_C_UpdateWireMesh");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_1) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_2) == 0x000020, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_3) == 0x000030, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_4) == 0x000040, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_5) == 0x000050, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_6) == 0x000060, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_7) == 0x000070, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_GetNumSections_ReturnValue) == 0x000080, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_GetNumSections_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_8) == 0x000088, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, Temp_struct_Variable_9) == 0x0000A8, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_GetSplineLength_ReturnValue) == 0x0000B8, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWireMesh, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000BC, "Member 'WIREPUZZLE_WirePlug_C_UpdateWireMesh::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.UpdateWirePlugTransform
// 0x0150 (0x0150 - 0x0000)
struct WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSplinePointIndex;                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform) == 0x000010, "Wrong alignment on WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform) == 0x000150, "Wrong size on WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, Direction) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::Direction' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, LastSplinePointIndex) == 0x00000C, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::LastSplinePointIndex' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x00001C, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000030, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_BreakTransform_Location) == 0x000060, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000C0, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000C4, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform, CallFunc_Subtract_IntInt_ReturnValue) == 0x00014C, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlugTransform::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.UpdateWirePlug
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_WirePlug_C_UpdateWirePlug final
{
public:
	float                                         InterpAlpha;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_UpdateWirePlug) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_UpdateWirePlug");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_UpdateWirePlug) == 0x000008, "Wrong size on WIREPUZZLE_WirePlug_C_UpdateWirePlug");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlug, InterpAlpha) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlug::InterpAlpha' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateWirePlug, CallFunc_FMin_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_WirePlug_C_UpdateWirePlug::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.SetInitiallyConnected
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_WirePlug_C_SetInitiallyConnected final
{
public:
	ENUM_WirePlugState                            Temp_byte_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_SetInitiallyConnected) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_SetInitiallyConnected");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_SetInitiallyConnected) == 0x000008, "Wrong size on WIREPUZZLE_WirePlug_C_SetInitiallyConnected");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetInitiallyConnected, Temp_byte_Variable) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_SetInitiallyConnected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetInitiallyConnected, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_WirePlug_C_SetInitiallyConnected::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.SetTargetWirePlugState
// 0x001C (0x001C - 0x0000)
struct WIREPUZZLE_WirePlug_C_SetTargetWirePlugState final
{
public:
	ENUM_WirePlugState                            NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTimeOffset;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanImmediatelyTransitionToState_Result;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FillTargetStatePath_DeltaTimeOffset;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_SetTargetWirePlugState");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState) == 0x00001C, "Wrong size on WIREPUZZLE_WirePlug_C_SetTargetWirePlugState");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, NewState) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::NewState' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, Success) == 0x000001, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::Success' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, DeltaTimeOffset) == 0x000004, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::DeltaTimeOffset' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_CanImmediatelyTransitionToState_Result) == 0x000008, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_CanImmediatelyTransitionToState_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_FillTargetStatePath_DeltaTimeOffset) == 0x000014, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_FillTargetStatePath_DeltaTimeOffset' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000018, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000019, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetTargetWirePlugState, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'WIREPUZZLE_WirePlug_C_SetTargetWirePlugState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.GetSplineForState
// 0x0018 (0x0018 - 0x0000)
struct WIREPUZZLE_WirePlug_C_GetSplineForState final
{
public:
	ENUM_WirePlugState                            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_GetSplineForState) == 0x000008, "Wrong alignment on WIREPUZZLE_WirePlug_C_GetSplineForState");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_GetSplineForState) == 0x000018, "Wrong size on WIREPUZZLE_WirePlug_C_GetSplineForState");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_GetSplineForState, State) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_GetSplineForState::State' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_GetSplineForState, Result) == 0x000008, "Member 'WIREPUZZLE_WirePlug_C_GetSplineForState::Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_GetSplineForState, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_GetSplineForState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.UpdateSpline
// 0x01E8 (0x01E8 - 0x0000)
struct WIREPUZZLE_WirePlug_C_UpdateSpline final
{
public:
	float                                         InterpAlpha;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                UpVector;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplineDirection;                                   // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetTangent;                                     // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceTangent;                                     // 0x0028(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceLocation;                                    // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_WirePlugState                            TargetInterpState;                                 // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_WirePlugState                            SourceInterpState;                                 // 0x004D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDistance;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetDistance;                                    // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SourceDistance;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplinePointIndex;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       TargetSpline;                                      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SourceSpline;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_WirePlugState                            CallFunc_GetNextTransitionState_State;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue_1;    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_3;   // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_GetSplineForState_Result;                 // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_GetSplineForState_Result_1;               // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalOffsetForSplinePoint_Result;      // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalOffsetForSplinePoint_Result_1;    // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1; // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_UpdateSpline) == 0x000008, "Wrong alignment on WIREPUZZLE_WirePlug_C_UpdateSpline");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_UpdateSpline) == 0x0001E8, "Wrong size on WIREPUZZLE_WirePlug_C_UpdateSpline");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, InterpAlpha) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::InterpAlpha' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, UpVector) == 0x000004, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::UpVector' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SplineDirection) == 0x000010, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SplineDirection' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, TargetTangent) == 0x00001C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::TargetTangent' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SourceTangent) == 0x000028, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SourceTangent' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, TargetLocation) == 0x000034, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::TargetLocation' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SourceLocation) == 0x000040, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SourceLocation' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, TargetInterpState) == 0x00004C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::TargetInterpState' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SourceInterpState) == 0x00004D, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SourceInterpState' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CurrentDistance) == 0x000050, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CurrentDistance' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, TargetDistance) == 0x000054, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::TargetDistance' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SourceDistance) == 0x000058, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SourceDistance' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SplinePointIndex) == 0x00005C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SplinePointIndex' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, TargetSpline) == 0x000060, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::TargetSpline' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, SourceSpline) == 0x000068, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::SourceSpline' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetNextTransitionState_State) == 0x000070, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetNextTransitionState_State' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_VSize_ReturnValue) == 0x000080, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_VSize_ReturnValue_1) == 0x000084, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Lerp_ReturnValue) == 0x000088, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00008C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000098, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0000A4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000A8, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000B8, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x0000C4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000D0, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Normal_ReturnValue) == 0x0000DC, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x0000E8, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x0000F4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000100, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetTangentAtSplinePoint_ReturnValue_1) == 0x00010C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetTangentAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x000118, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000124, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, Temp_int_Variable) == 0x000130, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000134, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue_3) == 0x000144, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_RLerp_ReturnValue) == 0x000150, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00015C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000168, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetSplineForState_Result) == 0x000178, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetSplineForState_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetSplineForState_Result_1) == 0x000180, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetSplineForState_Result_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000188, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Less_IntInt_ReturnValue) == 0x000189, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Greater_IntInt_ReturnValue) == 0x00018A, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_BooleanAND_ReturnValue) == 0x00018B, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_BooleanAND_ReturnValue_1) == 0x00018C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocalOffsetForSplinePoint_Result) == 0x000190, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocalOffsetForSplinePoint_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x00019C, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetLocalOffsetForSplinePoint_Result_1) == 0x0001A8, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetLocalOffsetForSplinePoint_Result_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001B4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_VLerp_ReturnValue) == 0x0001C0, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Lerp_ReturnValue_1) == 0x0001CC, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x0001D0, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1) == 0x0001D4, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0001D8, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001DC, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_UpdateSpline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001E0, "Member 'WIREPUZZLE_WirePlug_C_UpdateSpline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.SetConnectionOffset
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_WirePlug_C_SetConnectionOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_WirePlug_C_SetConnectionOffset) == 0x000004, "Wrong alignment on WIREPUZZLE_WirePlug_C_SetConnectionOffset");
static_assert(sizeof(WIREPUZZLE_WirePlug_C_SetConnectionOffset) == 0x000008, "Wrong size on WIREPUZZLE_WirePlug_C_SetConnectionOffset");
static_assert(offsetof(WIREPUZZLE_WirePlug_C_SetConnectionOffset, Offset) == 0x000000, "Member 'WIREPUZZLE_WirePlug_C_SetConnectionOffset::Offset' has a wrong offset!");

// Function WIREPUZZLE_WirePlug.WIREPUZZLE_WirePlug_C.GetLocalOffsetForSplinePoint
// 0x007C (0x007C - 0x0000)
struct WIREPUZZLE_WirePlug_C_GetLocalOffsetForSplinePoint final
{
public:
	ENUM_WirePlugState                            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PointIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Result;                                            // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DepthOffset;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Offset;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_WirePlugState                            Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
