#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WIREPUZZLE_Base

#include "Basic.hpp"

#include "ENUM_InteractResultType_structs.hpp"
#include "ENUM_PuzzleSolveType_structs.hpp"
#include "STRUCT_InteractResults_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "STRUCT_WirePuzzleData_structs.hpp"


namespace SDK::Params
{

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.OnPowerLevelChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature final
{
public:
	int32                                         TotalPowerLevel;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature) == 0x000004, "Wrong alignment on WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature");
static_assert(sizeof(WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature) == 0x000004, "Wrong size on WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature");
static_assert(offsetof(WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature, TotalPowerLevel) == 0x000000, "Member 'WIREPUZZLE_Base_C_OnPowerLevelChanged__DelegateSignature::TotalPowerLevel' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.ExecuteUbergraph_WIREPUZZLE_Base
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base) == 0x000004, "Wrong alignment on WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base");
static_assert(sizeof(WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base) == 0x000008, "Wrong size on WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base");
static_assert(offsetof(WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base, EntryPoint) == 0x000000, "Member 'WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'WIREPUZZLE_Base_C_ExecuteUbergraph_WIREPUZZLE_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WIREPUZZLE_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on WIREPUZZLE_Base_C_ReceiveTick");
static_assert(sizeof(WIREPUZZLE_Base_C_ReceiveTick) == 0x000004, "Wrong size on WIREPUZZLE_Base_C_ReceiveTick");
static_assert(offsetof(WIREPUZZLE_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WIREPUZZLE_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.RegisterActiveTrace
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_Base_C_RegisterActiveTrace final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_RegisterActiveTrace) == 0x000004, "Wrong alignment on WIREPUZZLE_Base_C_RegisterActiveTrace");
static_assert(sizeof(WIREPUZZLE_Base_C_RegisterActiveTrace) == 0x000008, "Wrong size on WIREPUZZLE_Base_C_RegisterActiveTrace");
static_assert(offsetof(WIREPUZZLE_Base_C_RegisterActiveTrace, Temp_int_Variable) == 0x000000, "Member 'WIREPUZZLE_Base_C_RegisterActiveTrace::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_RegisterActiveTrace, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_Base_C_RegisterActiveTrace::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.UpdatePropagationAudio
// 0x0068 (0x0068 - 0x0000)
struct WIREPUZZLE_Base_C_UpdatePropagationAudio final
{
public:
	bool                                          CallFunc_IsPuzzleSolved_Result;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              K2Node_DynamicCast_AsSound_Cue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_Base_C_UpdatePropagationAudio) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_UpdatePropagationAudio");
static_assert(sizeof(WIREPUZZLE_Base_C_UpdatePropagationAudio) == 0x000068, "Wrong size on WIREPUZZLE_Base_C_UpdatePropagationAudio");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_IsPuzzleSolved_Result) == 0x000000, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_IsPuzzleSolved_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Max_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_Get_Item) == 0x000018, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, K2Node_DynamicCast_AsSound_Cue) == 0x000038, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::K2Node_DynamicCast_AsSound_Cue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000048, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Array_Length_ReturnValue_2) == 0x00005C, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdatePropagationAudio, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WIREPUZZLE_Base_C_UpdatePropagationAudio::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.UnregisterActiveTrace
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_Base_C_UnregisterActiveTrace final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_UnregisterActiveTrace) == 0x000004, "Wrong alignment on WIREPUZZLE_Base_C_UnregisterActiveTrace");
static_assert(sizeof(WIREPUZZLE_Base_C_UnregisterActiveTrace) == 0x000008, "Wrong size on WIREPUZZLE_Base_C_UnregisterActiveTrace");
static_assert(offsetof(WIREPUZZLE_Base_C_UnregisterActiveTrace, Temp_int_Variable) == 0x000000, "Member 'WIREPUZZLE_Base_C_UnregisterActiveTrace::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UnregisterActiveTrace, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_Base_C_UnregisterActiveTrace::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.SetBatteryInput
// 0x0060 (0x0060 - 0x0000)
struct WIREPUZZLE_Base_C_SetBatteryInput final
{
public:
	struct FIntPoint                              BatteryLocation;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BatteryInputSocket;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PowerLevel;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewTotalPower;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntVector>                     CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	struct FIntVector                             CallFunc_Array_Get_Item;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_SetBatteryInput) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_SetBatteryInput");
static_assert(sizeof(WIREPUZZLE_Base_C_SetBatteryInput) == 0x000060, "Wrong size on WIREPUZZLE_Base_C_SetBatteryInput");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, BatteryLocation) == 0x000000, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::BatteryLocation' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, BatteryInputSocket) == 0x000008, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::BatteryInputSocket' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, PowerLevel) == 0x00000C, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::PowerLevel' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, NewTotalPower) == 0x000010, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::NewTotalPower' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Array_Get_Item) == 0x000030, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Map_Find_Value) == 0x000040, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Map_Find_ReturnValue) == 0x000044, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_SetBatteryInput, K2Node_MakeStruct_IntVector) == 0x000050, "Member 'WIREPUZZLE_Base_C_SetBatteryInput::K2Node_MakeStruct_IntVector' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.UpdateBatteryPower
// 0x0068 (0x0068 - 0x0000)
struct WIREPUZZLE_Base_C_UpdateBatteryPower final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewPowerLevel;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldPowerLevel;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJunctionBoxFunctional_Result;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_WirePuzzle_Cell_Base_C*           CallFunc_GetSelectedWireSourceCell_SelectedCell;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCOMP_WirePuzzle_Cell_Base_C*           CallFunc_GetSelectedWireSourceCell_SelectedCell_1; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_InteractResults                CallFunc_TryInteract_InteractResults;              // 0x0028(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_UpdateBatteryPower) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_UpdateBatteryPower");
static_assert(sizeof(WIREPUZZLE_Base_C_UpdateBatteryPower) == 0x000068, "Wrong size on WIREPUZZLE_Base_C_UpdateBatteryPower");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, DeltaSeconds) == 0x000000, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, NewPowerLevel) == 0x000004, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::NewPowerLevel' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, OldPowerLevel) == 0x000008, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::OldPowerLevel' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_IsJunctionBoxFunctional_Result) == 0x000010, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_IsJunctionBoxFunctional_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_GetSelectedWireSourceCell_SelectedCell) == 0x000018, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_GetSelectedWireSourceCell_SelectedCell' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_GetSelectedWireSourceCell_SelectedCell_1) == 0x000020, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_GetSelectedWireSourceCell_SelectedCell_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_TryInteract_InteractResults) == 0x000028, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_TryInteract_InteractResults' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, Temp_int_Variable) == 0x00004C, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000051, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000053, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000054, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_FFloor_ReturnValue) == 0x000058, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00005C, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateBatteryPower, CallFunc_FFloor_ReturnValue_1) == 0x000060, "Member 'WIREPUZZLE_Base_C_UpdateBatteryPower::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.GetSelectedWireSourceCell
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_Base_C_GetSelectedWireSourceCell final
{
public:
	class UCOMP_WirePuzzle_Cell_Base_C*           SelectedCell;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_GetSelectedWireSourceCell) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_GetSelectedWireSourceCell");
static_assert(sizeof(WIREPUZZLE_Base_C_GetSelectedWireSourceCell) == 0x000008, "Wrong size on WIREPUZZLE_Base_C_GetSelectedWireSourceCell");
static_assert(offsetof(WIREPUZZLE_Base_C_GetSelectedWireSourceCell, SelectedCell) == 0x000000, "Member 'WIREPUZZLE_Base_C_GetSelectedWireSourceCell::SelectedCell' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.SetSelectedWireSourceCell
// 0x0008 (0x0008 - 0x0000)
struct WIREPUZZLE_Base_C_SetSelectedWireSourceCell final
{
public:
	class UCOMP_WirePuzzle_Cell_Base_C*           NewSelection;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_SetSelectedWireSourceCell) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_SetSelectedWireSourceCell");
static_assert(sizeof(WIREPUZZLE_Base_C_SetSelectedWireSourceCell) == 0x000008, "Wrong size on WIREPUZZLE_Base_C_SetSelectedWireSourceCell");
static_assert(offsetof(WIREPUZZLE_Base_C_SetSelectedWireSourceCell, NewSelection) == 0x000000, "Member 'WIREPUZZLE_Base_C_SetSelectedWireSourceCell::NewSelection' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.ReserveWireDepthOffset
// 0x0048 (0x0048 - 0x0000)
struct WIREPUZZLE_Base_C_ReserveWireDepthOffset final
{
public:
	class AWIREPUZZLE_WirePlug_C*                 Plug;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWIREPUZZLE_WirePlug_C*                 CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_Base_C_ReserveWireDepthOffset) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_ReserveWireDepthOffset");
static_assert(sizeof(WIREPUZZLE_Base_C_ReserveWireDepthOffset) == 0x000048, "Wrong size on WIREPUZZLE_Base_C_ReserveWireDepthOffset");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, Plug) == 0x000000, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::Plug' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, Offset) == 0x000008, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::Offset' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000034, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Map_Find_Value) == 0x000038, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReserveWireDepthOffset, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WIREPUZZLE_Base_C_ReserveWireDepthOffset::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.ReleaseWireDepthOffset
// 0x0050 (0x0050 - 0x0000)
struct WIREPUZZLE_Base_C_ReleaseWireDepthOffset final
{
public:
	class AWIREPUZZLE_WirePlug_C*                 Plug;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AWIREPUZZLE_WirePlug_C*           Temp_object_Variable;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWIREPUZZLE_WirePlug_C*                 CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_ReleaseWireDepthOffset");
static_assert(sizeof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset) == 0x000050, "Wrong size on WIREPUZZLE_Base_C_ReleaseWireDepthOffset");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, Plug) == 0x000000, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::Plug' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, Temp_object_Variable) == 0x000018, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Array_Get_Item) == 0x000034, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Map_Find_Value) == 0x000040, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_ReleaseWireDepthOffset, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'WIREPUZZLE_Base_C_ReleaseWireDepthOffset::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.GetBatteryCells
// 0x0068 (0x0068 - 0x0000)
struct WIREPUZZLE_Base_C_GetBatteryCells final
{
public:
	TArray<class UCOMP_WirePuzzle_Cell_Base_C*>   Cells;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UCOMP_WirePuzzle_Cell_Base_C*>   Batteries;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* ObjectA, class UObject* ObjectB)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_PuzzleCell_Base_C*                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_WirePuzzle_Cell_Base_C*           K2Node_DynamicCast_AsCOMP_Wire_Puzzle_Cell_Base;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WIREPUZZLE_Base_C_GetBatteryCells) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_GetBatteryCells");
static_assert(sizeof(WIREPUZZLE_Base_C_GetBatteryCells) == 0x000068, "Wrong size on WIREPUZZLE_Base_C_GetBatteryCells");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, Cells) == 0x000000, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::Cells' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, Batteries) == 0x000010, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::Batteries' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_Array_Get_Item) == 0x000040, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, K2Node_DynamicCast_AsCOMP_Wire_Puzzle_Cell_Base) == 0x000050, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::K2Node_DynamicCast_AsCOMP_Wire_Puzzle_Cell_Base' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_GetBatteryCells, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'WIREPUZZLE_Base_C_GetBatteryCells::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.UpdateWireRetraction
// 0x0070 (0x0070 - 0x0000)
struct WIREPUZZLE_Base_C_UpdateWireRetraction final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWIREPUZZLE_WirePlug_C*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWIREPUZZLE_WirePlug_C*                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConnectionDepthOffset_Result;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WIREPUZZLE_Base_C_UpdateWireRetraction) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_UpdateWireRetraction");
static_assert(sizeof(WIREPUZZLE_Base_C_UpdateWireRetraction) == 0x000070, "Wrong size on WIREPUZZLE_Base_C_UpdateWireRetraction");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000034, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000038, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Less_FloatFloat_ReturnValue) == 0x000044, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Array_Get_Item) == 0x000048, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000050, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000054, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_GetConnectionDepthOffset_Result) == 0x000068, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_GetConnectionDepthOffset_Result' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_UpdateWireRetraction, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00006C, "Member 'WIREPUZZLE_Base_C_UpdateWireRetraction::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function WIREPUZZLE_Base.WIREPUZZLE_Base_C.StopChanneling
// 0x0028 (0x0028 - 0x0000)
struct WIREPUZZLE_Base_C_StopChanneling final
{
public:
	class AActor*                                 NewChannelingInteract;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopChanneling_Result;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENUM_InteractResultType                       CallFunc_InteractWithPuzzlePrimitive_Result;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_InteractWithPuzzlePrimitive_ResultText;   // 0x0010(0x0018)()
};
static_assert(alignof(WIREPUZZLE_Base_C_StopChanneling) == 0x000008, "Wrong alignment on WIREPUZZLE_Base_C_StopChanneling");
static_assert(sizeof(WIREPUZZLE_Base_C_StopChanneling) == 0x000028, "Wrong size on WIREPUZZLE_Base_C_StopChanneling");
static_assert(offsetof(WIREPUZZLE_Base_C_StopChanneling, NewChannelingInteract) == 0x000000, "Member 'WIREPUZZLE_Base_C_StopChanneling::NewChannelingInteract' has a wrong offset!");
static_assert(offsetof(WIREPUZZLE_Base_C_StopChanneling, Result) == 0x000008, "Member 'WIREPUZZLE_Base_C_StopChanneling::Result' has a wrong offset!");
