#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WirePuzzleDial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SystemReShock_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WirePuzzleDial.WirePuzzleDial_C
// 0x0020 (0x0500 - 0x04E0)
class UWirePuzzleDial_C final : public UUserStaticMeshComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DialPosition;                                      // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCOMP_WirePuzzle_Cell_Base_C*           WireCell;                                          // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WirePuzzleDial(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void InitializeWireDial();
	void UpdateTargetPosition();
	void UpdateRotation(float DeltaSeconds);
	void GetTargetRotation(struct FRotator* TargetRotation);
	void IsTJunction(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WirePuzzleDial_C">();
	}
	static class UWirePuzzleDial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWirePuzzleDial_C>();
	}
};
static_assert(alignof(UWirePuzzleDial_C) == 0x000010, "Wrong alignment on UWirePuzzleDial_C");
static_assert(sizeof(UWirePuzzleDial_C) == 0x000500, "Wrong size on UWirePuzzleDial_C");
static_assert(offsetof(UWirePuzzleDial_C, UberGraphFrame) == 0x0004E0, "Member 'UWirePuzzleDial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWirePuzzleDial_C, DialPosition) == 0x0004E8, "Member 'UWirePuzzleDial_C::DialPosition' has a wrong offset!");
static_assert(offsetof(UWirePuzzleDial_C, WireCell) == 0x0004F0, "Member 'UWirePuzzleDial_C::WireCell' has a wrong offset!");

}

